{
  "fuentes": [
    {
      "url": "https://www.enrollwaresolutions.com/contact-us",
      "email": "info@enrollware.com"
    },
    {
      "url": "https://www.displaysuk.co.uk/signage-perspex-frames/perspex-acrylic-poster-photo-frames/staff-photo-boards-for-schools-business/",
      "email": "enquiries@displaysuk.co.uk"
    },
    {
      "url": "https://www.getscreenedsd.org/contact",
      "email": "doh.info@state.sd.us"
    },
    {
      "url": "https://www.gatorcapital.com/contact",
      "email": "cp@gatorcapital.com"
    },
    {
      "url": "https://www.gatorcapital.com/contact",
      "email": "dp@gatorcapital.com"
    },
    {
      "url": "https://www.gatorcapital.com/contact",
      "email": "info@gatorcapital.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/thirsty-gator-winter-park-2",
      "email": "corporate@giftly.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/thirsty-gator-winter-park-2",
      "email": "merchants@giftly.com"
    },
    {
      "url": "https://staffboard.com/",
      "email": "contact@staffboard.de"
    },
    {
      "url": "https://guidetoflorida.com/winter-park/food-drink/thirsty-gator",
      "email": "directory@guidetoflorida.com"
    },
    {
      "url": "https://guidetoflorida.com/winter-park/food-drink/thirsty-gator",
      "email": "name@yoursite.com"
    }
  ],
  "mails": [
    "contact@staffboard.de",
    "corporate@giftly.com",
    "cp@gatorcapital.com",
    "directory@guidetoflorida.com",
    "doh.info@state.sd.us",
    "dp@gatorcapital.com",
    "enquiries@displaysuk.co.uk",
    "info@enrollware.com",
    "info@gatorcapital.com",
    "merchants@giftly.com",
    "name@yoursite.com"
  ],
  "nombre_sitio": "thethirstygator.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.enrollwaresolutions.com/contact-us",
      "text": "Contact the Team | Enrollware Skip to content Client Login All-in-One Platform Solutions Healthcare/AHA Corporate Government Continuing Education Pricing Contact Sign Up Contact Enrollware How to Reach Us To reach a representative, fill out the contact form on this page or give us a call. Phone: Support: 561-247-2432 Support Hours: Monday-Friday (8am-6pm ET) Email: Sales Inquiries: info@enrollware.com Support: support@enrollware.com Mailing Address: Fullsteam Software Holdings LLC DBA Enrollware Software 540 Devall Drive, Suite 301 Auburn, AL 36832 Password Assistance? Please contact your training center administrator. Enrollware can only issue usernames or passwords for the primary administrators of our direct clients. Online Class Registration and Management Features All-in-One Platform Pricing EnrollwarePay Solutions Healthcare Government Continuing Education Corporate Resources Contact Us Privacy Policy Terms & Conditions Responsible Disclosure Policy Client Login Follow Us © 2025 Enrollware. All rights reserved."
    },
    {
      "url": "https://www.displaysuk.co.uk/signage-perspex-frames/perspex-acrylic-poster-photo-frames/staff-photo-boards-for-schools-business/",
      "text": "Staff Photo Boards For Schools & Business This site is best viewed with javascript enabled. For help enabling javascript please click here . search close Search Quote ( 0 ) Checkout 0 item s £ 0.00 Home Products Exhibition Stands Pop Up Exhibition Stands Modular Exhibition Stands Fabric Exhibition Stands Shell Scheme Graphics Information Points & iPad Displays See all Outdoor Displays Outdoor Display Flags Outdoor Display Banners & Frames Pavement Signs Gazebos, Parasols & Inflatables Cafe Barriers See all Display Cases Perspex Acrylic Display Cases, Boxes & Cubes Display Case Plinths Token, Ballot, Collection Boxes Flat Pack Acrylic Display Cases Bespoke Perspex Display Cases See all Exhibition & Display Boards for Hire or Rent Folding Display Boards for Hire Panel And Pole Display Boards for Hire Brochure Stands for Hire See all Leaflet, Brochure, Menu & Card Holders Countertop Leaflet Holders Wall Mounted Leaflet Holders Floorstanding Brochure Holders Menu Holders Perspex Business Card Holders See all Banner Stands Pull Up Roller Banners Double Sided Pull Up Banner Stands Extra Wide & Linked Banner Stands Fabric Banner Stands Rigid Board Displays See all Counters & Plinths Portable Counters & Workstations Promotion / Demonstration Counters Lectern Test Category Pedestals See all Noticeboards & Whiteboards Perspex Acrylic Wall Mounted Noticeboard Pinnable Wall Mounted Noticeboards Fire Retardant Wall Mounted Noticeboards Lockable / Tamperproof Noticeboards Wall Mounted Fire Retardant Lockable Tamperproof Noticeboards See all Signage & Perspex Frames Perspex Acrylic Poster Photo Frames Perspex Acrylic Signs and Letters Magnetic Blocks & Signs Lightboxes Dibond Signs See all Display Boards Folding Display Boards Folding Screen Room Dividers Panel and Pole Display Boards Display Board Accessories See all Specialist Displays Catering & Sneeze Guards Cable Kits Retail & Point Of Sale NHS Signs & Displays Acrylic Furniture See all Perspex Cut To Size Acrylic Glazing Clear Acrylic Panels Cut To Size Perspex Acrylic White 069 Cut To Size Perspex Acrylic Black 962 Cut To Size Perspex Acrylic Grey 9640 Cut To Size See all About Us Services Large Format Printing Services Self Build DIY Exhibition Stands Cut-To-Size Perspex & Plastics Perspex Replacement Boat Windows Perspex Acrylic Secondary Double Glazing Acrylic Fabrication & Display Fabrication Acrylic Display Cases Boxes & Cubes Point Of Sale & POP Fabrication Recycled Acrylic Displays & Greencast Acrylic Sheet Public Sector Procurement - Credit Facilities Contact Quote ( 0 ) 50,000+ products in stock 1,000 stock product lines with over 50,000 products in stock Custom made displays Rapid delivery on custom made Perspex acrylic displays Next day delivery Next day delivery on many products if ordered by mid day UK Manufacturer Many of our products are made in our own UK factory Cutting edge technology Experts in printed acrylic panels - any size, any shape menu close Products Exhibition Stands Back All Pop Up Exhibition Stands Modular Exhibition Stands Fabric Exhibition Stands Shell Scheme Graphics Information Points & iPad Displays Extra Wide & Linked Banner Stands Outdoor Displays Back All Outdoor Display Flags Outdoor Display Banners & Frames Pavement Signs Gazebos, Parasols & Inflatables Cafe Barriers Outdoor Display Counters Outdoor Custom Printed Chairs Display Cases Back All Perspex Acrylic Display Cases, Boxes & Cubes Display Case Plinths Glass Display Cases Bespoke Acrylic Display Cases Token, Ballot, Collection Boxes Flat Pack Acrylic Display Cases Bespoke Perspex Display Cases Exhibition & Display Boards for Hire or Rent Back All Folding Display Boards for Hire Panel And Pole Display Boards for Hire Brochure Stands for Hire Exhibition Counters for Hire Banner Stands for Hire Leaflet, Brochure, Menu & Card Holders Back All Countertop Leaflet Holders Wall Mounted Leaflet Holders Floorstanding Brochure Holders Menu Holders Perspex Business Card Holders Rotating Brochure Holders Greeting Card Displays Business Card Holders Banner Stands Back All Pull Up Roller Banners Double Sided Pull Up Banner Stands Replaceable Cassette Roller Banners Extra Wide & Linked Banner Stands Fabric Banner Stands Rigid Board Displays Banner Stand Accessories Tension Banner Stands Counters & Plinths Back All Portable Counters & Workstations Promotion / Demonstration Counters Lectern Media Cabinets Test Test category for acrylic pedestals Test Category Pedestals Noticeboards & Whiteboards Back All Perspex Acrylic Wall Mounted Noticeboard Pinnable Wall Mounted Noticeboards Fire Retardant Wall Mounted Noticeboards Lockable / Tamperproof Noticeboards Wall Mounted Fire Retardant Lockable Tamperproof Noticeboards Freestanding / Mobile Noticeboards Whiteboards Glass Noticeboards Flipcharts & Easles Outdoor Noticeboards Acrylic Noticeboards Pinnable Noticeboards Write On Glassboards Signage & Perspex Frames Back All Perspex Acrylic Poster Photo Frames Perspex Acrylic Signs and Letters Magnetic Blocks & Signs Staff Photo Boards Lightboxes Dibond Signs Printed Foamex Signs Site Safety Signs Snap Frames Sign Fittings & Accessories Hoarding Panels Acrylic Awards and Trophies Acrylic Noticeboards Printed Correx Signs Retail & Point Of Sale Printed Plywood and Wood Display Boards Back All Folding Display Boards Folding Screen Room Dividers Aluminium & Graphic Folding Display Boards Panel and Pole Display Boards Office Screens Display Board Accessories Specialist Displays Back All Catering & Sneeze Guards Cable Kits Retail & Point Of Sale NHS Signs & Displays Acrylic Furniture Educational Furniture & Displays Social Distancing Screens Printed Outdoor Garden Art Garden Mirrors, Outdoor Mirrors & Illusion Mirrors Acrylic Photo Prints Shed, Playhouse, Greenhouse Windows Eco Lawn Edging From Recycled Plastic Decorative Garden Wall Panels Garden Structures, Gazebos, Arbours & Swings Garden Ornaments & Planters Acrylic Photo Prints Perspex Acrylic Splashbacks Perspex Cut To Size Back All Acrylic Glazing Clear Acrylic Panels Cut To Size Perspex Acrylic White 069 Cut To Size Perspex Acrylic Black 962 Cut To Size Perspex Acrylic Grey 9640 Cut To Size Perspex Acrylic Grey 9981 Cut To Size Perspex Acrylic Yellow 260 Cut To Size Perspex Acrylic Red 4415 Cut To Size Perspex Acrylic Orange 363 Cut To Size Perspex Acrylic Red 431 Cut To Size Perspex Acrylic Red 433 Cut To Size Perspex Acrylic Violet 886 Cut To Size Perspex Acrylic Green 6T81 Cut To Size Perspex Acrylic Green 650 Cut To Size Perspex Acrylic Blue 727 Cut To Size Perspex Acrylic Blue 750 Cut To Size Perspex Acrylic Blue 744 Cut To Size Perspex Acrylic Clear Frost S2 000 Perspex Acrylic Glass Look 6T21 Cut To Size Perspex Acrylic Silver Mirror Perspex Acrylic Blue Mirror 2069 Perspex Acrylic Purple Mirror 102 About Us Services Large Format Printing Services Self Build DIY Exhibition Stands Cut-To-Size Perspex & Plastics Perspex Replacement Boat Windows Perspex Acrylic Secondary Double Glazing Acrylic Fabrication & Display Fabrication Acrylic Display Cases Boxes & Cubes Point Of Sale & POP Fabrication Recycled Acrylic Displays & Greencast Acrylic Sheet Public Sector Procurement - Credit Facilities Contact Home Signage & Perspex Frames Perspex Acrylic Poster Photo Frames Staff Photo Boards For Schools & Business Staff Photo Boards For Schools & Business £ 36.30 ex. VAT £ inc.VAT Options Colour: Black Back Panel White Back Panel Clear Back Panel Clear Frost Back Panel Coloured Back Panel 2: 2: Qty Add to basket Get a quote Staff Photo Notice Boards - Perspex Acrylic Staff photo notice boards, or \"Meet The Team\" boards are a perfect way of letting people know who's who in a school, NHS Wards, general office and commercial workplace, recreation centres, reception areas, etc. Each clear pocket allows a small photo of a relevent member of staff. Options available include: choice of back acrylic colour, the number of photo pockets. We also offer a secure, tamper proof version, please click here for further details. NEW! We can now offer staff boards with your name and logo printed directlty to the top of the display - call for details. Features and Benefits: Please double click on the above images of our acrylic staff photo boards to zoom into a more detailed view Staff photo boards provide a professioal looking wall mounted display panel for quick reference of staff / team members Choice of black, white, clear or clear frost 5mm thick acrylic back panel with polished edges. Corners are rounded with no sharp edges Clear acrylic photo pockets allow staff photos to be changed quickly and easily Supplied with 4 polished sign fittings to give that floating effect off a wall Each photo pocket size is 75mm high x 50mm wide Header panel pocket is 260mm wide x 50mm high Please see the table below for our standard sized staff photo boards. We also manufacture custom sized boards if you require different sized pockets or different quantities of pockets - please call us on 01202 480104 for further details. Staff photo board prices are detailed in the drop down menu at the top of the page. Manufactured to order in our factory in Christchurch, Dorset, UK. Please allow 5 working days for delivery Please see our stand off fittings instructions by clicking here Looking for a a more secure staff photo board which can't be tampered with? Check out our Secure Staff Photo Boards ! Looking for a staff photo board with a different coloured back panel? We have a range of colours available other than our standard colours listed! Please contact us for a quote. Looking for a staff photo board with bespoke printing and branding to suit your business? With state of the art printers, we are able to fully print or brand these staff boards with your logos and messages! If this is something you are interested in, contact us for a quote! Code Photo Pockets Frame Size Width x Height (mm) SB10 10 430mm x 325mm SB20 20 430mm x 515mm SB30 30 500mm x 610mm SB40 40 640mm x 610mm SB50 50 780mm x 610mm SB60 60 780mm x 705mm SB65 65 800mm x 740mm SB70 70 780mm x 800mm SB80 80 780mm x 895mm SB100 100 780mm x 1085mm SB120 120 920mm x 1085mm SB140 140 1060mm x 1085mm SB160 160 1200mm x 1090mm Displays UK provide daily deliveries to most towns and cities in the UK including: Christchurch, Poole, Bournemouth, Swanage, Dorchester, Ferndown, Shaftesbury Sherborne Sturminster Newton Swanage Weymouth Ringwood New Forest Fordingbridge Salisbury Thank you for visiting our website Product Code: 64674569876345 Specification Code 64674569876345 Style Staff Photo Board Location Wall Mounted Weight 10.000 Kg Secured by sagePay Pay with PayPal Pay with Mastercard Pay with Visa × Items Quick basket Newsletter Signup Submit Exhibition Stands Outdoor Displays Display Cases Exhibition & Display Boards for Hire or Rent Leaflet, Brochure, Menu & Card Holders Banner Stands Counters & Plinths Noticeboards & Whiteboards Signage & Perspex Frames Display Boards Specialist Displays Perspex Cut To Size Displays (UK) Limited Displays UK are located in Christchurch, on the Hampshire / Dorset border. We are a proper 'bricks and mortar' manufacturing business not just another internet retailer. Read more… Head Office Units 16-18, 12 Airfield Road, Off Airfield Way, Christchurch, Dorset, BH23 3TG Tel: 01202 480104 Email: [email protected] Connect with us DISQ Display Innovation Service Quality Displays (UK) Limited registered in England and Wales with company number 8896740 and registered address Bank Court, Manor Road, Verwood, Dorset, BH31 6DY. VAT number GB980855382 © Displays (UK) Limited 2025 / Website by Adido / Terms & Conditions / Privacy / Sitemap"
    },
    {
      "url": "https://www.getscreenedsd.org/contact",
      "text": "GetScreenedSD | Contact Us AWC! Provider Resources Contact doh.sd.gov Open main menu Close main menu All Women Count! Open the submenu AWC! Provider Resources Get Screened SD SD Cancer Registry SD Cancer Coalition Resources Contact Us Have Questions or Need More Info? We'd Love to Hear From You! We welcome your inquiries and are here to assist you with any questions or information you may need. Please feel free to reach out using the contact form on this page or the details provided. A member of our team will respond promptly and ensure your request is handled with the attention it deserves. We look forward to connecting with you. 615 E 4th Street Pierre, SD 57501 (800) 738-2301 doh.info@state.sd.us doh.sd.gov Quick Links All Women Count! Get Screened SD SD Cancer Registry SD Cancer Coalition Legal & Privacy SD.gov Accessibility Policy Privacy Policy Disclaimer HIPAA Notice Follow us on Facebook ©2025 South Dakota Department of Health, All Rights Reserved. Site by The Sampson House ."
    },
    {
      "url": "https://www.gatorcapital.com/contact",
      "text": "Gator Capital | Contact You are now entering the Gator Capital Long/Short Fund website. If you do not want to continue, click \"Cancel\". Otherwise, click \"Proceed\". Proceed Cancel About Private Fund Mutual Funds Resources News Research Contact Client Login Client Login Client Login About Private Fund Mutual Funds Resources News Research Contact Client Login Contact Us Fill out the form below to get in touch with the Gator Capital Management team. Address 2502 N. Rocky Point Drive, Suite 665 Tampa, Florida 33607 Address Phone (813) 282-7870 Phone Email info@gatorcapital.com Email Follow Us On Social Gator Capital Management Gator Capital Management is a Financials sector specialist investment firm. Join us on Facebook Join us on X Join us on LinkedIn Join Us on YouTube Company About Contact Us Legal Disclaimer Strategies Private Fund Mutual Funds Resources News Research Access Client Login Due Diligence Portal Copyright © 2025 Gator Capital Management. All Rights Reserved. Form ADV Part 2A Form ADV Part 3 CRS Privacy Policy Thank you for your investment in our fund(s). Please click on the fund(s) you are invested in to view your private investor portal. Gator Financial Partners Gator Capital Long/Short Fund (COAGX) Derek Pilecki, CFA Managing Member and Portfolio Manager Email: dp@gatorcapital.com Phone: (813) 381-5376 In 2008, Derek Pilecki founded Gator Capital Management. He currently manages a long/short financials strategy, long-only financials strategy, and various other individual portfolios. Derek has managed a private fund for 11 years. He launched one mutual fund and took over management of another mutual fund. From 2002 through 2008, Derek was a member of the Goldman Sachs Asset Management (GSAM) Growth Equity Team (Co-Chair of the Investment Committee for the Growth Team and a Portfolio Manager). Prior to GSAM, Derek was an Analyst at Clover Capital Management in Rochester, NY and Burridge Growth Partners in Chicago, IL. He covered the Financials sector at both firms. Before entering graduate school, Derek worked at Fannie Mae providing interest rate risk analysis for the company’s mortgage investment portfolio. Derek holds an MBA with honors in Finance and Accounting from the University of Chicago and a BA in Economics from Duke University. He is also a CFA® charterholder. Chris Pilecki, CFA Portfolio Manager, Trader and Quantitative Analyst Email: cp@gatorcapital.com Phone: (813) 337-6394 In 2014, Chris Pilecki joined Gator Capital Management as a Trader and Quantitative Analyst. From 2008 through 2014, Chris was a Trader at Chesapeake Capital Corporation where he gained extensive experience trading equity index, fixed income, foreign currency (FX) and commodity futures contracts on global exchanges. While at Chesapeake, Chris also was involved in trading system research. Chris was an analyst at Atlantic Capital Management in Richmond, VA from 2003 to 2008. At Atlantic, Chris followed small and mid-cap companies in the technology and energy sectors. He also worked at Shockoe Capital, a long/short equity hedge fund, and in the sell side research department of Wachovia Securities prior to joining Atlantic Capital. Chris holds an MBA with a concentration in Finance from Johns Hopkins University and a BS in Civil Engineering from the University of Virginia. He is also a CFA® charterholder. Thank you for your investment in our fund(s). Please click on the fund(s) you are invested in to view your private investor portal. Gator Financial Partners Gator Capital Long/Short Fund (GATRX)"
    },
    {
      "url": "https://www.giftly.com/gift-card/thirsty-gator-winter-park-2",
      "text": "Thirsty Gator Giftly - Beautiful Gift Card Alternative Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Gifts Gift Cards Winter Park Going Out Thirsty Gator Thirsty Gator Gift Card Thirsty Gator Giftly A beautiful gift card alternative for Thirsty Gator Thirsty Gator 100% satisfaction guarantee Gift Amount $25 $50 $75 $100 $250 $500 $1000 Other Gift Design Continue 100% satisfaction guarantee Enter an amount between $5 and $1,000 Confirm Amount Thirsty Gator (108) (407) 678-0148 Categories Dive Bars, Sports Bars, American Location 3040 N Goldenrod Rd, Winter Park, FL Gift Tips Indulge in the fresh oysters, widely recognized as some of the best in Orlando, with options for raw or Oysters Rockefeller. Try the Gulf and Rock shrimp combo, which is a favorite among regulars who enjoy the mix of flavors. Engage with the friendly staff, especially Tim and Steph, who are often praised for their welcoming service and personal touches. Enjoy a casual evening playing pool or darts, ideal for those looking to relax and have fun. Don't miss the chance to soak in the Florida Gator spirit throughout the bar, making it a perfect spot for Gators fans. Click here to send a gift up to $1,000 with the suggestion to use it at Thirsty Gator. Is this your business? Claim your business to update business information, customize this listing, and more! Learn more about Thirsty Gator Price $$ Ambience Divey, Casual Year Established 1986 Thirsty Gator, located in Winter Park, is a beloved dive bar that has become a staple in the community since 1986. Founded by former Florida Gator football player Tim Groves, this sports bar combines a casual atmosphere with a strong local flavor. The establishment is renowned for its exceptional oysters, often praised as the best in the greater Orlando area. Over the years, Thirsty Gator has become a go-to spot for both Gator fans and seafood lovers. The warm and inviting environment showcases Florida Gators memorabilia, creating a sense of community and pride among patrons. Beyond the oysters, guests can enjoy a variety of dishes and drinks served by a friendly staff dedicated to providing a pleasant dining experience. With its charm and history, Thirsty Gator invites everyone to relax and enjoy good food in a laid-back setting. Great Alternatives Gift $100 for Ain't Misbehavin : Welcome to Ain't Misbehavin, the ultimate destination in Winter Park for a delightful and unforgettable dining experience that will have you coming back for more. Buy a Gift & Greeting Card for Spatz Deli & Billiard Liquor : Spatz Deli & Billiard Liquor in Winter Park is a bustling neighborhood spot that expertly combines the best of a traditional deli, a lively billiard hall, and a well-stocked liquor store, offering a unique and enjoyable experience for all. Updated: September 08, 2025 The Giftly Advantage With Giftly you strike a perfect balance, the thoughtfulness of a Thirsty Gator gift card with the flexibility of money. Easy to buy online. Have it delivered now or later Send it with a personalized greeting card 3 easy ways for your recipient to redeem the gift See a Sample Gift 100% satisfaction guaranteed No wasted balance Easy to customize How it works You customize a gift Gift up to $1,000 with the suggestion to use it at Thirsty Gator. Delivered in a personalized greeting card. They receive the gift Gifts can be sent by email, SMS*, mail or you can print it yourself. They enjoy it! They redeem the gift on our website and choose to deposit the funds in their bank account, Paypal account or to have a Visa Gift Card mailed to them. They can spend the money at Thirsty Gator or anywhere else they like! Top Related Gifts Yellow Pony Pub & Garden Savor Moments at Yellow Pony Pub 8510 NW 17th Ln, Ocala, FL 3.7 (147) • $$ • Lounges Flutes Champagne Bar Bubbles and Bliss Await You 480 N Orlando Ave, Winter Park, FL 4.7 (43) • Wine Bars Vue 360 Rooftop Bar Sip and Soak in Stunning Views 455 E Shore Dr, Clearwater, FL 4.2 (17) • Lounges Corona Cigar Company Elevate Your Cigar and Spirits Journey 4142 W Boy Scout Blvd, Tampa, FL 4.2 (205) • $$ • Whiskey Bars The Hideaway Bar Burgers and Brews, Dive into Fun 523 Virginia Dr, Orlando, FL 3.9 (239) • $$ • Dive Bars The Caboose Bar Burgers and Brews in a Divey Spot 1827 North Orange Ave, Orlando, FL 3.9 (39) • $ • Dive Bars Burton's Thornton Park Unwind and Play in Thornton Park 801 E Washington St, Orlando, FL 3.9 (88) • $ • Dive Bars Casey's on Central Strong Drinks, Live Beats, Good Times 50 E Central Blvd, Orlando, FL 4.0 (107) • $ • Dive Bars More Nearby Businesses Bullitt Bar 33 E Pine St, Orlando, FL 3.4 (54) • $ • Dive Bars George's Hideaway 5507 Edgewater Dr, Orlando, FL 4.1 (26) • $ • Dive Bars The Wheelhouse 42637 Hwy 27, Davenport, FL 4.2 (22) • $ • Dive Bars The Alibi 3391 E State Rd 46, Geneva, FL 4.4 (20) • Dive Bars Garage Bar 1018 Pennsylvania Ave, Saint Cloud, FL 4.5 (8) • Dive Bars Moe's Liquors & Lounge 4182 S Atlantic Ave, New Smyrna Beach, FL 3.9 (15) • $ • Dive Bars Cue-Phoria Billiards and Cafe 1810 Semoran Blvd, Winter Park, FL 4.1 (50) • $ • Pool Halls Cru Quarters At The Mayflower 1620 Mayflower Ct, Winter Park, FL 4.6 (13) • Wine Bars Ciel Bar & Lounge 1810 state Rd 436, Winter Park, FL 5.0 (4) • Lounges Fiddler's Green Irish Pub & Eatery 544 W Fairbanks Ave, Winter Park, FL 3.8 (372) • $$ • Pubs The Wine Room on Park Avenue 270 S Park Ave, Winter Park, FL 4.3 (764) • $$ • Wine Bars Hannibal's on the Square 522 W New England Ave, Winter Park, FL 3.2 (77) • $$$ • Lounges Bar Kada 957 W Fairbanks Ave, Winter Park, FL 4.8 (42) • Lounges Royal Bar 5500 S Orange Blossom Trl, Orlando, FL 3.8 (4) • Beer Bar Uncle Lou's Entertainment Hall 1016 N Mills Ave, Orlando, FL 3.1 (12) • $ • Dive Bars Whiskey Lou’s Lounge 121 N Bumby Ave, Orlando, FL 4.2 (19) • Dive Bars On the Rocks 3640 S Sanford Ave, Sanford, FL 4.5 (2) • Dive Bars Issues 114 E Indiana Ave, DeLand, FL 3.5 (13) • Dive Bars The Amsterdammer 112 S 5th St, Leesburg, FL 3.0 (2) • Dive Bars Friendly Confines 3088 Aloma Ave, Winter Park, FL 3.4 (151) • $$ • Sports Bars Trick Shots - Winter Park 7644 University Blvd, Winter Park, FL 3.6 (30) • $ • Pool Halls La Carambola 3012 N Goldenrod Rd, Winter Park, FL 3.5 (2) • Dance Clubs The Porch 643 N Orange Ave, Winter Park, FL 4.0 (916) • $$ • Sports Bars The Trap 2600 Lee Rd, Winter Park, FL 4.9 (75) • $$ • Axe Throwing Kava Cove Lounge 2020 W Fairbanks Ave, Winter Park, FL 4.8 (28) • Lounges Knowles Memorial Chapel 1000 Holt Ave, Winter Park, FL 3.5 (2) • Music Venues Will's Pub 1042 N Mills Ave, Orlando, FL 4.0 (104) • $ • Music Venues Clicks Billiards 1455 Semoran Blvd. North, Casselberry, FL 4.1 (34) • $$ • Pool Halls Tanqueray's 100 S Orange Ave, Orlando, FL 4.0 (135) • $ • Dive Bars Oasis Saloon 23800 State Rd 46, Sorrento, FL 4.3 (12) • $ • Dive Bars The Park Dive bar 2601 Park Dr, Sanford, FL 4.7 (3) • Dive Bars Jerry’s Pub 5825 S Orange, Orlando, FL 4.8 (10) • Dive Bars Mike's Corner 116 N Samsula Dr, New Smyrna Beach, FL 4.5 (6) • $ • Dive Bars QW Sports Bar 4270 Aloma Ave, Winter Park, FL 4.9 (11) • $$ • Sports Bars Conduit 6700 Aloma Ave, Winter Park, FL 4.1 (10) • Music Venues Muldoons Saloon 7439 Aloma Ave, Winter Park, FL 3.7 (27) • $ • Music Venues The Courtesy 1288 N Orange Ave, Winter Park, FL 4.6 (154) • $$ • Cocktail Bars VINIA Wine & Kitchen 444 West New England Ave, Winter Park, FL 4.9 (161) • $$ • Wine Bars Morse Code Lounge 163 E Morse Blvd, Winter Park, FL 4.5 (19) • Wine Bars The Chapman 500 S Park Ave, Winter Park, FL 4.6 (84) • $$$ • Lounges Bar One Orlando 1516 McCoy Rd, Orlando, FL 4.4 (45) • Beer Bar Cavo's Bar & Kitchen 900 E Washington St, Orlando, FL 4.4 (193) • $$ • Sports Bars See More Help If you have questions, need help, or want to modify, resend, or cancel a gift, please see our Support Center , where you can access an array of self-service tools and our FAQ. For other questions or issues, please contact support@giftly.com . Gift Disclosure The Giftly Prepaid Gift is redeemed for money through the Giftly website. It is not issued, endorsed, or accepted by any third-party merchant (including any third-party merchant explicitly referenced in this Giftly Prepaid Gift), and is not covered by the CARD Act. Giftly Prepaid Gifts never expire and there are no inactivity fees. Please see the Giftly Prepaid Gift Agreement for the complete terms. Dive Bars Sports Bars American 4.3 100-199 4 single place gcdp beautiful_gift_card_alternative_in_title_tag Winter Park, FL XL M Help Help Center How Giftly works FAQ support@giftly.com Corporate Why Giftly Sign Up Log In corporate@giftly.com Merchants Customize listing Remove listing Settlement Notice FAQ merchants@giftly.com About Team Press Blog Legal Terms Privacy Gift Agreement Business categories Restaurants Travel Shopping Activities Spa & Beauty Outdoors Going Out Nationwide Brands All Business Categories Business locations Atlanta Austin Boston Chicago Dallas Denver Detroit Houston Las Vegas Los Angeles Miami Minneapolis New York Oakland Philadelphia Phoenix Portland St. Louis San Diego San Francisco San Jose Seattle Wash, DC Browse All Restaurants Seafood Steakhouses Italian French Asian Fusion Pizza Sushi Burgers Mexican Japanese All Restaurant Types Gift Ideas Multi-Place Gift Ideas The Giftly Prepaid Gift is issued by Sunrise Banks N.A., St. Paul, MN 55103, Member FDIC. * Standard data rates, fees, and charges may apply to send by text. Copyright © 2025 Giftly. All rights reserved."
    },
    {
      "url": "https://staffboard.com/",
      "text": "staffboard HR Software [has_children] [de] Dashboard [child] [de] HR-Exzellenz-Dashboard Recruiting (ATS) [child] [de] Gestalten Sie bewusst die Zukunft Ihrer Organisation! Digitale Personalakte [child] [de] Mit der digitalen Personalakte haben Sie die Daten Ihrer Mitarbeiter immer im Blick Abwesenheitsmanagement [child] [de] Organisieren Sie übersichtlich & schnell Ihre Abwesenheiten Feedback & Performance [child] [de] Fördern Sie aktiv die persönliche Entwicklung Ihrer Mitarbeiter durch konstruktives Feedback Learning [child] [de] Planen Sie die Weiterentwicklung Ihrer Mitarbeiter Zeiterfassung [child] [de] Optimieren Sie die HR-Zeiterfassung Lohnabrechnung [child] [de] Mit dem Modul für Lohn & Gehalt erhalten Sie eine guten Überblick für die nächste Lohnabrechnung. Organigramm [child] [de] Visualisieren die Hierarchie und Struktur Ihres Teams Preise [de] Reports [child] [de] Gewinnen Sie wertvolle Einblicke in Ihre Belegschaft mit anpassbaren Berichten, Echtzeitanalysen und Datenvisualisierungstools. HR Insights [de] Unternehmen [has_children] [de] Unternehmen [child] [de] Kooperationspartner [child] [de] Karriere [child] [de] FAQ [child] [de] Kontakt [de] Login [de] HR Software [has_children] [en] Dashboard [child] [en] HR Excellence Dashboard Recruiting (ATS) [child] [en] Consciously shape the future of your organization! Digital Personnel File [child] [en] With the digital personnel file, you always have an overview of your employees' data Absences [child] [en] Organize your absences clearly and quickly Feedback & Performance [child] [en] Actively promote the personal development of your employees through constructive feedback Learning [child] [en] Plan the development of your employees Time Tracking [child] [en] Streamline HR Time Tracking Payroll [child] [en] The module for wages and salaries gives you a good overview for the next payroll. Orgchart [child] [en] Visualize your team's hierarchy and structure Pricing [en] Reports [child] [en] Gain valuable insights into your workforce with customizable reports, real-time analytics, and data visualization tools. HR Insights [en] Company [has_children] [en] About Us [child] [en] Partners [child] [en] Career [child] [en] FAQ [child] [en] Contact [en] Login [en] DE EN ONLINE DEMO BUCHEN Die HR Software für Unternehmensgestalter Ihr Copilot im HR Team Mit staffboard gestalten Sie Ihr Personalwesen nach den Bedürfnissen Ihrer Organisation. Sie schaffen mehr Zeit und Transparenz für Ihr Team, in einer modernen HR Software. JETZT KOSTENLOS TESTEN Good Bye, Papier Chaos! Herzlich Willkommen, Digitale Personalakte! Mit Hilfe der digitalen Mitarbeiterverwaltung können Sie alle Informationen über Ihre Mitarbeiter übersichtlich an einem Ort abspeichern. Suchen Sie mühsam nach Arbeitsverträgen, Attesten oder sonstigen Mitarbeiterdokumenten und verlieren dadurch wertvolle Zeit? Mit unserer Digitalen Personalakte finden Sie alles auf einen Blick im Mitarbeiterprofil. Dank des Employee Self Service (ESS) können zahlreiche Daten eigenständig von den Mitarbeitern gepflegt werden. So sparen Sie Zeit, Geld und natürlich Nerven für andere wichtige Themen. Bewerbermanagement leicht gemacht Mit unserem übersichtlichen Recruiting Modul verlieren Sie nie mehr einen Bewerber aus den Augen. Durch intuitives Drag & Drop können Sie ihre Bewerber schnell durch die Phasen Ihres individuellen Bewerbungsprozesses leiten. Eingangsbestätigungen werden automatisiert versendet und personalisierte Terminvereinbarungen oder Absagen sind mit einem Klick möglich. Viele Funktionen wie das Abgeben von Bewertungen für Bewerber, schreiben von Kommentaren und die Einbindung weiterer Teammitglieder sind problemlos möglich. STAFFBOARD 30 TAGE KOSTENLOS TESTEN! JETZT ANMELDEN Eine kleine Auswahl unserer treuen Kunden. \"Wir sind an dem Punkt, an dem wir ohne dieses Tool schlicht nicht arbeiten könnten.\" Jakob Schoroth (Reparando GmbH) Managing Director ✔️ staffboard wurde in Deutschland gegründet und hat seinen Hauptsitz in München. ✔️ Die Daten werden ausschließlich in Deutschland verarbeitet und verschlüsselt gespeichert. ✔️ Regelmäßige Updates und Backups sorgen für größtmögliche Sicherheit. Zudem liegen ISO-Zertifizierungen der Hosting Provider vor. ✔️ Die staffboard HR Software und die Daten werden in Rechenzentren in Deutschland gehostet. ✔️ Unternehmen mit dem Siegel hinterlegen beim BITMi e.V. den Standard ihrer Maßnahmen bzgl. Datenschutz. ✔️ Für den Vertrag mit den Hosting Provider gilt ausschließlich deutsches Recht, insbesondere das deutsche Datenschutzrecht, das BGB und das HGB. ✔️ Wir unterliegen der Kontrolle eines externen und unabhängigen Datenschutzbeauftragten. ✔️ Eine AV-Vereinbarung mit jedem Kunden gewährleistet Datenschutz und Datensicherheit. ✔️ Unsere Mitarbeiter sind im Umgang mit sensiblen, personenbezogenen Daten geschult und erhalten regelmäßige Unterweisungen. ✔️ 100% Service: Bei Fragen zum Produkt finden Sie stets einen deutschsprachigen Ansprechpartner. ✔️ 100% Qualität: Die in Deutschland designte staffboard HR Software wird auch in Deutschland getestet. ✔️ 100% Zukunft: Die staffboard HR Software ist investitionssicher und wird kontinuierlich weiterentwickelt und aktualisiert. Melden Sie sich für unseren Newsletter an, um regelmäßig über neue Funktionen und Produkt Updates informiert zu werden. Registrien Email sent! Check your inbox to complete your signup. Digitalisieren Sie Ihre HR Prozesse Unsere staffboard HR Software automatisiert und vereinfacht alle wesentlichen Personalprozesse. Dashboard Recruiting (ATS) Digitale Personalakte Abwesenheitsmanagement Feedback & Performance Learning Zeiterfassung Lohnabrechnung Organigramm Reports Kostenlos & unverbindlich Tage testen * Ich akzeptiere die Datenschutzbestimmungen und die AGB . Jetzt anmelden Benutzerfreundlich Unser intuitives Design ermöglicht eine steile Lernkurve ohne große Einarbeitung. Flexibel Jedes Unternehmen ist anders – und das wissen wir. Darum lässt sich staffboard an Ihre Anforderungen anpassen. Online Greifen Sie von überall mit einer verschlüsselten Verbindung auf staffboard zu. SUPPORT Allgemeine Fragen zum Produkt? 089 - 1250 1458 contact@staffboard.de Für technischen Support innerhalb der Software steht Ihnen ein Ticketsystem zur Verfügung. UNTERSTÜTZER & PARTNER Karriere [de] Impressum [de] Datenschutz [de] AGB [de] Career [en] Imprint [en] Privacy Policy [en] Terms & Conditions [en] 2025 © staffboard | Ihr Copilot im HR Team"
    },
    {
      "url": "https://guidetoflorida.com/winter-park/food-drink/thirsty-gator",
      "text": "Thirsty Gator - Guide to Florida www.guidetoflorida.com - Guide to Florida Search Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Menu Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Home United States Florida Winter Park Food & Drink Thirsty Gator Thirsty Gator Share Sports Bars 3040 N Goldenrod Rd, Winter Park, Florida, 32792 Send Message 407-678-0148 Vote for Us! | Sports Bars Best of Florida Vote Confirmation × Don't show this confirmation for the next 24 hours First Name Last Name Email Address Save my information and enable one-click voting for future votes on this device. I want to receive the Guide to Florida newsletter. Please complete the reCAPTCHA challenge below. Cancel Submit Your Vote! You are voting with the email Click here to switch users. Close Are you Thirsty Gator? Claim this listing now. Claim Listing Overview Get Directions View On Larger Map Company Name Thirsty Gator Phone Number 407-678-0148 Location 3040 N Goldenrod Rd Winter Park , Florida , 32792 United States × Map View Get Directions Cancel FEATURED LISTINGS! Sweet As Cyn Coffee House & Donuts Callahan, FL 32011 Website 904-879-6698 Success Orlando Orlando, FL 32837 Website 407-745-4684 Nino's Bakery & Cafe Punta Gorda, FL 33950 Website 941-833-8912 READ AND REAP! From Dashboard Woes to Smooth Roads The Local Pros Who Truly Power Up Your Escape Starts Here! MORE TO EXPLORE! Best of Florida Voting Best Sports Bars in Florida Guide to Alabama Georgia Business Journal Guide to Florida Get the Newsletter! Click to Subscribe Guide to Florida Subscribe Submit Story Idea Contact Us 904-515-5640 Directory List Your Company Advertise Your Company Member Login Browse Categories Best of Florida Vote For Your Favorites Download Campaign Kit Nominate a Business How it Works × Member Login * Email Address * Password Need to retrieve your password? Click Here × Get the Newsletter! The security check was not completed successfully."
    }
  ]
}