{
  "fuentes": [
    {
      "url": "https://woollyfelt.com/contact-us/",
      "email": "arun@woollyfelt.com"
    },
    {
      "url": "https://woollyfelt.com/contact-us/",
      "email": "info@woollyfelt.com"
    },
    {
      "url": "https://woollyclouds.com/pages/contact-us",
      "email": "main@woollyclouds.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.woolys.com/contact-us",
      "email": "gramby@woolys.com"
    },
    {
      "url": "https://tracxn.com/d/companies/wooly/__tQSc30PvamFffmS5orEg5udf2lz5G7l8XOi2pyaBwpA/founders-and-board-of-directors",
      "email": "hi@tracxn.com"
    }
  ],
  "mails": [
    "arun@woollyfelt.com",
    "gramby@woolys.com",
    "hi@tracxn.com",
    "info@reception-plus.de",
    "info@woollyfelt.com",
    "main@woollyclouds.com"
  ],
  "nombre_sitio": "thetopsecretevents.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://woollyfelt.com/contact-us/",
      "text": "Contact us – Reach Out for Inquiries - Woollyfelt Skip to navigation Skip to content Your Cart MENU Search for: Search 0.00 $ 0 Search for: Search Who We Are Apparel Felt Shoes Shoes Slip-ons Boots Felt Hat Felt Bag and Purse Pet Products Pet Toys Cat Cave Dog Bed Home & Decor Chair Pads Ball Chairpad Flat Chair-pad Padded Chair-pad Unpadded Chair-pad Trivet & Coasters Trivets Coasters Felt Rugs Rectangular Rugs Round Rugs Felt Mats Craft Supplies Decorations Felt Balls Felt Fabric Felt Figures Felt Fruits and Vegetables Halloween and Easter St. Patrick and Valentines Christmas Wholesale Application Our Certificates FAQ’s Order Tracking My Account Blog Browse My Account Who We Are Contact us Shipping and  Returns Privacy Policy Want to chat? Call us  +1 303 521 4965 Social Facebook Twitter Instagram 0.00 $ 0 Home / Contact us – Reach Out for Inquiries Contact Us Δ First Name Last Name Email Your Message Send Nepal Office: Tokha-03, Saraswati Kathmandu 44600, Nepal Phone: +977 9818103501 Email: arun@woollyfelt.com US Office: 1099 W 85th Ave Federal HGTS, CO 80260, United States Phone: +1 303 521 4965 Email : info@woollyfelt.com Information Who We Are? Terms & Conditions Shipping & Returns Privacy Policy FAQs Blogs Support My Account Customer Help Payment Safeguard Our Certificates Care Guide B2B Contact Us Woollyfelt LLC 1099 W 85th Ave, Federal HGTS, CO 80260, United States (+1) 303-521-4965 info@woollyfelt.com We are certified by Reach Out to Us Facebook Instagram Pinterest Whatsapp © Woollyfelt 2018, ALL RIGHTS RESERVED"
    },
    {
      "url": "https://woollyclouds.com/pages/contact-us",
      "text": "Contact Us\n– Woolly Clouds Skip to content icon-X Close menu Shop Storage & Organization Baskets & Bins Boxes for Shelf Toy Storage Baskets Laundry Hampers Firewood Baskets Tissue Box Covers Pillows & Cushions Pillows Cushion Table Setting Placemats Runners Coasters Napkin Rings Desk Mats Home Decor Wall Decor Floor Decor Nursery Decor Christmas Decor Samples & Other Sale Custom Order Custom Storage Basket Custom Seat Cushion Custom Mat About Us Our Story Team Sunstinability Contact Us Log in instagram Instagram Pinterest Cart icon-X Close cart Subtotal $0.00 Shipping, taxes, and discount codes calculated at checkout. Check out Your cart is currently empty. icon-search Search icon-hamburger Site navigation account Log in icon-search Search icon-bag-minimal Cart Shop Storage & Organization Baskets & Bins Boxes for Shelf Toy Storage Baskets Laundry Hampers Firewood Baskets Tissue Box Covers Pillows & Cushions Pillows Cushion Table Setting Placemats Runners Coasters Napkin Rings Desk Mats Home Decor Wall Decor Floor Decor Nursery Decor Christmas Decor Samples & Other Sale Custom Order Custom Storage Basket Custom Seat Cushion Custom Mat About Us Our Story Team Sunstinability Contact Us Search Search Made in in Kyiv, Ukraine, Lesya Kurbasa 2B. We are always happy to hear from you! If you have any questions, suggestions, or would like to learn more about our products, feel free to contact us. We strive to respond to all inquiries as quickly as possible. Contact us Name Email Message Send Send This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. Discover a World of Inspiration on Instagram! Fresh ideas, stylish collections, and the best moments – join us on Instagram. Discover Find Your Inspiration on Pinterest! Save your favorite looks and create your own style with us on Pinterest. Discover instagram Instagram Pinterest Shipping and Delivery Returns & Exchanges Shop Custom Order About Us Contact Us Sign up and save Sign up and save Subscribe to get special offers, free giveaways, and once-in-a-lifetime deals. Enter your email Subscribe icon-email Subscribe Powered by Shopify icon-X \"Close (esc)\" icon-chevron-left icon-X icon-chevron icon-X Contact Us"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Datenschutz name Surname Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.woolys.com/contact-us",
      "text": "Wooly Snowman | Primitive Snowmen Decorations | Customer Service for Wooly.com Inc. Home Shop Search Shipping Contact Us FAQs Get in touch (800) 449-6659 gramby@woolys.com SHOP HERE A white background with a few lines on it (800) 449-6659 A white background with a few lines on it gramby@woolys.com Home Shop Search Shipping Contact Us FAQs SHOP HERE Contact Us Contact Us First Name* Last Name* Email* Phone* Message* Thank you for contacting us. We will get back to you as soon as possible Oops, there was an error sending your message. Please try again later Wooly® Collectible Handcrafted Snowman Address 5211 Oliver Avenue SW, Cokato, MN 55321 Phone (800) 449-6659 Email gramby@woolys.com 5211 Oliver Avenue SW, Cokato, MN 55321 (800) 449-6659 gramby@woolys.com About Us Shop Shipping FAQs Privacy Policy About Us Shop Shipping FAQs Privacy Policy Secure Shopping, we accept these Credit Cards © 2025 All Rights Reserved | Wooly Share by:"
    },
    {
      "url": "https://tracxn.com/d/companies/wooly/__tQSc30PvamFffmS5orEg5udf2lz5G7l8XOi2pyaBwpA/founders-and-board-of-directors",
      "text": "Wooly - 2025 Company Profile, Team, Funding & Competitors - Tracxn JavaScript is disabled in your browser. enable it to enjoy the full features of Tracxn. Your browser was unable to load all of Tracxn resources. They may have been blocked by your firewall, proxy or browser configuration. Press Ctrl+F5 or Ctrl+Shift+R to have your browser try again and if that doesn't work, click here to retry or mail us at hi@tracxn.com Internal Server Error Toggle navigation Customers Investment Industry Venture Capital Funds Private Equity Funds Accelerators & Incubators Investment Banks Corporates and Startups Corp Dev and M&A Teams Corporate Innovation Startup Founders Sales Team Ecosystem Journalists and Publications Universities View All Customers Contact Us Offerings Rich Data Sets Companies Investors Funding Acquisitions Financials Cap Tables Employee Count Deep Dives Company deep-dive Investor deep-dive Activity by Corporates Sector Coverage Workflow Solutions Sourcing new deals Tracking Market Updates Portfolio Management Deal Flow CRM LiveDeals And Much More... Data Solutions Reports by Tracxn Enterprise Grade Support Sector Coverage Apps & Extensions View All Offerings Contact Us Try our premium features for FREE - no threads attached! Learn More Get Started. Itâs FREE Company About us Our Investors Media & Newsroom Careers Contact Us Pricing Login Get Started. It's FREE! Discover > Companies > Wooly Navigate to Overview About the company Funding and Investors Founders and Board of Directors Competitors and Alternates Investments and Acquisitions Reports Funding & Investors Competitors Landscape All Related Reports Wooly - Company Profile Last updated: March 28, 2025 Claim Profile Suggest Edits Linkedin Twitter Facebook Email Copy Url Request page removal Wooly - About the company Wooly is a seed company based in Lehi (United States), founded in 2015 by Scott Paul and James Davis . It operates as an Influencer and social marketing through customers . Wooly has raised $1.5M in funding . The company has 991 active competitors, including 209 funded and 110 that have exited . Its top competitor s include companies like Klaviyo , Rokt and Bango . Company Details Wooly provides solutions to brands to discover and engage their customers. Allows brands to segment customers and social followers based on demographics, job titles, interests, and social influence provides metrics on their interest and affinity level. It sends alerts to clients when influencers, executives, celebrities or VIPs buy or follow them. It collects data and integrates with Shopify, MailChimp, Instagram, YouTube, Twitter and Facebook. Clientele includes Exxon, Nomatic, Cotopaxi and Rubio's. Website wooly.com Social Key Metrics Founded Year 2015 Location Lehi, United States Stage Seed Total Funding $1.5M in 2 rounds Latest Funding Round Seed, Jul 09, 2020 , $495K Ranked 262 nd among 991 active competitors Wooly's funding and investors Wooly has raised a total funding of $1.5M over 2 round s . Its first funding round was on Dec 15, 2017 . Wooly has 2 institutional investor s including Album VC and Peterson Partners . Here is the list of recent funding rounds of Wooly : Date of funding Funding Amount Round Name Post money valuation Revenue multiple Investors Jul 09, 2020 $495K Seed 1883519 5531272 - Dec 15, 2017 $1M Seed 7550611 9532531 - Access funding benchmarks and valuations. Sign up today! View details of Wooly 's funding rounds and investors Wooly's founders and board of directors Founder? Claim Profile The founders of Wooly are Scott Paul and James Davis . Here are the details of Wooly's key team members: Scott Paul : Co-Founder & CEO of Wooly . They are also an angel investor in 2 startup s . Contact Info: 1 email address James Davis : Co-Founder & CTO of Wooly . View details of Wooly 's Founder profiles and Board Members Access Tracxn on any website Our Google Chrome extension lets you view company details while browsing their websites Install Tracxn Extension Wooly's Competitors and alternates Top competitor s of Wooly include Klaviyo , Rokt and Bango . Here is the list of Top 10 competitors of Wooly , ranked by Tracxn score: Overall Rank Company Details Short Description Total Funding Investors Tracxn Score 1st Klaviyo 2012 , Boston ( United States ) , Public Provider of SaaS-based e-mail marketing software solutions for e-commerce businesses $778M Morgan Stanley , Summit Partners Â &Â 21 Â others 73/100 2nd Rokt 2012 , New York City ( United States ) , Series E Provider of personalized marketing tools for e-commerce businesses $487M Wellington , TDM Growth Partners Â &Â 16 Â others 72/100 3rd Bango 1999 , Cambridge ( United Kingdom ) , Public Carrier billing-based payment solutions to businesses and merchants - AlbionVC , Cambridge Capital Group Â &Â 5 Â others 67/100 4th Elastic Path Software 2000 , Vancouver ( Canada ) , Series C API-based enterprise commerce software and content management platform $144M BlackRock , BDC Â &Â 5 Â others 66/100 5th Involve Aisa Technologies 2014 , Kuala Lumpur ( Malaysia ) , Series B Platform offering performance based digital marketing solution $13.6M 500 Global , 500 Durians Â &Â 23 Â others 64/100 6th LTK 2011 , Dallas ( United States ) , Series B Brand collabroration platform for influencers and creators $315M Maverick Ventures , SoftBank Vision Fund 64/100 7th CommerceIQ 2012 , Palo Alto ( United States ) , Series D Provider of SaaS and AI-based analytics software for e-commerce businesses $196M Trinity Ventures , Insight Partners Â &Â 4 Â others 63/100 8th Feedvisor 2012 , New York City ( United States ) , Series B AI based big data analytics solutions provider $32.7M General Catalyst , MicroVenture Marketplace Â &Â 12 Â others 61/100 9th Demandware 2004 , New York City ( United States ) , Acquired Enterprise cloud commerce solutions $65M General Catalyst , North Bridge Venture Partners Â &Â 3 Â others 60/100 10th Yottaa 2009 , Waltham ( United States ) , Series E Cloud-based landing page optimization platform for e-tailers $63.8M Intel Capital , General Catalyst Â &Â 3 Â others 59/100 262nd Wooly 2015 , Lehi ( United States ) , Seed Influencer and social marketing through customers $1.5M Album VC , Peterson Partners 30/100 Get insights and benchmarks for competitors of 2M+ companies! Sign up today! Looking for more details on Wooly 's competitors? Click here to see the top ones Wooly's Investments and acquisitions Wooly has made no investments or acquisitions yet. Reports related to Wooly Free Top Business Models in Retail Report Edition: Dec 28, 2023 (11 Pages) View all reports related to Wooly View complete company profile of Wooly Are you a Founder ? Claim your Profile Claim and keep your data updated to ensure investors can find you easily. Looking to raise funds? Showcase fundraising requirement to VCs, PEs, Angels & IBs. Find Investors for your Next Round Discover potential investors for your next round of investment. FAQs about Wooly When was Wooly founded? Wooly was founded in 2015. Where is Wooly located? Wooly is located in Lehi, United States . When was the latest funding round of Wooly? Wooly's latest funding round was on Jul 09, 2020. Who are the top competitors of Wooly? Wooly's top competitor s are Klaviyo , Rokt and Bango . What does Wooly do? Wooly provides solutions to brands to discover and engage their customers. Allows brands to segment customers and social followers based on demographics, job titles, interests, and social influence provides metrics on their interest and affinity level. It sends alerts to clients when influencers, executives, celebrities or VIPs buy or follow them. It collects data and integrates with Shopify, MailChimp, Instagram, YouTube, Twitter and Facebook. Clientele includes Exxon, Nomatic, Cotopaxi and Rubio's. Is Wooly a funded company? Wooly is a funded company, its first funding round was on Dec 15, 2017. Where does Wooly rank among its competitors? Wooly ranks 262 amongst 991 active competitors. Explore our recently published companies Design Aptitude Test - Pune based, 2017 founded, Unfunded company AMSOIL - Superior based, 1969 founded, Unfunded company Hindi Sahyog - India based, 2020 founded, Unfunded company sellerboard - Stuttgart based, 2021 founded, Unfunded company Tutelage Academy - Kullu based, 2020 founded, Unfunded company Lyrics Translaton - India based, 2020 founded, Unfunded company Get full company profile in your inbox Get Company Profile Unlock full data with our Lite plan! Sign Up and Get Free Access Tracxn powers 1,000+ customers across 30+ countries Company About us Our Investors News and Press Resources Investor Relations ODR Portal Terms of Use Privacy Policy GDPR FAQs Careers Customers Venture Capital Funds Private Equity Funds Accelerators and Incubators Investment Banks Corporate Innovation CorpDev and M&A Teams Startup Founders Journalists and Publications Customer Testimonials Explore Tracxn Discover interesting lists Sector Research Offerings Search for Indian Legal Entity Quick Links Schedule Demo Get in touch See Pricing Plans Â© 2025 Tracxn Technologies Limited. All rights reserved. Registered Office: L-248, 2nd Floor, 17th Cross, Sector 6, HSR Layout, Bengaluru, Karnataka 560102. CIN: L72200KA2012PLC065294. Investor Grievances & Compliance: Megha Tibrewal, Company Secretary & Compliance Officer | Email: | Phone: ."
    }
  ]
}