{
  "fuentes": [
    {
      "url": "https://www.iitk.ac.in/dora/Abhiraj-Singh-Bhal.php",
      "email": "alumni@iitk.ac.in"
    },
    {
      "url": "https://www.biography.com/musicians/keith-urban",
      "email": "editor@biography.com"
    },
    {
      "url": "https://urban.co/en-gb/contact",
      "email": "info@urban.co"
    },
    {
      "url": "https://urban.co/en-gb/contact",
      "email": "press@urban.co"
    },
    {
      "url": "https://www.urbn.com/contact-us",
      "email": "tricia.smith@urbanout.com"
    },
    {
      "url": "https://www.urbn.com/contact-us",
      "email": "amin.maredia@urbanout.com"
    },
    {
      "url": "https://www.urbn.com/contact-us",
      "email": "azeez.hayne@urbanout.com"
    },
    {
      "url": "https://www.urbn.com/contact-us",
      "email": "edward.antoian@urbanout.com"
    },
    {
      "url": "https://www.urbn.com/contact-us",
      "email": "frank.conforti@urbanout.com"
    },
    {
      "url": "https://www.urbn.com/contact-us",
      "email": "harry.cherken@urbanout.com"
    },
    {
      "url": "https://www.urbn.com/contact-us",
      "email": "john.mulliken@urbanout.com"
    },
    {
      "url": "https://www.urbn.com/contact-us",
      "email": "kelly.kotzman@urbanout.com"
    },
    {
      "url": "https://www.urbn.com/contact-us",
      "email": "margaret.hayne@urbanout.com"
    },
    {
      "url": "https://www.urbn.com/contact-us",
      "email": "mary.egan@urbanout.com"
    },
    {
      "url": "https://www.urbn.com/contact-us",
      "email": "melanie.marein-efron@urbanout.com"
    },
    {
      "url": "https://www.urbn.com/contact-us",
      "email": "pr@urbn.com"
    },
    {
      "url": "https://www.urbn.com/contact-us",
      "email": "richard.hayne@urbanout.com"
    },
    {
      "url": "https://www.urbn.com/contact-us",
      "email": "sheila.harrington@urbanout.com"
    },
    {
      "url": "https://www.urbn.com/contact-us",
      "email": "todd.r.morgenfeld@urbanout.com"
    },
    {
      "url": "https://www.urbn.com/contact-us",
      "email": "wesley.s.mcdonald@urbanout.com"
    },
    {
      "url": "https://tracxn.com/d/companies/urban-company/__klvROduBoJz1qAN0zIxDE3VmuQQS-pWfSJtuBmVwxvg/founders-and-board-of-directors",
      "email": "hi@tracxn.com"
    },
    {
      "url": "https://urbanhealth.org.uk/who-we-are/about-us",
      "email": "info@urbanhealth.org.uk"
    },
    {
      "url": "https://urban-company.pissedconsumer.com/customer-service.html",
      "email": "grievanceofficer@urbancompany.com"
    },
    {
      "url": "https://urban-company.pissedconsumer.com/customer-service.html",
      "email": "help@urbancompany.com"
    },
    {
      "url": "https://urban-company.pissedconsumer.com/customer-service.html",
      "email": "privacy@zapr.in"
    },
    {
      "url": "https://www.quora.com/Who-are-the-founders-of-Urban-Company",
      "email": "jo@samaritans.org"
    },
    {
      "url": "https://urban-reclamation.com/pages/contact-us",
      "email": "logo_rect_v2_small_7d5e915a-7bf2-40a0-ae61-0fc471910dd6_150x@2x.png"
    },
    {
      "url": "https://urban-reclamation.com/pages/contact-us",
      "email": "logo_rect_v2_small_7d5e915a-7bf2-40a0-ae61-0fc471910dd6_250x@2x.png"
    },
    {
      "url": "https://urban-reclamation.com/pages/contact-us",
      "email": "white_icon_87d7ae56-886a-442d-b25a-387a01b76416_150x@2x.png"
    },
    {
      "url": "https://urban-reclamation.com/pages/contact-us",
      "email": "white_icon_87d7ae56-886a-442d-b25a-387a01b76416_250x@2x.png"
    },
    {
      "url": "https://urban-reclamation.com/pages/contact-us",
      "email": "white_icon_87d7ae56-886a-442d-b25a-387a01b76416_x120@2x.png"
    },
    {
      "url": "https://miamiurbanleague.org/",
      "email": "contact@miamiurbanleague.org"
    },
    {
      "url": "https://miamiurbanleague.org/",
      "email": "media@miamiurbanleague.org"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "hernando.cairasco@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "jr@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "kiki.toledo@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "lisa@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "amelis.flores@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "carlos.cordoba@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "carolina.sanchez@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "dixie@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "ivy.soteldo@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "jackie.cairasco@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "joey@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "kevin@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "kiki.toledo@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "laura@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "lia.rodriguez@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "luisa.leal@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "mark.kilburn@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "omar@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "realestate@urbanresource.com"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "email": "sabrina.rivera@urbanresource.com"
    },
    {
      "url": "https://theurban.miami/",
      "email": "team@latofonts.com"
    },
    {
      "url": "https://store.urbanintellectuals.com/contactus/",
      "email": "you@domain.com"
    },
    {
      "url": "https://www.partyslate.com/venues/the-urban",
      "email": "contact@partyslate.com"
    },
    {
      "url": "https://www.linkedin.com/company/urban-standard-capital",
      "email": "ir@uscnyc.com"
    },
    {
      "url": "https://www.linkedin.com/company/urban-standard-capital",
      "email": "originations@uscnyc.com"
    },
    {
      "url": "https://mvul.org/about",
      "email": "info@mvul.org"
    },
    {
      "url": "https://www.thegoodsauna.co.uk/contact-us",
      "email": "info@thegoodsauna.co.uk"
    }
  ],
  "mails": [
    "alumni@iitk.ac.in",
    "amelis.flores@urbanresource.com",
    "amin.maredia@urbanout.com",
    "azeez.hayne@urbanout.com",
    "carlos.cordoba@urbanresource.com",
    "carolina.sanchez@urbanresource.com",
    "contact@miamiurbanleague.org",
    "contact@partyslate.com",
    "dixie@urbanresource.com",
    "editor@biography.com",
    "edward.antoian@urbanout.com",
    "frank.conforti@urbanout.com",
    "grievanceofficer@urbancompany.com",
    "harry.cherken@urbanout.com",
    "help@urbancompany.com",
    "hernando.cairasco@urbanresource.com",
    "hi@tracxn.com",
    "info@mvul.org",
    "info@thegoodsauna.co.uk",
    "info@urban.co",
    "info@urbanhealth.org.uk",
    "ir@uscnyc.com",
    "ivy.soteldo@urbanresource.com",
    "jackie.cairasco@urbanresource.com",
    "jo@samaritans.org",
    "joey@urbanresource.com",
    "john.mulliken@urbanout.com",
    "jr@urbanresource.com",
    "kelly.kotzman@urbanout.com",
    "kevin@urbanresource.com",
    "kiki.toledo@urbanresource.com",
    "laura@urbanresource.com",
    "lia.rodriguez@urbanresource.com",
    "lisa@urbanresource.com",
    "logo_rect_v2_small_7d5e915a-7bf2-40a0-ae61-0fc471910dd6_150x@2x.png",
    "logo_rect_v2_small_7d5e915a-7bf2-40a0-ae61-0fc471910dd6_250x@2x.png",
    "luisa.leal@urbanresource.com",
    "margaret.hayne@urbanout.com",
    "mark.kilburn@urbanresource.com",
    "mary.egan@urbanout.com",
    "media@miamiurbanleague.org",
    "melanie.marein-efron@urbanout.com",
    "omar@urbanresource.com",
    "originations@uscnyc.com",
    "pr@urbn.com",
    "press@urban.co",
    "privacy@zapr.in",
    "realestate@urbanresource.com",
    "richard.hayne@urbanout.com",
    "sabrina.rivera@urbanresource.com",
    "sheila.harrington@urbanout.com",
    "team@latofonts.com",
    "todd.r.morgenfeld@urbanout.com",
    "tricia.smith@urbanout.com",
    "wesley.s.mcdonald@urbanout.com",
    "white_icon_87d7ae56-886a-442d-b25a-387a01b76416_150x@2x.png",
    "white_icon_87d7ae56-886a-442d-b25a-387a01b76416_250x@2x.png",
    "white_icon_87d7ae56-886a-442d-b25a-387a01b76416_x120@2x.png",
    "you@domain.com"
  ],
  "nombre_sitio": "theurban.miami",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.iitk.ac.in/dora/Abhiraj-Singh-Bhal.php",
      "text": "DORA | IIT Kanpur IITK Foundation IITKDF GiveBack Home (current) News Reunions Reunion 2024-2025 Reunion 2023-2024 Reunion 2022-2023 Institute Alumni Obituaries Upcoming Events Reunion 2025-2026 PARWA Initiatives Academic Initiatives Faculty Initiatives Distinguished Lecture Series Departmental Fund Students Initiatives Scholarships Awards Other Initiatives Infrastructure Initiatives Gym Upgrade & Expansion Gangwal School of  Medical Sciences & Technology Community Welfare Shikhsa Sopan Prayas Rozi Shiksha Kendra Opportunity School Batch Initiative Centres Shivani Centre for the Nurture and Re-integration of Hindi and Other Indian Languages Chandrakanta Kesavan Centre for Energy Policy and Climate Solutions The Mehta Family Center for Engineering in Medicine Educational Initiative Kislaya School Campus School Awards DA Award SKD Award DS Award YA Award CSE-PJBT Award Brochure 2024 Brochure 2023 Brochure 2022 Alumni Alumni Association Notable Alumni Recognition & Honour CSR CSR Forms Publications Newsletter Annual Report Spark kritajna kritajna-2022 Blog CSR box 2023-24 IITK CSR Project Catalogue CSR Summit Brochure 2023-24 IITK Samanvay 2024 Industry Newsletter Team Career Young Alumnus Awardee 2020 Mr. Abhiraj Singh Bhal (BT/EE/2009) Mr. Bhal is the Co-founder and CEO of Urban Company (formerly\r\n known as UrbanClap). Launched in 2014, Urban Company  is\r\n the largest home services platform in India and UAE, with recent\r\n expansion to Australia and Singapore. The platform helps\r\n customers book reliable home services â from beauty services\r\n to massage therapy, appliance repair to plumbing etc. Since its inception, Urban Company has delivered more than 14 million service orders across 22 cities through a fleet of nearly 30,000 service professionals. Prior to starting his own business venture, Mr. Bhal was a consultant with The Boston Consulting Group, advising Fortune 500 companies across India, Germany and South East Asia.He holds post graduate diploma in management from IIM Ahmedabad. Mr. Bhalâs excellent entrepreneur leadership and skills have won him numerous awards, including IIMA Young Alumni Achieverâs Award 2020 in Entrepreneurship, \"The Entrepreneur of the Year Award 2020\" by NASSCOM Technology & Leadership Forum, Fortune 40 under 40 (3 years in a row), Entrepreneur Magazine 35 under 35 for India in 2017 and GQ 50 most influential young Indians in 2017. He is the co-chair of the CII Ecommerce Council, on the investment committee of ACT Grants (An INR 100 cr. grant fund to fight COVID-19), on the governing council of the Domestic Workers Sector Skill Council, and part of various policy initiatives of the central government, particularly in the domain of skilling and entrepreneurship. IITK conferred upon Mr. Abhiraj Singh Bhal the Young Alumnus Award, 2020. Awards and Honors Co- founder of the Urban Company, largest home services platform in India. IIM Ahmedabad Young Alumnus Achievers Award 2020. \"The Entrepreneur of the Year Award 2020\" by NASSCOM Technology & Leadership Forum. Contact Us Dean of Resources and Alumni Office Room no. 269, Faculty Building IIT Kanpur- 208016 For any queries please contact us at alumni@iitk.ac.in Phone. No. +91-512-259-7289 Others Office Orders Almaworld Social Media Links Copyright © All Rights Reserved"
    },
    {
      "url": "https://www.biography.com/musicians/keith-urban",
      "text": "Keith Urban: Biography, Country Singer, ‘American Idol’ Judge Search Newsletter History - Culture Musicians Athletes Movies - TV Artists Power - Politics Business Scientists Scholars - Educators Activists True Crime BIO Buys Privacy Notice Terms Of Use Skip to Content History & Culture Musicians Athletes Movies & TV Newsletter Charlie Sheen’s Addiction Kathy Bates Almost Quit Emmy Nominee Owen Wilson Shohei Ohtani Everyday Heroes of 9/11 Famous Musicians Country Singers Keith Urban Keith Urban Grammy-winning country singer Keith Urban is known for the song “Blue Ain’t Your Color,” “Somebody Like You,” and “Better Life.” By Biography.com Editors and Catherine Caruso Updated: Feb 25, 2025 4:41 PM EST Kevin Mazur // Getty Images We may earn commission from links on this page, but we only recommend products we back. 1967–present Keith Urban News: Singer to Star in a New TV Competition This Fall Keith Urban is set to headline the upcoming music competition series The Road . The CBS show will follow the Grammy-winning country singer as he searches for the next big name in music. Emerging artists will be tested on their ability to perform in front of a live audience by opening for Urban at a series of concerts across Texas, Tennessee, and Oklahoma. Audience members at each venue will help decide which participants will stay on tour. Musicians on the Road Kelsea Ballerini Is Touring Through April Here’s How You Can Buy Bad Bunny Concert Tickets Yes, It’s Still Possible to See Beyoncé on Her Cowboy Carter Tour “I love the idea of throwing artists into a real-world environment to find out if they are artists,” he said in a statement on February 25. “Paying your dues sucks, but there are things in this business that can’t be taught, like how to put together a set list, whether to extend or cut a song during your performance or how to work the crowd.” In the series, Urban will perform songs from his latest album, High , that released in September 2024, as well as some of his other hits. Filming will conclude shortly before the 57-year-old embarks on his High and Alive World Tour in May. “For me, touring has always been my first love,” he continued. “It’s the only road to take if you want to be a performer.” While there is currently no release date, The Road is expected to air in the fall. Listen to High on Amazon Music , Apple Music , or Spotify Jump to: Who Is Keith Urban? Quick Facts Early Life and Career Solo Albums Hit Songs Net Worth Wife Nicole Kidman and Daughters Addiction and Sobriety American Idol Judge Who Is Keith Urban? Since growing up in Australia on American country music, Keith Urban has become one of the genre’s most enduring artists. In 1999, he released a self-titled solo album, setting the table for an impressive career that has produced top-selling albums like Defying Gravity and Fuse as well as numerous Grammy, Country Music Association, and Academy of Country Music wins. Elsewhere, Urban served as a judge on the competition show American Idol from 2013 to 2016. He and his wife, actor Nicole Kidman , have two daughters. Quick Facts FULL NAME: Keith Lionel Urban BORN: October 26, 1967 BIRTHPLACE: Whangarei, New Zealand SPOUSE: Nicole Kidman (2006–present) CHILDREN: Sunday and Faith ASTROLOGICAL SIGN: Scorpio Early Life and Career Keith Lionel Urban was born on October 26, 1967, in Whangarei on New Zealand’s North Island. While being raised in Australia, Keith inherited a passion for American country music from his parents, Bob and Marienne, who gave him a ukulele when he was 4 years old. Keith took up guitar lessons two years later and started entering talent competitions at the age of 8. By the time he was a teenager, he had won several talent shows and joined a country band. His signature style—a mix of rock guitar and country sound—emerged during those formative years. His guitar influences include Fleetwood Mac , Dire Straits, and John Mellencamp . In 1991, when he was in his early 20s, Keith debuted his first album, which enjoyed success in his native Australia. It was time for the 5-foot-10 musician to cut his teeth in Nashville. His first Nashville band, the Ranch, made a huge splash, and the group released a self-titled album in 1997 to commercial acclaim. Shortly thereafter, Urban decided to leave the band to pursue a solo career. His talents were quickly recruited by some of the biggest names in country music, including Garth Brooks and the Dixie Chicks (now The Chicks). Solo Albums As a solo artist, Urban has released a whopping 11 studio albums, three of which have become No. 1 country albums. Defying Gravity (2009) , one of two albums to top the Billboard 200 chart, earned a Grammy nomination for Best Country Album. Urban’s newest album, High , arrived in September 2024. Keith Urban Urban released his first solo album in the United States in October 1999. The self-titled record featured hits like “Your Everything” and “It’s A Love Thing.” The track “But for the Grace of God” gave him his first No. 1 country song, launching his career. Four years later, Keith Urban went certified platinum. Golden Road Urban released his second studio album, Golden Road , in October 2002, one year after being named New Artist of the Year at the Country Music Association Awards. The album included No. 1 singles “Who Wouldn’t Want to Be Me” and “Somebody Like You,” which was nominated for Single Record of the Year at the Academy of Country Music Awards. The track “You’ll Think of Me” earned him his first Grammy win in 2006 for Best Male Country Vocal Performance. Be Here After touring with the likes of Brooks & Dunn and Kenny Chesney and headlining his own tour, Urban released his third album, Be Here , in September 2004. The record won an ACM Award for Album of the Year, as well as a nod in the same category at the CMAs and received a Grammy nomination for Best Country Album in 2005. With more than four million copies sold, Be Here is Urban’s best-selling album. The single “Days Go By” debuted at the top of Billboard ’s country song chart and was nominated for Single Record of the Year at the ACM Awards. Urban was also named Male Vocalist and Entertainer of the Year at the 2005 CMAs. Love, Pain & the Whole Crazy Thing Urban’s next album, Love, Pain & the Whole Crazy Thing , was released in November 2006, just one day after receiving his third CMA Award for Male Vocalist of the Year. It spawned several hits, including “Once in a Lifetime” and “Stupid Boy,” which won a Grammy for Best Male Country Vocal Performance in 2008. The record was also nominated for Album of the Year at the CMAs. In January 2008, Urban embarked on the Love, Pain and the Whole Crazy Carnival Ride Tour with Carrie Underwood . A live concert film of the tour was released the following year. Defying Gravity Urban continued his string of hits with another album, Defying Gravity , which was released in March 2009 and debuted at No. 1 on the Billboard 200—his first album to do so. The lead single, “Sweet Thing,” was inspired by his wife, Nicole Kidman. The tune hit No. 1 on Billboard ’s Hot Country Songs chart, then earned Urban his third Grammy Award for Best Male Country Vocal Performance. The album was nominated for but didn’t win Best Country Album. Urban performed the album’s second single, “Kiss a Girl,” during the Season 8 finale of the singing competition show American Idol as a duet with the show’s winner, Kris Allen. Three years after its release, Urban received his fourth Grammy for the track “’Til Summer Comes Around,” which won Best Male Country Vocal Performance. Get Closer In November 2010, he released Get Closer , a celebration of life and love, featuring the No. 1 country songs “Without You,” “You Gonna Fly,” and “Long Hot Summer.” The record debuted at No. 7 on the Billboard 200. Urban’s seventh headlining concert tour, the Get Closer 2011 World Tour, ran from April to October 2011. Fuse Maintaining his career as one of country music’s most popular stars, Urban released Fuse in September 2013. Debuting at No. 1 on the Billboard 200, the album included the tracks “We Were Us,” a duet with Miranda Lambert , as well as “Somewhere In My Car.” The following year, Fuse was nominated for Album of the Year at the CMA Awards. The songs “Cop Car” and “Raise ’Em Up,” featuring Eric Church, both earned Grammy nods in 2015 for Best Country Solo Performance and Best Country Duo/Group Performance, respectively. Ripcord Urban followed in May 2016 with the Grammy-nominated Ripcord, which debuted at No. 1 on Billboard ’s Top Country Albums chart. The synth-country record included a duet with Carrie Underwood on “The Fighter,” as well as “Blue Ain’t Your Color” and “John Cougar, John Deere, John 3:16,” which both received Grammy nominations. Graffiti U In April 2018, Urban delivered a new studio effort, Graffiti U . The No. 1 country album produced four singles—“Female,” “Parallel Line,” “Coming Home,” and “Never Comin’ Down”—and earned a CMA nomination for Album of the Year. His wife, Nicole Kidman, served as inspiration for multiple songs on the album, including the track “Gemini.” Kidman, whose zodiac sign is Gemini, also sang backing vocals on the #MeToo anthem “Female.” Urban’s “Parallel Line” received a Grammy nod for Best Country Solo Performance. The Speed of Now Part 1 The artist followed with The Speed of Now Part 1 in September 2020, featuring the song “We Were.” Urban’s duet with Pink on “One Too Many” earned him an ACM Award nomination for Musical Event of the Year. The multi-genre record reached the top of Billboard ’s Top Country Albums chart. High Urban released his latest album, High , on September 20, 2024. His first in four years, the record features the upbeat single “Wildside,” which was inspired by Joan Cusack ’s character in the 2003 movie School of Rock . Other tracks include the Hot Country single “Messed Up As Me” and the Lainey Wilson collaboration “Go Home W U.” Hit Songs Urban has delivered dozens of hit country songs over the course of his long career. His first No. 1 country song, “But for the Grace of God,” came in 1999 with the release of his self-titled album. In 2002, he released the No. 1 single “Somebody Like You,” which was nominated for Single Record of the Year at the ACM Awards. Four of his hits are responsible for all of Urban’s Grammy Awards. “You’ll Think of Me,” “Stupid Boy,” “Sweet Thing,” and “’Til Summer Comes Around” each won the award for Best Male Country Vocal Performance. “Sweet Thing” was inspired by the singer’s wife, actor Nicole Kidman. In fall 2009, Urban performed at the CMA Awards and received several honors for his collaborative effort with Brad Paisley on “Start a Band.” The singles “Without You” and “You Gonna Fly” rose to the top of the Billboard country songs chart in 2011 and 2012, respectively, followed by the release of the Grammy-nominated songs “Cop Car” and “Raise ’Em Up” three years later. His 2016 tracks “Blue Ain’t Your Color” and “John Cougar, John Deere, John 3:16” also received Grammy nominations, along with his 2018 single “Parallel Line.” Net Worth As of February 2025, Urban has an estimated net worth of $75 million, according to Celebrity Net Worth . In addition to his music and concert sales, he earns money from his signature line of acoustic and electric guitars. Wife Nicole Kidman and Daughters Getty Images Keith Urban and his wife, Nicole Kidman, have been married since 2006. Urban met actor Nicole Kidman at a gala in 2005 and proposed the following May. A month later, in June 2006, the pair married in their native Australia. Shortly after their wedding, the once-sober singer started drinking again, prompting Kidman to stage an intervention. Urban credits his wife for sobriety, expressing his gratitude for her in his 2009 song “Thank You.” In 2016, the musician opened up about how his struggles with addiction affected his relationship with Kidman. \"“I caused the implosion of my fresh marriage,” he told Rolling Stone . “It survived, but it’s a miracle it did. I was spiritually awoken with her. I use the expression ‘I was born into her,’ and that’s how I feel. And for the first time in my life, I could shake off the shackles of addiction.” After moving to Nashville, Urban and Kidman welcomed their first daughter, Sunday, in July in 2008. “We want to thank everybody that has kept us in their thoughts and prayers,” Urban wrote on his website shortly after Sunday’s birth. “We feel very blessed and grateful that we can share this joy with all of you today.” In December 2010, the couple had their second daughter, Faith, who was conceived via surrogacy. Addiction and Sobriety Urban first checked himself into a rehabilitation center for drug and alcohol addiction in 1998, following years of drug use and heavy drinking. After nearly eight years of sobriety, the singer relapsed just months after marrying actor Nicole Kidman in 2006. At Kidman’s urging, Urban checked himself into the Betty Ford Clinic. His album Love, Pain & the Whole Crazy Thing was released while he was in rehab. Dive Deeper How Betty Ford Tackled the Taboo of Addiction Urban opened up about his struggles with addiction in October 2021, revealing that his father, Robert, was also an alcoholic. “It took me a long time to get sober, took me a long time to recognize my alcoholism,” he told the Australian edition of Rolling Stone . “A long time because I didn’t drink like my dad, so I compared everything to him. So it just took a long time for me. But I was able to finally make the right choice in my life, that I wish my dad would have made.” American Idol Judge Getty Images Keith Urban appeared as a judge on American Idol from 2013 to 2016. In 2012, Urban was chosen as a new judge for Season 12 of American Idol , which began in January 2013. Urban appeared alongside Randy Jackson , Mariah Carey , and Nicki Minaj in his debut season. In 2014, he worked with Jennifer Lopez and Harry Connick Jr. A popular judge, Urban remained with the show for four seasons, through the end of its initial run in 2016. Fact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us ! Biography.com Editors Staff Editorial Team and Contributors The Biography.com staff is a team of people-obsessed and news-hungry editors with decades of collective experience. We have worked as daily newspaper reporters, major national magazine editors, and as editors-in-chief of regional media publications. Among our ranks are book authors and award-winning journalists. Our staff also works with freelance writers, researchers, and other contributors to produce the smart, compelling profiles and articles you see on our site. To meet the team, visit our About Us page: https://www.biography.com/about/a43602329/about-us Catherine Caruso Associate Profiles Editor Catherine Caruso joined the Biography.com staff in August 2024, having previously worked as a freelance journalist for several years. She is a graduate of Syracuse University, where she studied English literature. When she’s not working on a new story, you can find her reading, hitting the gym, or watching too much TV. Advertisement - Continue Reading Below Country Singers Megan Moroney Ella Langley Lainey Wilson 7 Musical Duos Who’ve Ended in Disaster Advertisement - Continue Reading Below Taylor Swift Morgan Wallen George Strait Bailey Zimmerman Tyler Childers Inside Morgan Wallen’s Promising Baseball Career Post Malone Has a Limited Collab With Stanley 6 Celeb-Loved Bronzing Drops, Starting at Just $17 Advertisement - Continue Reading Below About Biography.com Newsletter Contact Us Other Hearst Subscriptions A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2025 Hearst Magazine Media, Inc. Site contains certain content that is owned A&E Television Networks, LLC. All Rights Reserved. Biography and associated logos are trademarks of A+E Networks®protected in the US and other countries around the globe. Privacy Notice Terms of Use CA Notice at Collection DAA Industry Opt Out Your CA Privacy Rights/Shine the Light Cookies Choices"
    },
    {
      "url": "https://urban.co/en-gb/contact",
      "text": "Contact us | Urban.co Massage Most popular Deep tissue Urban classic Relaxing massage Sports massage Pregnancy massage Injury/pain management View All Massage by city Massage in London Massage in Manchester Massage in Birmingham Massage in Edinburgh Massage in Glasgow Massage in Liverpool View All Apply as a therapist Beauty Nails Gel manicure Classic pedicure Classic mani & pedi Gel pedicure View All Facials Deep cleanse facial Hydrating facial Youth boost facial Bespoke facial View All Hair removal Hollywood wax Brazilian wax Full leg wax Underarm wax View All Lashes Lift and tint Single lash extensions - full set Single lash extensions - half set Single lash extensions - infills View All Brows Brow shape and tint Brow shaping Brow lamination Defined brows View All Apply as a therapist Osteopathy Physiotherapy Pregnancy Pregnancy massages Prenatal massage Postnatal massage View All Other Pregnancy glow facial Osteopathy consultation and treatment View All Apply as a therapist Vitamin drips Most popular Drip consultation Essential Energy Drip Immune Support Drip Hydration drip View All Apply as a therapist Gifts Therapists Log in Book now Book now Massage Beauty Osteopathy Physiotherapy Pregnancy Vitamin drips Gifts Therapists Log in Book now Download the app Talk to us Fill in the form to send us a message, or tap the chat icon below to start a live chat. Your name Your email address Message Send Customer support Live chat 7am-10pm GMT daily, WhatsApp on +1 555-706-2192 , or email info@urban.co Postal address Urban, Office 18, 64-66 Wingate Square, London SW4 0AF Press office For press enquiries, please contact press@urban.co Looking for an Urban pro near you? London | Paris | Birmingham | Manchester | Liverpool | Edinburgh | Glasgow Find a pro near you About Urban Who we are Blog Reviews Refer a friend Urban Rewards Gift cards Careers Urban for teams Safety Legal Become an Urban pro Apply for massage Apply for beauty Apply for physio Apply for osteopathy Need help? How it works FAQ for customers FAQ for therapists Contact us Security Sitemap About Urban Who we are Blog Reviews Refer a friend Urban Rewards Gift cards Careers Urban for teams Safety Legal Become an Urban pro Apply for massage Apply for beauty Apply for physio Apply for osteopathy Need help? How it works FAQ for customers FAQ for therapists Contact us Security Sitemap United Kingdom"
    },
    {
      "url": "https://www.urbn.com/contact-us",
      "text": "Contact Us Your browser does not have JS enabled, you are still able to browse\n            the website but you won't be able to access advanced features such\n            as editing or logging in. Who We Are Board of Directors Campus Life Our History Senior Leadership What's New Our Brands Anthropologie Anthropologie Weddings Free People FP Movement Nuuly Menus & Venues Terrain Urban Outfitters Investor Relations Financial News and Events Financial Information Stock Information Analyst Coverage Governance Responsible Sourcing Work With Us Our Stores Home Office Distribution and Fulfillment Internships Hospitality International Apprenticeships Perks + Benefits Current Opportunities Impact Planet People Governance Inclusion + Belonging Senior Leadership Frank J. Conforti Co-President and Chief Operating Officer of URBN frank.conforti@urbanout.com Sheila Harrington Global Chief Executive Officer of Urban Outfitters and Free People Groups sheila.harrington@urbanout.com Azeez Hayne Chief Administrative Officer and General Counsel of URBN azeez.hayne@urbanout.com Margaret A. Hayne Co-President and Chief Creative Officer of URBN margaret.hayne@urbanout.com Richard A. Hayne Chief Executive Officer of URBN richard.hayne@urbanout.com Tricia Smith Global Chief Executive Officer of Anthropologie Group Tricia.smith@urbanout.com Melanie Marein-Efron Chief Financial Officer melanie.marein-efron@urbanout.com Board of Directors Edward N. Antoian (1)(4) Founder of Zeke Capital Advisors edward.antoian@urbanout.com Kelly Campbell (2) Former President, Peacock kelly.kotzman@urbanout.com Harry S. Cherken, Jr. Partner of Drinker Biddle & Reath LLP harry.cherken@urbanout.com Mary C. Egan (3) Strategy Consultant, Egan Advisory Group mary.egan@urbanout.com Margaret A. Hayne Co-President and Chief Creative Officer of URBN margaret.hayne@urbanout.com Richard A. Hayne Chief Executive Officer of URBN Chairman of the Board richard.hayne@urbanout.com Amin N Maredia (2)(3) Founder & Managing Partner, Meaningful Partners Former CEO, Sprouts Farmers Market amin.maredia@urbanout.com Wesley McDonald (1)(2) Former Chief Financial Officer of Kohl’s wesley.s.mcdonald@urbanout.com Todd R. Morgenfeld (1)(2) Former Chief Financial Officer of Pinterest todd.r.morgenfeld@urbanout.com John Mulliken (3) Senior Advisor - Boston Consulting Group Former CTO - Wayfair john.mulliken@urbanout.com (1) Members of the Audit Committee (2) Members of the Compensation and Leadership Development Committee (3) Members of the Nominating and Governance Committee (4) Lead Independent Director Or contact us at: Urban Outfitters, Inc. Media Relations Contact: pr@urbn.com 5000 South Broad St Philadelphia, PA 19112-1495 215-454-5500 Urban Outfitters Free People Anthropologie Terrain FP Movement Anthropologie Weddings Menus & Venues Nuuly Urban Outfitters Free People Anthropologie Terrain FP Movement Anthropologie Weddings Menus & Venues Nuuly Terms of Use Privacy Policy Contact Site Map ©2025 Urban Outfitters, Inc."
    },
    {
      "url": "https://tracxn.com/d/companies/urban-company/__klvROduBoJz1qAN0zIxDE3VmuQQS-pWfSJtuBmVwxvg/founders-and-board-of-directors",
      "text": "Urban Company - 2025 Company Profile, Team, Funding, Competitors & Financials - Tracxn JavaScript is disabled in your browser. enable it to enjoy the full features of Tracxn. Your browser was unable to load all of Tracxn resources. They may have been blocked by your firewall, proxy or browser configuration. Press Ctrl+F5 or Ctrl+Shift+R to have your browser try again and if that doesn't work, click here to retry or mail us at hi@tracxn.com Internal Server Error Toggle navigation Customers Investment Industry Venture Capital Funds Private Equity Funds Accelerators & Incubators Investment Banks Corporates and Startups Corp Dev and M&A Teams Corporate Innovation Startup Founders Sales Team Ecosystem Journalists and Publications Universities View All Customers Contact Us Offerings Rich Data Sets Companies Investors Funding Acquisitions Financials Cap Tables Employee Count Deep Dives Company deep-dive Investor deep-dive Activity by Corporates Sector Coverage Workflow Solutions Sourcing new deals Tracking Market Updates Portfolio Management Deal Flow CRM LiveDeals And Much More... Data Solutions Reports by Tracxn Enterprise Grade Support Sector Coverage Apps & Extensions View All Offerings Contact Us Try our premium features for FREE - no threads attached! Learn More Get Started. Itâs FREE Company About us Our Investors Media & Newsroom Careers Contact Us Pricing Login Get Started. It's FREE! Discover > Companies > Urban Company Navigate to Overview About the company Legal Entities Funding and Investors Founders and Board of Directors Competitors and Alternates Latest Cap tables and Shareholding Investments and Acquisitions Reports News Funding & Investors Latest Shareholding Competitors Landscape Comparables Historical Cap Tables Historical Financials Who's likely to Invest? All Related Reports Urban Company - Company Profile unicorn Last updated: September 11, 2025 Claim Profile Suggest Edits Linkedin Twitter Facebook Email Copy Url Request page removal Urban Company - About the company Urban Company is a series  F company based in Gurugram (India), founded in 2014 by Abhiraj Singh Bhal , Varun Khaitan and Raghav Chandra . It operates as a Provider of an on demand home services connecting customers with vetted professionals . Urban Company has raised $376M in funding from investors like Accel , Elevation Capital and Bessemer Venture Partners , with a current valuation of â¹20,000Cr . The company has 400 active competitors, including 24 funded and 8 that have exited . Its top competitor s include companies like Thumbtack , ServiceMarket and Spruce . Sectors and market segments that Urban Company operate in Urban Company serves in the Unbundling of Craigslist market segments . The primary business model of Urban Company is : Unbundling of Craigslist > Local Services > ***** **** > ***** ****** Company Details Provider of an on demand home services connecting customers with vetted professionals. It offers a variety of services including beauty treatments, cleaning, and repairs. It provides hand picked professionals for a wide range of services delivered directly to the doorstep. The platform provides transparent pricing with no hidden charges. It allows customers to book services through the app or website. Website www.urbancompany.com/ Social Email ID *****@urbancompany.com Phone Number +91 ********** Registered Address Unit No. 08, Ground Floor,   Rectangle 1, D4, Saket District Centre, South Delhi, New Delhi, Delhi, India, 110017 Key Metrics Founded Year 2014 Location Gurugram, India Stage Series F Total Funding $376M in 12 rounds Latest Funding Round Angel, Jun 29, 2022 , $144K Post Money Valuation â¹20,000Cr as on Jun 29, 2022 Investors Accel & 49 more Ranked 1 st among 400 active competitors Annual Revenue â¹928Cr as on Mar 31, 2024 Employee Count 1,213 as on May 31, 2025 Investment & Acquisitions Karban & 4 more Similar Companies Jeff & 182 more Legal entities associated with Urban Company Urban Company is associated with 1 legal entit y given below: Legal Entity Name Date of Incorporation Revenue Latest Employee Count Documents Urban Company Limited CIN: U74140DL2014PLC274413 India , Active Dec 22, 2014 $112M (as on Mar 31, 2024) 1213 (as on May 31, 2025) Buy Now Urban Company's funding and investors Filter this list Urban Company has raised a total funding of $376M over 12 round s . Its first funding round was on Mar 02, 2015 . Its latest funding round was a Angel round on Jun 29, 2022 for $144K . 1 investor participated in its latest round, lead by Ireena Vittal . Urban Company has 28 institutional investor s including Accel , Elevation Capital and Bessemer Venture Partners . Accel is the largest institutional investor in Urban Company . There are 22 Angel Investor s in Urban Company . Here is the list of recent funding rounds of Urban Company : Date of funding Funding Amount Round Name Post money valuation Revenue multiple Investors Jun 29, 2022 $144K Angel $2.53B - Ireena Vittal Apr 27, 2021 $190M Series F $2.16B - Wellington , Naspers , Prosus , Dragoneer Investment Group , DF International Group , Vy Capital , Steadview , Tiger Global Management , DF International Partners Aug 02, 2019 $75M Series E - - Tiger Global Management , Steadview , Vy Capital , ABG Capital Access funding benchmarks and valuations. Sign up today! View details of Urban Company 's funding rounds and investors Urban Company's founders and board of directors Founder? Claim Profile The founders of Urban Company are Abhiraj Singh Bhal , Varun Khaitan and Raghav Chandra . Abhiraj Singh Bhal is the CEO of Urban Company . Here are the details of Urban Company's key team members: Abhiraj Singh Bhal : Co-Founder & CEO of Urban Company and founder of 1 other compan y . They are also an angel investor in 5 startup s and serve on the board of 1 compan y . Contact Info: 2 email addresses Varun Khaitan : Co-Founder & COO of Urban Company and founder of 1 other compan y . They are also an angel investor in 4 startup s and serve on the board of 1 compan y . Contact Info: 2 email addresses Raghav Chandra : Co-Founder of Urban Company and founder of 1 other compan y . They serve on the board of 1 compan y . Contact Info: 2 email address es and 1 phone number Urban Company's Board of Directors Urban Company 's board has 6 active member s . Ravi Adusumalli , Vishal Gupta , Abhinav Chaturvedi and Ireena Vittal are part of team and Ashish Gupta and Shyamal Mukherjee are independent board member s . Here is the list of Urban Company's board of directors: Name Type Representing Status Duration Abhiraj Singh Bhal Team - Current 0y 4m Varun Khaitan Team - Current 10y 7m Raghav Chandra Team - Current 10y 7m Ravi Adusumalli Investor Elevation Capital Current 9y 6m Vishal Gupta Investor Bessemer Venture Partners Current 9y 9m Vamsi Krishna Duvvuri Investor - Current 0y 10m Abhinav Chaturvedi Investor Accel Current 10y 1m Ireena Vittal Investor - Current 3y 4m Mukul Singhal Investor Elevation Capital Past 0y 8m Ashish Gupta Independent board member - Current 3y 5m Shyamal Mukherjee Independent board member - Current 3y 5m Rajesh Gopinathan Independent board member - Current 0y 11m Deepinder Goyal Independent board member - Past 0y 11m View details of Urban Company 's Founder profiles and Board Members Urban Company's employee count trend Urban Company has 1,213 employees as of May 25. The total employee count is 22.0% more than what it was in May 24. Here is Urban Company 's employee count trend over the years: Uncover Urban Company's growth story! Sign up today! Access Tracxn on any website Our Google Chrome extension lets you view company details while browsing their websites Install Tracxn Extension Urban Company's Competitors and alternates Top competitor s of Urban Company include Thumbtack , ServiceMarket and Spruce . Here is the list of Top 10 competitors of Urban Company , ranked by Tracxn score: Overall Rank Company Details Short Description Total Funding Investors Tracxn Score 1st Urban Company 2014 , Gurugram ( India ) , Series F Provider of an on demand home services connecting customers with vetted professionals $376M Wellington , Naspers Â &Â 48 Â others 84/100 2nd Thumbtack 2008 , San Francisco ( United States ) , Series H App based platform to connect users with local service professionals $699M Hercules Capital , Founders Circle Capital Â &Â 20 Â others 81/100 3rd ServiceMarket 2013 , Dubai ( United Arab Emirates ) , Acquired App-based marketplace for multiple local services $7.5M AddVenture , EII CAPITAL Â &Â 2 Â others 62/100 4th Spruce 2015 , Austin ( United States ) , Series B Online marketplace to book on-demand local services $40M SoftBank , New Age Ventures Â &Â 10 Â others 59/100 5th StreetFair 2022 , Charlotte ( United States ) , Series A Provider of a neighborhood-based home services platform $8.5M Craft Ventures , 1984 Ventures Â &Â 2 Â others 55/100 6th Schedulicity 2008 , Bozeman ( United States ) , Acquired Online Appointment Scheduling for Local Services $52.1M Lateral Capital 54/100 7th Amenify 2016 , San Francisco ( United States ) , Seed Provider of housekeeping services for multi-family apartments $2.7M RiverPark Ventures , WISE Ventures Â &Â 6 Â others 52/100 8th Rizek 2004 , Dubai ( United Arab Emirates ) , Acquired Online marketplace for multiple local services $24M ADQ , Microsoft Accelerator Â &Â 3 Â others 49/100 9th Justlife 2014 , Dubai ( United Arab Emirates ) , Seed Provider of a mobile app to book multiple home services $150K 500 Global , Venture Friends Â &Â 2 Â others 48/100 10th Handyhome 2014 , Mumbai ( India ) , Acquired Mobile app to book repair services for electronic appliances $630K Bessemer Venture Partners , Kalysta Capital Â &Â 1 Â others 47/100 Get insights and benchmarks for competitors of 2M+ companies! Sign up today! Looking for more details on Urban Company 's competitors? Click here to see the top ones Urban Company's Latest cap tables and shareholding Founders own 26.70%, Funds (largest shareholder) own 68.85%, Enterprises own 0.06% and Angels own 0.77%. The net worth of Urban Company's founders is INR 5,330Cr as of Jun 29, 2022. Shareholders Name Post Round Holding % Net worth Cumulative investment Realised returns Unrealised returns Return multiple Founder 26.70 % 5,330Cr 5899452 4462799 7082839 2879095 Abhiraj Singh Bhal 5730431 4579238 3117147 4825224 6452168 8713133 Raghav Chandra 8284902 9480691 1352136 4931725 9952675 4109368 Varun Khaitan 1098482 8674909 8259973 6555701 4317261 4637002 Fund 68.85 % 13,700Cr 4708133 4357342 4804024 1318410 Steadview 7700514 3201724 1481331 7919960 2454285 8722554 Tiger Global Management 91546 38253 62859 37807 21670 96366 Naspers 8588 1953 1859 6542 8100 6014 Wellington 44 48 95 63 88 58 SAB Holding 0 0 0 0 0 0 Enterprise 0.06 % 12.5Cr 0 0 0 0 Angel 0.77 % 156Cr 0 0 0 0 Ireena Vittal 0 0 0 0 0 0 Mekin Maheshwari 0 0 0 0 0 0 Other People 0.02 % 4.25Cr 0 0 0 0 ESOP Pool 3.61 % 720Cr 530 508 148 632 Total 100.00 % 20,000Cr 6383689 3315983 8569546 7537285 To unlock detailed Cap Table of Urban Company Sign up today! Notes: The column Net Worth represents the net worth of investments made by that entity, as per the latest cap table. Disclaimer View more details of Urban Company 's Shareholding Urban Company's Investments and acquisitions Filter this list Urban Company has made 2 investments in companies including Karban and MyGate . Urban Company has also acquired 3 companies including Glamazon and Goodservice . Here is the list of investments & acquisitions: Date of Investment/Acquisition Type Company Name Founded Year Location Feb 01, 2024 Investments Karban 2021 Jaipur, India Nov 14, 2022 Investments MyGate 2016 Bengaluru, India Mar 04, 2020 Acquisition Glamazon 2013 Bondi, Australia Want to know more about where corporates are investing? Sign up today! See all acquisitions by Urban Company Reports related to Urban Company Here is the latest report on Urban Company's geography: Free FinTech - India Semi Annual Funding Report Edition: H1, 2025 (40 Pages) View all reports related to Urban Company News related to Urban Company Filter this list Media has covered Urban Company for a total of 38 events in the last 1 year , 13 of them have been about company updates and 3 about partnerships . â¢ Urban Company nears 'breakeven', focuses on margins after IPO success Moneycontrol â¢ Sep 10, 2025 â¢ Urban Company , Elevation Capital , Prosus , Accel â¢ Indian services firm Urban Company achieves full IPO subscription Tech in Asia â¢ Sep 10, 2025 â¢ Urban Company , JM Financial , Kotak Investment Banking , Goldman Sachs and 4 others â¢ Urban Company's â¹1,900 crore IPO: Red Flags to Consider Before Investing Livemint â¢ Sep 09, 2025 â¢ Urban Company â¢ Urban Company IPO Opens September 10: Check Price Band and Details Times Now â¢ Sep 08, 2025 â¢ URBN , HDFC securities , Kotak Investment Banking , Elevation Capital and 5 others â¢ Sbi Mf, Permira, Prosus And Elevation Acquire Shares Worth Rs 500 Crore Moneycontrol â¢ Sep 05, 2025 â¢ SBI Mutual Fund , Prosus , Permira , Urban Company and 7 others â¢ Indian firm Urban Company launches quick house-help service Tech in Asia â¢ Sep 04, 2025 â¢ Urban Company â¢ Urban Company's â¹1,900 crore IPO to open on September 10; sets price band at â¹98-103 The Hindu â¢ Sep 03, 2025 â¢ Urban Company , Dragoneer Investment Group , Goldman Sachs â¢ Urban Company and boAt receive SEBI approval for IPOs Entrackr â¢ Sep 02, 2025 â¢ boAt , Urban Company â¢ Urban Company's Profit Halves In Q1 FY26; Revenue Rises To INR 367 Cr Inc42 â¢ Sep 02, 2025 â¢ Urban Company â¢ Urban Company previews micro home makeover sub-brand 'Revamp' YourStory â¢ Aug 25, 2025 â¢ Urban Company Get curated news about company updates, funding rounds, M&A deals and others. Sign up today! View complete company profile of Urban Company Are you a Founder ? Claim your Profile Claim and keep your data updated to ensure investors can find you easily. Looking to raise funds? Showcase fundraising requirement to VCs, PEs, Angels & IBs. Find Investors for your Next Round Discover potential investors for your next round of investment. FAQs about Urban Company When was Urban Company founded? Urban Company was founded in 2014. Where is Urban Company located? Urban Company is located in Gurugram, India . Which legal entities is Urban Company associated with? Urban Company is associated with Urban Company Limited. Is Urban Company a funded company? Urban Company is a funded company, its first funding round was on Mar 02, 2015. When was the latest funding round of Urban Company? Urban Company's latest funding round was on Jun 29, 2022. Is Urban Company a Local Services company? The primary sector of Urban Company is Local Services. Who are the top competitors of Urban Company? Urban Company's top competitor s are Thumbtack , ServiceMarket and Spruce . What does Urban Company do? Provider of an on demand home services connecting customers with vetted professionals. It offers a variety of services including beauty treatments, cleaning, and repairs. It provides hand picked professionals for a wide range of services delivered directly to the doorstep. The platform provides transparent pricing with no hidden charges. It allows customers to book services through the app or website. Who is the current CEO of Urban Company? Abhiraj Singh Bhal is the current CEO of Urban Company . How many employees does Urban Company have? Urban Company has 1213 employees as of May 31, 2025. How much is Urban Company worth? The latest valuation of Urban Company is â¹20,000Cr as on Jun 29, 2022. What is the annual revenue of Urban Company? Annual revenue of Urban Company is â¹928Cr as on Mar 31, 2024. Where does Urban Company rank among its competitors? Urban Company ranks 1 amongst 400 active competitors. Explore our recently published companies Imanzy - Unfunded company RidEV - Hyderabad based, 2024 founded, Unfunded company Kreoh - Dublin based, 2022 founded, Unfunded company Benfootballboot - Unfunded company Arbshopbd - Unfunded company Navu - Funding Raised company Get full company profile in your inbox Get Company Profile Unlock full data with our Lite plan! Sign Up and Get Free Access Tracxn powers 1,000+ customers across 30+ countries Company About us Our Investors News and Press Resources Investor Relations ODR Portal Terms of Use Privacy Policy GDPR FAQs Careers Customers Venture Capital Funds Private Equity Funds Accelerators and Incubators Investment Banks Corporate Innovation CorpDev and M&A Teams Startup Founders Journalists and Publications Customer Testimonials Explore Tracxn Discover interesting lists Sector Research Offerings Search for Indian Legal Entity Quick Links Schedule Demo Get in touch See Pricing Plans Â© 2025 Tracxn Technologies Limited. All rights reserved. Registered Office: L-248, 2nd Floor, 17th Cross, Sector 6, HSR Layout, Bengaluru, Karnataka 560102. CIN: L72200KA2012PLC065294. Investor Grievances & Compliance: Megha Tibrewal, Company Secretary & Compliance Officer | Email: | Phone: ."
    },
    {
      "url": "https://urbanhealth.org.uk/who-we-are/about-us",
      "text": "About us - Impact on Urban Health Please ensure Javascript is enabled for purposes of website accessibility Our work Our approach Urban health Where we work Our strategy Data and analytics Innovation Programmes Children’s health and food Children’s mental health Health effects of air pollution Financial foundations for adult health Programmes We focus on four complex health issues more prevalent in urban areas Insights By topic All insights → Children's health and food Children's mental health Health effects of air pollution Financial foundations for adult health By type Latest updates Data Opinion Policy Reports Urban Health Index 2025 Explore the Urban Health Index, which looks at the social and environmental factors that shape the health of people living in Lambeth and Southwark. Partnerships Our partnerships Current partnerships Latest updates Work with us How we partner Become a partner Tenders Shifting the power in research With Wellcome Trust Who we are Who we are About us Our team Guy’s & St Thomas' Foundation Working here Vacancies\n\t\t\t\t(4) Working at Impact on Urban Health Contact us We want to hear from you. Newsletter Sign up Search for: Home Who we are About us Who we are About us The places that we grow up, live, and work impact how healthy we are. Urban areas, like inner-city London, have some of the most extreme health outcomes. Alongside their vibrancy and diversity sit stark health inequalities. At Impact on Urban Health, we want to change this. We believe that we can remove obstacles to good health, by making urban areas healthier places for everyone to live. Programmes of work We address these health inequalities by focusing on a few complex health issues that disproportionately impact people living in cities – children’s health and food , financial foundations for adult health , the health effects of air pollution , and children’s mental health . Our programmes are long-term and formed of partnerships at local, borough, national and international scales. Using our funding and expertise, we back home-grown initiatives, evidence-based approaches from around the world, and exciting, brand-new ideas. As a funder, we concentrate our efforts where evidence shows we will have the greatest impact and then layer up multiple initiatives that approach the issue from different angles. Taking a place-based approach The London Boroughs of Lambeth and Southwark are our home. They are some of the most diverse areas in the world. It is here that we invest, test, and build our understanding of how cities can be shaped to support better health. To us, a place-based approach means developing an understanding of how the local environment – such as the social context and economic factors – affects people’s health. We then share our insight, evidence and practical learning of what works in our inner-city place with others, to improve health in cities around the world. Addressing health equity in all our work We are a part of Guy’s & St Thomas’ Foundation, a charitable foundation. Within the Foundation, there is a family of organisations with the shared mission of health equity, including impact investing for health and supporting exceptional healthcare in the NHS. And we are working to embed diversity, equity and inclusion (DEI) into everything we do. Interested in working with us to tackle urban health issues? Share your idea and partner with us. Become a partner Related content Our team Our team bring together a unique combination of expertise, skills and drive to meet our ambition of making cities healthier places for everyone to live in. Read more Our work Urban health By 2050, nearly 70% of the world’s population will live in cities. We explore what distinct health challenges and opportunities urban areas have. Read more Who we are Guy’s & St Thomas’ Foundation We are part of a family of organisations, including Guy's & St Thomas' Foundation. Read more Bluesky Streamline Icon: https://streamlinehq.com Bluesky Quick links About us Become a partner Contact us Our team Urban health Programmes Children’s health and food Children’s mental health Health effects of air pollution Financial foundations for adult health About us Address: The Grain House, 46 Loman Street, London, SE1 0EH.  Tel: +44 (0)20 7089 4550 Part of Guy’s & St Thomas’ Foundation. Registered charity number: 1160316 Urban health newsletter Subscribe for a monthly round-up of news, views and insights Your email address (Required) CAPTCHA Name This field is for validation purposes and should be left unchanged. Δ ©\n\t\t\t\t\t2025\n\t\t\t\t\tImpact on Urban Health. All rights reserved Accessibility Privacy and cookies Website feedback"
    },
    {
      "url": "https://urban-company.pissedconsumer.com/customer-service.html",
      "text": "Urban Company Customer Service Phone Number +91 124 457 0250, Email, Help Center Skip to content PissedConsumer Reviews Categories All Categories Media Auctions and Marketplaces E-commerce Food Delivery Footwear and Clothing Gambling and Lotto Transportation and Logistics Companies All Companies Amazon Meesho Temu Google YouTube TV KukuFM Blinkit Write review For Business Login Professional Services Urban Company 3234 Customer Service Updated on 09/01/2025 Contact Urban Company Customer Service Reviews 0 Contacts Community Advertisements Urban Company Phone Numbers and Emails Customer Service: +91 124 457 0250 Send Message Urban Company Emails: Customer Service support@urbancompany.com privacy@zapr.in Privacy Inquiries grievanceofficer@urbancompany.com Is this your business? phone numbers and emails Advertisements Urban Company Customer Service Overview The aggregated data is based on calls made from PissedConsumer.com website and questionnaires provided by PissedConsumer.com users. Urban Company Customer Service is rated at 1.3 out of 5 . Consumers who contact the company are mostly dissatisfied . More commonly used way of contact is by phone . Source Distribution 93% phone 7% email The best phone number to call Urban Company is 911244570250 . 36% of customers managed to speak with a real person. The longest wait times are on Saturday , while the shortest are on Thursday . Be prepared for the call as Urban Company may ask you for the following information to identify you as a customer: email, phone number or address or zip code . View full overview › Urban Company Overview The aggregated data is based on calls made from PissedConsumer.com website and questionnaires provided by PissedConsumer.com users. Urban Company Customer Service is rated at 1.3 out of 5 . Consumers who contact the company are mostly dissatisfied . More commonly used way of contact is by phone . Source Distribution 93% phone 7% email The best phone number to call Urban Company is 911244570250 . 36% of customers managed to speak with a real person. The longest wait times are on Saturday , while the shortest are on Thursday . Be prepared for the call as Urban Company may ask you for the following information to identify you as a customer: email, phone number or address or zip code . People call Urban Company mainly because of staff, request for information and product/ service . 11% of the consumers who called the company’s customer support stated that their issues were resolved. Most customers feel very unsatisfied after talking to customer service representatives. The best email to contact Urban Company is help@urbancompany.com . 85% of customers use this email address to address their issues and concerns. Customers evaluated the effort they needed to make to contact customer service as difficult . Close Contact Information Urban Company Website: www.urbancompany.com Urban Company Help Center: Visit contact page Corporate Office Address: Urban Company 416 Udyog Vihar , Sector 20 Gurugram, Haryana India Help in Social Networks: Facebook Pinterest Instagram Twitter Linkedin Youtube Urban Company Customer Service Reviews 1.3 / 5 Bad See all 3.2K reviews Neeraj G Jui Aug 19, 2025 Instalation of water purifier 2.5 Your customer care number is not working. I have a water purifier from Kenstar company. I want to install it. Please call me on 914934**** as soon as possible. Read full review Abhijit L Jun 27, 2025 Today I faced an unprecedented incident done by your service personnel who was assigned to clean my fridge. He came late and in a hurry he damaged all of the shelves of one of the door. Then he left w 1.0 Today I faced an unprecedented incident done by your service personnel who was assigned to clean my fridge. He came late, and in a hurry, he damaged all of the shelves of one of the doors. Then he left without completing the job. I contacted customer care and was assured that another person would come shortly to assess the damage and clean the fridge. Nobody came. The job was rescheduled to 2:30. That also failed because the motorcycle of the serviceman was not working. After repeated efforts, I came to know that the person assigned would not come on the pretext that I had used filthy words and threats. It is absolutely unthinkable and rather an insult to a senior associate professor and a veteran columnist. This type of false allegation, I think, should be dealt with in the hardest possible way. Otherwise, the company's name and fame may be diluted. Ultimately, customer care fixed the assignment at 6 p.m., which is absolutely inconvenient for me, but I have to admit. This is the first time I have encountered such an incompetent and low-grade serviceman of UC who can easily malign a man of repute only to save his face. Sorry to say, the company is still performing well in other states like Delhi, but here it has gone down remarkably. I hope it will recover soon. But now it would be very difficult for me to retain faith in this company, especially which has damaged my costly instrument by sending a nonqualified serviceman. Read full review Guest-6709413 Jun 23, 2025 Deplorable customer care service 1.0 I am writing to raise a formal complaint regarding the highly unprofessional behavior and poor customer service provided by their technician, Mr. Nasir Khan. We had availed an AC servicing through Urban Company on 23rd May, following which we raised a warranty claim due to the AC making abnormal sounds. While the initial issue was addressed temporarily, the same problem has reoccurred within a few weekswe have recorded evidence of the sound. As I am currently residing outside India, my parents back in India reached out to the technician to seek service under warranty. Shockingly, he refused to provide service unless they paid him separately for petrol or diesel charges, despite it being a clear warranty case. Furthermore, his tone and behavior were rude and completely unacceptable. This is deeply disappointing and reflects poorly on Urban Companys standards for customer service and technician conduct. We trusted their platform for its professionalism, but this incident has caused significant inconvenience and frustration. Read full review Sonal S Ulw May 15, 2025 Complaint U have booked AC noise service issue with urban company The engineer who came on first day was not able to resolve issue but also my AC was facing issue with cooling I had to rebook He came again and he repaired But issue still persists When some one does service of an appliance how can AC cooling go bad And if it is not working urban company only will have to pay Such a big company and they dont have customer service number where we can talk They have chat option Every time some new person gets into that query and ask what is the issue No coordination within the company No seniour is ready to speak with customer Need solution Read full review How Good is Urban Company's Customer Service? Vickie g Suq Vickie g Suq Feels Disappointed | Apr 21, 2024 I have not heard back with any hope of getting the help to recover my money. I am going to have to get a lawyer. I would not recommend them to anyone they have treated me so poorly. Read full quote Jonesha Plo Jonesha Plo Feels Disappointed | Jan 21, 2023 There was a no response from them Read full quote Josian Ylm Josian Ylm Feels Disappointed | Oct 12, 2022 ggar born bastards Read full quote Seema J Nke Seema J Nke Feels Disappointed | Oct 07, 2022 Despite making several attempts to call and wrote several emails, I couldn’t get in touch with any executive of Urban Company, neither did I receive any satisfactory response. Read full quote Summary of Urban Company Customer Service Calls 41.3K TOTAL CALLS 00:00 AVG CALL DURATION 11% ISSUES RESOLVED Top Reasons of Customers Calls Consumers Call the Most From Why Do People Call Urban Company? Staff Question: 3h ago “Our company want require services” 1d ago “Service related” 4d ago “Service issues” Request for Information Question: 23h ago “Enquiry” 1d ago “Nobody has contacted yet” 2d ago “How to approach UC to clean my house” Product/ Service Question: 3h ago “Need today work GST invoice” 2d ago “Recurring warranty repair required but system keeps throwing back that the selected slot has expired” 3d ago “Water purification not working” Employment Question: 10d ago “Job” 29d ago “Job maasag mens” 1M ago “Electrician job work purpose” Payments and Charges Question: 9h ago “Payment done no messgae” 6d ago “My amount refund” 6d ago “Amount debited but not booked” Website/ Application Question: 9d ago “Installation” 9d ago “Need to enquire about cctv installation” 18d ago “Water coller installation” Refund Question: 1d ago “Refund” 3d ago “My refund not processed” 3d ago “For refund money claim” Shipping and Delivery Question: 5d ago “Professional has not arrived” 5d ago “Wrong product used” 6d ago “Delivery issue” Activation/ Cancellation Question: 1d ago “Cancel charge” 4d ago “Issue with cancellation” 6d ago “Cancel booking 9999” Account Question: 1M ago “My profile is blocked” 1M ago “My id not active” 1M ago “Unblock my account” Return/ Replace Question: 3d ago “Return related” 1M ago “Replace” 1M ago “Estimate for main door lock replacement” Cards Question: 1Y ago “Want to buy gift card” 1Y ago “Paid with 2 different credit cards amount deducted but the urban company says not received” 1Y ago “Pancard verification issue” Other Question: 7h ago “Your profsional not came” 9h ago “TV repair” 21h ago “Safai” Compare Urban Company Customer Service To Companies are selected automatically by the algorithm. A company's rating is calculated using a mathematical algorithm that evaluates the information in your profile. The algorithm parameters are: user's rating, number of resolved issues, number of company's responses etc. The algorithm is subject to change in future. Garnier Customer Service 1.8 out of 5 PhonePe Customer Service 2.0 out of 5 Loreal Paris Customer Service 2.1 out of 5 Write a review Do you have something to say about Urban Company? What happened? What can we help you with? Submit review Don't show this popup Call Company Send Message Urban Company Reviews Contacts Community Write a review About About PissedConsumer Press Page Blog FAQ for Consumers FAQ for Companies Careers Contact PissedConsumer Browse Companies Reviews Categories State Attorneys General Contacts Services Business Solutions List your Business Tips For Consumers Tips For Companies PissedConsumer Club Advertise with us Legal Privacy Policy Terms Of Use Legal Information Dispute Resolution (LVP Program) facebook youtube linkedin twitter tiktok PissedConsumer            © 2025 All\n            Rights Reserved Are you sure you want to leave Urban Company contact page? Contact Urban Company Contact PissedConsumer Terms of Service I agree to TOS Cancel"
    },
    {
      "url": "https://www.quora.com/Who-are-the-founders-of-Urban-Company",
      "text": "Who are the founders of Urban Company? - Quora Something went wrong. Wait a moment and try again. Try again Please enable Javascript and refresh the page to continue"
    },
    {
      "url": "https://urban-reclamation.com/pages/contact-us",
      "text": "Contact Us\n– Urban Reclamation Skip to content Close menu Home About Us Shop Bath Boards Brackets Benches/Shoe Racks Coat Racks Console Tables Door Stops Mantel Beams Record Storage/Cabinets Shelving Tables Shop By Room Living Room Shelves Accessories Homeware Furniture Mantels Kitchen Shelves Chopping Boards Shoe Rack Bathroom Shelves Bath Boards Furniture Hallway Shelves Benches Coat Racks Console Tables Shoe Racks Home Office Shelves Desks Door Stops Furniture Metalwork Sustainability Inspiration Blog FAQ Bracket Fitting Instructions Common Questions Our Wax Finishes Contact Log in Instagram Facebook Pinterest Cart Close cart Order note Subtotal £0.00 Shipping, taxes, and discount codes calculated at checkout. Check out Your cart is currently empty. Instagram Facebook Pinterest Currency GBP £ EUR € GBP £ Search Site navigation Log in Search Cart Home About Us Shop Bath Boards Brackets Benches/Shoe Racks Coat Racks Console Tables Door Stops Mantel Beams Record Storage/Cabinets Shelving Tables Shop By Room Living Room Shelves Accessories Homeware Furniture Mantels Kitchen Shelves Chopping Boards Shoe Rack Bathroom Shelves Bath Boards Furniture Hallway Shelves Benches Coat Racks Console Tables Shoe Racks Home Office Shelves Desks Door Stops Furniture Metalwork Sustainability Inspiration Blog FAQ Bracket Fitting Instructions Common Questions Our Wax Finishes Contact Search \"Close (esc)\" View more Pause slideshow Play slideshow Free shipping on ALL orders Home / Contact Us Contact Us Our Office Hours: Monday - 8am - 4.30pm Tuesday - 8am - 4.30pm Wednesday - 8am - 4.30pm Thursday - 8am - 4.30pm Friday - 8am - 12.30pm Weekends - Closed If you prefer to call rather than email you can ring us on 01457 761721. We are happy to assist you in any way possible. Your Name Your Email Best Phone Number To Get You On Your Message Send This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. Urban Reclamation Urban Reclamation About Us News Sustainability Contact Us Your Order Your Order Fitting Instructions FAQs Delivery Returns and Refunds Useful Links Useful Links Cookie Policy Privacy Policy Terms & Conditions Workshop Workshop Urban Reclamation Unit 2 - Surrey Street, Glossop, Derbyshire, SK13 7AJ Currency GBP £ EUR € GBP £ American Express Apple Pay Diners Club Discover Google Pay Klarna Maestro Mastercard PayPal Shop Pay Union Pay Visa ©  Copyright © 2024 Urban Reclamation Previous Next \"Close (esc)\""
    },
    {
      "url": "https://miamiurbanleague.org/",
      "text": "Home - Urban League of Greater Miami Scroll to top Follow Us – Fb. Tw. Inst. Skip to content Home About Our Programs The Pledge © 2022, Miami Urban League Theme. Developed by Flying Ram Media, Inc. Privacy & Cookie Policy | Terms of Service Follow Us – Fb. Tw. Inst. Contact Us Home About Our Programs The Pledge Get In Touch 8500 NW 25th Ave, Miami, FL 33147 P Gen. inquiries: contact@miamiurbanleague.org : (305) 696-4450 F: (305) 696-4455 Search for Empowering Youth. Strengthening Communities. We enable black children to reach their fullest potential and their parents to exercise their rights and assume their responsibilities as adults. Under our guidance, every child born in Liberty City shall grow up to be healthy, happy and successful. work about contact let's talk Upcoming Events Keep up-to-date with Urban League of Greater Miami News and view Community… Our Youth As a part of the Miami Dade County School system, we help… Our Programs Our programs are designed to support and place our community on a… Play Video The Urban League of Greater Miami, Inc. is a non-profit community service agency that provides services in our community including Employment Urban League of Greater Miami, Inc. bridges the gap between our talent-ready members and local employers. Senior Citizen Services We’re part of a broader, National Urban League network of 98 historic civil rights organizations throughout the United States that facilitate and assist the elderly. Housing Housing & Community Development Program is an approved counseling agency of the US HUD. Economic Development The Urban League of Greater Miami, Inc has been all about economic empowerment since we opened our doors more than 99 years ago. We are a dedicated person-to-person organization invested in the economic success of African-Americans ; coaching them to a better life. Training We Empower African American Entrepreneurs with the tools and skills they need to succeed. Our mission is to enable black children to reach their fullest potential and their parents to exercise their rights and assume their responsibilities as adults Community Service Community and individual empowerment often require resources and services that assist in improving our social conditions and quality of living. Urban League of Greater Miami community programs are supplemented by a variety of partners and service providers that we encourage you to contact should you require assistance or services that can be of benefit. Education Your child’s education is important to you and is important to us too! As a part of the Miami-Dade County School system, the Urban League of Greater Miami staff can help you and your child navigate any issues that may get in the way of your child’s academic success. Advocacy Our agency empowers metro Miami with access to civic and community leaders, and forums for productive dialogue regarding topics and priorities in their communities. Empowering Communities. Changing Lives. Enabling Blacks and other underserved urban residents to secure economic self-reliance, parity, power and civil rights. Learn More Happening In Our Community Miami Urban League News Urban League Denounces Supreme Court Decision on Gun Safety, Urges Immediate Action on Gun Safety Legislation Urban League News Show project Black Women Will Bear the Brunt of SCOTUS Abortion Ruling Urban League News Show project Preventing Black erasure will require record voting Urban League News Show project The US is the most unsafe developed country in the world Urban League News Show project US boards still disproportionately white as diversity rises Urban League News Show project Karine Jean-Pierre first Black woman White House press secretary Urban League News Show project Why minority women stand to lose most with abortion bans Urban League News Show project Campaign to increase urban tree canopy well under way Urban League News Show project Black districts restored when judge says DeSantis’ Congress map unconstitutional Urban League News Show project Load More Loading 0 + Families Living In Our HUD Housing 0 + Students We've Help Excel Fb. / Ig. / Tw. / Urban League of Greater Miami, Inc. 8500 NW 25th Ave, Miami, FL 33147 (305)696-4450 Work inquiries Interested in working with us? media@miamiurbanleague.org Career Looking for a job opportunity? See open positions Get the latest news, events and updates in your inbox © 2022, Miami Urban League Theme. Developed by Flying Ram Media, Inc. Privacy & Cookie Policy | Terms of Service Urban League News June 25, 2022 Urban League Denounces Supreme Court Decision on Gun Safety, Urges Immediate Action on Gun Safety Legislation The Supreme Court decision invalidating New York’s common-sense restrictions on concealed firearms is deeply flawed, rooted in political expediency rather than legal theory, and will contribute... Client Miami Times View Project Urban League News June 14, 2022 Black Women Will Bear the Brunt of SCOTUS Abortion Ruling National Urban League President Marc H. Morial today issued the following statement in response to the U.S. Supreme Court’s decision to overturn Roe v. Wade: Client Urban League View Project Urban League News May 11, 2022 Preventing Black erasure will require record voting Gov. Ron DeSantis’ redistricting map erasing two Black congressional seats won court approval. This means we go from four Black congressional seats to just two.\nDeSantis rewrote... Client Miami Times View Project Urban League News May 11, 2022 The US is the most unsafe developed country in the world So far this year, 227 shootings have taken place in America in which four or more people were killed or injured at one time. As of... Client Miami Times View Project Urban League News May 11, 2022 US boards still disproportionately white as diversity rises Amid the push to get U.S. boardrooms to look more like companies’ customers and employees, advocates are finally seeing just how steep the task will be.\nBoards... Client Miami Times View Project Urban League News May 11, 2022 Karine Jean-Pierre first Black woman White House press secretary Karine Jean-Pierre, whose long career in Democratic communications led her to the podium last year as the second Black woman to hold a White House daily... Client Miami Times View Project Urban League News May 11, 2022 Why minority women stand to lose most with abortion bans If you are Black or Hispanic in a conservative state that already limits access to abortions, you are far more likely than a white woman to... Client Miami Times View Project Urban League News May 11, 2022 Campaign to increase urban tree canopy well under way South Florida’s season of heat (May 1-Oct. 31) blasted in with record temperatures in the 90s and a May 7 county tree giveaway at William H... Client Miami Times View Project Urban League News April 29, 2022 Black districts restored when judge says DeSantis’ Congress map unconstitutional Finding a congressional redistricting map pushed by Gov. Ron DeSantis likely unconstitutional, a circuit judge Wednesday granted a temporary injunction because of changes to a North... Client Miami Times View Project"
    },
    {
      "url": "https://www.urbanresource.com/agents",
      "text": "Meet The Urban Resource Team — Urban Resource Buy Search Sell Rent Condos Management Commercial About Us Meet The Team Testimonials Sold Communities Login Resident Login Landlord/Board Login Buyer Login Rental Login Contact Us Buy Search Sell Rent Condos Management Commercial About Us Meet The Team Testimonials Sold Communities Login Resident Login Landlord/Board Login Buyer Login Rental Login Contact Us MEET OUR TEAM Urban Resource is a team of experienced, licensed real estate agents serving the Miami Beach, FL metro area. With a proven track record of getting results quickly and a direct line of communication at all times. Laura Veitia - Vice President/Broker Phone: (305) 403-8686 Email: laura@urbanresource.com laura.urbanresource.com CALL ME EMAIL ME Vice President / Broker Phone: (305) 403-8686 Email Me READ MORE Hernando Cairasco - REALTOR® Phone: (786) 620-2706 Email: Hernando.Cairasco@urbanresource.com hernando.urbanresource.com CALL ME EMAIL ME REALTOR® Phone: (786) 620-2706 Email Me READ MORE Lisa Martin - REALTOR® Phone: (786) 262-1480 Email: Lisa@urbanresource.com lisa.urbanresource.com CALL ME EMAIL ME REALTOR® Phone: (786) 262-1480 Email Me READ MORE Kiki Toledo - REALTOR® Phone: (786) 620-2702 Email: Kiki.Toledo@urbanresource.com kiki.urbanresource.com CALL ME EMAIL ME REALTOR® Phone: (786) 620-2702 Email Me READ MORE Omar Ariza - REALTOR® Phone: (786) 620-2703 Email: omar@urbanresource.com omar.urbanresource.com CALL ME EMAIL ME REALTOR® Phone: (786) 620-2703 Email Me READ MORE Ivy Soteldo-Ariza - REALTOR® Licensing: 3471996 Phone: (786) 620-2704 Email: ivy.soteldo@urbanresource.com ivy.urbanresource.com CALL ME EMAIL ME REALTOR® Phone: (786) 620-2704 Email Me READ MORE Kevin Mijares - REALTOR® Licensing: 3527075 Phone: (786) 620-2705 Email: kevin@urbanresource.com kevin.urbanresource.com CALL ME EMAIL ME REALTOR® Phone: (786) 620-2705 Email Me READ MORE Carlos Cordoba - REALTOR® Licensing: 3449616 Phone: (786) 620-2708 Email: carlos.cordoba@urbanresource.com carlos.urbanresource.com CALL ME EMAIL ME REALTOR® Phone: (786) 620-2708 Email Me READ MORE Dixie May Ege - Client Care Specialist Phone: (305) 403-8686 Email: dixie@urbanresource.com dixie.urbanresource.com CALL ME EMAIL ME Client Care Specialist Phone: (305) 403-8686 Email Me READ MORE Amelis Flores - REALTOR® Phone: (305) 922-5897 Email: amelis.flores@urbanresource.com amelis.urbanresource.com CALL ME EMAIL ME REALTOR® Phone: (305) 922-5897 Email Me READ MORE Jose (J.R.) Flores - Director of Sales Phone: (305) 403-8686 Email: JR@urbanresource.com CALL ME EMAIL ME Director of Sales Phone: (305) 403-8686 Email Me READ MORE Jackie Cairasco - REALTOR® Phone: (305) 962-4190 Email: jackie.cairasco@urbanresource.com jackie.urbanresource.com CALL ME EMAIL ME REALTOR® Phone: (305) 962-4190 Email Me READ MORE Joey Sciortino - REALTOR® Phone: (786) 647-9838 Email: joey@urbanresource.com joey.urbanresource.com CALL ME EMAIL ME REALTOR® Phone: (786) 647-9838 Email Me READ MORE Sabrina Rivera - REALTOR® Phone: (786) 875-8100 Email: sabrina.rivera@urbanresource.com sabrina.urbanresource.com CALL ME EMAIL ME REALTOR® Phone: (786) 875-8100 Email Me READ MORE Liannet Rodriguez - REALTOR® Phone: (786) 525-3929 Email: lia.rodriguez@urbanresource.com lia.urbanresource.com CALL ME EMAIL ME REALTOR® Phone: (786) 525-3929 Email Me READ MORE Carolina Sanchez - REALTOR® Phone: (786) 531-0048 Email: carolina.sanchez@urbanresource.com carolina.urbanresource.com CALL ME EMAIL ME REALTOR® Phone: (786) 531-0048 Email Me READ MORE Mark Kilburn - REALTOR® Phone: (786) 354-5801 Email: mark.kilburn@urbanresource.com mark.urbanresource.com CALL ME EMAIL ME REALTOR® Phone: (786) 354-5801 Email Me READ MORE Luisa Leal - REALTOR® Phone: (786) 501-6521 Email: luisa.leal@urbanresource.com luisa.urbanresource.com CALL ME EMAIL ME REALTOR® Phone: (786) 501-6521 Email Me READ MORE Edit Lead Form OPEN PAGE Optional custom content for this leadform (unique to this page) Name * First Name Last Name Email * Phone * (###) ### #### Thank you! © Urban Resource All Rights Reserved Popular Pages Buy Search Sell Rent Condos Management Commercial About Us Meet The Team Testimonials Sold Communities Login Resident Login Landlord/Board Login Buyer Login Rental Login Contact Us Office Hours Monday - 9am - 5:30pm Tuesday - 9am - 5:30pm Wednesday - 9am - 5:30pm Thursday - 9am - 5:30pm Friday - 9am - 5:30pm Saturday - Sunday - Urban Resource 1193 71st Street Miami Beach, FL, 33141 Phone: (305) 403-2424 Email: realestate@urbanresource.com Map View Privacy Policy ©Urban Resource 2020 All Rights Reserved Popular Pages Featured Condos Communities our team contact us Property management Resident Login Owner Login Search login RESIDENT FORMS Buy Search Sell Rent Condos Management Commercial About Us Meet The Team Testimonials Sold Communities Login Resident Login Landlord/Board Login Buyer Login Rental Login Contact Us Urban Resource 1193 71st Street Miami Beach, FL, 33141 Phone: (305) 403-2424 Email: realestate@urbanresource.com Privacy Policy Upload Background Image: Custom Background Brightness: Popular Pages Featured Condos Communities our team contact us Property management Resident Login Owner Login Search login RESIDENT FORMS Buy Search Sell Rent Condos Management Commercial About Us Meet The Team Testimonials Sold Communities Login Resident Login Landlord/Board Login Buyer Login Rental Login Contact Us ©Urban Resource 2020 All Rights Reserved 1193 71st Street Miami Beach, FL, 33141 Privacy Policy Upload Background Image: We are committed to respecting your right to privacy and protecting your information when\n\t\tyou use our services. This privacy policy also describes the choices available to you regarding our use of your\n\t\tpersonal information and how you can access, update and delete this information. We want you to understand what information we gather about you, how we use it and the\n\t\tsafeguards we have in place to protect it. This Privacy Policy applies to information\n\t\tcollected through this website and otherwise. Your use of this website and our services, and\n\t\tany disputes arising from it, is subject to this Privacy Policy as well as the Terms of Use\n\t\tand all its dispute resolution provisions, including arbitration, limitation on damages and\n\t\tchoice of law. This website is a general audience site and we do not knowingly collect personal information\n\t\tfrom children under the age of 13. If you have questions or concerns regarding this policy, you should first contact our website at support@ylopo.com 1. Collection and Use of Your Personal Information We collect Personal Information from you only when you voluntarily submit it in order to\n\t\tobtain certain information, including without limitation (A) requests to find out more about\n\t\tour programs; (B) requests to contact us; and (C) requests to forward your information to\n\t\tone of our affiliates. We do not honor all “do not track” requests and settings. If you use any signal(s) or\n\t\tanother mechanism(s) that provides you the ability to exercise choice regarding the\n\t\tcollection of personally identifiable information about your online activities over time and\n\t\tacross third-party websites or online services, we will attempt to override such signals or\n\t\tmechanisms. When you use our website, no other parties can collect personally identifiable\n\t\tinformation about your online activities over time and across different websites. Your\n\t\tchoice is indicated by your settings in your web browser. A “do not track” indication sent\n\t\tfrom your web browser will not result in any tracking activity (i.e., tracking cookies)\n\t\twithin the website to be programmatically disabled. We collect the following personal information from you: Contact Information such as name, email address, mailing address, and phone number We use this information to: Send you requested product or service information Respond to customer service requests Administer your account Send you a newsletter Send you marketing communications Improve our Web site and marketing efforts Conduct research and analysis Display content based upon your interests Data will not be sold or shared with third parties for promotional or marketing purposes.  Information collected may be used to help train AI models and approve our offerings. By clicking the Submit button, you agree to have your information shared with us \n\t\tand for us to initiate contact with you at the telephone number you provided using\n\t\tlive, recorded, artificial, or AI-generated voice, mobile phone (including through automated\n\t\tdialing, text SMS/MMS, or pre-recorded messaging) and/or email, even if your telephone\n\t\tnumber is on a corporate, state, or the National Do Not Call Registry, and you agree to our\n\t\tPrivacy Policy. You further represent that you have the authority to provide this consent\n\t\tregarding voice and text calls to the telephone number you provided. To opt out of voice\n\t\tcall, tell the operator you no longer wish to receive voice calls. To opt out of text calls,\n\t\treply “Stop”. For text messaging, you agree to only use the term “Stop” to communicate an\n\t\topt out. The rights of Users We adopt this Notice to comply with the California Consumer Privacy Act of 2018 (CCPA). Any\n\t\tterms defined in the CCPA have the same meaning when used in this Notice. Users may exercise certain rights regarding their Data processed by the Owner. In particular, Users have the right to do the following: Withdraw their consent at any time. Users have the right to withdraw\n\t\t\tconsent where they have previously given their consent to the processing of their Personal\n\t\t\tData. Object to processing of their Data. Users have the right to object to the\n\t\t\tprocessing of their Data if the processing is carried out on a legal basis other than\n\t\t\tconsent. Further details are provided in the dedicated section below. Access their Data. Users have the right to learn if Data is being\n\t\t\tprocessed by the Owner, obtain disclosure regarding certain aspects of the processing and\n\t\t\tobtain a copy of the Data undergoing processing. Verify and seek rectification. Users have the right to verify the\n\t\t\taccuracy of their Data and ask for it to be updated or corrected. Restrict the processing of their Data. Restrict the processing of their\n\t\t\tData. Users have the right, under certain circumstances, to restrict the processing of\n\t\t\ttheir Data. In this case, the Owner will not process their Data for any purpose other than\n\t\t\tstoring it. Have their Personal Data deleted or otherwise removed. Users have the right to obtain the erasure of their Data from the Owner by placing a request \n\t\t\tat the below designated support email address support@ylopo.com including their Facebook URL, \n\t\t\tfirst and last name, email address and/or phone number for identification purposes, or user can \n\t\t\talso request removal of data from Ylopo by removing the \"Local Home Search\" app connected to the \n\t\t\tFacebook account that was used for login. Go to Facebook settings, navigate to \"Apps and Websites,\" \n\t\t\tand find the app named \"Local Home Search\". Click \"Remove\" next to the app's name. Receive their Data and have it transferred to another controller. Users\n\t\t\thave the right to receive their Data in a structured, commonly used and machine readable\n\t\t\tformat and, if technically feasible, to have it transmitted to another controller without\n\t\t\tany hindrance. This provision is applicable provided that the Data is processed by\n\t\t\tautomated means and that the processing is based on the User's consent, on a contract\n\t\t\twhich the User is part of or on pre-contractual obligations thereof. Lodge a complaint. Users have the right to bring a claim before their\n\t\t\tcompetent data protection authority. Details about the right to object to processing Where Personal Data is processed for a public interest, in the exercise of an official\n\t\tauthority vested in the Owner or for the purposes of the legitimate interests pursued by the\n\t\tOwner, Users may object to such processing by providing a ground related to their particular\n\t\tsituation to justify the objection. Users must know that, however, should their Personal Data be processed for direct marketing\n\t\tpurposes, they can object to that processing at any time without providing any\n\t\tjustification. To learn, whether the Owner is processing Personal Data for direct marketing\n\t\tpurposes, Users may refer to the relevant sections of this document. How to exercise these rights Any requests to exercise User rights can be directed to the Owner through the contact\n\t\tdetails provided in this document. These requests can be exercised free of charge and will\n\t\tbe addressed by the Owner as early as possible and always within one month. We may provide this information in a standardized format that is not specific to you. The\n\t\tdesignated email address for these requests is support@ylopo.com Consent to Receiving Emails, Auto-Dialing & Auto-Texting: By registering, you are giving us, and our professional real estate clients and\n\t\tadvertisers permission to contact you via text message, email, or telephone using the email\n\t\taddress and/or telephone number that you have provided during the registration process. Such\n\t\tcontact may, from time to time, include attempts to contact you via auto-dialing,\n\t\tprerecorded or artificial voice, or auto-texting technology. You may opt out of receiving\n\t\tthese forms of communication by unsubscribing from any email communication or texting STOP\n\t\tas a reply to one of our text communications. There is no fee charged by us or its\n\t\tadvertisers to receive text messages, however, your mobile service provider may charge you\n\t\tfor sending and/or receiving text messages and air-time, as well as any other standard\n\t\tapplicable rates charged by your mobile service provider. Information Sharing We may share your personal information with and any other business associated\n\t\twith this site, in the ways that are described in this Privacy Statement. We may provide\n\t\tyour personal information to our subcontractors in support of our services,\n\t\tsuch as customer service. These companies are authorized to use your personal information as\n\t\tis necessary to provide these services to you. We may also disclose your personal information: As required by law such as to comply with a subpoena, or similar legal process. When we believe in good faith that disclosure is necessary to protect our rights, protect\n\t\t\tyour safety or the safety of others, investigate fraud or respond to a government request, To any other third party with your prior consent to do so. Cookies and Other Tracking Technologies We may use cookies, for example, to keep track of your preferences and profile information.\n\t\tCookies are also used to collect general usage and volume statistical information that does\n\t\tnot include personal information. We may use another company to place cookies on your computer to collect non-personally\n\t\tidentifiable information to compile aggregated statistics for us about visitors to our site. Links to Other Web Sites Our Site includes links to other Websites whose privacy practices may differ from ours. If\n\t\tyou submit personal information to any of those sites, your information is governed by their\n\t\tprivacy policy statements. We encourage you to carefully read the privacy statement of any\n\t\tWeb site you visit. Security The security of your personal information is important to us. We follow generally accepted\n\t\tindustry standards to protect the personal information submitted to us, both during\n\t\ttransmission and once we receive it. No method of transmission over the internet, or method\n\t\tof electronic storage is 100% secure, however. Therefore, we cannot guarantee its absolute\n\t\tsecurity. If you have any questions about the security of our Web site, you can contact our\n\t\twebsite and advertising provider support@ylopo.com Special Notice to California Residents. If you are a resident of California, in addition to\n\t\tthe rights set forth in this Privacy Policy: 1. We will not share any personal information about you to the extent prohibited by\n\t\tapplicable California law or to the extent your prior consent to share is required by\n\t\tapplicable California law; and 2. You have the right to request information from us regarding the manner in which we share\n\t\tcertain categories of information with third parties for their direct marketing purposes.\n\t\tCalifornia law gives you the right to send us a request at a designated address to receive\n\t\tthe following information the categories of information we disclosed to third parties for their direct marketing purposes during the preceding calendar year the names and addresses of the third parties that received that information; and if the nature of the third party's business cannot be determined from their name, examples of the products or services marketed. Additional Policy Information Our Web site includes Widgets, which are interactive mini-programs that run on our site to\n\t\tprovide specific services from another company (e.g. displaying the news, opinions, music,\n\t\tetc.). Personal information, such as your email address, may be collected through the\n\t\tWidget. Cookies may also be set by the Widget to enable it to function properly. Information\n\t\tcollected by this Widget is governed by the privacy policy of the company that created it. Our Web site offers publicly accessible blogs, social media, or community forums such as\n\t\tFacebook, Twitter, or Google Plus. You should be aware that any information you provide in\n\t\tthese areas may be read, collected, and used by others who access them. Visiting our Websites From Outside the United States. This Privacy Policy is intended to cover collection of information on our websites from\n\t\tresidents of the United States. If you are visiting our websites from outside the United\n\t\tStates, please be aware that your information may be transferred to, stored and processed in\n\t\tthe United States where our servers are located and our central database is operated. The\n\t\tdata protection and other laws of the United States and other countries might not be as\n\t\tcomprehensive as those in your country. By using our services, you understand that your\n\t\tinformation may be transferred to our facilities and those third parties with whom we share\n\t\tit as described in this Privacy Policy. No Rights of Third Parties. This Privacy Policy does not create rights enforceable by third parties or require\n\t\tdisclosure of any personal information relating to users of our websites. Notification of Privacy Policy Statement Changes We may update this privacy statement to reflect changes to our information practices or\n\t\tchanges in regulations governing privacy. If we make any material changes we will notify you\n\t\tby email (sent to the email address specified in your account) or by means of a notice on\n\t\tthis Site prior to the change becoming effective. We encourage you to periodically review\n\t\tthis page for the latest information on our privacy practices. This Privacy Policy was last revised on June 2, 2025. We reserve the right to modify\n\t\tor amend this policy at any time by posting the revised Privacy Policy on the website."
    },
    {
      "url": "https://theurban.miami/",
      "text": "The Urban - Overtown Miami - Craft. Culinary. Culture Home Events Gallery About Contact Book Venue Vendor Signup More Home Events Gallery About Contact Book Venue Vendor Signup Home Events Gallery About Contact Book Venue Vendor Signup craft. Culinary. culture. craft. Culinary. culture. craft. Culinary. culture. craft. Culinary. culture. craft. Culinary. culture. craft. Culinary. culture. craft. Culinary. culture. craft. Culinary. culture. Subscribe Sign up to hear from us about specials, sales, and events. Email Sign up Experience The Urban through our Instagram feed Copyright © 2024 Urban Gateway, LLC - All Rights Reserved. Privacy Policy Terms and Conditions This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://store.urbanintellectuals.com/contactus/",
      "text": "Contact Us | Urban Intellectuals Store 0 $ 0.00 Cart Shop Menu Home Products Flashcards Games Board Games Card Games Memberships Sankofa Legacy Sankofa Circle (Adults) Sankofa Club (Children) Apparel & Merch T-Shirts Hats Bags Other Apparel Posters Travel Sankofa Experiences Travel Calendar Community Affiliate Program Articles Education Flashcard Articles Observations News Schools About Us Our Story Meet the Founder FAQs Contact Us Login 0 $ 0.00 Search × 15% off on your first order Click here to sign up 15% off on your first order Click here to sign up Unlock 15% Off Your First Order Sign up for updates, news, first look at products and more. [SUBSCRIBE] - 15% Off Popup (Jan 2024) Your First Name Email Phone/Mobile 🔓 UNLOCK 15% OFF Coupon valid for first order only. Not valid for travel purchases. *By entering your phone number and submitting this form, you consent to receive marketing and order status text messages from True Classic at the number provided, including messages sent by autodialer. Consent is not a condition of any purchase. Message and data rates may apply. Message frequency varies. You can unsubscribe at any time by replying STOP or clicking the unsubscribe link (where available) in one of our messages. View our Privacy Policy and Terms of Service Please fill out the form below or email all support queries to support@urbanintellectuals.com . Include any customer information and details so we can help you as quickly as possible. Contact Form (#38) First Name Last Name Email Subject Description I consent to have this website store my submitted information so they can respond to my inquiry Submit Query If you need to reach us by post our address is: Urban Intellectuals, Inc 401 North Michigan Avenue Suite 1200 Chicago, IL 60611 Search × Privacy Policy T&Cs Affiliate T&Cs Return / Refund Policy Support Urban Intellectuals and Earn 15% for Every Referral! Your User Data Cookie Policy (US) Privacy Statement (US) Disclaimer © Urban Intellectuals, Inc. 2025 Search × Bestsellers Black History Playing Cards View Product Black History S.T.E.A.M Bingo View Product Black History Flashcards Vol 1 View Product Off The Dome “Hip Hop Edition” View Product Flashcards Games Apparel & Homeware Travel Schools Memberships Sankofa Legacy Sankofa Circle (Adults) Sankofa Club (Children) Articles Login \"We are loving these!! It’s amazing how much information you all have put on this little cards! I’m learning right along with my 12 year old!\" Dortheen, flashcards customer 🤔 FAQs ✍🏾 Contact 🔓 My Account 📦 Returns / Refunds 🤑 Affiliate Area Privacy Policy Terms & Conditions 0"
    },
    {
      "url": "https://www.partyslate.com/venues/the-urban",
      "text": "The Urban | Miami Venue | PartySlate Skip to content Venues Planners Vendors Ideas Venues Planners Vendors Ideas The Urban Find Venues / Florida / Miami / The Urban Unclaimed The Urban 1000 NW 2nd Ave, Miami, FL 33136, USA Request info Favorite Owner hasn't claimed this business If you own this business, claim your profile to update information, add photos, and more. Claim Profile Overview Gallery 0 About The Urban The Urban is located at 1000 NW 2nd Ave, Miami, FL 33136, USA. Pricing Packages The Urban hasn't listed their pricing yet. Connect with them directly to get a customized pricing proposal for your event. Request a Quote Map 1000 NW 2nd Ave, Miami, FL 33136, USA Follow Us Visit Website Call If you own this business, claim your profile to update information, add photos, and more. Claim Profile Get the latest trends Our team's top picks and more straight to your inbox. Subscribe Follow us Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Privacy Policy Terms of Service Pro Terms of Service © PartySlate 2025"
    },
    {
      "url": "https://www.linkedin.com/company/urban-standard-capital",
      "text": "Urban Standard Capital | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Sign in Join now Urban Standard Capital Real Estate New York, NY 4,100 followers Commercial Real Estate Bridge Loans I Bespoke Loan Structures I Core Plus and Opportunistic/Value Add Strategies Follow View all 19 employees Report this company About us Urban Standard Capital is a NYC-based real estate investment firm providing institutional capital solutions to real estate sponsors. Having invested $2B of equity and debt capital since launching in 2014, we distinguish ourselves as direct lenders in the middle market by leveraging our in-house real estate development expertise to provide creative and bespoke financing solutions to our partners. \n\nEquity roots, credit expertise: USC combines direct experience in property ownership, development and management with capital markets expertise to invest opportunistically across the capital stack. We originate or acquire real estate debt and structured equity investments with a focus on senior first mortgages, with a concentration on Core Plus and Opportunistic/Value Add strategies. We lend nationwide. \n\nWhat sets us ahead in the middle-market lending space is our equity DNA coupled with a relationship driven, solutions oriented and engaged team and culture. \n\nDeep hands-on real estate experience provides us with a granular understanding of real estate credit risk, enabling us to evaluate each transaction from both a lender’s and equity investor’s perspective and to structure loans to mitigate risk while positioning borrowers to succeed. USC capitalizes on the gap between real and perceived investment risk. \n\nHow we do one thing is how we do everything, focusing on what it takes to build long-term partnerships. This fosters a high rate of recurring borrower and broker relationships.\n\nOne of the few middle-market-focused debt funds with institutional pedigree and backing, we invest on behalf of foundations, pension funds, insurance companies and family offices.\n\nDreamers, builders, landscape shapers, we’ve got you covered: If you have an opportunity to discuss, please contact us. Our team looks forward to partnering with you.\n\nIf you would like to learn more about our private credit real estate platform and investment strategies, please contact us at IR@uscnyc.com. Website http://www.uscnyc.com External link for Urban Standard Capital Industry Real Estate Company size 11-50 employees Headquarters New York, NY Type Privately Held Founded 2015 Locations Primary 233 Broadway Suite 1470 New York, NY 10279, US Get directions Employees at Urban Standard Capital Charlie Brosens Partner at Urban Standard Capital Jeremy Plofker Vice President at Urban Standard Capital Sarah Saul, CPA Controller at Urban Standard Capital Seth Weissman Managing Partner at Urban Standard Capital See all employees Updates Urban Standard Capital 4,100 followers 8h Report this post Urban Standard Capital is proud to announce the successful payoff of our $9,350,000 acquisition and renovation loan in Tacoma, WA bringing 132 apartments to the market. A win for our borrower, investors, and the community!\n\nLearn more about our real estate bridge lending terms at www.uscnyc.com and reach out to Sam Hollander at originations@uscnyc.com for more information on this transaction. #realestatedebt #bridgelending #privatecredit #multifamily 4 Like Comment Share Urban Standard Capital 4,100 followers 2d Report this post Just one week away! Urban Standard Capital 's Managing Partner Seth Weissman is excited to join Natalie Garcia , Paul Rahimian , Lindsay Berz, CFA and moderator Dayna Fields to discuss what's ahead for the credit markets at SuperReturn West. We hope to see many of you there!\n\nReach out to Rachel Markus , Director of Investor Relations, at IR@uscnyc.com for more info. or to connect with us in LA. #privatecredit #bridgelending #conferences #SRUSWEST #urbanstandardcapital 10 Like Comment Share Urban Standard Capital 4,100 followers 3d Report this post \"A rate cut expands the buyer's pool of assets that didn't pencil under a higher debt cost [and] might now clear the market,” Urban Standard Capital Managing Partner Seth Weissman recently shared with FundFire 's Davide Mamone . \"...it will be really good, both in terms of the absolute cost of capital, but also sentiment or driving transaction volume, both on acquisitions and refinancing.\"\n\nRead the full article discussing Real Estate Managers Jump on Deals as Rate Cut Hopes Drive Optimism here: https://lnkd.in/ey_8g2jG #realestatedebt #bridgelending #realestateinvesting #fundfire #urbanstandardcapital 4 Like Comment Share Urban Standard Capital 4,100 followers 1w Report this post The The Wall Street Journal reports the U.S. now has 1,135 billionaires holding $5.7T in wealth — and they’re driving demand for luxury real estate that’s scarce, resilient, and lifestyle-driven.\n\nThat’s why luxury real estate credit remains so compelling: equity-like returns, credit-level risk, and strong collateral in markets the ultra-wealthy can’t get enough of. We see this demand every day — and it’s only accelerating. https://lnkd.in/eSX3g4KJ What We Know About America’s Billionaires: 1,135 and Counting wsj.com 6 Like Comment Share Urban Standard Capital 4,100 followers 1w Report this post Urban Standard Capital is proud to announce the successful payoff of our $16,000,000 condo inventory loan at 100 Franklin Street in Tribeca’s historic district.\n\nLearn more about our real estate bridge lending terms at www.uscnyc.com and reach out to Seth Weissman at originations@uscnyc.com for more information on this transaction. #privatecredit #bridgelending #realestatedebt #realestateinvesting 5 Like Comment Share Urban Standard Capital 4,100 followers 2w Report this post Urban Standard Capital is proud to share the closing of a $12,000,000 construction completion loan in the heart of Manhattan's West Village.\n\nLearn more about our real estate bridge lending terms at www.uscnyc.com and reach out to Robert Levine at originations@uscnyc.com for more information on this transaction. #privatecredit #bridgelending #realestatedebt #realestateinvesting 25 Like Comment Share Urban Standard Capital 4,100 followers 2w Report this post Driving results: Urban Standard Capital is proud to share the closing of a $2,900,000 loan in Park City, Utah with a collateral package that includes a golf membership!\n\nLearn more about our real estate bridge lending terms at www.uscnyc.com and reach out to Robert Levine at originations@uscnyc.com for more information on this transaction. #privatecredit #bridgelending #realestatedebt #realestateinvesting #singlefamily #luxurylending #skitowns 5 Like Comment Share Urban Standard Capital 4,100 followers 3w Report this post “Family offices are prioritizing predictable income and downside protection in today’s market.” Seth Weissman , Founder & Managing Partner at Urban Standard Capital , sat down with Crain Currency to discuss why ultra-high-net-worth investors are turning to private credit in luxury real estate and how Urban Standard’s approach to loan-to-value structuring and consistent monthly dividends is resonating with families seeking stability and diversification.\n \nRead the full Q&A with Carrie Pallardy here: https://lnkd.in/e8VhYaDA #RealEstateInvesting #PrivateCredit #FamilyOffice #AlternativeInvestments #luxurylending Seth Weissman on why family offices seek stability and income in luxury real estate credit craincurrency.com 9 Like Comment Share Urban Standard Capital 4,100 followers 3w Edited Report this post Relationships create value: Over 75% of Urban Standard Capital 's deals come from repeat borrowers, referrals, or direct connections — a rare stat in such a transactional industry.\n\nUSC Founder and Managing Partner Seth Weissman recently joined client Josef Goodman on Brick & Wonder 's Working Together podcast to talk about how we’ve built that kind of partnership. \n\nListen here: https://lnkd.in/eFyKJptf 4:51    Does it pencil? What USC looks for.\n  7:25    Communication matters—especially in challenging times\n 17:31    Is enough risk being taken in RE development?\n21:30    How to align incentives\n29:30   Why NYC continues to be a great place to invest #relationshipsmatter #realestateinvesting #privatecredit #realestatedebt Working Together https://podcasts.apple.com 11 Like Comment Share Urban Standard Capital 4,100 followers 3w Report this post Structured with SoHo style, Urban Standard Capital is proud to share the funding of a $5,000,000 loan in the heart of the SoHo neighborhood of Manhattan, NY.\n\nLearn more about our real estate bridge lending terms at www.uscnyc.com and reach out to Harrison Pergament at originations@uscnyc.com for more information on this transaction. #privatecredit #bridgelending #realestatedebt #realestateinvesting #soho 11 Like Comment Share Join now to see what you are missing Find people you know at Urban Standard Capital Browse recommended jobs for you View all updates, news, and articles Join now Similar pages Stolar Capital Real Estate Hoboken, New Jersey Camber Property Group Real Estate The Ardent Companies Real Estate Atlanta, Georgia Hirshmark Capital Real Estate New York, NY Greenbrook Partners Real Estate New York, NY Madison Realty Capital Real Estate New York, NY Traded: New York Real Estate New York, New York CNY Group Construction New York, New York GCM Grosvenor Financial Services Chicago, IL Ranger Properties, LLC Real Estate New York, NY Show more similar pages Show fewer similar pages Browse jobs Analyst jobs 694,057 open jobs Real Estate Analyst jobs 28,041 open jobs Revenue Officer jobs 34,196 open jobs Associate jobs 1,091,945 open jobs Corporate Real Estate Manager jobs 740 open jobs Associate Financial Advisor jobs 16,513 open jobs Real Estate Attorney jobs 9,107 open jobs Junior Estimator jobs 15,077 open jobs Credit Associate jobs 13,760 open jobs Leasing Manager jobs 19,649 open jobs Transaction Coordinator jobs 32,722 open jobs Director of Real Estate jobs 2,674 open jobs Finance Graduate jobs 23,252 open jobs Investment Analyst jobs 14,999 open jobs Real Estate Manager jobs 19,557 open jobs Associate Attorney jobs 11,455 open jobs Leasing Consultant jobs 67,056 open jobs Attorney jobs 37,177 open jobs Design Manager jobs 189,125 open jobs Manager jobs 1,880,925 open jobs Show more jobs like this Show fewer jobs like this More searches More searches Real Estate Analyst jobs Associate jobs Analyst jobs Sales Trader jobs Corporate Real Estate Manager jobs Accountant jobs Business Development Officer jobs Underwriting Analyst jobs Real Estate Associate jobs Market Research Analyst jobs Asset Manager jobs Project Manager jobs Project Accountant jobs Accounting Clerk jobs Accounts Payable Specialist jobs Real Estate Coordinator jobs Staff Accountant jobs Asset Management Analyst jobs Senior Associate jobs Consultant jobs Oracle Consultant jobs Office Manager jobs Graduate Analyst jobs Junior Analyst jobs Marketing Analyst jobs Manager jobs Structures Engineer jobs Planning Engineer jobs Training Associate jobs Mortgage Specialist jobs Investor Relations Associate jobs Design Engineer jobs Fundraiser jobs Trading Analyst jobs Travel Advisor jobs Private Equity Intern jobs Sales Technician jobs Trader jobs Engineer jobs Real Estate Intern jobs Sports Intern jobs Interior Designer jobs Lender jobs Originator jobs Loan Officer jobs Vice President of Business Development jobs Real Estate Paralegal jobs Legal Counsel jobs Cost Accountant jobs Director jobs Cost Manager jobs Senior Estimator jobs Head of Sales jobs Estimator jobs Salesperson jobs Mortgage Underwriter jobs Security Manager jobs Private Equity Associate jobs Equity Specialist jobs Audit Manager jobs LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at Urban Standard Capital Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://mvul.org/about",
      "text": "About | Miami Valley Urban League Skip to content About Show submenu for About Advisory Board Join the Movement Careers Contact Us SOAR EMERGE Show submenu for EMERGE Youth Conference Business Financial Coaching News & Events Show submenu for News & Events Pillar Awards Open main navigation Close main navigation About Show submenu for About Advisory Board Join the Movement Careers Contact Us SOAR EMERGE Show submenu for EMERGE Youth Conference Business Financial Coaching News & Events Show submenu for News & Events Pillar Awards DONATE Open search Close search DONATE This is a search field with an auto-suggest feature attached. There are no suggestions because the search field is empty. About MVUL The Urban League has been serving the Miami Valley since 1947. Currently, the Miami Valley Urban League operates impactful programs focused on economic empowerment, community development, and social justice. Scroll below to learn more. What does MVUL do? Financial Empowerment Community Empowerment We help you gain the skills to maintain financial stability. Miami Valley Urban League helps individuals, families, and businesses achieve generational wealth through career development programs and entrepreneurship growth. Click below to learn more about some of our programs SOAR > EMERGE > Business & Entrepreneurship > Financial Coaching > We equip the community with programming to make Dayton greater. We are committed to fighting for social change and equity in Southwestern Ohio to improve the quality of life for all people. Some of our work in the community includes: - Mini-Grants - State of Black Dayton MEET OUR TEAM Nikol Miller Executive Director Champion for Community Development and Social Justice Nikol Miller is the Executive Director of the Miami Valley Urban League, a division of the Urban League of Greater Southwestern Ohio. As a mission-driven lifelong public servant, Nikol brings extensive experience in community outreach, public policy, fundraising, and media relations to her role. A proud alumna of Meadowdale High School in Dayton, OH, and Miami University in Oxford, OH, Nikol has deep roots in the Miami Valley. Before taking on her current role, she served as the Community Relations Manager for the Greater Dayton RTA. Her commitment to public service extends beyond Dayton; she played a pivotal role in developing the national outreach plan for the 2020 Census as part of a consultancy team and served as Chief of Staff for Chicago’s 7th Ward Alderman. Nikol is highly active in her community, holding leadership positions on several boards, including: Alpha Kappa Alpha Sorority, Inc. Greater Edgemont Community Coalition Five Rivers Health Center Edgemont Campus Board African American Community Fund Board City of Dayton’s Community and Neighborhood Development Advisory Board OnMain Advisory Board CityWide Development Corporation Greater Dayton RTA Board of Trustees Her dedication to community service is complemented by her membership at St. Benedict Catholic Church. Nikol resides in Dayton’s Sunnyview-Catalpa neighborhood with her beloved dog, Neo. She is also a proud aunt, affectionately known as the FUNtie, to Bryanna Robinson and Eryanna Miller. Nikol Miller's leadership at the Miami Valley Urban League exemplifies her commitment to fostering economic empowerment, social justice, and community development in the Greater Dayton region. Tiara Wright Program Coordinator Amanda Green Life and Career Coach Donerik Black Career Trainer, SOAR Timothy McKinney Career Trainer, SOAR Cherry Mansell Administrative Assistant ADVISORY BOARD JOIN THE MOVEMENT 31 S. Main St. Suite 211 Dayton, Ohio 45402 (937) 226-1513 info@mvul.org About SOAR EMERGE Business Financial Coaching News & Events facebook-f icon instagram icon linkedin-in icon Follow us on Facebook Copyright ©2025 Miami Valley Urban League. All rights reserved. Privacy policy"
    },
    {
      "url": "https://www.thegoodsauna.co.uk/contact-us",
      "text": "The Good Sauna | Contact Us | Get In Touch Today — Good Sauna UK 0 Skip to Content Home Important Stuff How to Book How it Works About Us Contact Us FAQs My Account Journal Buy Credits Book a Session Book Now Open Menu Close Menu Book Now Home Important Stuff How to Book How it Works About Us Contact Us FAQs My Account Journal Buy Credits Book a Session Open Menu Close Menu Home Folder: Important Stuff Back How to Book How it Works About Us Contact Us FAQs My Account Journal Buy Credits Book a Session Book Now Contact Us The Good Sauna The Good Sauna is located at Club de Padel and together will form Manchester’s most premium outdoor wellness and lifestyle destination. Offering an authentic Finnish sauna and cold plunge experience, alongside Manchester's first dedicated Padel Venue, all within a modern setting. Located in the New Jackson district of the city, we invite guests to relax, rejuvenate, and reconnect through a combination of traditional saunas, cold plunges, and community-focused relaxation. Open from 4pm - 8pm, or 12pm - 6pm on weekends, the site offers panoramic city views, quality coffee, and ample space to unwind. Conveniently located near main transport links (Deansgate tram stop) and just a short walk from the city centre, The Good Sauna and Club De Padel, can be found via our entrance on Owen Street, with The Good Sauna being clearly signposted and our check in desk located to the right of the Club de Padel cabin. Book Session HOW IT WORKS WEDNESDAY - FRIDAY: 4PM - 8PM SATURDAY - SUNDAY: 12PM - 6PM *Special events & collaborations are available upon request. Please email us at info@thegoodsauna.co.uk to discuss further ADDRESS: Club De Padel, Owen St., Manchester M15 4TQ EMAIL: info@thegoodsauna.co.uk PHONE: 0161 710 5110 Sign-Up For Our Newsletter! Join our mailing list and get an exclusive 10% off discount for your first booking and all the latest updates on Manchester’s newest urban oasis. Email * Thanks for subscribing! We’ll be in touch shortly with all the details regarding our launch. BOOK NOW DOWNLOAD THE APP Outdoor Sauna and Cold Plunge Community Experience About Us How It Works Contact Us How to Book FAQ’s Waiver Form Pricing Buy Credits My Account Journal Terms & Conditions Book Session Follow Us On Instagram! @thegoodsauna.mcr Looking for The Good Sauna Canada? Visit our Canadian site here. Please enable JavaScript to view the Web Integrations by Mariana Tek."
    }
  ]
}