{
  "fuentes": [
    {
      "url": "https://www.enrollwaresolutions.com/contact-us",
      "email": "info@enrollware.com"
    },
    {
      "url": "https://www.thevolsteadjax.com/",
      "email": "team@thevolsteadjax.com"
    },
    {
      "url": "https://www.thevolsteadjax.com/events/",
      "email": "team@thevolsteadjax.com"
    },
    {
      "url": "https://www.archives.gov/education/lessons/volstead-act",
      "email": "education@nara.gov"
    },
    {
      "url": "https://volsteadlounge.wordpress.com/",
      "email": "info@hotelvegasaustin.com"
    },
    {
      "url": "https://www.jax.org/about-us/our-leaders",
      "email": "emily.schorer@jax.org"
    },
    {
      "url": "https://www.jax.org/about-us/our-leaders",
      "email": "dan.hoag@jax.org"
    },
    {
      "url": "https://www.jax.org/about-us/our-leaders",
      "email": "gina.rodriguez@jax.org"
    },
    {
      "url": "https://www.jax.org/about-us/our-leaders",
      "email": "mary.dickinson@jax.org"
    },
    {
      "url": "https://www.jax.org/about-us/our-leaders",
      "email": "orderquest@jax.org"
    },
    {
      "url": "https://www.jax.org/about-us/our-leaders",
      "email": "u003eorderquest@jax.org"
    },
    {
      "url": "https://www.jax.org/about-us/our-leaders",
      "email": "webservices@jax.org"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "brianna@teamjackfoundation.org"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "kylie@teamjackfoundation.org"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "lindsey@teamjackfoundation.org"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "shirley@teamjackfoundation.org"
    },
    {
      "url": "https://www.thevolsteadjax.com/menu/",
      "email": "team@thevolsteadjax.com"
    },
    {
      "url": "https://www.thevolsteadjax.com/about-us/",
      "email": "team@thevolsteadjax.com"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "email": "alex.halloran@sportingjax.com"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "email": "andrew.klimek@sportingjax.com"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "email": "anthony.ortiz@sportingjax.com"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "email": "cole.pepper@sportingjax.com"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "email": "david.phillips@sportingjax.com"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "email": "emerson.burris@sportingjax.com"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "email": "eric.turner@sportingjax.com"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "email": "grace.genest@sportingjax.com"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "email": "henry.olivas@sportingjax.com"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "email": "hisham.bilal@sportingjax.com"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "email": "jack.gonzalez@sportingjax.com"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "email": "keneil.gibbs@sportingjax.com"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "email": "kiernan.schindler@sportingjax.com"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "email": "marshall.happer@sportingjax.com"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "email": "mikaela.sites@sportingjax.com"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "email": "riley.platt@sportingjax.com"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "email": "sara.gm@sportingjax.com"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "email": "vincent.buzzy@sportingjax.com"
    },
    {
      "url": "https://dtjax.com/poi/the-volstead/",
      "email": "team@thevolsteadjax.com"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    },
    {
      "url": "https://www.thevolsteadjax.com/contact-us/",
      "email": "team@thevolsteadjax.com"
    },
    {
      "url": "https://thevolsteadwv.com/",
      "email": "info@ndiscovered.com"
    },
    {
      "url": "https://www.volstead.co.nz/contact/",
      "email": "info@volstead.co.nz"
    },
    {
      "url": "https://www.senate.gov/artandhistory/history/minute/Volstead_Act.htm",
      "email": "historian@sec.senate.gov"
    },
    {
      "url": "https://mspmag.com/locations/Volstead-s-Emporium/",
      "email": "yourprofile@mspmag.com"
    }
  ],
  "mails": [
    "alex.halloran@sportingjax.com",
    "andrew.klimek@sportingjax.com",
    "anthony.ortiz@sportingjax.com",
    "brianna@teamjackfoundation.org",
    "cole.pepper@sportingjax.com",
    "dan.hoag@jax.org",
    "david.phillips@sportingjax.com",
    "education@nara.gov",
    "emerson.burris@sportingjax.com",
    "emily.schorer@jax.org",
    "eric.turner@sportingjax.com",
    "gina.rodriguez@jax.org",
    "grace.genest@sportingjax.com",
    "henry.olivas@sportingjax.com",
    "hisham.bilal@sportingjax.com",
    "historian@sec.senate.gov",
    "info@enrollware.com",
    "info@hotelvegasaustin.com",
    "info@inzmo.com",
    "info@ndiscovered.com",
    "info@volstead.co.nz",
    "jack.gonzalez@sportingjax.com",
    "keneil.gibbs@sportingjax.com",
    "kiernan.schindler@sportingjax.com",
    "kylie@teamjackfoundation.org",
    "lindsey@teamjackfoundation.org",
    "marshall.happer@sportingjax.com",
    "mary.dickinson@jax.org",
    "mikaela.sites@sportingjax.com",
    "orderquest@jax.org",
    "riley.platt@sportingjax.com",
    "sara.gm@sportingjax.com",
    "shirley@teamjackfoundation.org",
    "team@thevolsteadjax.com",
    "u003eorderquest@jax.org",
    "vincent.buzzy@sportingjax.com",
    "webservices@jax.org",
    "yourprofile@mspmag.com"
  ],
  "nombre_sitio": "thevolsteadjax.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.enrollwaresolutions.com/contact-us",
      "text": "Contact the Team | Enrollware Skip to content Client Login All-in-One Platform Solutions Healthcare/AHA Corporate Government Continuing Education Pricing Contact Sign Up Contact Enrollware How to Reach Us To reach a representative, fill out the contact form on this page or give us a call. Phone: Support: 561-247-2432 Support Hours: Monday-Friday (8am-6pm ET) Email: Sales Inquiries: info@enrollware.com Support: support@enrollware.com Mailing Address: Fullsteam Software Holdings LLC DBA Enrollware Software 540 Devall Drive, Suite 301 Auburn, AL 36832 Password Assistance? Please contact your training center administrator. Enrollware can only issue usernames or passwords for the primary administrators of our direct clients. Online Class Registration and Management Features All-in-One Platform Pricing EnrollwarePay Solutions Healthcare Government Continuing Education Corporate Resources Contact Us Privacy Policy Terms & Conditions Responsible Disclosure Policy Client Login Follow Us © 2025 Enrollware. All rights reserved."
    },
    {
      "url": "https://www.thevolsteadjax.com/",
      "text": "Home - The Volstead Toggle navigation Home About Us Menu Events Private Party Contact Us Facebook Twitter Instagram Call To Action Speakeasy-style bar serving the best handcrafted cocktails in downtown jacksonville OUR STORY About Us The Volstead opened on NYE 2013 in Downtown Jacksonville. We are dedicated to bringing unrivaled drink quality and service to a discerning crowd of grown-ups. Our talented bartenders create tantalizing hand crafted cocktails that will intrigue both your palate and your senses. Since opening, The Volstead has quickly become one of Jacksonville’s best-loved bars based on its inspired cocktails, speakeasy attitude and cozy atmosphere. Come see for yourself why we are Jacksonville’s “best-kept secret”. MORE ABOUT US thevolsteadjax A refined homage to the art of the cocktail | 21+ Discreetly nestled behind @snipsbarbershoppe #TheVolsteadCocktails Swing Dance 1st & 3rd Sunday 🎷 Friday, Sept 12\nJazz Jam w/ Pablo Duque & the 🏆Top Shelf Tuesday: Elijah Craig [Prices below] Instagram post 18501486313065539 🕵‍♂️ Monday All Day Happy Hour\nHand-craft ✨ Tonight: LoFi Lounge, 9pm–1am \nFresh cocktai ✨Swing Dance Sunday✨\nThis Sunday we’re clear 🕵‍♂️ During Prohibition, Jacksonville’s This Saturday, walk through the barbershop, sip a 🥃 Top Shelf Tuesday Pick: Orphan Barrel Whiskey 🕵‍♂️ In the early 1900s, Jacksonville was 🎨✨ Art Walk After Dark ✨🎨\n\nArt Walk does 🪴 Carnivorous Plants 🪴\nParsley-infused rhum ✨ Volstead Classics ✨\nSome cocktails earn thei 🌶🍹There’s just something about a margarita ✨️Top Shelf Tuesday✨️\n🕵‍♂️Want th Load More... Follow on Instagram This message is only visible to admins. Problem displaying Facebook posts. Backup cache in use. Click to show error Error: Error validating access token: The user has not authorized application 1332798716823516. Type: OAuthException MUSIC. CULTURE. PASSION. 01 MENU 02 EVENTS 03 MASTERCLASSES 04 BOOK A PRIVATE PARTY Directions Location The Volstead 115 W Adams St. Jacksonville, FL 32202 team@thevolsteadjax.com Opening Hours Monday-Saturday 4:00PM – 2:00AM Sunday 4:00PM – 12:00AM Follow Us Facebook Instagram LINKS HOME ABOUT US MENU EVENTS PRIVATE PARTY CONTACT US Home About Us Menu Events Private Party Contact Us 115 W Adams St. Jacksonville, FL 32202 904-414-3171 Mon-Sat 4pm - 2am  |  Sun 7pm-2am © 2017 The Volstead. All rights reserved. Photo Credit | Ben Cross Photography"
    },
    {
      "url": "https://www.thevolsteadjax.com/events/",
      "text": "Events - The Volstead Toggle navigation Home About Us Menu Events Private Party Contact Us Facebook Twitter Instagram Call To Action Speakeasy-style bar serving the best handcrafted cocktails in downtown jacksonville OUR STORY Events SWING DANCE SUNDAY First and Third Sunday every month Free lessons, delicious cocktails, and a chance to catch a glimpse of some of the best swing dancers around doing their thing (while sometimes appearing to defy gravity). All levels are welcome and no partner is required. LIVE MUSIC SCHEDULE Every Second and Forth Friday The Volstead House Jazz band Featuring Pablo Duque and Guest UPCOMING EVENTS May 3rd Cocktail Class https://www.eventbrite.com/e/april-19th-cocktail-class-tickets-1325931048459?aff=oddtdtcreator MASTERCLASSES Would you like that shaken, or stirred? Our bartenders will teach you how to make classic cocktails while discovering the history behind them. Learn new skills, enjoy your creations and show off your newly acquired talents by playing bartender at your next event! Limited space is available. Next class: 05/03/2025 Purchase tickets: https://www.eventbrite.com/e/may-3rd-cocktail-class-tickets-1337178279229?aff=oddtdtcreator Location The Volstead 115 W Adams St. Jacksonville, FL 32202 team@thevolsteadjax.com Opening Hours Monday-Saturday 4:00PM – 2:00AM Sunday 4:00PM – 12:00AM Follow Us Facebook Instagram LINKS HOME ABOUT US MENU EVENTS PRIVATE PARTY CONTACT US Home About Us Menu Events Private Party Contact Us 115 W Adams St. Jacksonville, FL 32202 904-414-3171 Mon-Sat 4pm - 2am  |  Sun 7pm-2am © 2017 The Volstead. All rights reserved. Photo Credit | Ben Cross Photography"
    },
    {
      "url": "https://www.archives.gov/education/lessons/volstead-act",
      "text": "The Volstead Act | National Archives Top Skip to main content The U.S. National Archives Home Citizen Archivists · Bookmark/Share · Contact Us Search Search Main menu Research Our Records Veterans' Service Records Educator Resources Visit Us America's Founding Documents Educator Resources Home > Educator Resources > The Volstead Act Educator Resources Educator Resources Civics for All of US DocsTeach: Our Online Tool for Teaching with Documents Teaching With Documents Student Visits Professional Development Distance Learning Programs eBooks, Online Tours, Videos & More National History Day Resources Education Programs at Presidential Libraries Events & Public Programs The Volstead Act By the turn of the 20th century, temperance societies were prevalent in the United States. Concerned citizens had begun warning others about the effects of alcohol nearly 100 years earlier. In 1826 the American Temperance Society was founded to convince people to abstain from drinking. Not long after, the Women's Christian Temperance Union pledged not only to ban alcohol and drugs, but to improve public morals. The anti-Saloon League was formed in 1893 and eventually became a powerful political force in passing a national ban on alcoholic beverages. Women were strongly behind the temperance movement, for alcohol was seen as the destroyer of families and marriages. Men would often spend their money on alcohol, leaving women with no money to provide for their children. Factory owners also supported temperance as well because of the new work habits that were required of industrial workers - early mornings and long nights. Progressive reformers also took to Prohibition for they saw it as a continuation of their efforts to improve society in general. Temperance societies and Progressives alike saw the need for more governmental control and involvement in citizens' lives. They were successful in passing several laws at the local level. Between 1905 and 1917, states across the nation were imposing laws that prohibited the manufacture and sale of intoxicating beverages. They did not stop there, however. The temperance societies began to push to change American society and elevate morality through national legislation. In 1917, the House of Representatives wanted to make Prohibition the 18th Amendment to the Constitution. Congress sent the amendment to the states for ratification, where it needed three-fourths approval. The amendment stipulated a time limit of seven years for the states to pass this amendment. In just 13 months enough states said yes to the amendment that would prohibit the manufacture, sale, and transportation of alcoholic liquors. The amendment worked at first: liquor consumption dropped, arrests for drunkenness fell, and the price for illegal alcohol rose higher than the average worker could afford. Alcohol consumption dropped by 30 percent and the United States Brewers' Association admitted that the consumption of hard liquor was off 50 percent during Prohibition. These statistics however, do not reflect the growing disobedience toward the law and law enforcement. The intensity of the temperance advocates was matched only by the inventiveness of those who wanted to keep drinking. Enforcing Prohibition proved to be extremely difficult. The illegal production and distribution of liquor, or bootlegging, became rampant, and the national government did not have the means or desire to try to enforce every border, lake, river, and speakeasy in America. In fact, by 1925 in New York City alone there were anywhere from 30,000 to 100,000 speakeasy clubs. The demand for alcohol was outweighing (and out-winning) the demand for sobriety. People found clever ways to evade Prohibition agents. They carried hip flasks, hollowed canes, false books, and the like. Neither federal nor local authorities would commit the resources necessary to enforce the Volstead Act. For example, the state of Maryland refused to pass any enforcement issue. Prohibition made life in America more violent, with open rebellion against the law and organized crime. In this lesson, students will be historians examining the documents listed above, trying to find out why \"the great social and economic experiment, noble in motive and far reaching in purpose\" as Herbert Hoover called it, did not work. Students should try to identify the changing values and cultural pressures at the beginning of the 20th century. How are these similar to and different from those we are experiencing at the advent of the 21st century? What can we learn from Prohibition? How can we compare it to our own war on drugs? What cultural movements are happening today that relate to this time in American history? Use these questions and others to guide your students through their research on this \"experiment.\" The Documents Links go to DocsTeach, our online tool for teaching with documents. 18th Amendment to the Constitution The Volstead Act Letter About Transportation of Liquor from California to Washington Drawing of a Still Letter from Harry S. Truman to Bess Wallace Alluding to the Adoption of Prohibition Presidential Proclamation Announcing the Repeal of Prohibition 21st Amendment to the Constitution Go to Teaching Activities This article was written by Kerry C. Kelly, a teacher at Hunterdon Central Regional High School in Flemington, NJ. Resources Boardman, Fon W. Jr. America and the Jazz Age: A History of the 1920's . New York: Henry Z. Walck, Inc., 1968. Downey, Matthew T., et al. Volume II: The Roaring Twenties and an Unsettled Peace . New York: Macmillan Publishing Company, 1992. Mowry, George E. The Twenties: Fords, Flappers & Fanatics. Englewood Cliffs, NJ: Prentice Hall, 1963. Pietrusaz, David. The Roaring Twenties. San Diego, CA: Lucent Books,. 1998. Time Life Books. 1920-1930. Volume III. New York: Time Inc.,1969. Lesson Resources The Documents Teaching Activities and Standards Document Analysis Worksheet This page was last reviewed on February 24, 2017. Contact us with questions or comments . Teachers’ Resources Primary Sources DocsTeach.org OurDocuments.gov Founders Online Today's Document National Archives Catalog How to Cite Documents Document Analysis DocsTeach DocsTeach.org DocsTeach App for iPad Getting Started How-to Videos Featured Topics @DocsTeach on Twitter Visits & Workshops Student Visits Professional Development Distance Learning Events & Public Programs Other Resources National History Day Resources Online Exhibits eBooks YouTube, Historypin, iTunes U Contact the Education Staff Connect With Us Facebook X Instagram Tumblr YouTube Blogs Flickr Contact Us · Accessibility · Privacy Policy · Freedom of Information Act · No FEAR Act · USA.gov The U.S. National Archives and Records Administration 1-86-NARA-NARA or 1-866-272-6272 Top"
    },
    {
      "url": "https://volsteadlounge.wordpress.com/",
      "text": "Volstead Lounge – East Austin cocktail bar and lounge. Skip to content Volstead Volstead Lounge is a classic vintage cocktail lounge mixed with a little bit of east side dive bar. Volstead is the East Austin destination for cocktails, dj’s, dance parties, local pop-up markets, trivia, karaoke, live music, drag brunch, and creative events. Facebook / Instagram Open Hours Mon – Fri: 5:00 pm – 2 am Sat – Sun : 12:00 pm – 2:00 am Location 1500 E. 6th St Austin, TX 78702 USA Contact info@hotelvegasaustin.com Facebook Instagram Volstead Lounge , Blog at WordPress.com. Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy Subscribe Subscribed Volstead Lounge Sign me up Already have a WordPress.com account? Log in now. Volstead Lounge Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar Loading Comments... Write a Comment... Email (Required) Name (Required) Website Design a site like this with WordPress.com Get started"
    },
    {
      "url": "https://www.jax.org/about-us/our-leaders",
      "text": "Our Leaders - The Jackson laboratory Research & Faculty Education & Learning JAX® Mice & Services Personalized Medicine News About Us Give Research & Faculty Overview Locations Jax Mammalian Genetics - Maine Jax Genomic Medicine - Connecticut Faculty A-Z Labs A-Z Research Centers Scientific Services Data Science Tools & Resources Education & Learning Education & Learning Home Online Learning Courses In-Person and Online Learning In-Person & Virtual Online MicroLessons and MiniCourses Clinicians Course Offerings Clinical Resources Postbac, Ph.D., and Postdoctoral Programs Postbaccalaureate Training Cooperative Ph.D. Training At JAX Postdoctoral Associates Students & Teachers Science Fair Summer Student Program Fellowships Teacher Professional Development Genetics Learning Resources College Scholarship JAX® Mice & Services Find JAX® Mice Search JAX Mice Order JAX Mice Why JAX Mice Custom Model Generation Donate a Strain Find Cells and Tissues Human iPS Cells PDX Tumors Mouse Tissue Mouse Embryos & Sperm Mouse Embryonic Stem Cells Colony Management Services Breeding Services Cryopreservation Cryorecovery IVF Expansion Genome Scanning Preclinical Research Services Oncology Immunology Neurobiology Metabolic Cardiovascular Rare Disease Antibody Therapeutics Humanized Mice Surgical Services Consulting & Advisory Services Customer Resources Technical Support Quality Team Resource Center Events JAX Envision™ Personalized Medicine What is Personalized Medicine? Genetics vs. Genomics Ethical Considerations Personalized Medicine and You What is CRISPR? Mice in Biomedical Research Areas of Research Addiction Research Aging Research Alzheimer's and Other Dementias Cancer Diabetes Endometriosis Research at JAX Clinical Knowledgebase Advanced Precision Medicine Lab Maine Cancer Genomics Initiative News Newsroom News Releases JAX in the News Stories Videos JAX in Motion Minute to Understanding Search Magazine Subscribe About Us Fast Facts Our People & Culture Our Values Belonging at JAX Faces of JAX Our Leaders Work With Us Our History Our Campuses & Communities Our Impact Collaboration at JAX Our Medical Impact Our Economic Impact Our Community Impact Our Environmental Impact Careers Contact Us Give JAX Home Our Leaders About JAX About JAX Fast Facts Why mice for biomedical research? Why the mouse? FAQs Mighty Mice in Space People & Culture Faces of JAX Belonging at JAX Our Values in Action Campuses California Connecticut Japan Maine Impact Collaboration at JAX Our Community Impact Our Economic Impact Our Environmental Impact Our Medical Impact History History Timeline of The Jackson Laboratory Leaders Board of Trustees Chairs and Trustees Emeriti Honorary Trustees Leadership Team Board of Scientific Counselors Careers Contact JAX Executive Team Lon Cardon President and CEO JAX Executive Team As a nonprofit organization, JAX is governed by its Board of Trustees , which provides strategic direction, financial oversight and fundraising support. A Board of Scientific Counselors provides advice on the Laboratory's scientific activities, including research, education, training and genetic resources programs. The leadership team is comprised of senior leaders responsible for implementing JAX strategic priorities, and for administering all JAX functions. Mary Dickinson Executive Vice President and Chief Scientific Officer Meet Mary Mitchell Kennedy Executive Vice President,  JAX & President, JMCRS Meet Mitchell Doug Abbott Senior Vice President and Chief Financial Officer Meet Doug Dan Hoag Senior Vice President, General Counsel and Corporate Secretary Meet Dan Gina Rodriguez Senior Vice President of Advancement Meet Gina Emily Schorer Senior Vice President, Chief of Staff and Chief People Officer Meet Emily Contact Donate Subscribe Jax Home Careers Legal Information Research Centers Mouse Genome Informatics Mouse Phenome Database Leading the search for tomorrow's cures ©2025 The Jackson Laboratory Choose other country or region China Japan"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "text": "Board & Staff | Team Jack Foundation Follow Follow Follow Follow U Search  Shop w News w Blog Donate Search for: About Us About Us Our Mission Our History Jack Hoffman Board & Staff Financials Contact Us Our Impact Projects & Progress We Fund Nebraska Childhood Brain Tumor Program Scientific Advisory Board Apply for TJF Grant Research Articles Brain Cancer About Brain Cancer What is DIPG? Brain Cancer Facts Cancer Awareness Months Brain Tumor Awareness Month Childhood Cancer Awareness Month Family Resources Events Takedown the Tumor Gala Golf Classic An Evening with Henry Winkler Miles for Team Jack Radiothon Texas Golf Broken Chair Trophy View All Events Get Involved Fundraise Workplace Giving Host an Event Birthday Fundraiser Partner Memorials Give Our Sponsors Volunteer Heroes Donate Shop Blog Select Page About Us Team Jack Board and Staff Team Jack Board Members The Team Jack Foundation is a nonprofit under the leadership of a volunteer board of directors consisting of community and business leaders from around Nebraska and the country. The board meets monthly to discuss budgets, events and other news about the fight against childhood brain cancer. The expert guidance of our volunteer board consistently drives Team Jack to new heights. Rex Burkhead Rex Burkhead is a retired running back of the National Football League. Originally drafted by Cincinnati in the sixth round (190th overall) of the 2013 NFL Draft, Burkhead spent four seasons with the New England Patriots, before signing with the Texans prior to the 2021 season. He was a key offensive contributor each season for the Patriots and was a member of the Patriots 2018 Super Championship team, scoring the last two touchdowns during the thrilling overtime AFC Championship against the Kansas City Chiefs. Burkhead played college football at the University of Nebraska, which is where his story with Team Jack began. Rex has played an important part to the development and ongoing success of the Team Jack Foundation. Not only does Burkhead serve as a board member on the Foundation’s board of directors, but he was instrumental in the Foundation’s inception itself. Team Jack was formed to raise funds for pediatric brain cancer research. Its namesake is Jack Hoffman, a 18-year-old from Nebraska who has been battling the disease for most of his life. Hoffman and Burkhead formed an unlikely friendship when Burkhead was a star player at Nebraska that has continued to this day. Hoffman even won a “Best Moment” ESPY award when he entered Nebraska’s 2013 spring game and scored a 69-yard touchdown while sporting No. 22, Burkhead’s number during his college days. The two even met President Barack Obama together at the White House in 2013. Rex is from Plano, TX, where he currently resides with this wife, Danielle, and two sons, Jett and Steel. Karen Carson Karen Carson is a Co-founder of Fat Brain Toys, a retailer and manufacturer of educational toys and games. Karen’s introduction to the toy industry came about at the suggestion of her then 10-year old son, Adam. In the Fall of 2002, after finding it difficult to locate specialty toys online, her son suggested that she and her husband Mark build their own website to better serve the growing demand for toys online. Carson accepted the challenge from her son and thus began a new career in the toy industry. Since 2002, Fat Brain Toys has grown into one of the largest online toy stores in the country. Recognizing the importance of a true multi-channel experience, Fat Brain Toys has since expanded into brick & mortar retail, opening retail store experiences in Omaha, Nebraska and Overland Park, Kansas. In addition to the company’s direct-to-consumer efforts, the company also designs and wholesales it’s own line of products to over 2,000 retailers around the world. Fat Brain Toys is a frequent benefactor to a number of non-profit organizations that support the needs of children, including: Team Jack Foundation, Omaha Children’s Hospital Foundation, Royal Family Kids, The Toy Bank, and many others. Karen has been married to her husband and business partner, Mark, since 1992, and lives in Elkhorn, Nebraska. Karen and Mark have three children, Adam, Makenzie, and Jenna. Scott Fangman Scott Fangman has 20+ years of industry experience and is the Director of Business Development at Wealth Enhancement Group where he leads outreach to RIAs across the US. He was most recently as the Business Development Officer – M&A for Advisor Seekers, leading their markets and sales team. Scott joined Wealth Enhancement Group because of the shared purpose, mission, and values. Scott previously held regional leadership roles at TD Ameritrade Institutional, where he was recognized multiple times for his accomplishments in surpassing company goals. A Nebraska native, Scott currently resides in Omaha, NE with his wife Anne and their 2 (teenage!) children. When not working, Scott enjoys hiking and reading. Scott also serves on the Board of Directors for the Team Jack Foundation raising funds and awareness for pediatric brain cancer research – his son is a survivor. Dr. Kari Galyen Dr. Kari is originally from Pierce, NE. She went to the University of Nebraska. Dr. Kari Galyen is a general practice family physician. Dr. Galyen and her husband, Dr. Jim Galyen, own and operate Sunny Meadow Medical Clinic in Norfolk, Nebraska. Originally from Pierce, NE, Dr. Galyen attended the University of Nebraska Medical Center where she received her medical doctor (MD) degree. She then completed a dual internal medicine/family practice residency in Omaha and Kearney, NE. Dr. Galyen is a strong advocate for increased funding for child brain cancer research and was a guest speaker at the 2013 Team Jack Foundation Gala. She has a strong commitment to helping improve treatment options and overall survivorship for children facing the disease. Dr. Galyen is married to Dr. Jim Galyen and together they live in Atkinson, NE with their four children, Ainsley, Brody, Blake and Luke. Brianna Hoffman Brianna Hoffman is a pharmacist at West Holt Medical Services in Atkinson, NE. She is also the Co-Founder and Board Chair of the Foundation. To contact: Brianna@TeamJackFoundation.org Kenneth Maxwell Kenneth Maxwell is the co-founder and Vice President of Advertising for Proxibid.com, a privately held Nebraska based e-commerce Company serving more than a million buyers, and thousands of businesses, auction companies, and non-profit organizations worldwide. In his tenure with the company he has led multiple teams responsible for the design and development of their real-time auction platform, and more recently, led the expansion of the company’s marketing team to provide advertising and creative services to Proxibid and their clients. Prior to Proxibid, Kenneth was the creative director for another Nebraska based startup – Leftbid.com, and was also a professional artist, selling original art through Anderson O’Brien Fine Art Gallery in Nebraska. Kenneth studied fine art at the University of Nebraska – Lincoln, and abroad in Florence, Italy. He is classically trained in painting and sculpture and graduated from UNL with a degree in Fine and Performing Arts. Ken resides in Omaha with his wife Lynn, and two children, Kate and Harrison – as well as two black Labrador retrievers, Cira and Chloe, AKA – “the meatballs”. Tiffany Miller Tiffany Miller serves as Deputy General Counsel for First Bank & Trust, Brookings, SD. She has practiced in the banking and financial services industry for over 16 years, specializing in contract negotiation and compliance. Outside of the office, Tiffany is involved in a number of community activities. She serves on the board of directors for Downtown Sioux Falls, Inc., and is on the Sioux Falls Area Chamber of Commerce Community Appeals Committee. Tiffany is motivated to serve the Foundation by the grueling and potentially harmful treatments currently used to treat pediatric brain cancer patients and the dire need for more funding to support pediatric cancer research. In honor of Jack and all children who are called to the front lines in the battle against cancer, Tiffany is committed to the Team Jack mission of raising awareness and funds for pediatric cancer research. She and her family are proud to Take A Stand in the fight against brain cancer together with the Team Jack Foundation. Tiffany and her husband, Dr. Nate Miller, are parents to two young boys, Noah and Luke. Janae Simard Janae Simard is a Registered Dental Hygienist with Family and Implant Dentistry in Lincoln, NE, since 1997. Janae is an originating member of the Team Jack Foundation board and is committed to helping the organization fund pediatric brain cancer research. She was appointed secretary for the Team Jack Foundation in 2013. Janae and her husband Robby live in Omaha, Nebraska with their two boys, Eli and Luke. The Simard family is dedicated to helping the Team Jack Foundation improve treatment for children with brain tumors. Having endured their own family adversity with one of their own children, Janae is a compassionate leader who is known for being a “hands on” servant leader for the Foundation. Janae is active in her childrens’ school and devotes much of her spare time working with children. She enjoys traveling, scuba-diving and family activities. Mark Walz Mark was born and raised in Lincoln, Nebraska. He graduated Summa Cum Laude from Nebraska Wesleyan University in 1988 with a Bachelor of Science Degree in Economics and an emphasis in Accounting. Mark began his professional career in 1988 as an independent auditor with the international accounting firm of Touche Ross & Co. (now Deloitte) in their Lincoln, Nebraska office. His client focus was primarily the banking and insurance industries. In May of 1991, Mark left Deloitte to become the Accounting Manager at Farmers Mutual Insurance Company of Nebraska and has been employed in various positions of increasing responsibility with Farmers Mutual since that time. He was promoted to Controller in 1997; Treasurer in 1999; Vice President and Treasurer in 2002; Senior Vice President, Treasurer and Chief Financial Officer in 2006; Executive Vice President, Treasurer and Chief Operating Officer in 2009; President, Treasurer and Chief Operating Officer in 2010; President and Chief Executive Officer in 2014; and Chairman, President and Chief Executive Officer in 2015. Mark is a member of both the American Institute of Certified Public Accountants and the Nebraska Society of Certified Public Accountants. Mark serves on the Board of Directors of Farmers Mutual Insurance Company of Nebraska, National Association of Mutual Insurance Companies, Nebraska Property and Liability Insurance Guaranty Association, Nebraska Chamber of Commerce, United Way, Team Jack, Junior Achievement, and the US Bank Advisory Board. *Andy Hoffman (Board Chairman 2013 - 2021) Courageous. Passionate. Gregarious. Brave. Selfless. Spiritual. Unwavering. These are just a few of the words used to describe our Team Jack Foundation co-founder, Andy Hoffman. Tributes have poured in from around the country following Andy’s passing on Monday, March 1. Andy was shockingly diagnosed with glioblastoma multiforme, a rare and very aggressive cancer, after having a seizure while running on the Cowboy Trail, in his hometown of Atkinson, Nebraska, in July 2020. Even after getting this devastating news, Andy was more determined than ever to find ways to raise money for Team Jack. And fast, while he was still able. Following his diagnosis, the Team Jack Foundation launched the “Twice the Fight” campaign as a way to show support for both Jack and Andy Hoffman’s brain cancer battles. One of Andy’s first visions to raise money for Team Jack was to sell t-shirts, and this time selling “Twice the Fight” t-shirts saw nearly 3,000 sold for over $65,000 raised. Earlier in 2020, Andy worked hard to fulfill his New Year’s resolution and finished writing his first book, “Yards After Contact” which details the family’s experience during Jack’s fight. It was published in October 2020 and has been a huge success. From the beginning, Andy made one thing clear with his book: 100% of the proceeds for the book sales go to Team Jack and, Team Jack would own the copyright to the book. To date, over 2,500 books have been sold, raising nearly $80,000 for Team Jack. In the book, Andy writes: “This book is the mission statement for the Team Jack Foundation, a Nebraska business that tirelessly works daily to improve brain cancer treatment in its region and nationally fund child brain cancer research. I hope you can open this book and know Jack and what his foundation stands for.” In early December, both ESPN and BigTen Networks produced shows giving an update on the Hoffmans’ life with cancer. The ESPN E:60 story aired as part of programming highlighting the importance of cancer research during ESPN’s 14th consecutive V Week on Dec.1-12. Andy spoke with Chris Connelly about his fight and his hopes for the future of those fighting childhood brain cancer. “This is going to sound screwy, but it’s been a blessing,” he said. “We’re supposed to thank God for the challenges that he gives us, and I’ve prayed the thank-you prayer. Thank you, God, for giving me brain cancer. Because he knows what he’s doing. And you don’t.” Check off another chance for Andy to raise awareness of this disease. Andy always looked to seize every opportunity to raise awareness for childhood brain cancer and fund research from some of the brightest research minds in the country. Although the Hoffmans knew the research they were funding may not benefit their son Jack, he did it for all the families down the road that will receive the horrible diagnosis of pediatric brain cancer. Andy remained hopeful even when faced with the grim nature of his prognosis. Andy worked hard to squeeze more life into his 42 years than most get in a lifetime. He did a couple of bucket list items, including a New Mexico elk hunt with his kids, his wife, and brothers during the last months of his life. He kept his unwavering faith and spent every moment possible with his family. In mid-February, his condition progressed, and his fight ended on Monday, March 1, where he peacefully passed away at home surrounded by his loving family. He is survived by his wife Brianna, children Jack, Ava and Reese, parents Gary and Karen Hoffman of Spencer, brothers Tony (Amy) Hoffman of Crofton and Michael (Jacky) Hoffman of Spencer, sister Julia (Chris) Jones of Tellico Plains, TN, parents-in-law Kerry and Bonnie Stiner of Burke, SD, sister-in-law Tiffany (Nate) Miller of Sioux Falls, SD, brother-in-law Kollin (Sarah) Stiner of Lakeville, MN, nephews Nathan Hoffman of Spencer, Hudson and Hayden Hoffman of Spencer, Luke Jones of Cleveland, OH, Matt and Nate Jones of Clarksburg, MD, Noah, Luke and Graham Miller of Sioux Falls, SD, and Karson Stiner of Lakeville, MN, nieces Alison (Justin) Wegenke of Fort Collins, CO, Samantha (Cody) Kahl of Grand Island, NE, Lauryn and Amelia Hoffman of Spencer, and Isabel and Nora Stiner of Lakeville, MN. He was also excited to be a Great Uncle to Will and Wren Wegenke and Alton Kahl. He was preceded in death by his brother Luke Hoffman. The Team Jack Foundation is committed to working harder than ever to ensure Andy’s legacy shines, and his mission grows. He had big ideas and big dreams for the foundation, and we will focus on making those a reality. He is irreplaceable and his smile and energy will be missed. But we will always follow the path he set to be a success. And fight on in his honor. How lucky we all are to have known him. * * Tragically, Jack’s dad, Andy Hoffman, was diagnosed with brain cancer (glioblastoma) in July of 2020. He battled for seven months before passing away from the disease. The Team Jack Foundation is committed to upholding Andy’s legacy by working harder than ever to fund the cure for childhood brain cancer. Team Jack Staff Team Jack’s caring, driven staff is dedicated to ending childhood brain cancer by pushing Team Jack forward every day. Kylie Dockter, Executive Director Kylie (Tielke) Dockter joined the Foundation in August 2013 as the first full time employee for the Foundation and is excited to be part of the fight against pediatric brain cancer. Kylie received her Bachelor of Science degree in Journalism: Public Relations in December 2009 from the University of Nebraska at Kearney with a minor in Political Science and has strong qualifications in management, marketing and sales through educational and job experience. She has been involved in the non-profit sector for over thirteen years. Prior to the Foundation, Kylie was the Director of Marketing and then Executive Director of a non-profit that benefits nearly 50 non-profits in the Denver, CO metro area. In addition to management skills, she assisted in planning large scale events to raise money for these 50 non-profits. She joined the Team Jack Foundation in August 2013 as the Chief Development Director and is now the Executive Director of the Foundation. Working with a Foundation that has such an impact on children and children’s lives has truly been a career dream for Kylie, so she is very excited to join such a prestigious and impactful Foundation to help with their goals. She was born and raised in Atkinson, NE and is married to her husband Stuart Dockter who is originally from North Dakota and together they have a daughter, Graesyn, and a son, Hayes. To contact: kylie@teamjackfoundation.org Lindsey Nemetz, Director of Marketing Lindsey (Mlnarik) Nemetz, a native of Clearwater, Nebraska, earned her degree in Business Administration from Nebraska Wesleyan University in 2001. While at NWU, she was a member of the Prairie Wolves women’s basketball and softball teams from 1997 to 2001. Lindsey now lives in Atkinson with her husband, Chris, and their five children: Maci, Drake, Avery, Landri, and Brooke. After a six-year career in property and casualty insurance, Lindsey shifted her focus to raising her family. In October 2013, she began working for the Team Jack Foundation on a limited part-time basis. Over time, her role and passion for the mission grew, leading her to become the Foundation’s Director of Marketing in November 2018. She is deeply dedicated to helping find a cure for childhood brain cancer. To contact: lindsey@teamjackfoundation.org Shirley Rossman, Event Coordinator Shirley Rossman joined the Team Jack Foundation in August 2020, assisting with donation processing and merchandise shipping. Before that, she spent her career as an elementary school teacher, retiring from West Holt Public Schools in 2020. A lifelong resident of Atkinson, Shirley and her husband, Bruce, are proud parents of four grown daughters which includes a set of triplets, and grandparents to ten grandchildren. To contact: shirley@teamjackfoundation.org Make an impact through your inbox News, upcoming events and research updates delivered straight to your inbox. About Us Our Mission Jack Hoffman Board & Staff Fund Allocation Financials Our Impact Scientific Advisory Board Sponsored Grants Research Articles Brain Cancer Family Resources Cancer Awareness Months Get Involved Fundraise Give Events Our Sponsors Volunteer Follow Follow Follow Follow Follow © 2025 Team Jack Foundation. POB 607, 47640 US Highway 20, STE 2, Atkinson, NE, 68713. All Rights Reserved. Team Jack Foundation, Inc. is exempt from federal income tax under section 501(c)3, ID Number 46-2301134, of the internal revenue code. All contributions to the Foundation are tax deductible. Privacy Policy • Contact"
    },
    {
      "url": "https://www.thevolsteadjax.com/menu/",
      "text": "Menu - The Volstead Toggle navigation Home About Us Menu Events Private Party Contact Us Facebook Twitter Instagram Call To Action Speakeasy-style bar serving the best handcrafted cocktails in downtown jacksonville OUR STORY Menu Music. Culture. Passion Our seasonal menu of bespoke cocktails exclusively available at The Volstead – Jacksonville’s PREMIER Speakeasy Bar Location The Volstead 115 W Adams St. Jacksonville, FL 32202 team@thevolsteadjax.com Opening Hours Monday-Saturday 4:00PM – 2:00AM Sunday 4:00PM – 12:00AM Follow Us Facebook Instagram LINKS HOME ABOUT US MENU EVENTS PRIVATE PARTY CONTACT US Home About Us Menu Events Private Party Contact Us 115 W Adams St. Jacksonville, FL 32202 904-414-3171 Mon-Sat 4pm - 2am  |  Sun 7pm-2am © 2017 The Volstead. All rights reserved. Photo Credit | Ben Cross Photography"
    },
    {
      "url": "https://www.thevolsteadjax.com/about-us/",
      "text": "About Us - The Volstead Toggle navigation Home About Us Menu Events Private Party Contact Us Facebook Twitter Instagram Call To Action Speakeasy-style bar serving the best handcrafted cocktails in downtown jacksonville OUR STORY About Us THE VOLSTEAD ACT The Volstead gets its name from The Volstead Act, co-written and sponsored by Congressman Andrew Volstead, which enacted Prohibition in the United States in 1919. Considered one of America’s biggest mistakes, the act was later repealed in 1933 but the era would forever leave its mark on history. So why open a prohibition-style lounge in Downtown Jacksonville, you might ask? It’s not every day that a group of young entrepreneurs can influence and be a part of the revival of one of America’s largest cities. Why not throwback to an era of elegance, prosperity, and change? To a time in which life felt like it was moving in fast forward, back when youth and culture were first celebrated and in the most prosperous and exciting period this city had ever seen. We here at The Volstead are striving to revive this time of elegance and intimacy, as we turn down the house music and let you guys talk to each other while an old jazz album plays in the background. We want to bring back the art and craft of classic cocktails. We tossed the chemical flavored booze, got the largest collection of small-batch whiskey our shelves could hold and hit the farmer’s market looking for interesting ingredients and pairings rarely seen in a glass. Let us give you a feel of what was happening behind closed doors in our own river city almost one hundred years ago. We hope you sit back, relax, and let us take your senses back to what was once good, and as it turns out, still is. So why you ask? Why the hell not? -THE VOLSTEAD- 01 MENU 02 EVENTS 03 MASTERCLASSES 04 BOOK A PRIVATE PARTY Location The Volstead 115 W Adams St. Jacksonville, FL 32202 team@thevolsteadjax.com Opening Hours Monday-Saturday 4:00PM – 2:00AM Sunday 4:00PM – 12:00AM Follow Us Facebook Instagram LINKS HOME ABOUT US MENU EVENTS PRIVATE PARTY CONTACT US Home About Us Menu Events Private Party Contact Us 115 W Adams St. Jacksonville, FL 32202 904-414-3171 Mon-Sat 4pm - 2am  |  Sun 7pm-2am © 2017 The Volstead. All rights reserved. Photo Credit | Ben Cross Photography"
    },
    {
      "url": "https://www.sportingjax.com/front-office/",
      "text": "Front Office - Sporting JAX Skip to primary navigation Skip to main content Network #UnitedForSoccer Gainbridge Super League USL Championship USL League One USL League Two USL W League USL Academy USL Corporate Gainbridge Super League USL Championship USL League One USL League Two USL W League USL Academy USL Corporate Gainbridge Super League Brooklyn FC Carolina Ascent FC Dallas Trinity FC DC Power Football Club Fort Lauderdale United FC Lexington SC Spokane Zephyr FC Sporting JAX Tampa Bay Sun FC Go to GainbridgeSuperLeague.com USL Championship Birmingham Legion FC Charleston Battery Colorado Springs Switchbacks FC Detroit City FC El Paso Locomotive FC Hartford Athletic Indy Eleven Las Vegas Lights FC Lexington SC Loudoun United FC Louisville City FC Miami FC Monterey Bay FC New Mexico United North Carolina FC Oakland Roots SC Orange County SC Phoenix Rising FC Pittsburgh Riverhounds SC Rhode Island FC Sacramento Republic FC San Antonio FC Tampa Bay Rowdies FC Tulsa Future Teams Atlético Dallas Brooklyn FC Milwaukee Pro Soccer OKC Energy FC Santa Barbara Sky FC Sporting JAX USL Pro Iowa a b c d e f g h i j k l m n o p q v w x y z Go to USLChampionship.com USL League One AV Alta FC Charlotte Independence Chattanooga Red Wolves SC FC Naples Forward Madison FC Greenville Triumph SC One Knox SC Portland Hearts of Pine Richmond Kickers South Georgia Tormenta FC Spokane Velocity FC Texoma FC Union Omaha Westchester SC Expansion Teams Athletic Club Boise Corpus Christi FC Fort Lauderdale United FC Fort Wayne FC New York Cosmos Sarasota Paradise Sporting Cascades FC a b c d e f g h i j k l m n o p q v w x y z Go to USLLeagueOne.com USL League Two AC Connecticut AC Houston Sur Academica SC AFC Ann Arbor AHFC Royals Akron City FC Albany Rush ALBION SC Colorado Almaden FC AMSG FC Annapolis Blues FC Apotheos FC Arizona Arsenal SC Asheville City SC Athens FC Ballard FC Bavarian United SC Bigfoot FC Birmingham Legion FC 2 Black Rock FC Brevard SC Boston Bolts Boston City FC Brave SC Brooke House FC Capo FC Cedar Stars Rush Charlotte Eagles Charlotte Independence 2 Charlottesville Blues FC Chicago City SC Chicago Dutch Lions Christos FC City SC CISA Cleveland Force SC Coachella SC Colorado Storm Columbus United FC Corpus Christi FC Dayton Dutch Lions Davis Legacy SC Delaware FC Denton Diablos Des Moines Menace Dothan United East Atlanta FC Eagle FC Erie Sports Center FC Buffalo FC Motown FC Tucson FC Olympia Flatirons FC Flint City Bucks Florida Elite Soccer Academy Fort Lauderdale United FC Fort Wayne FC GFI Hattiesburg FC Hill Country Lobos Houston FC Hudson Valley Hammers Inter Gainesville KF Ironbound SC Kalamazoo FC Kings Hammer FC Columbus Kings Hammer Lane United FC Lansing City Football Laredo Heat SC Lexington SC Lionsbridge FC Little Rock Rangers Lonestar SC Long Island Rough Riders Louisiana Krewe FC Manhattan SC Miami AC Marin FC McKinney Chupacabras FC Midlakes United Midwest United FC Minneapolis City SC Mississippi Brilla FC Monterey Bay FC 2 Morris Elite New England FC New Jersey Copa FC New Mexico United U23 Nona FC North Carolina FC U23 Northern Indiana FC Northern Virginia FC Oakland County FC Ocean City Nor'Easters Pathfinder FC Patuxent Football Athletics Peoria City Philadelphia Lone Star Portland Bangers FC Project 510 Reading United AC Real Central NJ Redlands FC Red River FC River Light FC RKC Third Coast Rochester FC Saint Charles FC Salem City FC San Francisco City FC San Francisco Glens SC San Juan SC Santafé Wanderers Sarasota Paradise Seacoast United Phantoms Snohomish United South Carolina United Bantams Southern California Eagles Southern Soccer Academy Springfield FC St. Croix Legends St. Petersburg FC Stars FC Staten Island Athletic SC St. Louis Ambush Steel City FC Sueño FC Sunflower State FC Swan City FC Tacoma Stars Tennessee SC Thunder Bay Chill Tobacco Road FC Toledo Villa FC Twin City Toucans FC Union FC Macomb United PDX USL to Lynchburg Utah Avalanche Utah United Ventura County Fusion SC Vermont Green FC Virginia Beach United Virginia Marauders FC Wake FC West Chester United SC West Seattle Junction FC West Virginia United Westchester Flames FC Western Mass Pioneers Weston FC a b c d e f g h i j k l m n o p q v w x y z Go to USLLeagueTwo.com USL W League AFC Ann Arbor AC Connecticut AC Houston Sur Academica SC AHFC Royals ALBION SC Colorado AMSG Fútbol Club Asheville City SC Athens United Annapolis Blues FC Bavarian United SC Bigfoot FC Birmingham Legion WFC Brevard Riptide Brooke House FC California Storm Capistrano FC Carolina Ascent FC Cedar Stars Challenge SC Charlotte Eagles Charlottesville Blues FC Chattanooga Red Wolves SC Chicago City SC Chicago Dutch Lions FC Christos FC CISA Cleveland Force SC Colorado Storm Dayton Dutch Lions FC Detroit City FC Eagle FC Erie Sports Center Fayetteville Fury FC Buffalo FC Olympia Flatirons FC Flint City AFC Florida Elite Soccer Academy Flower City 1872 Fort Lauderdale United FC Greenville Liberty SC Hudson Valley Crusaders Indy Eleven Kalamazoo FC King's Hammer FC Lancaster Inferno Lane United FC Lexington SC Lonestar San Antonio Long Island Rough Riders Manhattan SC Marin FC Miami AC Midwest United FC Minnesota Aurora FC Morris Elite SC NC Courage U23 NJ Copa FC North Carolina Fusion Northern Virginia FC Oakland Soul SC OC Sporting FC Olympic Club One Knoxville Paisley Athletic FC Palm City Americanas Patuxent Football Athletics Pittsburgh Riveters SC Pleasanton Rage Port City FC Racing Louisville FC Richmond Ivy SC River Light FC RKC Third Coast Rochester FC Salmon Bay FC San Antonio Athenians SC San Francisco Glens SC San Juan SC Sioux Falls City FC South Carolina United FC Southern California Dutch Lions FC South Georgia Tormenta FC Southern Soccer Academy St. Charles FC Steel City FC Stockton Cargo SC Swan City SC Tacoma Galaxy Tallahassee Reckoning Tennessee SC Toledo Villa FC United PDX Union FC Macomb USL W League Madison Utah United Virginia Atlantic FC Virginia Beach United Virginia Marauders FC Wake FC a b c d e f g h i j k l m n o p q v w x y z Go to USLWLeague.com USL Academy Go to USL-Academy.com Sporting JAX Bringing professional soccer to Jacksonville Menu Menu Tickets Gainbridge Super League Season Tickets Single Match Tickets Premium Seating Luxury Field Suites Group Tickets and Fan Experiences USL Championship Tickets FAQ Request Season Ticket Info Schedule Gainbridge Super League Theme Nights Team Roster Technical Staff Statistics Our Club About Us Front Office About Gainbridge Super League About USL Championship Pre-Pro Teams About USL W League About USL League Two Academy Careers Contact Us Matchday Hodges Stadium Know Before You Go Matchday Parking Fan Code of Conduct Venue Map Supporters Groups Media Credentials Fanzone Events Sporting JAX Content Contests and Giveaways Sporting JAX Hub Contest & Promotion Rules Shop News Latest News Media Coverage Community Sporting JAX Foundation 50/50 Raffle 50/50 Raffle Rules Business Alliance Business Luncheon Partners Volunteer Youth Soccer Directory PURCHASE Season TicketS EXECUTIVE LEADERSHIP Steve Livingstone Club President and CEO Tony Allegretti Chief Community Officer J.J. Keitzer Chief Financial Officer Bob Ohrablo Special Advisor to the President TECHNICAL STAFF Mark Warburton Head of Soccer, Sporting Director Steve Fell Head of Sports Performance Stacey Balaam Head Coach, Gainbridge Super League Alan Kirkup Associate Head Coach, Gainbridge Super League Mat Cosgriff Goalkeeper Coach, Gainbridge Super League MARKETING AND COMMUNICATIONS David Phillips Director of Marketing and Brand Riley Platt Fan Engagement Coordinator Molly Springer Media Communications Specialist TICKETS Jack Gonzalez Director of Tickets Sales and Service Henry Olivas Ticket Operations Manager and CRM Analyst Andrew Klimek Senior Account Executive Alex Halloran Account Executive BROADCASTING Cole Pepper Director of Broadcasting and Digital Content Emerson Burris Club Reporter and Digital Producer PARTNERSHIPS Kiernan Schindler Director, Business Development + Corporate Partnerships Sara Garcia-Malone Director, Business Operations Peter Gillcrist Manager, Partnerships Sales Grace Genest Partnership Marketing Coordinator OPERATIONS Marshall Happer Head of Operations Eric Turner Manager, Operations and Community Relations Keneil Gibbs Manager, Equipment Mikaela Sites Player Care & Liaison Officer MERCHANDISE Anthony Ortiz Merchandise Manager Presented By JOIN THE CLUB: BECOME A FREE MEMBER By clicking subscribe, you are agreeing to the USL privacy policy and agree to receive emails from USL. View Sporting JAX Competition & Promotion Rules X Instagram Facebook YouTube Tickets News Sporting JAX FanZone USL Corporate USL Terms of Use USL Privacy Policy Do Not Sell My Information This website is powered by SportsEngine's Sports Relationship Management (SRM) software, but is owned and subject to the USL privacy policy. © 2025 SportsEngine. Inc."
    },
    {
      "url": "https://dtjax.com/poi/the-volstead/",
      "text": "The Volstead – Downtown Jacksonville Visit Visit Overview Dining Bars & Nightlife Hotels Shopping Arts & Culture Sports Parks & Riverfront Jacksonville Riverwalk Events & Meeting Spaces Services Anchor Institutions Tours Experiences Live Work Invest Donate Events Map Parking & Transit Downtown History Shop #DTJax e-Gift Card Blog Downtown Jacksonville Events Map Parking & Transit Downtown History Shop #DTJax e-Gift Card Blog Visit Visit Overview Dining Bars & Nightlife Hotels Shopping Arts & Culture Sports Parks & Riverfront Jacksonville Riverwalk Events & Meeting Spaces Services Anchor Institutions Tours Experiences Live Work Invest Donate Back To Map The Volstead $$ The Volstead $$ 115 W. Adams St., Jacksonville, FL 32202 (904) 274-2832 Visit Website About So why open a prohibition-style lounge in Downtown Jacksonville, you might ask? It’s not every day that a group of young entrepreneurs can influence and be a part of the revival of one of America’s largest cities. Why not throwback to an era of elegance, prosperity, and change? To a time in which life felt like it was moving in fast forward, back when youth and culture were first celebrated and in the most prosperous and exciting period this city had ever seen. We here at The Volstead are striving to revive this time of elegance and intimacy, as we turn down the house music and let you guys talk to each other while an old jazz album plays in the background. We want to bring back the art and craft of classic cocktails. Event Booking Information: Available for private events and parties. Capacity: 150 Booking Contact: Hana Ferguson Marketing and Events 904.417.7780 team@thevolsteadjax.com Hours Monday-Saturday: 4 p.m. – 2 a.m. Sunday : 4 p.m. -  12 a.m. Category Bars & Nightlife Events & Meeting Spaces Tags Alcohol Directions Print Category Bars & Nightlife Events & Meeting Spaces Tags Alcohol Visit Live Work Invest Donate Events Map Parking & Transit Downtown History Shop #DTJax e-Gift Card Blog Downtown Vision Inc. About Downtown Vision Board Staff Opportunities Meeting Space Rental Downtown Ambassadors Research PlacemakingJax Our Events First Wednesday Art Walk OLD Third Thursday Sip and Stroll DTJax Awards DTJax Gala Connect Meeting Notifications Quarterly Stakeholder Meeting Media Pay DVI Downtown Vision, Inc. 29 W. Duval St. Jacksonville, FL 32202 Contact Us Terms & Conditions Report An Issue Site powered by Wingard Downtown Jacksonville Join Our Newsletter ©2025 Downtown Vision, Inc. All Rights Reserved."
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    },
    {
      "url": "https://www.thevolsteadjax.com/contact-us/",
      "text": "Contact Us - The Volstead Toggle navigation Home About Us Menu Events Private Party Contact Us Facebook Twitter Instagram Call To Action Speakeasy-style bar serving the best handcrafted cocktails in downtown jacksonville OUR STORY Contact Us We are identifiable by a sign that reads “Jax Post” Email team@thevolsteadjax.com Address 115 W Adams St. Jacksonville, FL 32202 Get in Touch Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number * Subject Comment or Message * Website Submit Location The Volstead 115 W Adams St. Jacksonville, FL 32202 team@thevolsteadjax.com Opening Hours Monday-Saturday 4:00PM – 2:00AM Sunday 4:00PM – 12:00AM Follow Us Facebook Instagram LINKS HOME ABOUT US MENU EVENTS PRIVATE PARTY CONTACT US Home About Us Menu Events Private Party Contact Us 115 W Adams St. Jacksonville, FL 32202 904-414-3171 Mon-Sat 4pm - 2am  |  Sun 7pm-2am © 2017 The Volstead. All rights reserved. Photo Credit | Ben Cross Photography"
    },
    {
      "url": "https://thevolsteadwv.com/",
      "text": "The Volstead The Volstead Room of the Hale Street Center The Volstead Room \nof the \nHale Street Center The Volstead Room \nof the \nHale Street Center The Volstead Room \nof the \nHale Street Center Home Gallery The Volstead Room of the Hale Street Center The Volstead Room \nof the \nHale Street Center The Volstead Room \nof the \nHale Street Center The Volstead Room \nof the \nHale Street Center Home Gallery More Home Gallery Home Gallery Delicious Food, amazing drinks and Friendly Atmosphere Delicious Food, amazing drinks and Friendly Atmosphere Delicious Food, amazing drinks and Friendly Atmosphere Delicious Food, amazing drinks and Friendly Atmosphere Join us for a drink! Visit Us About Us Weekends We are currently just opened Friday and Saturday nights for your enjoyment. See below for each night. Friday Night We are starting to book some live music on Friday evenings. Come and enjoy the atmosphere. We are also the only bar currently in the state of WV that has the Orange Door Entertainment System as seen on Bar Rescue. When live music isn't playing, we play music videos the rest of the night. Saturday Night Every Saturday night is karaoke night. Grab you a bite to eat and enjoy our amazing karaoke system, while you may win prizes. Karaoke starts at 9. Don't miss this great night out in Charleston! ordering Buttons Hello. Click button to order food YOUR way! DoorDash DELIVERY Doordash pickup The Volstead room online ordering Gift Cards Send a gift card to friends and family or buy it now for your future use. Buy Now We're Hiring! Join our crew! Entry level and management positions available. Apply Now Name Phone Email* Attach Resume Attachments (0) Submit Application This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Social Contact Us Send a Message Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Grab a Drink! Don't just read about us, come on in and have our bartenders make you the perfect cocktail! We are in the basement of the Hale Street Center! The Volstead 209 Dickinson Street, Charleston, West Virginia 25301, United States 304-610-5993 Hours Tuesday: closed Wednesday: closed Thursday: closed Friday: 6pm - 2am Saturday: 6pm - 2am Sunday: closed Get directions Copyright © 2025 The Volstead - All Rights Reserved. Powered by Gallery This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.volstead.co.nz/contact/",
      "text": "Contact :: Volstead Trading Company Home Online store Food Menu Brewery Contact Terms & Conditions Off Licence Privacy Policy About us More Cart 0 0.00 NZD Menu Contact information 55 Riccarton Road, Christchurch 8011 Phone: 022-417-4304 Email: info@volstead.co.nz Please phone or email us if you would like to make a booking. Usual opening hours: Mon 4pm - 8pm Tues - Thurs 4pm - 10pm Fri 2pm - 10pm Sat 2pm - 10pm Sunday 2pm - 8pm JBPP Limited, trading as Volstead Trading Co (off licence number 60/OFF/25/2020) All rights reserved 2020 Powered by Webnode Cookies We use cookies to enable the proper functioning and security of our website, and to offer you the best possible user experience. Accept only necessary Accept all Advanced settings You can customize your cookie preferences here. Enable or disable the following categories and save your selection. Essential cookies Save"
    },
    {
      "url": "https://www.senate.gov/artandhistory/history/minute/Volstead_Act.htm",
      "text": "U.S. Senate: The Senate Overrides the President's Veto of the Volstead Act Skip Content Find Your Senators Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming MENU SENATORS Contact Your Senators Leadership & Officers Former Senators Qualifications & Terms of Service Facts & Milestones States in the Senate COMMITTEES Membership & Assignments Hearings & Meetings History LEGISLATION & RECORDS Bills, Acts, & Laws Nominations Treaties Votes Floor Proceedings Rules & Procedure Landmark Legislation Sessions of Congress Senate Archives Public Disclosure ART & ARTIFACTS Collection Search Fine Art Decorative Art Historical Images Historical Artifacts Thematic Collections Exhibitions & Publications ABOUT THE SENATE Officers & Staff Vice President President Pro Tempore Secretary of the Senate Sergeant at Arms Party Secretaries Chaplain Committee & Office Staff Pages Powers & Procedures Censure Declarations of War Expulsion Filibuster & Cloture Impeachment Investigations Nominations Rules Treaties Voting Origins & Foundations The Senate & the Constitution Electing & Appointing Senators Committee System Idea of the Senate Parties & Leadership Parties & Leadership Historic Buildings & Spaces The Capitol Senate Chamber Historic Rooms Senate Office Buildings Congressional Meeting Places Past Senate Chambers Traditions & Symbols Oral History Project Historical Highlights 1787-1800 1801-1850 1851-1877 1878-1920 1921-1940 1941-1963 1964-present Senate Stories Blog Research Tools The Senate Overrides the President's Veto of the Volstead Act October 28, 1919 On October 28, 1919, the United States Senate voted 65 to 20 to override President Woodrow Wilson’s veto of the Volstead Act. Since the House had also voted to override the veto, America entered the Prohibition era. The movement to prohibit alcoholic beverages had been underway for a century, led by the Women's Christian Temperance Union and the Anti-Saloon League. These groups formed a powerful single-issue coalition that relentlessly lobbied local, state, and federal governments. When the states began enacting laws to prohibit the manufacture and sale of intoxicating beverages, the temperance societies stepped up the pressure on Congress. In 1917 Congress sent the Eighteenth Amendment , known as the Prohibition Amendment, to the states with a seven-year deadline for passage—the first amendment to have a time restriction. Within 13 months, the states had ratified it. The Eighteenth Amendment banned but did not define “intoxicating liquors.” Some of the members of Congress who had voted for the amendment assumed that it referred to hard liquor and would exempt beer and wine. But the head of the Anti-Saloon League drafted a tough enforcement act, which was then sponsored by the chairman of the House Judiciary Committee, Minnesota representative Andrew Volstead. The National Prohibition Act, better known as the Volstead Act, defined an intoxicating beverage as anything that contained more than one half of one percent alcohol. By contrast, Canadian prohibition laws set the limit at 2.5 percent. The Volstead Act made it illegal to “manufacture, sell, barter, transport, import, export, deliver, furnish, or possess” such beverages. The Eighteenth Amendment provided that the “Congress and the several states” would have power to enforce Prohibition by legislation, but the sweeping Volstead Act left the states no room for local option or any other flexibility. Ironically, the law called for a vast increase in the federal government’s intervention in society just as “limited government” advocates were coming into office. Prohibition corresponded with the presidencies of Warren G. Harding, Calvin Coolidge, and Herbert Hoover, and with a parsimonious Congress that was reluctant to appropriate sufficient funds for effective enforcement of the Volstead Act. The result was a decade of lawlessness, with citizens flouting the law at speakeasies and bootleggers corrupting public officials. On Capitol Hill, a rumrunner known as “The Man in the Green Hat” operated freely out of the Senate office building. By 1932, polls showed that the great majority of Americans believed that Prohibition had failed. The repeal of Prohibition became a popular campaign theme for Franklin D. Roosevelt, and the Twenty-First Amendment , which was approved soon after he swept into the presidency, finally nullified the misguided Volstead Act. Officers & Staff Vice President President Pro Tempore Secretary of the Senate Sergeant at Arms Party Secretaries Chaplain Committee & Office Staff Pages Powers & Procedures Censure Declarations of War Expulsion Filibuster & Cloture Impeachment Investigations Nominations Rules Treaties Voting Origins & Foundations The Senate & the Constitution Electing & Appointing Senators Committee System Idea of the Senate Parties & Leadership Historic Buildings & Spaces The Capitol Senate Chamber Historic Rooms Senate Office Buildings Congressional Meeting Places Past Senate Chambers Traditions & Symbols Oral History Project Historical Highlights 1787-1800 1801-1850 1851-1877 1878-1920 1921-1940 1941-1963 1964-present Senate Stories Blog Research Tools Senate Historical Office Information provided by the Senate Historical Office . Questions about Senate History? Email a Senate historian . Biographical Directory The Directory provides information about former and current senators. SENATORS Contact Leadership & Officers Former Senators Qualifications & Terms of Service Facts & Milestones States COMMITTEES Membership & Assignments Hearings & Meetings History LEGISLATION & RECORDS Bills, Acts, & Laws Nominations Treaties Votes Floor Proceedings Rules & Procedure Landmark Legislation Sessions of Congress Senate Archives Public Disclosure ART & ARTIFACTS Fine Art Decorative Art Historical Images Historical Artifacts Thematic Collections ABOUT THE SENATE Officers & Staff Powers & Procedures Origins & Foundations Parties & Leadership Historic Buildings & Spaces Traditions & Symbols Oral History Project Historical Highlights Senate Stories Blog Research Tools Contact | Content Responsibility | Usage Policy | Privacy Policy | Employment & Internships | Procurement | www.senate.gov"
    },
    {
      "url": "https://mspmag.com/locations/Volstead-s-Emporium/",
      "text": "Volstead's Emporium - Mpls.St.Paul Magazine Skip to main content Search News & Features Things to Do Weddings Our Events Newsletters The Lists facebook twitter linkedin pinterest instagram RSS Home Find It Restaurants Health Things To Do More... News & Features Eat & Drink Foodie The Feed Best Restaurants Find Restaurants Restaurant Week Northern Char Arts & Culture The Scene Calendar Kids & Family Shop & Style Fashionopolis Home & Design RAVE Artisan Home Tour Health & Fitness Find Doctors Find Dentists Find Clinics/Hospitals Care Chronicles Just Wondering Travel & Visitors Explore Minnesota Kids & Family Weddings Our Events MSPTV Subscribe Subscribe & Save Give a Gift Update Your Address Customer Service FAQ Newsletters Newsletters Home Volstead's Emporium Volstead's Emporium 711 W. Lake St. , Minneapolis , Minnesota 55408 Print Map Nearby Nearby Events Address 711 W. Lake St. , Minneapolis , Minnesota 55408 Phone 612-259-7891 Neighborhoods LynLake , Minneapolis , Uptown Meals Served Dinner Price $$ Cuisine American Details Entertainment , Late Night Dining , Private Dining There's no website, and no front door to this speakeasy in LynLake. Head to the back parking lot and find the door with the red light, descend for Prohibition era cocktails and light dinner plates in a small but well-turned space with curtained booths and secret rooms. Claim this listing: yourprofile@mspmag.com Back to Search Results Tags Locations Print Written About Photographs by Kevin J. Miyazaki, Caitlin Abrams, Ashley Sullivan, and Eliesa Johnson Best New Restaurants 2016 Our annual critics' picks of the hottest new restaurants in the Twin Cities, plus the 30-plus dishes, drinks, and desserts you should try at these spots when you go. Oct 31, 2016 Find it in the Twin Cities Restaurants Health Calendar More... © Key Enterprises LLC All rights reserved Channels Eat & Drink Arts & Culture Shop & Style Home & Design Health & Fitness Travel & Visitors Weddings Find It Company Info About Us Contact Us Careers Media Kit Internships RSS Feed Privacy Policy Terms of Service Subscriptions Subscribe & Save Now Give a Gift Update Your Address Customer Service FAQ Find Us on Newsstands Awards & Plaques facebook twitter pinterest instagram RSS Key Enterprises LLC is committed to ensuring digital accessibility for mspmag.com for people with disabilities. We are continually improving the user experience for everyone, and applying the relevant accessibility standards. ] Built with Metro Publisher™ Cookie Settings"
    }
  ]
}