{
  "fuentes": [
    {
      "url": "https://thousandtrails.com/about-us/contact-us",
      "email": "media_inquiries@equitylifestyle.com"
    },
    {
      "url": "https://www.lakelandhillsymca.net/contact/",
      "email": "membership@lhymca.com"
    },
    {
      "url": "https://www.easthillshotel.com.au/contact/",
      "email": "info@easthillshotel.com.au"
    },
    {
      "url": "https://www.shacademy.org/contact-us",
      "email": "admissions@shacademy.org"
    },
    {
      "url": "https://www.shacademy.org/contact-us",
      "email": "summerschool@shacademy.org"
    }
  ],
  "mails": [
    "admissions@shacademy.org",
    "info@easthillshotel.com.au",
    "media_inquiries@equitylifestyle.com",
    "membership@lhymca.com",
    "summerschool@shacademy.org"
  ],
  "nombre_sitio": "thousandtrails.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://thousandtrails.com/about-us/contact-us",
      "text": "Thousand Trails: Contact Us My Reservations Member Login Contact Want to book a nightly, weekly, or seasonal stay? For guest reservations, please call the Contact Center during business hours at (877) 570-2267 . Contact Center Hours: Mon — Fri: 8am to 8pm | Sat, Sun: 9:30am to 6pm EST Already a Thousand Trails Member? Please call member services at (800) 388-7788 or login to contact member services online. Member Services Contact Center Hours: Mon – Fri: 7am to 7pm | Sat, Sun: 8:30am to 5pm CST Have a question about Thousand Trails campgrounds or memberships? Fill out the form below or call (800) 205-0606 (Mon — Fri: 8am to 8pm | Sat, Sun: 9:30am to 6pm EST). * Denotes required field First Name * Last Name * Email Address * Phone Number Mobile Number Member Number (if applicable) Type of Request * ---Please Select-- Interested in Purchasing a Membership Question about My Membership Question about a Property Compliments/Complaints Questions / Comments Thousand Trails About Us All Careers Sales Careers Our Commitment Contact Us Discover Campgrounds Camping Pass Cabin Pass Groups & Special Events TrailBlazer Magazine Free Camping Directory 100 Days of Camping Follow Us © 2025 MHC Property Management, L.P. Privacy Policy Terms of Service Do Not Sell My Personal Information Ask how you can camp all year long with our Thousand Trails Memberships! Our Thousand Trails memberships are offered by MHC Thousand Trails Limited Partnership, Two North Riverside Plaza, Suite 800, Chicago, IL 60606. This advertising is being used for the purpose of soliciting sales of resort campground memberships. This document has been filed with the Department of Licensing, State of Washington as required by Washington Law. Value, quality or conditions stated and performance on promises are the responsibility of the operator, not the Department. The filing does not mean the Department has approved the merits or qualifications of any registration, advertising, or any gift or item of value as part of any promotional plan. × Purchase a Camping Pass My Reservations My Reservations Home Campground Search Long-Term Stays Explore Memberships Cabin Pass Groups & Special Events Reservations Contact Us Resources RV/Site Standards & Guidelines Member Rules Winter Differently /index.php?option=com_resorts&task=member.trips My Reservations Look up a reservation to review, modify, or cancel. Confirmation Number Arrival Date Find Reservation Enter PIN to login to your Thousand Trails Membership Member Number PIN Forgot your PIN? Remember Me Login Member Login Member Number PIN Forgot your PIN? Remember Me Login Please Complete This Challenge Submit Cancel"
    },
    {
      "url": "https://www.lakelandhillsymca.net/contact/",
      "text": "Contact - Lakeland Hills Family YMCA Skip to content LAKELAND HILLS FAMILY Y LAKELAND HILLS FAMILY Y MENU LAKELAND HILLS FAMILY Y Search for: JOIN REGISTER GIVE Toggle Navigation About Who We Are Leadership Team Employment at the Y Financial Reports Facility Information Child Protection Privacy Policy Join Join the Y Membership Benefit Corporate Membership Financial Assistance Give Give Fit For The Future Endowment Volunteer Donors & Partners Programs Programs Overview Adult Sports Adult Sports Overview Adult Basketball Adult Pickleball Adult Sports Leagues Adult Volleyball Certification Courses Childcare & Camps Childcare and Camps Child Watch (Babysitting) Infant & Toddler Care Kids Club Before and After School Care Preschool & Pre-K Summer Camp Rockaway River Country Club Camp Health & Wellness Health & Wellness Overview Active Older Adults Adaptive Programs Group Exercise Adult Healthy Living Programs Personal Training Swimming Swim Overview Adaptive Swim Adult Swim Lessons & Aquatic Exercise Competitive Swim Team Drowning Elimination Parent & Child Water Safety Youth Swim Lessons Youth & Teen Programs Youth & Teen Programs Overview Fit Kids Personal Training Fun & Fitness Preschool Youth Gaming Club STEM Teen Leaders Youth & Teen Special Events Teen Programs Youth & Teen Sports Youth & Teen Sports Overview Basketball Soccer Indoor Youth Leagues Dance Snowboarding Parkour Schedules Events Special Events Youth & Teen Special Events Kids Night Out Annual Golf Outing Annual Dinner Meeting Birthday Parties Turkey Trot Contact More Annual Dinner Meeting Community Engagement Rentals at the Y Vendors & Suppliers News & Media Member Login X CLOSE Toggle Navigation About Who We Are Leadership Team Employment at the Y Financial Reports Facility Information Child Protection Privacy Policy Join Join the Y Membership Benefit Corporate Membership Financial Assistance Give Give Fit For The Future Endowment Volunteer Donors & Partners Programs Programs Overview Adult Sports Adult Sports Overview Adult Basketball Adult Pickleball Adult Sports Leagues Adult Volleyball Certification Courses Childcare & Camps Childcare and Camps Child Watch (Babysitting) Infant & Toddler Care Kids Club Before and After School Care Preschool & Pre-K Summer Camp Rockaway River Country Club Camp Health & Wellness Health & Wellness Overview Active Older Adults Adaptive Programs Group Exercise Adult Healthy Living Programs Personal Training Swimming Swim Overview Adaptive Swim Adult Swim Lessons & Aquatic Exercise Competitive Swim Team Drowning Elimination Parent & Child Water Safety Youth Swim Lessons Youth & Teen Programs Youth & Teen Programs Overview Fit Kids Personal Training Fun & Fitness Preschool Youth Gaming Club STEM Teen Leaders Youth & Teen Special Events Teen Programs Youth & Teen Sports Youth & Teen Sports Overview Basketball Soccer Indoor Youth Leagues Dance Snowboarding Parkour Schedules Events Special Events Youth & Teen Special Events Kids Night Out Annual Golf Outing Annual Dinner Meeting Birthday Parties Turkey Trot Contact More Annual Dinner Meeting Community Engagement Rentals at the Y Vendors & Suppliers News & Media Member Login REGISTER HERE Give Search for: Contact 2025-08-25T10:48:20-06:00 Contact Us Lakeland Hills YMCA is community-centered, bringing people of all ages and backgrounds together, to nurture potential and mobilize local communities to effect lasting and meaningful change. We look forward to helping you with your needs and answering any questions you may have. Feel free to contact us via the form below or through a membership representative at one of our local YMCAs. Contact Us Form × Contact Lakeland Hills Family Y Name * First Last Email * Who do you want to contact? * President and Chief Executive Officer, Alex Martinez Fund Development Associate, Dante Gonzalez Health & Wellness Director, Kelly Najjar Assistant Camp and Program Director, Quentin Pickering Camp & Youth Program Director, Linnea Berry Website Manager, Carmen Fritsch HR Director, Renee Dorn Chief Operating Officer, Devon Maloney Assistant Aquatics Director & Swim Lesson Coordinator, Yash Kothari Controller, Gail Shelby Fitness Director, Gerry Gessie Member Services Coordinator, Hope Hornick IT Director, Jonathan Ogintz Aquatics Manager/Lifeguard Coordinator, Sydney Jasinski Vice President Fund Development, Kaite Burke Community Engagement Manager, Kelly Horvath Early Childhood Learning Center Director, Michele Leaman Buildings and Grounds Assistant Director, Mika Newman Buildings and Grounds Director, Mike Ambrosi Membership Administrator/Day Camp Bookkeeper, Nancy Dunham Member Services Director, Reneé Welch Vice President Marketing and Membership, Rosemary Linder Day Competitive Swim Team & HR Administrator, Sarah Gulbin Senior Program Director, Shannon Bujoreanu Chief Financial Officer, Robert Marzan Early Childhood Learning Center Program Specialist & I-SWAP Manager, Cynthia Rodriguez Message * CAPTCHA URL This field is for validation purposes and should be left unchanged. Δ Close Lakeland Hills Family YMCA 100 Fanny Road Mountain Lakes, NJ Phone: 973-334-2820 membership@lhymca.com Frequently Asked Questions What are your facility hours? Our hours are: Monday – Friday 5:00 A.M – 10:30 P.M. Saturday – Sunday 7:00 A.M. – 6:00 P.M. Directions Can I access other YMCA’s with my Lakeland Hills YMCA membership? Yes. We are proud to offer our members access to YMCA facilities across the United States and Canada that participate in Nationwide Membership. This way, our members can use the Y as often as they like, making it easier to achieve their health and wellness goals. Are group exercise classes available? Yes. We have over 65 weekly classes offered from Yoga to HIT. These classes offer a great workout in a class setting, and are all included with your membership. Can I bring a friend? Yes. As a member, you are given 3 guest passes per year. You can bring a friend up to 3X for free. After that there is a fee. Guests/friends can use facility a max of 3X per year and then must become a member. Is there a trial membership to try out the Y? Yes. We have a 1-Week Trial Membership for free.  After that, we have several options that you can choose as a new member. What benefits do I get with my membership? Full Privilege Membership entitles you to use the pool, basketball gymnasium, Health and Fitness Training Center, general membership locker rooms, as well as group fitness, yoga, spinning classes, and all aqua exercise classes. Plus, three free guest passes per year and a fitness orientation. Some age restrictions apply. Long Term Locker Membership offers full privilege membership plus an assigned locker and towel service in an adult only locker room which includes steam room, sauna and TV. What are the pool hours? For Pool Hours and available swim times, please visit our schedules page where you can download swim times as well as gymnasium and group fitness class times. Do you offer financial assistance? Yes. We offer financial aid to ensure that no one is turned away from a Y program or service due to an inability to pay. Visit our Financial Assistance page for more information. STAY CURIOUS Want to know more about how you can make an impact in the community? Fill out this simple form to learn how to get involved. About Us Join Give Volunteer Test Contact Leadership Team Register Privacy Policy Member Login Facility Hours Y Hours Mon-Fri: 5:00am-10:15pm Sat-Sun: 7:00am – 5:45pm Desk Hours Mon-Fri: 8:00am-8:00pm Sat-Sun: 8:00am – 4:00pm Learn more >> CONNECT WITH US Copyright © Lakeland Hills YMCA Lakeland Hills YMCA | 100 Fanny Road | Mountain Lakes, NJ 07046 | 973.334.2820 Site designed by Daxko Toggle Sliding Bar Area Page load link Both Tai Chi classes will be cancelled Thursday, September 11. Last chance this week to register for fall classes, which begin Monday, September 8. Registration available 24/7 online. + +"
    },
    {
      "url": "https://www.easthillshotel.com.au/contact/",
      "text": "Contact – East Hills Hotel info@easthillshotel.com.au (02) 9772 8804 19 MacLaurin Ave East Hills NSW 2213 What’s On Eat & Drink Bistro Menu Chef Specials Wine List Cocktail List Functions Contact Make A Booking info@easthillshotel.com.au (02) 9772 8804 19 MacLaurin Ave East Hills NSW 2213 What’s On Eat & Drink Bistro Menu Chef Specials Wine List Cocktail List Functions Contact Make A Booking Contact Us! Have questions about our dining options or have feedback for us? Reach out via the form below, phone, or email. Your satisfaction is our priority. Experience the charm of East Hills Hotel. Get in touch today! Name (Required) First Last Email (Required) Phone Reason for enquiry (Required) General Whats On Function Hire Restaurant Comments (Required) Please let us know what's on your mind. Have a question for us? Ask away. CAPTCHA Comments This field is for validation purposes and should be left unchanged. WHERE TO FIND US EMAIL: info@easthillshotel.com.au PHONE: (02) 9772 8804 ADDRESS: 19 MacLaurin Ave East Hills NSW 2213 TRADING HOURS: Monday to Saturday 10am – 4am Sunday 10am – 12am BISTRO TRADING HOURS: Monday to Friday 12pm-3pm & 5pm-9pm Saturday & Sunday 12pm-9pm Privacy Policy Terms & Conditions Copyright © 2025. East Hills Hotel. ABN 24 000 973 919. All Rights Reserved. Help is close at hand. GAMBLEAWARE. Free Call 1800 858 858 or visit Gambling Help . Web Design By Daily Press Group Hotels Automotive Projects Aviation Careers Contact Us Privacy Policy Terms & Conditions Copyright © 2025. East Hills Hotel. ABN 24 000 973 919. All Rights Reserved. Help is close at hand. GAMBLEAWARE. Free Call 1800 858 858 or visit Gambling Help ."
    },
    {
      "url": "https://www.shacademy.org/contact-us",
      "text": "Contact South Hills Academy: Get In Touch With Our Team Today! top of page South Hills Academy Pre-K-12 HOME ABOUT OUR SCHOOL FACULTY & STAFF ALUMNI ADMISSION LOCAL ADMISSION INTERNATIONAL SUMMER ACADEMICS PRESCHOOL ELEMENTARY SCHOOL MIDDLE SCHOOL HIGH SCHOOL CAMPUS LIFE DORM LIFE ATHLETICS AFTER SCHOOL STUDENT ACTIVITIES RESOURCES AP TESTING SCHOOL BLOG 2025-2026 CALENDAR 2025 LUNCH MENU CONTACT US Use tab to navigate through the menu items. Thank you for your interest in South Hills Academy! We're offering Scholarships to qualifying High School Students and Sibling Discounts . Ask us how to apply today! We look forward to connecting with you! Contact Us Name: Email: Phone Number: Interested In: * Required Summer School Preschool Elementary School Middle School High School Local or International? Choose an option Questions/Comments: Submit Programs The South Hills Academy Preschool program nurtures creativity while providing opportunities for inquiry and discovery. Preschool Learn More Our private Christian school offers academic excellence, character development, and spiritual growth for our elementary school aged children. Elementary School Learn More Our private Christian school offers academic excellence, character development, and spiritual growth for grades 6-8. Middle School Learn More As a college-preparatory academy, we focus on maintaining excellence in academics, social skills and physical health. High School Learn More We achieve outstanding educational success for international students from kindergarten to 12th grade who aim for a fulfilling academic journey in the United States. International Learn More The summer program includes a rich variety of practical activities and academic coursework, making it highly popular among SHA students and parents. Summer Learn More Map Open Campus Phone +1.626.919.2000 Location 1600 E Francisquito Ave West Covina, CA 91791 United States Connect With Us South Hills Academy 1600 E Francisquito Ave West Covina, CA 91791 United States admissions@shacademy.org summerschool@shacademy.org +1.626.919.2000 Office Hours Monday to Friday - 7:30 AM - 4:00 PM Saturday to Sunday - Closed © 2024 South Hills Academy. All Rights Reserved bottom of page"
    }
  ]
}