{
  "fuentes": [
    {
      "url": "https://ilovetheburg.com/three-birds-tavern-st-pete/",
      "email": "info@ilovetheburg.com"
    },
    {
      "url": "https://www.enrollwaresolutions.com/contact-us",
      "email": "info@enrollware.com"
    },
    {
      "url": "https://threebirdsdigital.com/about-us/",
      "email": "libby@threebirdsdigital.com"
    },
    {
      "url": "https://www.threebirds.co.uk/contactus/",
      "email": "contact@threebirds.co.uk"
    },
    {
      "url": "https://tbbwmag.com/2021/10/12/three-birds-tavern-in-st-petersburg-announces-new-owners/",
      "email": "tbbw-logo-2023-100x50-v1-@2x.png"
    },
    {
      "url": "https://www.threebirdsrenovations.com/contact",
      "email": "collaborations@threebirdsrenovations.com"
    },
    {
      "url": "https://www.threebirdsrenovations.com/contact",
      "email": "info@threebirdsrenovations.com"
    },
    {
      "url": "https://www.threebirdsrenovations.com/contact",
      "email": "media@threebirdsrenovations.com"
    },
    {
      "url": "https://threebirdstavern.com/private-events.html",
      "email": "info@threebirdstavern.com"
    },
    {
      "url": "https://threebirdstavern.com/private-events.html",
      "email": "parties@threebirdstavern.com"
    },
    {
      "url": "https://www.threebirdscounseling.com/contact",
      "email": "begin@threebirdscounseling.com"
    }
  ],
  "mails": [
    "begin@threebirdscounseling.com",
    "collaborations@threebirdsrenovations.com",
    "contact@threebirds.co.uk",
    "info@enrollware.com",
    "info@ilovetheburg.com",
    "info@threebirdsrenovations.com",
    "info@threebirdstavern.com",
    "libby@threebirdsdigital.com",
    "media@threebirdsrenovations.com",
    "parties@threebirdstavern.com",
    "tbbw-logo-2023-100x50-v1-@2x.png"
  ],
  "nombre_sitio": "threebirdstavern.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://ilovetheburg.com/three-birds-tavern-st-pete/",
      "text": "Three Birds Tavern owners to retire, owner of Annex 400 Beach to take over We use cookies to give you the best experience on our site. Learn more or close to accept. × Skip to content Stories Guides Events Visitors Tours Merch Stories Guides Events Visitors Tours Merch Search Search COMMUNITY PARTNER Burg Three Birds Tavern owners to retire, owner of Annex 400 Beach to take over October 12, 2021 • By Andrew Harlan October 12, 2021 • By Andrew Harlan 137 SHARES Facebook Twitter Three Birds Tavern is one of the most celebrated restaurants in St. Pete. Just one taste of the oh so sweet potato fries tossed in sea salt, honey cinnamon-bourbon butter and you can taste why Three Birds is so beloved. Robin and Jack King, owners of Three Birds Tavern in St. Petersburg for more than twelve years, are retiring and passing the nest along to local hospitality professionals John and Haley Ruetz. We will miss the gregarious, charismatic, and assiduous Kings, but we are delighted they’re ready to take this well deserved step back. It’s encouraging to see a new pair of local entrepreneurs take up the mantle of this 4th Street gem. ADVERTISEMENT Let’s hope the Bread Pudding for Breakfast stays on the brunch menu because it is our favorite way to wake up on a Sunday — especially on the outdoor patio. Three Birds Tavern restored a 140-year-old building Truly, Three Birds offers the best shaded outdoor dining in the Sunshine City. When the Kings moved to St. Petersburg in 2009 and bought the 140-year-old former farmhouse at 1492 Fourth Street North, their goal was to create a family-friendly neighborhood restaurant with fresh food, refreshing drinks, a welcoming environment for all and a strong sense of community. Mission accomplished. The Kings restored the building and expanded the outdoor patios, all while preserving its old charm and beautiful towering oak trees. The space is brimming with local history, and maybe a casual haunt or two. In 2015, their efforts to restore the building were recognized with a city beautification award. Robin and Jack share the belief that community always comes first. They are active advocates of the buy local movement and Robin often mentors emerging female entrepreneurs. Both focus on supporting local artists, local nonprofits and fellow local business owners in all industries. Robin and Jack King join the Buy Local Movement In 2014, Robin started a second business, Out of the Weeds artisan sauces and, just two years later, was named Tampa Bay Business Woman of the Year in Hospitality. The restaurant has received numerous awards over the years, such as Best New Business, several ADDY Awards  for logo design, branding and website, Most Community-Minded Business, Best Established  Business, as well as many food awards, including TBBJ Best Dish in the Biz. “When we bought the building in 2009, Jack told me we would give this a 10-year run after his first retirement from a successful litigation career in Ohio, so I knew in 2019 our time was winding down,” Robin said. But the Kings decided they would continue to operate Three Birds Tavern until the perfect buyers came along. The problem, she shared, was that while many offers had been made for the building since a developer first approached them in 2015, all of them had plans to tear the building down. “That isn’t what we wanted for this little piece of St. Pete history,” Robin said. Two St. Pete locals take over the storied restaurant John and Haley, both born and raised here in the ‘Burg, are dedicated to preserving the property and making the  restaurant even better. John owns and operates The Annex on Beach Drive and prior to that managed 400 Beach Seafood and Tap House and Cafe Gala at the Dali Museum. He and Haley just welcomed their second child. “We are excited to carry on the tradition of Three Birds Tavern with our growing family (two future busboys) and be an active part in the community in which we live and love,” John said. Robin and Jack are grateful to the hundreds of team members who worked tirelessly over the years, and especially through this pandemic. Robin and Jack are enormously grateful to the thousands of guests who supported the restaurant, making 12 years of continued growth possible, and wish John and Haley much success. The Kings are ready to enjoy retirement In the future, you will find the Kings splitting their time between the beaches of Florida, the mountains of North Carolina and traveling the country to visit their adult children. They especially look forward to spending more time with their 3-year-old granddaughter and new  grandson. Congrats, Robin and Jack. You both deserve it! Visit Three Birds’ website , and Instagram for future updates. What to read next: Tampa Bay Born Murals: iBOMS paints a new narrative in St. Pete Studio Public House brings pub life to the Grand Central District Fo’Cheezy Twisted Meltz begins hiring for new brick-and-mortar location in downtown St. Pete New Australian pub opening on the 200 Block of Central Avenue Breeze Airways launches 10 nonstop routes from Tampa International Airport Oxford Exchange named one of the 10 best brunch spots in America ADVERTISEMENT Subscribe Now Don’t miss out on All Things Good in the Burg 👉 Email Stay in the know 👇 GET UPDATES 👇 Stay connected to All Things Good in the Burg by subscribing today. Email Stay in the know Andrew Harlan A proud Eckerd College graduate, he’s a passionate advocate for independent bookstores and St. Petersburg’s thriving craft coffee scene. When he’s not working, you’ll find him biking the Pinellas Trail, strolling with his dogs, catching a film at Green Light Cinema, or enjoying long runs along the city’s award-winning waterfront parks. Recent Stories Longtime British favorite Moon Under Water to make its return in Gulfport September 10, 2025 20 amazing events to attend during St. Pete’s City of Performing Arts Month September 9, 2025 Help restore Egmont Key: Volunteer for a massive cleanup effort September 9, 2025 Related Stories Razed (Director’s Cut) two new in-person screenings confirmed in St. Pete September 5, 2025 Gallagher’s Pumpkins & Christmas Trees is one of St. Pete’s best fall experiences September 4, 2025 Small Talks Magazine is a love letter to St. Pete and physical media September 3, 2025 Ribbon cutting and big reopening date revealed for the President Barack Obama Main Library September 3, 2025 All Recent Stories Help restore Egmont Key: Volunteer for a massive cleanup effort September 9, 2025 Things To Do In St Pete This Weekend: Best Festivals & Events Going On In St Petersburg September 9, 2025 Award-winning author of ‘Build It Boldly’ to host book talk, Q&A in Tampa this week September 8, 2025 The Frog Pond reopens in North Redington Beach: “the heart of this place stays the same” September 8, 2025 Paradeco is one of the “chicest cafes in America” September 8, 2025 Pilates, yoga and strength studio FS8 to bring new wellness community to St. Pete September 8, 2025 Razed (Director’s Cut) two new in-person screenings confirmed in St. Pete September 5, 2025 Things to do with kids this weekend: St. Pete, Clearwater, and beyond September 5, 2025 Since I Love the Burg launched in May of 2009, it has been our mission to make St. Petersburg (a.k.a. the #BURG) the best place to live, work and play. Facebook-f Instagram Twitter Tiktok Youtube Envelope Email Subscribe All Things Good Stories Guides Events Shop Visitor's Guide More From Us History Tours About / Contact Advertise Privacy Policy That's So Tampa © All rights reserved Brought to you with ❤️ by WallMedia Partners Stories Guides Events Visitors Merch"
    },
    {
      "url": "https://www.enrollwaresolutions.com/contact-us",
      "text": "Contact the Team | Enrollware Skip to content Client Login All-in-One Platform Solutions Healthcare/AHA Corporate Government Continuing Education Pricing Contact Sign Up Contact Enrollware How to Reach Us To reach a representative, fill out the contact form on this page or give us a call. Phone: Support: 561-247-2432 Support Hours: Monday-Friday (8am-6pm ET) Email: Sales Inquiries: info@enrollware.com Support: support@enrollware.com Mailing Address: Fullsteam Software Holdings LLC DBA Enrollware Software 540 Devall Drive, Suite 301 Auburn, AL 36832 Password Assistance? Please contact your training center administrator. Enrollware can only issue usernames or passwords for the primary administrators of our direct clients. Online Class Registration and Management Features All-in-One Platform Pricing EnrollwarePay Solutions Healthcare Government Continuing Education Corporate Resources Contact Us Privacy Policy Terms & Conditions Responsible Disclosure Policy Client Login Follow Us © 2025 Enrollware. All rights reserved."
    },
    {
      "url": "https://threebirdsdigital.com/about-us/",
      "text": "About Us - Three Birds Digital Skip to content Strategic Consulting & Planning Content Creation & Community Engagement Advertising, Analytics & Performance About Us Blog Contact Us Subscribe To Our Newsletter Toggle Menu Our story Three Birds Digital is a small business with BIG goals – to help your business grow! Contact Us Today! Founded in 2023 by Libby White, Three Birds Digital emerged from a clear vision: to provide affordable, professional marketing services tailored to the unique needs of small to mid-sized businesses. Recognizing the challenges faced by these enterprises in a rapidly evolving digital landscape, Libby embarked on a mission to create a marketing agency that not only delivers exceptional results but also operates on principles that resonate deeply with its clientele. Contact Us Today! OUR VALUES At Three Birds Digital, we are guided by a core set of values that define who we are and how we operate. These principles are the bedrock of our approach to digital marketing, ensuring that every strategy we devise and every campaign we execute is infused with integrity, innovation, transparency, and a deep focus on our customers. Our commitment to these values is unwavering, as they inspire us to deliver exceptional results for businesses of all sizes. 01 Innovation At the heart of Three Birds Digital, innovation is more than a buzzword; it’s our operational blueprint. We believe in staying ahead of trends, continuously evolving our strategies, and employing cutting-edge technologies to keep our clients at the forefront of their industries. 02 Transparency We understand that trust is the cornerstone of any successful partnership. That’s why we prioritize clear, open communication with our clients. From strategy development to execution, we ensure that our clients are informed and involved every step of the way. 03 Integrity Conducting our business with the utmost integrity is non-negotiable. We are committed to ethical practices, honesty, and fairness in all our interactions. Our goal is to build long-term relationships based on mutual respect and ethical business practices. 04 Customer-Focused Our clients are at the center of everything we do. We are dedicated to understanding and addressing their unique needs, challenges, and aspirations. Our approach is not one-size-fits-all; instead, we tailor our services to deliver personalized solutions that drive growth and success. The Latest From The Blog Read More A Feather In Your Cap: The Top 10 KPIs You Need To Measure Email Marketing Success February 12, 2024 What You Need To Know About Email Marketing KPIs February 12, 2024 How to Think Like an AI: Cultivating a Machine Learning Mindset February 8, 2024 How To Increase Customer Satisfaction With AI Chatbots February 6, 2024 Unleashing the Full Potential of Marketing Automation January 31, 2024 How To Integrate AI Into Your Marketing Analytics January 26, 2024 Navigating The New AI Frontier – Redefine Your Marketing In 2024 January 24, 2024 7 Ways To Create An Eye-Catching Marketing Strategy January 22, 2024 Strategic Consulting & Planning Content Creation & Community Engagement Advertising, Analytics & Performance About Us Blog Contact Us Subscribe To Our Newsletter © 2025 Three Birds Digital Facebook Facebook Linkedin Linkedin Instagram Instagram Twitter Twitter Phone Phone Email Email Scroll to top Scroll to top Strategic Consulting & Planning Content Creation & Community Engagement Advertising, Analytics & Performance About Us Blog Contact Us Subscribe To Our Newsletter"
    },
    {
      "url": "https://www.threebirds.co.uk/contactus/",
      "text": "CONTACT – Three Birds Restaurant Skip to content BOOK YOUR TABLE MENUS CONTACT Contact You can book your table online or if you prefer you can call us on 0131 229 3252 . For further contact details if you need them: Email: contact@threebirds.co.uk |    Address – 3-5 Viewforth, Bruntsfield, Edinburgh, EH10 4JD Follow us on social: Twitter – @3birdsedinburgh | Instagram – 3birdsedinburgh/ Opening times Mon – CLOSED Tues – 12pm-2.30pm / 5pm-9pm Wed – 12pm-2.30pm / 5pm-9pm Thu – 12pm-2.30pm / 5pm-9pm Fri – 12pm-2.30pm / 5pm-10pm Sat – 10am-4pm / 5pm-10pm Sun – 10am-4pm / 5pm-9pm Our festival menus // Brunch // Lunch // Dinner // Dessert // Kids / / Beer and s oft drinks // Wine List CONTACT BOOK YOUR TABLE ________________ 3-5 Viewforth, Edinburgh, EH10 4JD 0131 229 3252 contact@threebirds.co.uk Opening hours Mon – CLOSED Tues – 12pm-2.30pm / 5pm-9pm Wed – 12pm-2.30pm / 5pm-9pm Thu – 12pm-2.30pm / 5pm-9pm Fri – 12pm-2.30pm / 5pm-10pm Sat – 10am-4pm / 5pm-10pm Sun – 10am-4pm / 5pm-9pm GET SOCIAL Copyright © 2020 Three Birds Restaurant. All Rights Reserved We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. OK THANKS"
    },
    {
      "url": "https://tbbwmag.com/2021/10/12/three-birds-tavern-in-st-petersburg-announces-new-owners/",
      "text": "Three Birds Tavern in St. Petersburg announces new owners - Tampa Bay Business & Wealth Digital Magazine Skip to content Main Navigation Tampa Bay Business & Wealth Search for: Sections Signature Events Upcoming Events Awards and Event Highlights Apogee Awards CEO Connect Philanthropist of the Year Awards Women Who Win Awards Women’s Wellness Invitational All Events Ask the Experts Awards On The Scene Calendar Community Event Calendar Submit an event Economic Development Economic impact Economic impact Coronavirus Editor’s Choice Editor’s Choice 20 Question with… Cover Stories Great Places and Spaces Local Business Luxe Life Mansions on the Market Posher Palate Hurricane Alliance Industries Industries Arts & Culture Banking & Financial Advice Cars, Boats & Toys Education & Philanthropy Entrepreneurs & Business Strategy Fashion and Retail Health Care & Wellness Law & Professional Services Marine Real Estate Retail Sports Technology Travel & Recreation People Profiles Local Buzz All Local Buzz Things To Do One Liners All One Liners Hillsborough Manatee/Sarasota Pasco Pinellas Polk The Good Life Thought Leadership Women of Business About TBBW Advertise With TBBW Contact Us Digital Publications Meet The Team Subscribe Social Media Connect Tampa Bay Business & Wealth Subscribe Header Navigation Posher Palate Editor’s Choice 20 Question with… Cover Stories Great Places and Spaces Local Business Mansions on the Market People Profiles The Good Life Luxe Life Signature Events Upcoming Events Awards & Event Highlights Apogee Awards Philanthropist of the Year Awards Women Who Win Women’s Wellness Invitational Thought Leadership Industries Banking & Financial Advice Cars, Boats & Toys Commercial Real Estate Education & Philanthropy Entrepreneurs & Business Strategy Fashion and Retail Health Care & Wellness Human Resources/Management Law & Professional Services Marine Real Estate Retail Sports Technology Travel & Recreation Calendar Community Event Calendar Submit an event Hurricane Alliance About Us Meet The Team Contact Us Advertising With TBBW Posher Palate Three Birds Tavern in St. Petersburg announces new owners October 12, 2021 | Jo-Lynn Brown Robin and Jack King, owners of Three Birds Tavern in St. Petersburg for more than twelve years, are retiring and selling the business to local hospitality professionals John and Haley Ruetz. Three Birds Tavern is housed in a 140-year-old, former farmhouse, at 1492 Fourth Street North. Robin and Jack King, owners of Three Birds Tavern The Kings purchased the property in 2009 and restored the building and expanded the outdoor patios. In 2015, Three Birds Tavern was recognized with a city beautification award. “When we bought the building in 2009, Jack told me we would give this a 10-year run after his first retirement from a successful litigation career in Ohio, so I knew in 2019 our time was winding down,” Robin said, in a statement. The Kings decided they would continue to operate Three Birds Tavern until the perfect buyers came along. John and Haley, St. Pete natives, say they are dedicated to preserving the property and making the restaurant even better. John owns and operates The Annex on Beach Drive and prior to that managed 400 Beach Seafood and Tap House and Cafe Gala at the Dali Museum. “We are excited to carry on the tradition of Three Birds Tavern, with our growing family (two future busboys,) and be an active part in the community in which we live and love,” John said, in the statement. [image_slider_no_space on_click=”prettyphoto” height=”300″ images=”13965,13964,13963,13962″] Print Share Share on Facebook Share on Twitter Share on LinkedIn Share on Pinterest Tags: Restaurants You May Also Like Cassis American Brasserie: The Anchor of Beach Drive (PHOTOS) September 5, 2025 CW’s Gin Joint: Tampa’s hidden spirit (PHOTOS) August 4, 2025 Elliott Aster: Where historic charm meets Michelin dreams (PHOTOS) July 18, 2025 Michelin-starred Lilac unveils new tasting and à la carte menus at The Tampa EDITION (PHOTOS) July 7, 2025 Upcoming Events Apogee Awards 2025 Learn More featured Rob Higgins named USF’s first CEO of Athletics Sep 10, 2025 Kettler names James Nozar president of development, to lead Gasworx in Tampa Sep 9, 2025 Keep up with TBBW's top headlines Subscribe to our free eNewsletter Email Address Comments This field is for validation purposes and should be left unchanged. Latest Issue READ LATEST ISSUE MAGAZINE ARCHIVE More Posher Palate Posts Pulpo Kitchen & Lounge: Bold Latin flavor, elevated dining (PHOTOS) June 3, 2025 | Barbara Lynch Longtime residents of St. Petersburg have witnessed the city’s remarkable transformation from a quiet coastal retirement haven, once affectionately dubbed “God’s Waiting Room,” into a vibrant cultural hub. That evolution Read More Chef Jeannie Pierola’s Culinary Revolution at Counter Culture May 11, 2025 | Barbara Lynch In the rarefied world of fine dining, few journeys exemplify culinary perseverance quite like that of Chef Jeannie Pierola. Her latest venture, Counter Culture, isn’t merely another upscale establishment — Read More The Tides Seafood Market& Provisions: Anchoring Safety Harbor’s Culinary Renaissance (PHOTOS) April 11, 2025 | Barbara Lynch In the heart of Safety Harbor, an extraordinary culinary destination has taken root. The Tides Seafood Market & Provisions stands apart from the bustling restaurants and bars along historic Main Read More Tampa adds four more dining destinations to The MICHELIN Guide Florida (PHOTOS) March 12, 2025 | Jo-Lynn Brown Tampa Bay has solidified its place among Florida’s top dining destinations. From a seafood shack serving up local catches to a Scandinavian-inspired fine dining experience, these new Tampa Bay selections Read More Other Posts The Studio Public House is a distinctly British experience in St. Petersburg (PHOTOS) March 5, 2025 | Barbara Lynch A truly memorable brunch transcends mere sustenance. It’s the confluence of exceptional cuisine, an inviting ambiance and impeccable service that fosters a sense of belonging. Add the effervescence of flowing Read More Dunedin Golf Club begins a new era with The Highland House (PHOTOS) February 13, 2025 | Barbara Lynch Dunedin Golf Club | 1050 Palm Blvd, Dunedin Read More Chef Chris Ponte announces opening date for Olivia in St. Pete January 15, 2025 | Jo-Lynn Brown Chef Chris Ponte has announced the opening date for Olivia, a modern Italian restaurant in downtown St. Pete. The 5,550-square-foot restaurant is located at 225 1st Ave. N., will open Read More Estuary is redefining dining in New Port Richey (PHOTOS) January 3, 2025 | Barbara Lynch Estuary | 6220 Grand Blvd, New Port Richey Read More Awards & Events Recap Upcoming Events Editor’s Choice Posher Palate Industries Local Buzz Company Tampa Bay Business & Wealth (TBBW) magazine is the leading provider and trusted resource for business leaders affecting change in the Tampa Bay region. TBBW delivers in-depth reporting – with a distinct local perspective – on topics that make a difference in our community. Our wealth coverage will not only provide information for high net worth investors, but will also spotlight the emerging angel investor, venture capital, private equity and hedge fund ecosystem in Tampa Bay. Read More… 1901 Ulmerton Road Suite 100 Clearwater 33762 (727)860-8229 [email protected] About TBBW Contact TBBW Advertise With TBBW Also of Interest Kahwa Coffee announces new St. Petersburg location Habitat for Humanity of Pinellas and West... 95 local businesses receive funding from... Privacy Policy Terms of Use Ad Services © Copyright , Babcox Media Inc. All rights reserved Latest Digital Edition View All Editions Subscribe Email Address Comments This field is for validation purposes and should be left unchanged. Social Connect"
    },
    {
      "url": "https://www.threebirdsrenovations.com/contact",
      "text": "CONTACT — THREE BIRDS RENOVATIONS Cart 0 HOME DISCOUNT CARD SCHOOLS FREEBIES BLOG HOUSE TOURS PROJECTS GET THE LOOK FIND A TRADIE ABOUT JOBS SEARCH Back LOGIN RENO SCHOOL STYLING SCHOOL FOURTH BIRD KITCHEN BOOTCAMP BATHROOM BOOTCAMP WHICH SCHOOL? STUDENT STORIES Cart 0 HOME DISCOUNT CARD SCHOOLS LOGIN RENO SCHOOL STYLING SCHOOL FOURTH BIRD KITCHEN BOOTCAMP BATHROOM BOOTCAMP WHICH SCHOOL? STUDENT STORIES FREEBIES BLOG HOUSE TOURS PROJECTS GET THE LOOK FIND A TRADIE ABOUT JOBS SEARCH Scroll We would love to hear from you, get in touch anytime. You can shoot us an email info@threebirdsrenovations.com . Media enquiries please contact media@threebirdsrenovations.com . Product (furniture + styling) collaborations please contact collaborations@threebirdsrenovations.com . 1 CONTACT LOVE LETTERS - Contact Page FOLLOW View fullsize View fullsize View fullsize View fullsize View fullsize View fullsize info@threebirdsrenovations.com Hours VIDEOS MEDIA BOOKS HOUSE SUBMISSIONS NEWSLETTER PARTNERS COMPETITIONS PRIVACY CONTACT MADE WITH LOVE BY PEPPA HART"
    },
    {
      "url": "https://threebirdstavern.com/private-events.html",
      "text": "private events Home Brunch Menu Drinks Private Events RESERVATIONS GIFT CARDS ONLINE ORDERS Employment Home Brunch Menu Drinks Private Events RESERVATIONS GIFT CARDS ONLINE ORDERS Employment PRIVATE EVENTS Whether your plans include drinks with friends or a casual wedding, or anything in between, include us in your plans. Our professional staff can help you with everything from the planning to the event itself. Private areas and restaurant rentals are available for your special party. Give us a call or email us to find out about our private dining availability. Please contact us at info@threebirdstavern.com Visit our exceptional coffee shops.... BEACH DRIVE WALK UP CAFE A place to grab a cup of coffee, a glass of wine  some light fare while exploring famous Beach Drive in St Petersburg, Florida. Relax in the shade of our sidewalk cafe, shop for local souvenirs or art works and people watch while enjoying the sunny weather. 8am - 8pm  7 days a week 727.896.4400 400 Beach Dr. Downtown St. Petersburg Providing quick, delightful coffee and treats via drive-thru to the beautiful Gulfport & St. Petersburg, Florida Communities! 727.289.4759 5133 Gulfport Blvd. S, Gulfpor t, FL Join Our Mailing List for Fun Events & Specials 727.895.2049 1492 4th Street N St. Petersburg, FL 33704 OPEN 7 DAYS Sunday - Thursday 11 am - 10pm Friday and Saturday 11 am - 11pm Â© 2024 Three Birds Tavern  |  ALL RIGHTS RESERVED xclaimagency.com"
    },
    {
      "url": "https://www.threebirdscounseling.com/contact",
      "text": "Three Birds Counseling & Clinical Supervision | Contact top of page ESPAÑOL GREENSBORO, RALEIGH & NORTH CAROLINA COUNSELING & THERAPY HOME ABOUT MEET MARIA MEET ANGIEMIL MEET ASLI MEET BRITTANY MEET LINDSEY MEET EMILEA MEET MEREDITH MEET CHRISTY MEET DANIEL SERVICES TELEMENTAL HEALTH CLASSES CLINICAL SUPERVISION ADHD TESTING PARENTING YOUR ADHD CHILD IMMIGRATION HARDSHIP EVALUATIONS EATING DISORDER SUPERVISION GROUP WORKSHOPS GROUPS IS GROUP RIGHT FOR ME? BODY WORKS HACK YOUR ADHD--ADULT CLASS ANGER MANAGEMENT CLASS MOTHER DAUGHTER BODY IMAGE GROUP TEEN EATING DISORDERS SUPPORT ADULT EATING DISORDERS SUPPORT FEEL BETTER FAST! ANXIETY REDUCTION FEES & POLICIES COUNSELING PRICING & POLICIES CLINICAL SUPERVISION PRICING & POLICIES BLOG RESOURCES CONTACT More Use tab to navigate through the menu items. Please note, while most of our providers are seeing clients in person, some are solely providing telehealth via Zoom. When requesting an appointment, please indicate your preference. Below, you can request an available appointment via our secure & encrypted portal or send us an email inquiry. You can also reach us: via phone (Greensboro): 336.296.8822 via phone (Raleigh): 919.756.3888 via phone (en Español): 336.296.5525 via email: begin@threebirdscounseling.com via fax: 888-475-8311 You can find the physical addresses of our offices at the bottom of this page. Anchor 1 Para servicio en español, por favor llama al: 336.296.5525 o email: begin@threebirdscounseling.com Current client looking to sign into your secure portal? Click here “and i said to my body. softly. ‘i want to be your friend.’ it took a long breath. and replied ‘i have been waiting my whole life for this.” -Nayyirah Waheed Why wait any longer? Reach out to us today. By providing a telephone number and submitting the form you are consenting to be contacted by SMS text message from Three Birds Counseling. Message & data rates may apply. Message Frequency Varies. Reply STOP to opt-out of further messaging. Reply HELP for more information. Please see our Privacy Policy for further details.I agree to the terms & conditions Send Success! Message received. Physical Locations Greensboro Raleigh 2721 Horse Pen Creek Rd Unit #104 Greensboro, NC 27410 Tel: 336-296-8822 Fax: 888-475-8311 Email: begin@threebirdscounseling.com 4904 Waters Edge, Suite 158 Raleigh, NC 27606 Tel: 919-756-3888 Fax: 888-475-8311 Email: begin@threebirdscounseling.com Greensboro: 2721 Horse Pen Creek Rd, Unit #104 ​ Raleigh: 4904 Waters Edge, Suite 158 ​ North Carolina: Via Telehealth Maria Paredes, PhD, LCMHCS, CEDS-C Three Birds Counseling and Clinical Supervision, PLLC Tel: 336.296.8822 ​ Email: begin@threebirdscounseling.com © 2016-2025 Three Birds Counseling & Clinical Supervision PLLC ​ This page is not intended to convey sensitive information. The contents of this website are provided solely for informational purposes, and are not meant to provide professional medical or psychiatric advice, counseling or services. Always consult a trained mental health professional before making any decision regarding treatment. bottom of page"
    }
  ]
}