{
  "fuentes": [
    {
      "url": "https://www.displaysuk.co.uk/signage-perspex-frames/perspex-acrylic-poster-photo-frames/staff-photo-boards-for-schools-business/",
      "email": "enquiries@displaysuk.co.uk"
    },
    {
      "url": "https://throwsomeshadeorl.com/reservation/",
      "email": "devyn@thrivinghospitalityent.com"
    },
    {
      "url": "https://throwsomeshadeorl.com/reservation/",
      "email": "lamp@thrivinghospitalityent.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/lamp-and-shade-craft-kitchen-and-cocktails-orlando",
      "email": "corporate@giftly.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/lamp-and-shade-craft-kitchen-and-cocktails-orlando",
      "email": "merchants@giftly.com"
    },
    {
      "url": "https://www.brph.com/portfolio-items/lamp-shade-craft-kitchen-cocktails/",
      "email": "c05636_080_00_n75_png-500x383@2x.png"
    },
    {
      "url": "https://www.brph.com/portfolio-items/lamp-shade-craft-kitchen-cocktails/",
      "email": "c08032_001_00_n40-500x383@2x.jpg"
    },
    {
      "url": "https://www.brph.com/portfolio-items/lamp-shade-craft-kitchen-cocktails/",
      "email": "c08270_010_00_n114-500x383@2x.jpg"
    },
    {
      "url": "https://www.brph.com/portfolio-items/lamp-shade-craft-kitchen-cocktails/",
      "email": "cs1048_004_00_n78-1-e1739386392492-500x383@2x.jpg"
    },
    {
      "url": "https://www.orlandoweekly.com/orlando/lamp-shade-craft-kitchen-and-cocktails-poised-for-december-opening/Slideshow/35279413",
      "email": "tips@orlandoweekly.com"
    },
    {
      "url": "https://throwsomeshadeorl.com/",
      "email": "lamp@thrivinghospitalityent.com"
    },
    {
      "url": "https://www.orlandosentinel.com/2024/09/05/lamp-and-shade-restaurant-review-amy-drew-thompson-mills-50-orlando/",
      "email": "amthompson@orlandosentinel.com"
    },
    {
      "url": "https://throwsomeshadeorl.com/privateeventsandcatering/",
      "email": "lamp@thrivinghospitalityent.com"
    },
    {
      "url": "https://throwsomeshadeorl.com/privateeventsandcatering/",
      "email": "lampevents@thrivinghospitalityent.com"
    },
    {
      "url": "https://throwsomeshadeorl.com/about/",
      "email": "lamp@thrivinghospitalityent.com"
    },
    {
      "url": "https://throwsomeshadeorl.com/menus/",
      "email": "lamp@thrivinghospitalityent.com"
    }
  ],
  "mails": [
    "amthompson@orlandosentinel.com",
    "c05636_080_00_n75_png-500x383@2x.png",
    "c08032_001_00_n40-500x383@2x.jpg",
    "c08270_010_00_n114-500x383@2x.jpg",
    "corporate@giftly.com",
    "cs1048_004_00_n78-1-e1739386392492-500x383@2x.jpg",
    "devyn@thrivinghospitalityent.com",
    "enquiries@displaysuk.co.uk",
    "lamp@thrivinghospitalityent.com",
    "lampevents@thrivinghospitalityent.com",
    "merchants@giftly.com",
    "tips@orlandoweekly.com"
  ],
  "nombre_sitio": "throwsomeshadeorl.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.displaysuk.co.uk/signage-perspex-frames/perspex-acrylic-poster-photo-frames/staff-photo-boards-for-schools-business/",
      "text": "Staff Photo Boards For Schools & Business This site is best viewed with javascript enabled. For help enabling javascript please click here . search close Search Quote ( 0 ) Checkout 0 item s £ 0.00 Home Products Exhibition Stands Pop Up Exhibition Stands Modular Exhibition Stands Fabric Exhibition Stands Shell Scheme Graphics Information Points & iPad Displays See all Outdoor Displays Outdoor Display Flags Outdoor Display Banners & Frames Pavement Signs Gazebos, Parasols & Inflatables Cafe Barriers See all Display Cases Perspex Acrylic Display Cases, Boxes & Cubes Display Case Plinths Token, Ballot, Collection Boxes Flat Pack Acrylic Display Cases Bespoke Perspex Display Cases See all Exhibition & Display Boards for Hire or Rent Folding Display Boards for Hire Panel And Pole Display Boards for Hire Brochure Stands for Hire See all Leaflet, Brochure, Menu & Card Holders Countertop Leaflet Holders Wall Mounted Leaflet Holders Floorstanding Brochure Holders Menu Holders Perspex Business Card Holders See all Banner Stands Pull Up Roller Banners Double Sided Pull Up Banner Stands Extra Wide & Linked Banner Stands Fabric Banner Stands Rigid Board Displays See all Counters & Plinths Portable Counters & Workstations Promotion / Demonstration Counters Lectern Test Category Pedestals See all Noticeboards & Whiteboards Perspex Acrylic Wall Mounted Noticeboard Pinnable Wall Mounted Noticeboards Fire Retardant Wall Mounted Noticeboards Lockable / Tamperproof Noticeboards Wall Mounted Fire Retardant Lockable Tamperproof Noticeboards See all Signage & Perspex Frames Perspex Acrylic Poster Photo Frames Perspex Acrylic Signs and Letters Magnetic Blocks & Signs Lightboxes Dibond Signs See all Display Boards Folding Display Boards Folding Screen Room Dividers Panel and Pole Display Boards Display Board Accessories See all Specialist Displays Catering & Sneeze Guards Cable Kits Retail & Point Of Sale NHS Signs & Displays Acrylic Furniture See all Perspex Cut To Size Acrylic Glazing Clear Acrylic Panels Cut To Size Perspex Acrylic White 069 Cut To Size Perspex Acrylic Black 962 Cut To Size Perspex Acrylic Grey 9640 Cut To Size See all About Us Services Large Format Printing Services Self Build DIY Exhibition Stands Cut-To-Size Perspex & Plastics Perspex Replacement Boat Windows Perspex Acrylic Secondary Double Glazing Acrylic Fabrication & Display Fabrication Acrylic Display Cases Boxes & Cubes Point Of Sale & POP Fabrication Recycled Acrylic Displays & Greencast Acrylic Sheet Public Sector Procurement - Credit Facilities Contact Quote ( 0 ) 50,000+ products in stock 1,000 stock product lines with over 50,000 products in stock Custom made displays Rapid delivery on custom made Perspex acrylic displays Next day delivery Next day delivery on many products if ordered by mid day UK Manufacturer Many of our products are made in our own UK factory Cutting edge technology Experts in printed acrylic panels - any size, any shape menu close Products Exhibition Stands Back All Pop Up Exhibition Stands Modular Exhibition Stands Fabric Exhibition Stands Shell Scheme Graphics Information Points & iPad Displays Extra Wide & Linked Banner Stands Outdoor Displays Back All Outdoor Display Flags Outdoor Display Banners & Frames Pavement Signs Gazebos, Parasols & Inflatables Cafe Barriers Outdoor Display Counters Outdoor Custom Printed Chairs Display Cases Back All Perspex Acrylic Display Cases, Boxes & Cubes Display Case Plinths Glass Display Cases Bespoke Acrylic Display Cases Token, Ballot, Collection Boxes Flat Pack Acrylic Display Cases Bespoke Perspex Display Cases Exhibition & Display Boards for Hire or Rent Back All Folding Display Boards for Hire Panel And Pole Display Boards for Hire Brochure Stands for Hire Exhibition Counters for Hire Banner Stands for Hire Leaflet, Brochure, Menu & Card Holders Back All Countertop Leaflet Holders Wall Mounted Leaflet Holders Floorstanding Brochure Holders Menu Holders Perspex Business Card Holders Rotating Brochure Holders Greeting Card Displays Business Card Holders Banner Stands Back All Pull Up Roller Banners Double Sided Pull Up Banner Stands Replaceable Cassette Roller Banners Extra Wide & Linked Banner Stands Fabric Banner Stands Rigid Board Displays Banner Stand Accessories Tension Banner Stands Counters & Plinths Back All Portable Counters & Workstations Promotion / Demonstration Counters Lectern Media Cabinets Test Test category for acrylic pedestals Test Category Pedestals Noticeboards & Whiteboards Back All Perspex Acrylic Wall Mounted Noticeboard Pinnable Wall Mounted Noticeboards Fire Retardant Wall Mounted Noticeboards Lockable / Tamperproof Noticeboards Wall Mounted Fire Retardant Lockable Tamperproof Noticeboards Freestanding / Mobile Noticeboards Whiteboards Glass Noticeboards Flipcharts & Easles Outdoor Noticeboards Acrylic Noticeboards Pinnable Noticeboards Write On Glassboards Signage & Perspex Frames Back All Perspex Acrylic Poster Photo Frames Perspex Acrylic Signs and Letters Magnetic Blocks & Signs Staff Photo Boards Lightboxes Dibond Signs Printed Foamex Signs Site Safety Signs Snap Frames Sign Fittings & Accessories Hoarding Panels Acrylic Awards and Trophies Acrylic Noticeboards Printed Correx Signs Retail & Point Of Sale Printed Plywood and Wood Display Boards Back All Folding Display Boards Folding Screen Room Dividers Aluminium & Graphic Folding Display Boards Panel and Pole Display Boards Office Screens Display Board Accessories Specialist Displays Back All Catering & Sneeze Guards Cable Kits Retail & Point Of Sale NHS Signs & Displays Acrylic Furniture Educational Furniture & Displays Social Distancing Screens Printed Outdoor Garden Art Garden Mirrors, Outdoor Mirrors & Illusion Mirrors Acrylic Photo Prints Shed, Playhouse, Greenhouse Windows Eco Lawn Edging From Recycled Plastic Decorative Garden Wall Panels Garden Structures, Gazebos, Arbours & Swings Garden Ornaments & Planters Acrylic Photo Prints Perspex Acrylic Splashbacks Perspex Cut To Size Back All Acrylic Glazing Clear Acrylic Panels Cut To Size Perspex Acrylic White 069 Cut To Size Perspex Acrylic Black 962 Cut To Size Perspex Acrylic Grey 9640 Cut To Size Perspex Acrylic Grey 9981 Cut To Size Perspex Acrylic Yellow 260 Cut To Size Perspex Acrylic Red 4415 Cut To Size Perspex Acrylic Orange 363 Cut To Size Perspex Acrylic Red 431 Cut To Size Perspex Acrylic Red 433 Cut To Size Perspex Acrylic Violet 886 Cut To Size Perspex Acrylic Green 6T81 Cut To Size Perspex Acrylic Green 650 Cut To Size Perspex Acrylic Blue 727 Cut To Size Perspex Acrylic Blue 750 Cut To Size Perspex Acrylic Blue 744 Cut To Size Perspex Acrylic Clear Frost S2 000 Perspex Acrylic Glass Look 6T21 Cut To Size Perspex Acrylic Silver Mirror Perspex Acrylic Blue Mirror 2069 Perspex Acrylic Purple Mirror 102 About Us Services Large Format Printing Services Self Build DIY Exhibition Stands Cut-To-Size Perspex & Plastics Perspex Replacement Boat Windows Perspex Acrylic Secondary Double Glazing Acrylic Fabrication & Display Fabrication Acrylic Display Cases Boxes & Cubes Point Of Sale & POP Fabrication Recycled Acrylic Displays & Greencast Acrylic Sheet Public Sector Procurement - Credit Facilities Contact Home Signage & Perspex Frames Perspex Acrylic Poster Photo Frames Staff Photo Boards For Schools & Business Staff Photo Boards For Schools & Business £ 36.30 ex. VAT £ inc.VAT Options Colour: Black Back Panel White Back Panel Clear Back Panel Clear Frost Back Panel Coloured Back Panel 2: 2: Qty Add to basket Get a quote Staff Photo Notice Boards - Perspex Acrylic Staff photo notice boards, or \"Meet The Team\" boards are a perfect way of letting people know who's who in a school, NHS Wards, general office and commercial workplace, recreation centres, reception areas, etc. Each clear pocket allows a small photo of a relevent member of staff. Options available include: choice of back acrylic colour, the number of photo pockets. We also offer a secure, tamper proof version, please click here for further details. NEW! We can now offer staff boards with your name and logo printed directlty to the top of the display - call for details. Features and Benefits: Please double click on the above images of our acrylic staff photo boards to zoom into a more detailed view Staff photo boards provide a professioal looking wall mounted display panel for quick reference of staff / team members Choice of black, white, clear or clear frost 5mm thick acrylic back panel with polished edges. Corners are rounded with no sharp edges Clear acrylic photo pockets allow staff photos to be changed quickly and easily Supplied with 4 polished sign fittings to give that floating effect off a wall Each photo pocket size is 75mm high x 50mm wide Header panel pocket is 260mm wide x 50mm high Please see the table below for our standard sized staff photo boards. We also manufacture custom sized boards if you require different sized pockets or different quantities of pockets - please call us on 01202 480104 for further details. Staff photo board prices are detailed in the drop down menu at the top of the page. Manufactured to order in our factory in Christchurch, Dorset, UK. Please allow 5 working days for delivery Please see our stand off fittings instructions by clicking here Looking for a a more secure staff photo board which can't be tampered with? Check out our Secure Staff Photo Boards ! Looking for a staff photo board with a different coloured back panel? We have a range of colours available other than our standard colours listed! Please contact us for a quote. Looking for a staff photo board with bespoke printing and branding to suit your business? With state of the art printers, we are able to fully print or brand these staff boards with your logos and messages! If this is something you are interested in, contact us for a quote! Code Photo Pockets Frame Size Width x Height (mm) SB10 10 430mm x 325mm SB20 20 430mm x 515mm SB30 30 500mm x 610mm SB40 40 640mm x 610mm SB50 50 780mm x 610mm SB60 60 780mm x 705mm SB65 65 800mm x 740mm SB70 70 780mm x 800mm SB80 80 780mm x 895mm SB100 100 780mm x 1085mm SB120 120 920mm x 1085mm SB140 140 1060mm x 1085mm SB160 160 1200mm x 1090mm Displays UK provide daily deliveries to most towns and cities in the UK including: Christchurch, Poole, Bournemouth, Swanage, Dorchester, Ferndown, Shaftesbury Sherborne Sturminster Newton Swanage Weymouth Ringwood New Forest Fordingbridge Salisbury Thank you for visiting our website Product Code: 64674569876345 Specification Code 64674569876345 Style Staff Photo Board Location Wall Mounted Weight 10.000 Kg Secured by sagePay Pay with PayPal Pay with Mastercard Pay with Visa × Items Quick basket Newsletter Signup Submit Exhibition Stands Outdoor Displays Display Cases Exhibition & Display Boards for Hire or Rent Leaflet, Brochure, Menu & Card Holders Banner Stands Counters & Plinths Noticeboards & Whiteboards Signage & Perspex Frames Display Boards Specialist Displays Perspex Cut To Size Displays (UK) Limited Displays UK are located in Christchurch, on the Hampshire / Dorset border. We are a proper 'bricks and mortar' manufacturing business not just another internet retailer. Read more… Head Office Units 16-18, 12 Airfield Road, Off Airfield Way, Christchurch, Dorset, BH23 3TG Tel: 01202 480104 Email: [email protected] Connect with us DISQ Display Innovation Service Quality Displays (UK) Limited registered in England and Wales with company number 8896740 and registered address Bank Court, Manor Road, Verwood, Dorset, BH31 6DY. VAT number GB980855382 © Displays (UK) Limited 2025 / Website by Adido / Terms & Conditions / Privacy / Sitemap"
    },
    {
      "url": "https://throwsomeshadeorl.com/reservation/",
      "text": "Reservations - Lamp & Shade Craft Kitchen And Cocktails 1336 N Mills Ave, Orlando, FL 32803 321-417-3477 lamp@thrivinghospitalityent.com Menu Find a Table Reservations Table Reservations Lamp & Shade is available for every night for reservation. We now offer custom birthday cakes made to order for your special occasion! To inquire, please contact us at your convenience: devyn@thrivinghospitalityent.com If you do not see your desired time slot available or your party exceeds 10 people, please call us. Tel: (321) 417-3477 Lamp & Shade Craft Kitchen & Cocktails Hours Of Operation Monday & Tuesday | 5:00pm – 11:00pm Wednesday & Thursday | 4:00pm – 11:00pm Friday | 4:00pm – 12:00am Saturday | 11:00am – 12:00am Sunday | 10:00am – 10:00pm Kitchen Hours Monday & Tuesday | 5:00pm – 10:00pm Wednesday & Thursday | 4:00pm – 10:00pm Friday | 4:00pm – 11:00pm Saturday | 11:00am – 11:00pm Sunday | 10:00am – 10:00pm Happy Hour Monday & Tuesday | 5:00pm – 6:00pm Wednesday – Friday | 4:00pm – 6:00pm Brunch Saturday | 11:00am – 3:00pm Sunday | 10:00am – 3:00pm 1336 N Mills Ave, Orlando, FL 32803 lamp@thrivinghospitalityent.com (321) 417-3477 Site Map Home Menu About Reservations Gift Cards Private Events / Catering Career Opportunities View In Google Maps Facebook Instagram © Copyright Thriving Hospitality 2025. Close Menu About Reservations Chef’s Table Gift Cards Private Events / Catering Opening Hours Monday & Tuesday 5:00pm - 11:00pm Wednesday & Thursday 4:00pm - 11:00pm Friday 4:00pm - 12:00am Saturday 10:00am - 12:00am Sunday 10:00am - 10:00pm * Happy Hour (Mon & Tues) 5:00pm - 6:00pm * Happy Hour (Wed - Fri) 4:00pm - 6:00pm * Brunch ( Sat & Sun) 10:00am - 3:00pm Our Location 1336 N Mills Ave, Orlando, FL 32803 321-417-3477 lamp@thrivinghospitalityent.com Close Search for: Search"
    },
    {
      "url": "https://www.giftly.com/gift-card/lamp-and-shade-craft-kitchen-and-cocktails-orlando",
      "text": "Lamp & Shade Craft Kitchen And Cocktails Giftly - Beautiful Gift Card Alternative Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Gifts Gift Cards Orlando Restaurants Lamp & Shade Craft Kitchen And Cocktails Lamp & Shade Craft Kitchen And Cocktails Gift Card Lamp & Shade Craft Kitchen And Cocktails Giftly A beautiful gift card alternative for Lamp & Shade Craft Kitchen And Cocktails Lamp & Shade Craft Kitchen And Cocktails 100% satisfaction guarantee Gift Amount $25 $50 $75 $100 $250 $500 $1000 Other Gift Design Continue 100% satisfaction guarantee Enter an amount between $5 and $1,000 Confirm Amount Lamp & Shade Craft Kitchen And Cocktails (194) (321) 417-3477 Categories Tapas/Small Plates, Cocktail Bars, Asian Fusion Location 1336 N Mills Ave, Orlando, FL Gift Tips Try the Squid Ink Calamari for a unique twist on a classic dish, praised for its incredible flavor and texture. Don't miss the Caesar Salad Bites, which have been highlighted as a delicious and unique appetizer. Order the Tomahawk steak for a standout main course that many guests rave about. Make sure to explore their craft cocktails, particularly the Afterglow cocktail, known for its creative twist and excellent flavor. Consider trying the dumplings as a starter; they are well-cooked and bursting with flavor, setting a great tone for your meal. Click here to send a gift up to $1,000 with the suggestion to use it at Lamp & Shade Craft Kitchen And Cocktails. Is this your business? Claim your business to update business information, customize this listing, and more! Learn more about Lamp & Shade Craft Kitchen And Cocktails Price $$$ Ambience Casual, Trendy, Classy Lamp & Shade Craft Kitchen and Cocktails is a lively restaurant located in the Mills 50 neighborhood of Orlando, FL. This contemporary dining and nightlife concept combines an energetic atmosphere with a menu inspired by Asian flavors. Ambiance : The ambiance is chic and inviting, featuring unique decor that creates a lively atmosphere perfect for a night out. Cuisine : Lamp & Shade offers a diverse Asian-influenced tapas menu, showcasing seasonal and local ingredients crafted into innovative dishes. Highlights : Guests enjoy a comprehensive beverage program with creative cocktails and standout dishes like the Squid Ink Calamari and Tomahawk steak. The restaurant is designed for both social gatherings and intimate dinners, making it a versatile choice for various occasions. With an attentive staff and a focus on quality ingredients, Lamp & Shade ensures each guest has a memorable experience. Lamp & Shade stands out not just for its food and drinks but also for its unique history, having transformed from a local lamp store into a vibrant culinary destination. It’s a place that captures the spirit of Orlando's dining scene, making it a must-visit spot. Great Alternatives Gift $100 for The Moderne : The Moderne in Orlando is a trendy and sophisticated establishment that offers a delightful fusion of culinary creativity and an inviting atmosphere. Buy a Gift & Greeting Card for Coro Restaurant : Coro Restaurant in Orlando offers a delightful culinary experience that seamlessly blends traditional Latin flavors with a modern twist. Updated: August 31, 2025 The Giftly Advantage With Giftly you strike a perfect balance, the thoughtfulness of a Lamp & Shade Craft Kitchen And Cocktails gift card with the flexibility of money. Easy to buy online. Have it delivered now or later Send it with a personalized greeting card 3 easy ways for your recipient to redeem the gift See a Sample Gift 100% satisfaction guaranteed No wasted balance Easy to customize How it works You customize a gift Gift up to $1,000 with the suggestion to use it at Lamp & Shade Craft Kitchen And Cocktails. Delivered in a personalized greeting card. They receive the gift Gifts can be sent by email, SMS*, mail or you can print it yourself. They enjoy it! They redeem the gift on our website and choose to deposit the funds in their bank account, Paypal account or to have a Visa Gift Card mailed to them. They can spend the money at Lamp & Shade Craft Kitchen And Cocktails or anywhere else they like! Top Related Gifts Topolino’s Terrace A Taste of Disney Magic and Elegance 1080 Esplanade Ave, Lake Buena Vista, FL 4.4 (461) • $$$ • Italian Psomi Taste Tradition with Every Bite 701 N Howard Ave, Tampa, FL 4.5 (751) • $$ • Bakeries Cala Bella Shingle Creek Italian Elegance in Every Bite 9939 Universal Blvd, Orlando, FL 4.1 (114) • $$$ • Italian Kimchi Korean Restaurant Authentic Korean Flavors in Oviedo 7 Alafaya Woods Blvd, Oviedo, FL 4.3 (239) • $$ • Korean Sticky Rice Lao Street Food Authentic Lao Flavor in Every Bite 1915 E Colonial Dr, Orlando, FL 4.4 (1.1k) • $$ • Tapas/Small Plates Café Tu Tu Tango Art, Tapas, and Good Vibes 8625 International Dr, Orlando, FL 4.4 (5.2k) • $$$ • Tapas/Small Plates Eola Lounge Tasty Plates, Trendy Cocktails 100 S Eola Dr, Orlando, FL 4.3 (88) • Tapas/Small Plates 98Forty Tapas & Tequila Tapas and Tequila, Orlando's Best Blend 9840 International Dr, Orlando, FL 3.7 (35) • $$ • Tapas/Small Plates More Nearby Businesses D'Loft Kitchen 6838 Hoffner Ave, Orlando, FL Tapas/Small Plates Toledo - Tapas, Steak & Seafood 1001 W Buena Vista Dr, Lake Buena Vista, FL 4.1 (251) • $$$ • Tapas/Small Plates Foxtail Farmhouse 1282 N Orange Ave, Winter Park, FL 4.1 (80) • $$ • Tapas/Small Plates Dba 809 N Mills Ave, Orlando, FL 4.7 (25) • $$ • Tapas Bars Kabooki Sushi 3122 E Colonial Dr, Orlando, FL 4.4 (1.1k) • $$$ • Asian Fusion Gyukatsu Rose 3201 Corrine Dr, Orlando, FL 4.8 (37) • $$$ • Japanese Ô Bon Chocolatier 3201 Corrine Dr, Orlando, FL 4.6 (13) • $$$ • Chocolatiers & Shops Boteco Restaurant 5135 International Dr, Orlando, FL 4.0 (197) • $$ • Brazilian Jaleo 1482 E Buena Vista Dr, Orlando, FL 3.5 (2) • Spanish King Bao 710 N Mills Ave, Orlando, FL 4.5 (1.5k) • $$ • Asian Fusion Little Saigon 1106 E Colonial Dr, Orlando, FL 3.7 (442) • $ • Vietnamese Tako Cheena 948 N Mills Ave, Orlando, FL 4.2 (2.0k) • $$ • Asian Fusion The Bistro Restaurant and Bar 730 N Magnolia Ave, Orlando, FL 4.1 (10) • Coffee & Tea Pigzza 1050 N Mills Ave, Orlando, FL 4.2 (338) • $$ • Pizza Mist Wine Bar and Tapas 6677 Sea Harbor Dr, Orlando, FL 3.9 (21) • $$ • Tapas/Small Plates The Wildflower 107 S Magnolia Ave, Sanford, FL 4.3 (107) • Tapas/Small Plates Eleven At Reunion Resort 7593 Gathering Dr, Kissimmee, FL 4.4 (33) • Tapas/Small Plates La Femme Du Fromage 3201 Corrine Dr, Orlando, FL 4.3 (176) • $$ • Cheese Shops Kaya 618 N Thornton Ave, Orlando, FL 4.7 (199) • $$$ • Filipino King Cajun Crawfish 924 N Mills Ave, Orlando, FL 4.2 (803) • $$$ • Cajun/Creole Pizza Bruno 2429 Edgewater Dr, Orlando, FL 3.8 (95) • Pizza The Whiskey 7563 W Sand Lake Rd, Orlando, FL 4.4 (1.2k) • $$ • American Strong Water Tavern 6601 Adventure Way, Orlando, FL 4.3 (276) • $$ • Caribbean Quickly Boba N Snow 3214 E Colonial Dr, Orlando, FL 4.0 (548) • $$ • Bubble Tea Banshoo Sushi Bar 9840 International Dr, Orlando, FL 3.1 (19) • $$ • Sushi Bars Maxine's On Shine 337 Shine Ave, Orlando, FL 4.3 (1.6k) • $$ • New American East End Market 3201 Corrine Dr, Orlando, FL 4.5 (399) • $$ • Public Markets Z Asian - Vietnamese Kitchen 1830 E Colonial Dr, Orlando, FL 4.3 (297) • $$ • Vietnamese The Living Room Bar 6100 Wave Hotel Dr, Orlando, FL 4.8 (16) • Tapas/Small Plates Matador Tacos and Tapas Bar 120 Broadway, Kissimmee, FL 3.8 (74) • Tapas/Small Plates Son Pastelitos Clermont, FL 4.7 (7) • Tapas/Small Plates Jaleo 1482 E Buena Vista Dr, Orlando, FL 4.0 (1.2k) • $$$ • Spanish Juju 700 Maguire Blvd, Orlando, FL 4.5 (210) • $$$ • Japanese Linda's La Cantina 4721 E Colonial Dr, Orlando, FL 4.3 (670) • $$$ • Steakhouses Chroma Modern Bar + Kitchen 6967 Lake Nona Blvd, Orlando, FL 4.3 (1.3k) • $$ • New American Paella House Restaurant 12701 S John Young Pkwy, Orlando, FL 3.6 (208) • $$ • Mediterranean Susuru 8548 Palm Pkwy, Orlando, FL 4.4 (1.1k) • $$ • Izakaya Sus Hi Eatstation 1830 E Colonial Dr, Orlando, FL 4.0 (193) • $$ • Japanese Mamak Asian Street Food 1231 E Colonial Dr, Orlando, FL 4.0 (1.2k) • $$ • Asian Fusion Pho Wheels 3100 East Colonial Dr, Orlando, FL 3.7 (3) • Korean EDOBOY Standing Sushi Bar 728 N Thornton Ave, Orlando, FL 4.9 (175) • Sushi Bars Chicken Fire 2425 E Colonial Dr, Orlando, FL 4.6 (686) • $$ • Chicken Shop See More Help If you have questions, need help, or want to modify, resend, or cancel a gift, please see our Support Center , where you can access an array of self-service tools and our FAQ. For other questions or issues, please contact support@giftly.com . Gift Disclosure The Giftly Prepaid Gift is redeemed for money through the Giftly website. It is not issued, endorsed, or accepted by any third-party merchant (including any third-party merchant explicitly referenced in this Giftly Prepaid Gift), and is not covered by the CARD Act. Giftly Prepaid Gifts never expire and there are no inactivity fees. Please see the Giftly Prepaid Gift Agreement for the complete terms. Tapas/Small Plates Cocktail Bars Asian Fusion 4.5 100-199 4 single place gcdp beautiful_gift_card_alternative_in_title_tag Orlando, FL XXL M Help Help Center How Giftly works FAQ support@giftly.com Corporate Why Giftly Sign Up Log In corporate@giftly.com Merchants Customize listing Remove listing Settlement Notice FAQ merchants@giftly.com About Team Press Blog Legal Terms Privacy Gift Agreement Business categories Restaurants Travel Shopping Activities Spa & Beauty Outdoors Going Out Nationwide Brands All Business Categories Business locations Atlanta Austin Boston Chicago Dallas Denver Detroit Houston Las Vegas Los Angeles Miami Minneapolis New York Oakland Philadelphia Phoenix Portland St. Louis San Diego San Francisco San Jose Seattle Wash, DC Browse All Restaurants Seafood Steakhouses Italian French Asian Fusion Pizza Sushi Burgers Mexican Japanese All Restaurant Types Gift Ideas Multi-Place Gift Ideas The Giftly Prepaid Gift is issued by Sunrise Banks N.A., St. Paul, MN 55103, Member FDIC. * Standard data rates, fees, and charges may apply to send by text. Copyright © 2025 Giftly. All rights reserved."
    },
    {
      "url": "https://www.brph.com/portfolio-items/lamp-shade-craft-kitchen-cocktails/",
      "text": "Lamp & Shade Craft Kitchen & Cocktails - BRPH Skip to content Toggle Navigation Who We Are Culture History Organization Who We Serve Aerospace Commercial Defense Education Entertainment Hospitality Manufacturing What We Do ThirdSpace™ News and Now Updates Ideas & Insights On The Boards Portfolio Careers Contact Locations Subcontractor Prequalification Lamp & Shade Craft Kitchen & Cocktails Services Interior Design Cocktail Lamp, LLC Orlando, Florida Breathing new life into a landmark Orlando building, BRPH has transformed the former The Lamp & Shade Fair repair shop into the colorful and whimsical Lamp & Shade Craft Kitchen and Cocktails. This up-and-coming Central Florida hotspot pays playful homage to its 40-year roots by incorporating lamp shade motifs throughout, including a mural by a local artist depicting fashionable figures adorned with lampshades to create plenty of Instagram-able moments. The interior features a custom wallcovering by Astek, interweaving lamp shades into a dynamic squirrel pattern. The bar is the focal point of the space with integrated lighting accessorized by colorful accents and seating for 22 patrons. A collaboration with Barn Light, a Central Florida lighting manufacturer, resulted in an eclectic collection of bespoke fixtures that illuminate the cozy space. A curated collection of furniture provides 72 lounge seat options for guests to cozy up with a craft cocktail and socialize with friends. Outside, a profound diversity mural by Luna Mosaic Arts, commissioned in 2016 to honor the Pulse Nightclub victims, was thoughtfully preserved. This blend of history and creativity makes this destination a vibrant tribute to its past and a beacon of interior design ingenuity. Related Projects School District of Osceola County – Gateway High School Volusia County Schools – Tomoka Elementary Amazon Kuiper Payload Processing Facility Kennedy Space Center Visitor Complex – Gateway: The Deep Space Launch Complex BRPH is a technically focused, creative architecture, engineering and construction company with six decades of expertise in helping mission-driven clients identify gaps in their program delivery and develop innovative solutions to their most challenging problems. Home Who We Are Who We Serve News and Now Careers Contact Registrations Copyright © 2025 BRPH | All Rights Reserved | Website By Visit the Rock Paper Simple Website Copyright © 2025 BRPH | All Rights Reserved Website By Visit the Rock Paper Simple Website Page load link Go to Top"
    },
    {
      "url": "https://www.orlandoweekly.com/orlando/lamp-shade-craft-kitchen-and-cocktails-poised-for-december-opening/Slideshow/35279413",
      "text": "Lamp + Shade Craft Kitchen and Cocktails poised for December opening - Orlando Weekly Close Search for: Search News Open dropdown menu Abortion Rights Orlando Area News Florida News LGBTQ+ Pulse Views + Opinions Orlando Guides Digital Issue News Photos Arts + Culture Open dropdown menu Arts Stories + Interviews Things to Do Orlando Theme Parks Arts + Culture Photos Food + Drink Open dropdown menu Food News Drinking + Bars Restaurant Reviews Find a Restaurant Food + Drink Photos Music Open dropdown menu Music Stories + Interviews Orlando Music News Live Music Picks + Previews Find a Concert Music Photos Movies Open dropdown menu Movie Reviews Streaming Find a Theater Movie Times Cannabis Open dropdown menu Cannabis News Legislative Updates Dispensary Directory Calendar Open dropdown menu Today’s Events This Weekend Free Events Submit an Event Best Of Orlando® Open dropdown menu 2025 Voting Arts + Entertainment Attractions + Recreation City Life Drinking + Nightlife Food + Dining Health, Beauty + Wellness Local Music Local Notables Services Shopping + Retail Shop Best of Awards Orlando Photos Support Open dropdown menu Support Subscribe Advertise Instagram Twitter Facebook Facebook Bluesky TikTok Instagram Apple News Google News Close Skip to content EARLY BIRD SALE TICKETS TO ORLANDO BEER FEST NOW AVAILABLE. BUY YOURS NOW! Facebook Bluesky TikTok Instagram Apple News Google News Orlando Weekly Open Search Search for: Search Support Us Menu News Open dropdown menu Abortion Rights Orlando Area News Florida News LGBTQ+ Pulse Views + Opinions Orlando Guides Digital Issue News Photos Arts + Culture Open dropdown menu Arts Stories + Interviews Things to Do Orlando Theme Parks Arts + Culture Photos Food + Drink Open dropdown menu Food News Drinking + Bars Restaurant Reviews Find a Restaurant Food + Drink Photos Music Open dropdown menu Music Stories + Interviews Orlando Music News Live Music Picks + Previews Find a Concert Music Photos Movies Open dropdown menu Movie Reviews Streaming Find a Theater Movie Times Cannabis Open dropdown menu Cannabis News Legislative Updates Dispensary Directory Calendar Open dropdown menu Today’s Events This Weekend Free Events Submit an Event Best Of Orlando® Open dropdown menu 2025 Voting Arts + Entertainment Attractions + Recreation City Life Drinking + Nightlife Food + Dining Health, Beauty + Wellness Local Music Local Notables Services Shopping + Retail Shop Best of Awards Orlando Photos Support Open dropdown menu Support Subscribe Advertise Instagram Twitter Facebook Posted in Food + Drink Lamp + Shade Craft Kitchen and Cocktails poised for December opening by Faiyaz Kara October 13, 2023 Share this: Click to email a link to a friend (Opens in new window) Email Click to share on Reddit (Opens in new window) Reddit Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to share on Nextdoor (Opens in new window) Nextdoor Click to share on Bluesky (Opens in new window) Bluesky In February, we told you about Lamp & Shade Craft Kitchen and Cocktails opening in the old Lamp & Shade Fair building at 1336 N. Mills Ave. in Mills 50. Like most restaurant openings, Lamp & Shade has been plagued by delays, but the restaurant has cleared numerous hurdles and is poised to open in early December. We can now lift the shade off to reveal some details about the concept. Ryan Stewart, executive chef of Thriving Hospitality, says Lamp & Shade will offer an “Asian-influenced, tapas-style menu” (menu and food images posted below) as well as a “comprehensive beverage program” focusing on “riffs of tiki classics” overseen by part-owner and beverage developer Courtney Williams. All of Lamp & Shade’s cocktails will be designed to pair with Stewart’s menu. The restaurant’s playful name, of course, pays homage to the longstanding lamp store that first opened in this space back in 1963. Judging from the above renderings, lighting will certainly be a central focus of the restaurant’s interior design. The mural inside the restaurant by artist Sumner Mormeneo fuses elements of surrealism, Dada and Pop Art and is intended to be a conversation piece exploring the meaning behind the concept. The restaurant’s exterior features the “Diversity Mural” by artist Cherie Bosela , a work memorializing the victims of the Pulse Nightclub shooting and dedicated to all who suffer from discrimination. The Thriving Hospitality group also includes Thrive Cocktail Lounge & Eatery downtown, and Bounce House Social Eats near UCF. Check out food photos as well as the food and drink menus below. For all the latest info and updates, follow @throwsomeshadeorl on Instagram. ( Note: Instagram handle corrected after publication; we regret the previous error. ) Subscribe to Orlando Weekly newsletters. Follow us: Apple News | Google News | NewsBreak | Reddit | Instagram | Facebook | Twitter | or sign up for our RSS Feed Lamp & Shade Craft Kitchen Credit: Image courtesy of Thriving Hospitality Lamp & Shade Craft Kitchen Credit: Image courtesy of Thriving Hospitality Hamachi Kama (gochujang glaze, blistered shishitos, sesame seeds, grilled lemon) Credit: photo courtesy of Thriving Hospitality Dumplings (purple sweet potatoes, pecans, pepitas, soy miso butter, local greens) Credit: photo courtesy of Thriving Hospitality Stone Fried Rice (local vegetables, viola flowers, sunny side up egg, rock shrimp) Credit: photo courtesy of Thriving Hospitality Jack’s Crispy Rice (spicy jackfruit, avocado, lotus chip, gochujang glaze) Credit: photo courtesy of Thriving Hospitality “Diversity Mural” “Buried in Pearls” (Smith & Cross, Hamilton 86 demerara, Bacardi 8 Year, Falernum, vanilla honey butter, mandarin, lime) Credit: photo courtesy of Thriving Hospitality Blackened Tuna (avocado smash, lotus chip, citrus, caviar, melon greens, peach pepper aioli) Credit: photo courtesy of Thriving Hospitality Crispy Tofu (spicy chimichurri aioli, lotus chips) Credit: photo courtesy of Thriving Hospitality “Under the Same Sun” (Don Julio Blanco, Del Maguey Vida Mezcal, Boomsma Beerenburger, falernum, tamarind-shiso shrub, lime) Credit: photo courtesy of Thriving Hospitality Beverage Menu Credit: Thriving Hospitality Beverage Menu Credit: Thriving Hospitality Additional Slideshows All the Orlando restaurants and bars that closed in 2023 Orlando in Photos Rosie O’Donnell’s former Florida mansion sells for $36 million Will’s Pub celebrated the dawn of its dirty 30s with a Shriektacular night of Orlando sounds Garbage kicked off farewell tour in Orlando with renewed fire WE LOVE OUR READERS! Since 1990, Orlando Weekly has served as the free, independent voice of Orlando, and we want to keep it that way. Becoming an Orlando Weekly Supporter for as little as $5 a month allows us to continue offering readers access to our coverage of local news, food, nightlife, events, and culture with no paywalls. Join today because you love us, too. Tagged: Lamp & Shade , new Orlando restaurant , Orlando restaurant , Orlando restaurant openings , Slideshow Gallery Faiyaz Kara Orlando restaurant critic. Orlando Weekly restaurant critic since 2006. More by Faiyaz Kara SEND A NEWS TIP Trending Florida’s first H Mart finally opens in Orlando this month September 4, 2025 Here are the 20 most miserable places in Orlando July 25, 2024 All the Guy Fieri ‘Diners, Drive-Ins and Dives’ restaurants within driving distance of Orlando August 29, 2025 Orlando restaurants open for 25 years or more that every local should know April 10, 2025 Newsletters Join Orlando Weekly Newsletters Subscribe now to get the latest news delivered right to your inbox. SIGN UP NOW News News Abortion Rights Orlando Area News Florida News LGBTQ+ Pulse Informed Dissent Views + Opinions Orlando Sports Savage Love Reader Reactions Comics Digital Issue News Photos Movies Movies Movie Reviews Streaming Find a Theater Movie Times Arts + Culture Arts + Culture Arts Stories + Interviews Live Active Cultures Things to Do Orlando Theme Parks Astrology Performing Arts Visual Arts Arts + Culture Photos Calendar Calendar Orlando Weekly Events Today’s Events This Weekend Free Events Submit an Event Social Media Facebook Instagram Bluesky TikTok Food + Drink Food + Drink Food News Drinking + Bars Restaurant Reviews Find a Restaurant Food + Drink Photos Best Of Orlando® Best Of Orlando® 2025 Voting Arts + Entertainment Attractions + Recreation City Life Drinking + Nightlife Food + Dining Health, Beauty + Wellness Local Music Local Notables Services Shopping + Retail Shop Best of Awards 🥇 Sponsored Links Apartments Near UCF Apartments Near Full Sail Orlando Apartments Music Music Music Stories + Interviews Orlando Music News Live Music Picks + Previews This Little Underground Find a Concert Music Photos Cannabis Cannabis Cannabis News Legislative Updates Dispensary Directory Orlando Guides Orlando Guides City Guide Bite Fall Guide Holiday Guide Newcomers Guide Summer Guide Legal Advertising Sponsored Orlando Weekly Events Bite30 Orlando Beer Festival Whiskey Business Tacos & Tequila Brunch in the Park Beer ‘Merica Orlando Taco Week About Contact Us Work for Us Staff Directory Where to find us FAQs Policies Support Subscribe Advertise Chava Communications Read our sister publications SUPPORT US Orlando Weekly PO Box 953127. Lake Mary, FL 32795 © 2025 Orlando Weekly Powered by Newspack Facebook Bluesky TikTok Instagram Apple News Google News Loading Comments... Write a Comment... Email (Required) Name (Required) Website"
    },
    {
      "url": "https://throwsomeshadeorl.com/",
      "text": "Home - Lamp & Shade Craft Kitchen And Cocktails 1336 N Mills Ave, Orlando, FL 32803 321-417-3477 lamp@thrivinghospitalityent.com Menu Find a Table Welcome to Lamp & Shade Craft kitchen And Cocktails Order Online Order Online Uber Eats Delivery Join Our Text Club | Text JOIN to 1-833-344-0067 and Enjoy 10% Off Your Next Meal! Lamp & Shade's Story About Us Playfully yet eloquently named, Lamp & Shade Craft Kitchen and Cocktails got its inspiration from the idea to ‘hangout and throw some shade in conversation’ while paying homage to the history of its building, previously The Lamp Shade Fair, well-known by locals for over 50 years. Discover More Discover the full menu À la Carte Food Discover More Beverage Discover More Happy Hour Discover More Brunch Discover More More At Lamp & Shade Private Events & Catering We do everything from small groups to full buyouts, and curated in-house experiences. Our team is here to listen to all your needs and make your dreams come true. Your wish is our command! Discover More Join Our Text Club | Text JOIN to 1-833-344-0067 and Enjoy 10% Off Your Next Meal! Lamp & Shade Craft Kitchen & Cocktails Hours Of Operation Monday & Tuesday | 5:00pm – 11:00pm Wednesday & Thursday | 4:00pm – 11:00pm Friday | 4:00pm – 12:00am Saturday | 11:00am – 12:00am Sunday | 10:00am – 10:00pm Kitchen Hours Monday & Tuesday | 5:00pm – 10:00pm Wednesday & Thursday | 4:00pm – 10:00pm Friday | 4:00pm – 11:00pm Saturday | 11:00am – 11:00pm Sunday | 10:00am – 10:00pm Happy Hour Monday & Tuesday | 5:00pm – 6:00pm Wednesday – Friday | 4:00pm – 6:00pm Brunch Saturday | 11:00am – 3:00pm Sunday | 10:00am – 3:00pm 1336 N Mills Ave, Orlando, FL 32803 lamp@thrivinghospitalityent.com (321) 417-3477 Site Map Home Menu About Reservations Gift Cards Private Events / Catering Career Opportunities View In Google Maps Facebook Instagram © Copyright Thriving Hospitality 2025. Close Menu About Reservations Chef’s Table Gift Cards Private Events / Catering Opening Hours Monday & Tuesday 5:00pm - 11:00pm Wednesday & Thursday 4:00pm - 11:00pm Friday 4:00pm - 12:00am Saturday 10:00am - 12:00am Sunday 10:00am - 10:00pm * Happy Hour (Mon & Tues) 5:00pm - 6:00pm * Happy Hour (Wed - Fri) 4:00pm - 6:00pm * Brunch ( Sat & Sun) 10:00am - 3:00pm Our Location 1336 N Mills Ave, Orlando, FL 32803 321-417-3477 lamp@thrivinghospitalityent.com Close Search for: Search Book Here"
    },
    {
      "url": "https://www.orlandosentinel.com/2024/09/05/lamp-and-shade-restaurant-review-amy-drew-thompson-mills-50-orlando/",
      "text": "Lamp & Shade brings another bright spot to Orlando's Mills 50 scene Skip to content All Sections Subscribe Now 87°F Thursday, September 11th 2025 Daily e-Edition Evening e-Edition Home Page Daily e-Edition Evening e-Edition News News Latest Headlines Politics Education National News Local News Local News Lake County Orange County Osceola County Seminole County Health Health Medicare Sports Sports High School Sports UCF Knights Orlando Magic Mike Bianchi Commentary Florida Gators Business Business Tourism Economy Real Estate GrowthSpotter Consumer Reviews Weather Weather Conditions and Forecasts Hurricanes Hurricane preparedness Hurricane Tracks Opinion Opinion Letters to the Editor Scott Maxwell Commentary Editorials Endorsements Entertainment Entertainment Theater and Arts Things to Do Horoscopes Restaurants, Food & Drink Events Travel Travel Theme Parks Epic Universe Explore Florida Cruises Florida & Caribbean Experiences Obituaries Obituaries News Obituaries Place an Obituary Branded Content Paid Partner Content Advertising by Ascend Paid Content by Brandpoint Classifieds Services About the Orlando Sentinel Manage Subscription Subscriber Benefits Sign up for Newsletters Buy an advertisement Sign up for email newsletters Sign Up Restaurants, Food & Drink | Amy Drew Thompson: Lamp & Shade brings another… Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on Bluesky (Opens in new window) Bluesky Click to share on X (Opens in new window) X Subscribe Login Account Settings Contact Us Log Out Spoof a user Sign up for email newsletters Sign Up Subscribe Login Search 87°F Thursday, September 11th 2025 Daily e-Edition Evening e-Edition Sponsored by Entertainment Theater and Arts Things to Do Horoscopes Restaurants, Food & Drink Travel Trending: ☹️ Ticked off! 🚀 Launch schedule 🔍 Restaurant Inspections 🏠 Homeless Camping Ban 💻 Donate to Sentinel News Fund ❓🧔🏾‍♂️❓Read Asking Eric Sponsored by Breaking News FBI releases photos of person of interest in Charlie Kirk’s killing on a Utah university campus Things To Do Restaurants, Food & Drink Lamp & Shade brings another bright spot to Mills 50 | Review Asian-inspired eats that might make the trendy bar crawlers sit and stay. Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on Bluesky (Opens in new window) Bluesky Click to share on X (Opens in new window) X Super delish king crab ‘n’ grits. It’s a pricier brunch plate at $36, but hearty as hell, shareable and decadent. Calorie counters, steer way clear. (Amy Drew Thompson/Orlando Sentinel) By Amy Drew Thompson | amthompson@orlandosentinel.com | Orlando Sentinel PUBLISHED: September 5, 2024 at 5:00 AM EDT More than 10 years ago, I brought a brass globe into Lamp & Shade Fair, a decades-old, family-run store on Mills Avenue, and they turned it into a pendant fixture. Suspended from the extra-high ceiling of my entryway, it radiated welcome — even from the street, as it was visible through a window above the home’s front door. There’s solid stuff simmering at Boiled Fish | Review The shop had old-school feels in the best way. Outside, a colorful mural welcomed shoppers. Inside, close quarters and a bit of repair-shop clutter made it cozy, comfortable —the same sort of vibes I get from shoe-repair shops, redolent of polish and leather and  craftsmanship. It spoke to a certain level of service and expertise. The ceilings at 1336 N. Mills Ave. are no longer low-slung. In fact, they soar. Those who remember Lamp & Shade Fair will find the airy new restaurant unrecognizable. Everyone will find it beautiful. (Amy Drew Thompson/Orlando Sentinel) Loads of natural light, along with clean-lined pendants, an illuminated wall behind the bar and a smattering of fixtures amid the exposed ducts and beams do their jobs well. This means that I — and others intent on showing off the new ownership’s level of service and expertise — can forgo those obnoxious ring lights when snapping pics of the workmanship. This is Lamp & Shade Craft Kitchen and Cocktails , Mills 50’s newest hot spot for sips and snacks and being seen, and the third Orlando offering from local restaurant group Thriving Hospitality ( Thrive Cocktail Lounge & Eatery , Bounce House ). Shades of chefdom. Left to right, Lamp & Shade Sous Chef Stephanie Roig-Hernandez, Executive Chef Ryan Stewart and R&D Chef Courtney Deneau. (Photo courtesy Thriving Hospitality) “This one is a departure from both,” says Ryan Stewart, executive chef for Thriving Hospitality, which acquired the building before the pandemic. “It took us close to three years before it was all said and done.” Not surprising. The 50-year-old building, a retail operation, was hardly fit for restauranting. Everything here is either retrofitted or new. Murals inside playfully honor the venue’s past, as does the name. Smoked trout dip is served with house-made chips that are cooked to order. (Amy Drew Thompson/Orlando Sentinel) “Mills 50 is very vibrant. It’s the spot to be,” says Stewart, a Nashville native whose Orlando tenure began 10 years ago at Universal CityWalk’s Cowfish. “This building was so important for so long in the community — we asked the previous owners if we could keep the name. They thought we were crazy, but they were honored.” It’s doubtful any lighting store was ever such a scene. The rum- and pisco-based Pink + White is a super-refresher that showcases that POW dragonfruit hue. (Amy Drew Thompson/Orlando Sentinel) Lamp & Shade cattily urges you to “throw some shade” via the neon photo-op in the back, but the place is buzzing with friendly, if trendy, energy. Well-planned seating and those tall walls make the space feel airy, even when the bar crawlers are out in full force. The menu here suits that M.O. — shareable small plates and playful, posh cocktails are the order — but can easily handle a group hang or extended dinner if you have plans to linger. Cases in point: larger “for the table” dishes, including shiitake risotto and a bone-in tomahawk steak. Either way, the joint is fashionable. “We’re blessed to have the vibes,” says Stewart. “For lack of a better term, it’s the ‘grown and sexy’ coming out at Lamp. They’ll go to The Guesthouse or Sunroom across the street, pop over here for a drink and some plates and when we see them leave, a lot are headed down Mills for a nightcap or to enjoy the next part of their evening.” The Strand is now doing business as d.b.a. in the chic, chill space next door | Review The location is a hospitality hotbed. “On almost any given night, I will recognize a chef or bar staffer from another restaurant. I’m always telling my team there’s a ton of eyes on us. The food has to be perfect. The drinks have to be perfect.” Taste is subjective, of course, but if all you ate with were your eyes, you’d leave fat and happy. Shiitalkin' Shade is a Ketel One-Shōchū amalgam with fruity Mandarin punch. Shiitake syrup gives it a lingering earthy undertone that we loved, but probably isn't for everyone. (Amy Drew Thompson/Orlando Sentinel) Here, gorgeous cocktails move from bar to tables like a runway show, a parade of color and and glassware and garnish. Take the brunchy delights of the Pink & White ($13), a rum and pisco refresher with its dragonfruit drama and dehydrated fascinator amid flawless ice or the Shiitalkin’ Shade ($14), a bright, citrusy offering with the unique add of shiitake syrup. Not for everyone, but we loved its lingering earthiness. Plates, too, dazzle. For fans of the fried stuff, crispy tofu bites with spicy chimichurri aioli are a fun choice.(Amy Drew Thompson/Orlando Sentinel) On a first visit, the crispy tofu ($12) was a hearty winner, served in a martini glass with chimichurri aioli and addictively spicy lotus chips. It’s one of many vegan offerings here (and done in its own dedicated fryer). This is something Stewart and his team spent time on. There are eight to 10 vegan dishes on the menu here. None are throwaway plant-based box checkers. The brunch menu’s plantain pancakes, in fact, are sublime. My leftovers were destroyed by two discriminating teenagers before they made it into the fridge. “We wanted the vegan community to be able to come in and enjoy a full meal sitting beside their [non-vegan] friends, to eat and be full and leave ecstatic.” Behold the plantain pancakes.  You want these whether you're vegan or just love pancakes. Fluffy and hearty and crunchy and coconut-creamy, all at once. (Amy Drew Thompson/Orlando Sentinel) The pancakes ($16), fluffy but weighted with the caramelized starchiness of plantain bits, come layered with cinnamon sugar and corn flake crumble, a pouf of coconut whipped cream alongside. And while we’re talking brunch, the king crab and grits ($36) isn’t just a must-get flavor bomb; it’s a must-share for its richness and an exemplary representation of Stewart’s Asian-influenced menu. Here, Creole meets Korea in a sauce built on kimchi and charred tomatoes. Super delish king crab 'n' grits. It's a pricier brunch plate at $36, but hearty as hell, shareable and decadent. Calorie counters, steer way clear. (Amy Drew Thompson/Orlando Sentinel) “I’m from the South,” Stewart laughs, “so butter makes the grits for me … that amazing base, with Applewood-smoked bacon, lots of butter and love and all that king crab, we’re getting it out of the shells and chopping it up and putting a nice portion in the center with fresh chives.” Get it. Our enthusiastic server sold us on the Curry Green Mussels, which are something of a love letter. Chef Ryan Stewart made them for his wife. Not surprising that some guests order a side of the soppable sauce. You might find yourself spooning it up when the bivalves have gone bye-bye. (Amy Drew Thompson/Orlando Sentinel) There are other seafood love stories on this menu, too. On our first visit, the server’s exuberance for the curry mussels ($18) sold us. Some customers, Stewart tells me, order a side of the sauce to go. I’m not surprised. Our server brought us spoons for the occasion to sample the creamy sweetness and subtle heat on its own. We resisted extra bread, as there was much to taste, but it’s something you might want to ask for upfront. Duck dumplings ($14), crisp purses loaded with ginger and garlic flavor, were a hit, though I’d have passed on the orange aioli accompaniment in which they sat. My companion, however, loved the stuff. Menu writing is tricky. Duck dumplings atop orange aioli. (Amy Drew Thompson/Orlando Sentinel) “We’re at a juncture here,” says Stewart. “We’re close to Winter Park, with a crowd that wants its food a certain way. You have the industry people who want their food a certain way. You have the Mills community with its own preferences. It’s been a big eye-opener for me. I’ve never had this much feedback on my food before.” As with any art form, you can’t please everybody. “More than anything, though, it’s made me a better chef.” The Shady Spice is a mellow brunch-menu cocktail, with notes of gingerbread and tea. (Amy Drew Thompson/Orlando Sentinel) Smoked trout dip with radish and leek, shallot and bonito flakes, is dreamy alongside housemade chips that are fried to order ($24). The Shady Spice cocktail ($14) feels like fall in a glass, tea meets gingerbread. It came recommended by a local chef I know who spotted me from his perch at the bar. Stewart’s not fibbing when he says the restaurant crowd has made Lamp & Shade a new habit since doors opened back in May. It makes sense. It’s not just well-located. It’s lit. Find me on Facebook, TikTok, Twitter or Instagram @amydroo or on the OSFoodie Instagram account @orlando.foodie . Email: amthompson@orlandosentinel.com , For more foodie fun, join the Let’s Eat, Orlando Facebook group . If you go Lamp & Shade Craft Kitchen and Cocktails: 1336 N. Mills Ave. in Orlando, 321-417-3477; throwsomeshadeorl.com Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on Bluesky (Opens in new window) Bluesky Click to share on X (Opens in new window) X RevContent Feed Most Popular Most Popular Orange schools to reassign over 100 school teachers amid enrollment drops Orange schools to reassign over 100 school teachers amid enrollment drops DeSantis’ step toward victory on ‘Alligator Alcatraz’ sets up a funding dilemma for Florida DeSantis’ step toward victory on ‘Alligator Alcatraz’ sets up a funding dilemma for Florida 7 Central Florida restaurants shut down last week 7 Central Florida restaurants shut down last week Florida’s ban on open carry of guns is unconstitutional, appeals court rules Florida’s ban on open carry of guns is unconstitutional, appeals court rules Conservative activist Charlie Kirk assassinated at Utah university Conservative activist Charlie Kirk assassinated at Utah university Florida warns teachers not to post negatively about Charlie Kirk Florida warns teachers not to post negatively about Charlie Kirk Orange judge reprimanded by Florida Supreme Court over rude comments Orange judge reprimanded by Florida Supreme Court over rude comments UCF, HBCUs nationwide receive threats against Black people on campus UCF, HBCUs nationwide receive threats against Black people on campus FBI releases photos of person of interest in Charlie Kirk’s killing on a Utah university campus FBI releases photos of person of interest in Charlie Kirk’s killing on a Utah university campus Orlando mourns Tom Moench, 64, founder of Orange Blossom Brewing Orlando mourns Tom Moench, 64, founder of Orange Blossom Brewing More in Restaurants, Food & Drink Gemütlichkeit: It’s the Oktoberfest state of being Amy Drew Thompson: UCF-adjacent Shokupan Bakehouse slings fun, fast-casual sandwiches Orlando mourns Tom Moench, 64, founder of Orange Blossom Brewing 3 singular spots to wine down around Orlando 2024 September 5 Tribune Publishing Chicago Tribune The Morning Call of Pa. Daily Press of Va. New York Daily News South Florida Sun-Sentinel Hartford Courant The Virginian-Pilot Studio 1847 Company Info Archives Contact Us at the Orlando Sentinel Community News Fund Careers Manage Account Newsletters Daily e-Edition Evening Edition Help Advertise with Us Place an Ad Auto Listings Find a Job About the Orlando Sentinel Photo requests, reprints Send us a News Tip Subscriber Services & Help Site Map Subscribe Now Subscriber Terms and Conditions Terms of Service Privacy Policy Cookie Policy Cookie Preferences CA Notice at Collection CA Notice of Financial Incentive Do Not Sell/Share My Personal Information Copyright © 2025 Orlando Sentinel Close"
    },
    {
      "url": "https://throwsomeshadeorl.com/privateeventsandcatering/",
      "text": "Private Events / Catering - Lamp & Shade Craft Kitchen And Cocktails 1336 N Mills Ave, Orlando, FL 32803 321-417-3477 lamp@thrivinghospitalityent.com Menu Find a Table Private Events / Catering Get In Touch We do everything from small groups to full buyouts, curated in-house experiences, catering and custom cakes made to order for your special occasion! Our team is here to listen to all your needs and make your dreams come true. Your wish is our command! For all inquiries, please fill out the form below and we’ll be in touch soon. If you have any questions, feel free to reach out at lampevents@thrivinghospitalityent.com . Facebook Instagram Full Name Email Phone Company Date Time Select Event Type Alumni Bachelor / Bachelorette Birthday Cocktail Reception Corporate Lunch Engagement Fundraiser Graduation Holiday Meeting / Presentation Photo / Film Shoot Private Dinner Rehearsal Dinner Shower Sporting Event Wedding Other Number Of People How Did You Hear About Us? Word Of Mouth Social Media Google Networking Event Email Newsletter Online Advertisement Influencer Other Additional Information (Optional) Lamp & Shade Craft Kitchen & Cocktails Hours Of Operation Monday & Tuesday | 5:00pm – 11:00pm Wednesday & Thursday | 4:00pm – 11:00pm Friday | 4:00pm – 12:00am Saturday | 11:00am – 12:00am Sunday | 10:00am – 10:00pm Kitchen Hours Monday & Tuesday | 5:00pm – 10:00pm Wednesday & Thursday | 4:00pm – 10:00pm Friday | 4:00pm – 11:00pm Saturday | 11:00am – 11:00pm Sunday | 10:00am – 10:00pm Happy Hour Monday & Tuesday | 5:00pm – 6:00pm Wednesday – Friday | 4:00pm – 6:00pm Brunch Saturday | 11:00am – 3:00pm Sunday | 10:00am – 3:00pm 1336 N Mills Ave, Orlando, FL 32803 lamp@thrivinghospitalityent.com (321) 417-3477 Site Map Home Menu About Reservations Gift Cards Private Events / Catering Career Opportunities View In Google Maps Facebook Instagram © Copyright Thriving Hospitality 2025. Close Menu About Reservations Chef’s Table Gift Cards Private Events / Catering Opening Hours Monday & Tuesday 5:00pm - 11:00pm Wednesday & Thursday 4:00pm - 11:00pm Friday 4:00pm - 12:00am Saturday 10:00am - 12:00am Sunday 10:00am - 10:00pm * Happy Hour (Mon & Tues) 5:00pm - 6:00pm * Happy Hour (Wed - Fri) 4:00pm - 6:00pm * Brunch ( Sat & Sun) 10:00am - 3:00pm Our Location 1336 N Mills Ave, Orlando, FL 32803 321-417-3477 lamp@thrivinghospitalityent.com Close Search for: Search"
    },
    {
      "url": "https://throwsomeshadeorl.com/about/",
      "text": "About - Lamp & Shade Craft Kitchen And Cocktails 1336 N Mills Ave, Orlando, FL 32803 321-417-3477 lamp@thrivinghospitalityent.com Menu Find a Table Our Story THE SECRET OF OUR SUCCESS A distinctive, well-preserved and comfortable space, high-quality products, authentic cuisine, food & drinks done flawlessly. ——– The Bar's History Our Philosophy At Lamp & Shade, we believe that an exceptional dining experience arises from a harmony of dedicated service, meticulous attention to detail, and a profound respect for our ingredients. Our philosophy is rooted in a commitment to excellence in every aspect of our service. Each dish and every drink we present is crafted with the highest quality ingredients, sourced responsibly and prepared with both skill and passion. Beloved Place Unique Experience We take pride in creating memorable moments for our guests, curating an atmosphere where each visit becomes a unique and cherished experience. Above all, our aim is to exceed expectations, ensuring that from the moment our guests arrive to their very last sip, every detail is flawless. Here, fine dining is not just eating, it is an event—a celebration of culinary artistry and exceptional hospitality. Make A Reservation Lamp & Shade Craft Kitchen & Cocktails Hours Of Operation Monday & Tuesday | 5:00pm – 11:00pm Wednesday & Thursday | 4:00pm – 11:00pm Friday | 4:00pm – 12:00am Saturday | 11:00am – 12:00am Sunday | 10:00am – 10:00pm Kitchen Hours Monday & Tuesday | 5:00pm – 10:00pm Wednesday & Thursday | 4:00pm – 10:00pm Friday | 4:00pm – 11:00pm Saturday | 11:00am – 11:00pm Sunday | 10:00am – 10:00pm Happy Hour Monday & Tuesday | 5:00pm – 6:00pm Wednesday – Friday | 4:00pm – 6:00pm Brunch Saturday | 11:00am – 3:00pm Sunday | 10:00am – 3:00pm 1336 N Mills Ave, Orlando, FL 32803 lamp@thrivinghospitalityent.com (321) 417-3477 Site Map Home Menu About Reservations Gift Cards Private Events / Catering Career Opportunities View In Google Maps Facebook Instagram © Copyright Thriving Hospitality 2025. Close Menu About Reservations Chef’s Table Gift Cards Private Events / Catering Opening Hours Monday & Tuesday 5:00pm - 11:00pm Wednesday & Thursday 4:00pm - 11:00pm Friday 4:00pm - 12:00am Saturday 10:00am - 12:00am Sunday 10:00am - 10:00pm * Happy Hour (Mon & Tues) 5:00pm - 6:00pm * Happy Hour (Wed - Fri) 4:00pm - 6:00pm * Brunch ( Sat & Sun) 10:00am - 3:00pm Our Location 1336 N Mills Ave, Orlando, FL 32803 321-417-3477 lamp@thrivinghospitalityent.com Close Search for: Search"
    },
    {
      "url": "https://throwsomeshadeorl.com/menus/",
      "text": "Menu - Lamp & Shade Craft Kitchen And Cocktails 1336 N Mills Ave, Orlando, FL 32803 321-417-3477 lamp@thrivinghospitalityent.com Menu Find a Table Menu Hot Plates Bread Service (V) gochugaru shishito cornbread, whipped corn scallion butter, smoked salt Dumplings (V) corn shishito salsa, potato, micro cilantro, chili bomb ponzu Cauliflower (V)(VG) coconut creamed spinach, sesame Hasselback Potatoes herb aioli, truffle oil, parmesan, bonito flakes, scallions Baby Zucchini  (V)(VG)(GF) zucchini purée, black garlic, sweet soy glaze, garlic chips, grilled lemon Squid Ink Calamari calamari, kobachi sauce, sweet pepper, micro cilantro Curry Mussels green coconut curry, micro cilantro, charred bread Grilled Octopus smoked tomato tamarind, lotus root, marinated tomatoes, pea tendril salad Pork Belly miso caramel, báhn mì slaw, peanut dust,\nmicro cilantro, sesame oil Vegan Bone Marrow (V)(VG) trumpet mushroom, heart of palm, gremolata, miso, dill, smoked salt, ciabatta Cold Plates Oysters* (GF) half dozen, prosecco mignonette, grilled lemon Caesar Salad Bites caesar salad on toasted brioche, bonito flakes Burrata Cheese (V) yuzu jam, charred tomatoes, blackberries, local greens, grilled bread Peach Salad (V) mixed greens, cucumber, avocado, radish, cherry tomatoes, brûléed goat cheese, cornbread crumble, shiso calamansi vinaigrette Sushi Squared* (GF) salmon, gochujang mustard, cucumber, ikura, radish, rice, nori Jack's Crispy Rice (V)(VG) spicy jackfruit, avocado, lotus chip, gochujang glaze Shrimp Lettuce Wraps (GF) shrimp, diakon, cabbage, peanut sauce, micro basil, lime Chili Bomb Ceviche* shrimp, white fish, octopus, avocado, red onion, tomatoes, cucumber, sesame, plantains Scallop Tartare* yuzu kosho ponzu, corn shishito salsa, leek mousse, sesame rice crisp Beers For The Kitchen gratuity for the kitchen staff For The Table Caviar Service* siberian caviar, scallion pancake blinis, leek mousse, pickled shallots, shaved egg yolk Spicy Rigatoni (V) gochujang cream, scallion garlic crunch, sesame seeds — option: add lump crab Stone Fried Rice* (V)(GF) sunny side up egg, local vegetables, viola flowers — option: add shrimp Charred Branzino* (GF) green chili pepper sauce, pickled fennel, micro cilantro Shiitake Risotto (V) wild mushrooms, miso, parmesan — option: add bbq eel House Cuts Pork Chop* (GF) 14 oz, black garlic butter, smoked salt Skirt* 12 oz, gremolata, lemongrass butter, smoked salt Bone-In Tomahawk* 30 oz, umami butter, smoked salt, shiso chimichurri Lamp & Shade Experience Sunday-thursday Savor the artistry of our menu with a 7- or 11-course tasting, thoughtfully composed to offer a little of everything our menu has to offer Desserts Dubai Basque (V) chocolate basque, pistachio crunch, fresh strawberries, mini dubai chocolate bar Coffee Crème Brûlée (v)(gf) almond moelleux, espresso ganache Peach & Ginger (V) spiced cake, ginger peach compote, ginger pecan ice cream, chantilly cream, candied pecans Sorbet (V)(vg)(GF) chef's seasonal flavor Kindly Be Advised that an outside dessert fee will apply to any cakes or desserts brought in from outside the establishment Signature Cocktails Siam Sunset pa'lante blanco rum, lemongrass, coconut, lime Bourbon Nomad smooth ambler contradiction bourbon, tamarind, lemon, agave, angostura bitters, aquafaba Eastern Standard mellow corn whiskey, yellow curry infused ginger, lime, fever tree ginger beer Filthy Fashion eagle rare 10 year old kentucky straight bourbon, suntory toki whisky, chai demerara, orange bitters Smoke And Petals del maguey vida puebla mezcal, cherry blossom, lime, agave, fever tree grapefruit Forbidden Bloom código 1530 blanco tequila. lychee, summerflowers, lime, agave Tokyo Confidential aviation gin, mujen original shochu, dolin blanc vermouth, cherry blossom, orange bitters Midnight In Kumamoto mujen x shochu, pa'lante blanco rum, coffee liqueur, cold brew, agave, aquafaba WHite Kimono roku gin, st. germain elderflower liqueur, thai basil, lime, agave, aquafaba Morning Microdose plantation oftd, hamilton 86 demerara, zacapa, mr. black, macadamia, coconut, pineapple Sake Hakkaisan, Tokubetsu junamai — btl | carafe | glass Kikusui, Funaguchi Kunko honjozo nama genshu — can honjozo nama genshu sparkling — can chibi zumo, little sumo junamai genshu —can Bushido, Way Of The Warrior Ginjo Genshu junmai ginjo — can Kikusui junmai ginjo — btl Ginga Shizuku, Divine Droplets junmai daiginjo — btl Hakkaisan junmai daiginjo — btl Nakano Kunizakari nigiri — can Asahi, Dassai junmai daiginjo — btl | carafe | glass Boilermakers Gaslight cider & a shot of amaro Nightshade japanese lager & a shot of awamori Blackout ipa & a shot of japanese whisky Packaged Goods Japanese Lager IPA Ale Cider Hard Seltzer Non-Alcoholics East End Coast seedlip grove 42, shiso tamarind, lime, red bull tropical Agave Glow seedlip notas de agave, lime Coconova seedlip garden 108, coconut, pineapple, lime Amber Waves thai tea, condensed milk White Wines Kettmeir pinot grigio | abruzzo, italy Forge Cellars riesling | seneca lakes, new york Stoneleigh sauvignon blanc | marlborough, new zealand Knuttel Family chardonnay | russian river valley, california Domaine Seguinot-bordet white burgundy | burgundy, france Baskoli txokolina | txokolina, spain Mar De Frades albarino | provence, france Orange & Rosé IRL Amato orange pinot grigio | friuli-venezia, italy Minuty rosé | provence, france The Language Of Yes rosé | central coast, california Red Wines Lola pinot noir | sonoma, california Treana cabernet sauvignon | paso robles, california Coto De Lmaz tempranillo | rioja, spain Kindly Be Advised that a corkage fee will apply to any wine brought in from outside the establishment Bubbles Chandon Brut sparkling | napa valley, california Chandon Brut Rosé sparkling | napa valley, california Veuve Clicquot Yellow Label Brut champagne | reims, france Veuve Clicquot Rosé champagne | reims, france Dom Perignon Brut champagne | epernay, france Organic/Natural Montenidoli white blend | tuscany, italy Unlitro red blend | tuscany, italy el cabrito cabernet sauvignon | mendoza, argentina Happy Hour Monday & Tuesday: 5:00PM - 6:00PM Wednesday-Friday: 4:00PM - 6:00PM Martini ketel one vodka or aviation gin, junmai sake, bitters — optional: dirty Bees Knees nolet’s gin, honey, lemon Daiquiri pa’lante blanco rum, cane, lime Shiso G&T aviation gin, shiso, fever tree tonic Mikey's Margarita pueblo viejo tequila, agave, lime El Diablo pueblo viejo tequila, giffard crème de cassis, lime, fever tree ginger beer Old Fashioned evan williams small batch, demerara, bitters Wine selection of red, white or prosecco Caviar Bump (GF) siberian Tomato Tartare (V)(VG) capers, balsamic, miso, shiso, ciabatta Green Goddess Salad (VG)(GF) mixed greens, avocado, cucumber, radish, scallion, crispy shallot, dill Shishitos (V)(VG) lemon oil, tamari, fried garlic Chili Bomb Hummus (V)(VG) chickpea, cucumber, lavash Mayak Deviled Eggs (V) brûlée yolk, fried garlic, scallion - add caviar Duck Dumplings ginger, garlic, cabbage, ponzu Chicken Satay (GF) lemongrass ginger marinade, peanut sauce, sesame seeds Brunch Saturday: 11:00am - 3:00PM Sunday: 10:00am - 3:00PM Oysters* prosecco mignonette, grilled lemon\n— choice of half dozen or dozen Oysters Rockefeller* spinach, artichoke, parmesan, panko, bacon Deviled Eggs (V) brûlée yolk, fried garlic, scallion — add caviar (+$15) Duck Dumpling ginger, garlic, cabbage, orange aioli, micro cilantro Crispy Rice smoked salmon, cream cheese, pickled shallots, capers Caesar Salad Bites caesar salad on toasted brioche, bonito flakes Burrata (V) compressed tomatoes, arugula, thai basil, pesto, candied walnuts, chive oil French Toast (V) strawberry cream cheese, condensed milk, micro basil Plantain Pancakes (V)(VG) silver dollar, sweet plantain, cornflake crumble, coconut whipped cream Avocado Toast (V) chili bomb, tomato, radish, micro cilantro, sesame Chicken And Waffle cornflake crusted tender, gochujang glaze, chili bomb butter, scallions, sesame Heart Of Palm \"Crab Cakes\" (V)(Vg) avocado, corn, micro cilantro, orange aioli Caviar Service* siberian caviar, scallion pancake blinis, leek mousse, pickled shallots, shaved egg yolk — served with a bottle of veuve clicquot yellow label brut Shrimp Rolls* brioche, poached shrimp, yuzu aioli, cured egg yolk Crab And Grits (GF) applewood bacon, charred tomatoes, gochujang cream, spinach, shallots Sliders* fried egg, applewood bacon, bibb lettuce,\ntomato, chipotle aioli Pink + White pa'lante rum, pisco, aperol, dragon fruit, lemon, angostura and orange bitters Skirt Steak* 12 oz, miso hollandaise, gremolatta, smoked salt Bone-In Tomahawk* (GF) 30 oz, kimchi hollandaise, smoked salt Weekly Specials Monday Industry Night 20% off for hospitality workers, health care & first responders - all night, 4pm to close Shuck It Tuesday $2 oysters and discounted bubbles & white wine - all night, 4pm to close Midweek Martinis & Margs $10 martinis & margaritas - all night, every wednesday, 4pm to close Thriving Thursday happy hour - all night, 4pm to close Shady Nights $8 classic cocktails - late night, sunday through wednesday, 9pm to close Happy Hour $10 classic cocktails and select wine - monday through friday, 4pm to 6pm dietary restrictions key V: vegetarian | VG: vegan | GF: gluten-free service charge 20% applied to all checks. service charge shared with entire lamp & shade team. please let your server know about any allergies or dietary restrictions. *consuming raw or undercooked meats, poultry, seafood, shellfish, eggs, or unpasteurized milk may increase your risk of foodborne illness. Lamp & Shade Craft Kitchen & Cocktails Hours Of Operation Monday & Tuesday | 5:00pm – 11:00pm Wednesday & Thursday | 4:00pm – 11:00pm Friday | 4:00pm – 12:00am Saturday | 11:00am – 12:00am Sunday | 10:00am – 10:00pm Kitchen Hours Monday & Tuesday | 5:00pm – 10:00pm Wednesday & Thursday | 4:00pm – 10:00pm Friday | 4:00pm – 11:00pm Saturday | 11:00am – 11:00pm Sunday | 10:00am – 10:00pm Happy Hour Monday & Tuesday | 5:00pm – 6:00pm Wednesday – Friday | 4:00pm – 6:00pm Brunch Saturday | 11:00am – 3:00pm Sunday | 10:00am – 3:00pm 1336 N Mills Ave, Orlando, FL 32803 lamp@thrivinghospitalityent.com (321) 417-3477 Site Map Home Menu About Reservations Gift Cards Private Events / Catering Career Opportunities View In Google Maps Facebook Instagram © Copyright Thriving Hospitality 2025. Close Menu About Reservations Chef’s Table Gift Cards Private Events / Catering Opening Hours Monday & Tuesday 5:00pm - 11:00pm Wednesday & Thursday 4:00pm - 11:00pm Friday 4:00pm - 12:00am Saturday 10:00am - 12:00am Sunday 10:00am - 10:00pm * Happy Hour (Mon & Tues) 5:00pm - 6:00pm * Happy Hour (Wed - Fri) 4:00pm - 6:00pm * Brunch ( Sat & Sun) 10:00am - 3:00pm Our Location 1336 N Mills Ave, Orlando, FL 32803 321-417-3477 lamp@thrivinghospitalityent.com Close Search for: Search"
    }
  ]
}