{
  "fuentes": [
    {
      "url": "https://www.throwsocial.com/dc",
      "email": "guests@throwsocialdc.com"
    },
    {
      "url": "https://www.throwsocial.com/faq-delray",
      "email": "delrayguests@throwsocial.com"
    },
    {
      "url": "https://digitalmarketingservpro.com/Service-Area/social-media-management-delray-beach/",
      "email": "brian@digitalmarketingservpro.com"
    },
    {
      "url": "https://www.throwsocial.com/contact",
      "email": "delrayguests@throwsocial.com"
    },
    {
      "url": "https://www.throwsocial.com/contact",
      "email": "delrayguests@throwsocial.com"
    },
    {
      "url": "https://www.throwsocial.com/contact",
      "email": "events@throwsocial.com"
    },
    {
      "url": "https://www.throwsocial.com/contact",
      "email": "guests@throwsocialdc.com"
    },
    {
      "url": "https://www.throwsocial.com/contact",
      "email": "miamiguests@throwsocial.com"
    },
    {
      "url": "https://bocaratonobserver.com/locations/throw-social-delray-beach/",
      "email": "info@bocaratonobserver.com"
    },
    {
      "url": "https://www.throwsocial.com/faq",
      "email": "dcguests@throwsocial.com"
    },
    {
      "url": "https://www.throwsocial.com/faq",
      "email": "guests@throwsocialdc.com"
    },
    {
      "url": "https://bocaratonobserver.com/locations/throw-social-delray/",
      "email": "info@bocaratonobserver.com"
    },
    {
      "url": "https://www.pma-dc.org/throw-social-faq",
      "email": "bianca@pma-dc.org"
    },
    {
      "url": "https://www.throwsocial.com/plan-an-event-in-delray-beach",
      "email": "delrayguests@throwsocial.com"
    }
  ],
  "mails": [
    "bianca@pma-dc.org",
    "brian@digitalmarketingservpro.com",
    "dcguests@throwsocial.com",
    "delrayguests@throwsocial.com",
    "events@throwsocial.com",
    "guests@throwsocialdc.com",
    "info@bocaratonobserver.com",
    "miamiguests@throwsocial.com"
  ],
  "nombre_sitio": "throwsocial.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.throwsocial.com/dc",
      "text": "Throw Social DC | Nightlife, Parties & Rooftop Vibes top of page HOME RESERVATIONS PLAN AN EVENT PROMOS & EVENTS ACTIVITIES MUSIC CALENDAR MENUS GALLERY & 3D TOUR FAQ GIFT CARDS CONTACT More Use tab to navigate through the menu items. THRōW Social® Washington, D.C. Reservations not required. Come Flamingle! RESERVATIONS To play, press and hold the enter key. To stop, release the enter key. Scroll for more! > ABOUT Let's Get Flocked Up! DELICIOUS FOOD & DRINKS IN AN AMAZING, TROPICAL VENUE. ​ COCKTAILS, CABANAS, & BITES See what's happening! Dine, Drink & Competitive Socialize! WE AREN'T JUST A RESTAURANT & BAR! WE OFFER ACTIVITIES FROM FAMILIAR TO FANCIFUL LIVE MUSIC & DJS ROOFTOP DECK & LOUNGES VIP INTERIOR CABANA S LIGHT-UP PING PONG SHU FFLEBOARD CORN HOLE ​ Check them out! Our Games Cabana - Ooh - Na - Na! ​Want that VIP experience? Rent a beautiful & guaranteed space for your crew with our furnished Interior Cabanas! ​ You can reserve online and be ready to go! ​ Perfect idea for Birthday, Engagement, Baby Shower, & Bachelor/Bachelorette Celebrations. Or just a fabulous Night Out in Washington, DC! Reserve Now! Fun & Friends is our business ​THR ōW​® is a social venue with a tropical vibe that combines ‘backyard-style' games with food & libations. Good playful fun with friends old & new! See what's going on! Join Our Mailing List & GET UPDATES ON ​THRōW SOCIAL® DC I want to subscribe to the newsletter. Subscribe Now Please confirm your subscription in the email you will recieve. Thanks! Follow Us for the Latest Updates! View 3D immersive tour! CONTACT WHAT PEOPLE SAY Rodger B. What's not to love! A beautiful open space with so many games and attractions. Fun staff, talented bartenders & groovy tunes all night long from live bands and popping DJs. From tasty bites to ping pong, you'll find all the fun you need at Throw Social DC. Betty D. This place is a must visit! They have jumbo games! The employees love to laugh with you, which makes the place more inviting. Drinks are on time & they are happy to serve you! I've been here 4 times & will come back again! I've recommended this place to many people. Jen D. Planning our office event was a breeze. Ana put together a fantastic menu (we have a lot of dietary & catering restrictions) & our people loved everything. They loved the LED game! The THRōW Social DC staff is excellent. The space is huge, and the food is amazing. Share the love, leave us review! ​THRōW Social® D.C. 1401 Okie St. NE STE #102 Washington D.C., 20002 202-880-2559 guests@throwsocialdc.com HOURS M - TH F SA SU CLOSED 7:00 pm  -    2:00 am 11:30 am  -    2:00 am 11:30 am  -  11:00 pm DC RESERVATIONS plan an event VIEW FLOORPLAN 360 VENUE TOUR VISIT OUR SISTER BRAND! KICK AXE THROWING®​ Fun restaurant in Washington, DC. Live Music in DC. Best Brunch in DC. ​©2025 Throw Social LLC bottom of page"
    },
    {
      "url": "https://www.throwsocial.com/faq-delray",
      "text": "FAQ | ​THRōW Social® Delray Beach top of page HOME RESERVATIONS DELRAY RESERVATIONS DC RESERVATIONS PLAN AN EVENT IN DC IN DELRAY BEACH DELRAY BEACH DELRAY HOME PROMOS & EVENTS ACTIVITIES MUSIC CALENDAR MENUS RESERVATIONS PLAN AN EVENT GALLERY & 3D TOUR FAQ MEET GINGER GIFT CARDS CONTACT DC LOCATION DC HOME PROMOS & EVENTS ACTIVITIES MUSIC CALENDAR MENUS RESERVATIONS PLAN AN EVENT GALLERY & 3D TOUR FAQ GIFT CARDS CONTACT MIAMI MIAMI HOME GIFT CARDS GIFT CARDS DELRAY GIFT CARDS DC CONTACT JOBS More Use tab to navigate through the menu items. THRōW Social® Delray Beach FAQ FAQ Remember: We have plenty of OPEN SEATING, 3 Bars, Live Music, FREE Games throughout the venue + a fabulous Happy Hour. Come flamingle! Subscribe! Please confirm your subscription through the email you will receive. Thanks! VIEW 3D IMMERSIVE TOUR! What exactly is Throw Social​® ? We are exactly what you've been flocking looking for – a 1960s retro-tropical full-service restaurant, bar, and entertainment venue! With Live Music all week, an unbelievable Happy Hour, 3 bars, backyard-style games, flamazing fruity Cocktails, and a tasty Menu with shareable plates – there's something for everyone to enjoy! Reserve a Cabana or Lounge for VIP vibes or hang out at our bars & tables (open seating) and grab a bite! Remember: We have plenty of OPEN SEATING, three bars, FREE games throughout the venue & a fabulous Happy Hour . Come flamingle! ​ ​ Do you still have Axe Throwing? Ah, nope!  Recently, we replaced our axe-throwing ranges with an interactive gaming area featuring Light-up Ping-Pong, Jumbo Beer Pong, Corn Hole, Jumbo Jenga, Connect Four & more – designed to create a fun, engaging experience for all guests! ​ Do you accept Table Reservations? No, tables are first-come, first- served. We do accept reservations for Cabanas & Dart Lanes. See reservation details HERE ! ​ *Reservations are NOT required to visit our venue ​ Do you have a cover charge? Yes, a cover charge applies on Friday & Saturday nights. *Please note, cover charge policy is subject to change at any time, for any reason. ​ ​ ​ ​ Do we have to Reserve a Cabana, Game or Lounge to come hang out? No! We have plenty of other seating available on a walk-in basis. Get the flock in here and grab a tropical drink, a tasty bite, or play some games! *We are 21+ every Thursday-Saturday after 9pm ​ CABANAS!! Tell me how to make a Reservation & what can I add on? Cabana-ooh-na-na! Want a beautiful, guaranteed space for your group? You can reserve our furnished, fabulous Cabanas, Lounges, and XL Lounges – right here ! ​ ​ VIP ADD ONS : Welcome Bottle of Rosé, Wine or Bubbly Bottle Service Beer Buckets Open Bar Packages (for parties of 25+ only. Contact us HERE .) Food Packages (for parties of 20+ only. Contact us HERE .) ​ ​ ​ When is Happy Hour? We have the happiest of hours every WEEKDAY from open until 7pm! See Happy Hour specials Here . ​ ​ ​ Do you have Brunch and Bottomless Mimosas? We have weekend brunch & bottomless every Saturday & Sunday from 11am-3pm. See Brunch menu Here . ​ ​ ​ ​ ​ ​ Are you Dog-friendly? Yes, our outdoor patio is dog-friendly! *ALL DOGS MUST STAY ON A LEASH! ​ ​ ​ Birthday Parties, Team Building, Bachelor(ette) Parties... are they hard to arrange? We make it easy! If you only need (1) Cabana, you can book yourself online without contacting us. You can even bring store-bought (per health code) cupcakes for your event. *For parties of 20 or more, check out our event pricing & packages HERE, or contact us HERE . ​ Our Special Events Department can assist with choosing food menus, *bar packages, or multi-hour sessions. For weekend events, please contact us as far in advance as possible! ​ Note: Ou r Special Events team is available for inquiries Monday-Friday from 10am-6pm . Inquiries received outside of those hours will be responded to the next business day. For urgent questions and requests, please contact us at delrayguests@throwsocial.com or (800) 561-0755 . ​ *Pre-paid Bar Packages are only available for groups of 25+ or for events two hours or longer Do you allow outside catering? We don't offer outside catering (except for Kosher). We have a full kitchen and flocking fabulous M enus ! Can I book an event outside of your normal hours? Absolutely! Contact us HERE . More information on Special Events can be found HERE . ​ I see an extra charge on my credit card. Why? We assure you, we did not charge you extra! This is a temporary pre-authorization that our Point of Sale system, Toast, requires. If you open a tab, a temporary hold will be placed on your credit card for the amount of your initial order. This will fall off your statement once the actual charge is processed. Some banks drop this off the statement immediately, but others can take 4-5 days for this to happen, especially after a weekend, so please be patient. Thanks for understanding! ​ ​ Is your venue eco-friendly? Yes, we are! We use StrawFish® 's biodegradable cups and straws, so each sip is sustainable! We also have air dryers in each bathroom. What ages can play at Throw Social​®? We welcome everyone at Throw Social​® ! All ages can eat, drink, and play our board games, ping pong, darts, Corn hole, Jenga, etc. We do ask that all children be kept under the direct supervision of an adult at all times. *We are 21+ Thursday-Saturday after 9pm What is your Lateness Policy for Reserved Activities and VIP Spaces? Cabanas, Lounges, and Dart Reservations will be held , but your tim e will be shortened to end at the originally scheduled time if there are guests after you. ​ What is your Cancellation policy for reserved Cabanas, Lounges or Darts Reservations? You will get a FULL REFUND up to 24 hours before your reservation time. Refunds are NOT accepted for cancellations within 24 hours of your reservations – sorry! :'(  You can try to change your booking from through your confirmation email or contact us at delrayguests@throwsocial.com . ​ * For Special Event Bookings, cancellation fees are outlined in your contract and are different than normal reservations.. Are you handicapped accessible? Can I play games if I am in a wheelchair? Yes and yes! ​ How do I find Throw Social ® Delray? Throw Social ® Delray is located right in the heart of Delray Beach off of Atlantic Ave... just across the street from Kapow and next door to Rack's Seafood . You can also enter off of Atlantic Avenue, down the alley between Brandy Melville and the previous home of Taverna Opa . Our address is 29 SE 2nd Ave, Delray Beach FL, 33444 ​ Do you have a dress code? We do have standards for entry into our venue on weekend evenings. ​ ​​ No attire with foul or graphic language or images (unless we think it's funny... just kidding. Save it for the grocery store!) No attire that does not cover your private areas appropriately (keep them covered, for all our sakes!) No Backpacks... please leave them at home or return them to your vehicle (because of some things you could have in there... like alcohol, which puts our liquor license at risk; weapons; enough space to steal our ceramic pineapples – oh, it's happened!) . Note : If you have nowhere to put your backpack, please note that a search will be required. Valid Photo ID with your birthdate A great attitude & an open heart that's ready for some fun! ​ ​ *We do not deny entry to anyone unless they are underage (we take this VERY seriously); are visibly intoxicated; have the above dress & refuse to change; or refuse to put their backpack away or have it searched. What is parking like at ​Throw Social​​ ® ? There is metered parking directly adjacent to the venue (that we don't own) , street parking, and (3) parking garages. Robert Federspiel Garage : 22 SE 1st Ave, Delray Beach, FL 33444 ​ Monday-Saturday: $5 after 4pm * FREE before 4pm *in before 4pm, you can remain in the garage after 4pm at no additional cost. Sunday: Free all day *closes at midnight; 14-hour parking max ​ ​ Old School Square Garage: 95 NE 1st Ave, Delray Beach, FL 33444 Monday-Saturday: $5 after 4pm until midnight * FREE before 4pm * drivers who exit the garage after 4 pm will be required to pay the $5 fee upon return. Sunday: Free all-day Delray Beach Market Parking Garage: SE 1st Street, Delray Beach, FL 33444 *between SE 2nd & SE 3rd Ave Monday-Thursday: $7 first 2 hours, $3.50 for each additional hour; $28 daily max Friday-Sunday: $9 first 2 hours, $4.50 for each additional hour; $36 daily max Don’t forget you can use FREEBEE , an electric vehicle fleet that looks like elongated golf carts, that will provide FREE RIDES throughout Delray. ​ I received a ticket from your parking lot! Ruh-roh. Unfortunately, we do not own or have any association with the parking lot next to our venue. If you received a ticket, please contact them, not us. We appreciate it! ​ Have more questions? Call or email us. delrayguests@throwsocial.com (800) 561-0755 Parking LeaveReview Share the love, leave us review! VISIT OUR SISTER BRAND! KICK AXE THROWING®​ ​ To learn more about The Ginger Brands , visit our website HERE . Fun restaurant in Delray Beach. Best Brunch in Delray Beach. Best Brunch in Miami. ​©2024 Throw SocialL LC ​THRōW Social® Delray 29 SE 2nd Ave. Delray Beach, FL DELRAY CONTACT & HOURS ​THRōW Social® Miami 2335 N. Miami Ave. COMING SOON! MORE INFO! ​THRōW Social® D.C. 1401 Okie St. NE Washington D.C. D.C. SITE bottom of page"
    },
    {
      "url": "https://digitalmarketingservpro.com/Service-Area/social-media-management-delray-beach/",
      "text": "Social Media Management Delray Beach - Digital Marketing Service Pro LLC Skip to content Digital Marketing Services SEO Content Writing Search Engine Optimization Website Design Services Social Media PPC Services Video Production Link Building Services Results Blog Contact Want more customers? You're in the right place. 954-914-7317 Services Updated Service Areas Fort Lauderdale SEO Company Web Design PPC Company Social Media Management Miami Miami Digital Marketing Miami SEO Company Miami Web Design Miami PPC Agency Miami Social Media West Palm Beach Digital Marketing Agency West Palm Beach SEO WPB Web Design Social Media Management West Palm Beach PPC Delray Beach Marketing Agency Social Media Management Delray Beach Web Design Delray Beach SEO Delray Beach PPC Agency West Chester Digital Marketing SEO West Chester Video Production Social Media Management Philadelphia Digital Marketing Agency Website Design Email Marketing Local SEO SEO Consultant SEO Agency PPC Agency SEO Expert Video Production Commercial Video Production Social Media Marketing Live Streaming Video Boca Raton Boca Raton SEO Boca Raton Local SEO SEO Company Boca Raton SEO Service Social Media Management Boca Raton PPC Agency Allentown PA SEO Allentown PA Pennsylvania Digital Marketing Agency Pennsylvania Lancaster PA SEO Lancaster PA Brian Zippin | DMSP CEO Let's Discuss your Project Brian Zippin is the founder of Digital Marketing Service Pro and a Partner at Zip In Media Productions. Since 2009, Brian Zippin has helped 100’s of owners achieve systematic #1 rankings while in addition providing top-quality video content. 954-914-7317 Results Blog Contact BOOK A CALL Want more customers? You're in the right place. Call: 954-914-7317 BOOK CALL Menu Social Media Management   Delray Beach Expert Social Media Marketing Services You are actually working directly with me the Owner & SEO Pro! BOOK A CALL 954-914-7317 About Grow your online presence with Social Media Management Delray Beach! Incorporating social media management Delray Beach can help you grow your online presence and build your brand. We offer a variety of services to help you succeed, including: Social Media Strategy Content Creation Community Management Advertising Management Analytics and Reporting Search engine marketing Graphic design Let Digital Marketing Service Pro help you take your business to the next level. Contact us today at 954-914-7317 to get started! CALL NOW Get expert social media marketing services from our team! Our team will help you create and execute a social media strategy that works for your business, and we’ll also be there to help you manage and monitor your social media accounts daily. We understand that social media can be a lot of work, so we’re here to help lighten the load! With our social media management services, you can focus on running your business while we take care of the rest. Some of the social media marketing services we offer include: Developing and executing a social media strategy Creating and managing social media accounts Content creation and curation Social media advertising Reporting and analytics You need someone to do the social media management Delray Beach. Contact us today at 954-914-7317 if you’re interested in learning more about our social media management services! We’ll be happy to answer any of your questions. Ready to Dominate Your Market? Create engaging content that will attract new customers! Digital marketing strategies are a great way to connect with new customers and grow your business. Here are some tips to get started: Keep your content fresh – regularly update your content to keep people interested. Be engaging – interact with your audience and encourage them to interact with you. Use hashtags – use relevant hashtags to reach a wider audience. Promote your business – let people know what you do and how they can benefit from your products or services. Use images and videos – people are more likely to engage with visual content. Be active – the more active you are on social media, the more likely people will notice you. Monitor your activity – keep an eye on what people say about your business and respond accordingly. If you are looking for a social media manager to handle your social profiles, DMSP is the best choice. We can help you with your marketing strategy, which will surely increase your visibility and sales. Maximize your social media campaigns with our support! At AVPC, we understand that social media can be a lot to keep up with the following: Post Likes Tweets Shares Comments, and more. But we also know the importance of a solid social media presence for businesses today. Our team is here to help you with every step, from creating content to engaging with your followers. We’ll help you maximize your social media campaigns and ensure you get the most out of your platforms. We can do paid ads for more visibility and to reach new and potential customers. Contact us today at 954-914-7317 to learn more! Other Services We Offered In addition to social media management, we also offer the following services: Content Management Web Design Graphic Design Search Engine Optimization (SEO) Pay Per Click (PPC) Advertising Email Marketing Social Media Website If you are looking for a complete online marketing solution, look no further than DMSP. We have the experience and knowledge to help your business succeed online, whether you are selling products or services. Contact us today at 954-914-7317 to learn more about our other digital services. About Digital Marketing Strategies For Social Media Management As a business owner, social media is a powerful tool to reach new customers and grow your brand. But what are the best ways to use social media for your business? Here are some digital marketing strategies for social media management: Use social media to create a strong relationship with your customers. Make sure you are responsive to comments and questions. Show that you care about your customers and their experience with your brand. Share your brand’s story Your customers want to know who you are, what you stand for, and what makes you different. Please share your story on social media, and make sure it is consistent with the story you tell on your website and other marketing materials. Drive traffic to your websites Ensure your website is optimized for SEO and that your social media links lead to your website. Use effective calls to action on your social media posts to encourage customers to visit your website. Create valuable content Your customers will appreciate valuable content that is relevant to their interests. Share the following: Blog posts Infographics Images, and other types of content It will help your customers learn more about your brand and your offer. Stay top of mind Make sure your social media posts are timely and relevant and that you are regularly sharing fresh content. Keeping your brand top of mind will make you more likely to convert leads into customers. Digital marketing is constantly evolving, so it’s essential to keep up with the latest trends. If you need help with your social media marketing, contact us today. We’re a full-service digital marketing agency specializing in social media management and can help you create a social media strategy that gets results. We also serve West Palm beach and other surrounding areas. Take your business to the next level with our social media services! If you want to take your business to the next level, our social media services are perfect! We can help you create: Social media channels Manage your social media accounts Develop a social media strategy, and much more. You won’t have to worry about posting content, managing followers, or anything related to your social media. We can also look at the market conditions to position your brand effectively. Let us take care of everything for you so you can focus on what you’re good at – running your business! Don’t wait any longer. Contact us today at 954-914-7317 , and let us show you what we can do for your social media management Delray Beach ! We already help large and small businesses stay on top of the game. BOOK A CALL 954-914-7317 Services Digital Marketing Services Our digital marketing services are one of many ways that we help you grow your business. We manage every part of the digital marketing process, with services that improve your presence across any and all potential avenues. Website Design and Development We are able to design new, engaging, high quality websites that improve conversions and are SEO optimized. Content Writing We have the best content writers available today, with the ability to create tens of thousands of words of high quality content. Learn about our Content Writing Services Search Engine Optimization (SEO) We are able to generate more visitors for your business by improving your location in search engines. Social Media Marketing Promotes brands through platforms like Facebook and Instagram to engage and grow audiences. Email Marketing Our team is filled with experts on customer relationship management, and can craft newsletters and emails that get results. Link Building “Backlinks” are at the core of any SEO strategy. Our team will obtain backlinks from reputable websites across the internet. Video Production DMSP has a full service video production team, capable of creating professional video across any industry. Local SEO Local SEO optimizes a website for location-based searches, helping businesses attract nearby customers effectively. Pay-Per-Click (PPC) Advertising We can help you manage online advertising through Google Ads, Bing Ads, and PPC ads on other platforms. Reach More People And Grow Your Brand Awareness You want to grow. We want to help. We’ve helped businesses like yours double, triple, and quadruple their revenue using tools like social media marketing, content writing, website development, and more. See why so many have turned to Digital Marketing Service Pro. Contact us at (954)-914-7317 to speak to a team member. BOOK A CALL 954-914-7317 Services Why Choose DMSP for Digital Marketing ? There are so many companies that perform online marketing related services. So when we created Digital Marketing Services Pro, our goal was to offer a different experience. We’ve designed an online marketing company around the success of our clients, acting as their own internal marketing department. Everything we do is designed around your profits, making it possible for you to focus on the business side of your company. When you work with DMSP, you receive: Dedicated Account Managers You’ll have your own personal account manager that will oversee all of the different projects. You’ll be able to have one point of contact for all your questions, needs, and more. Extensive Onboarding Process You want to see results fast. We want to give them to you. Our onboarding process is extensive, setting up almost the entirety of your marketing efforts from the beginning in a massive overhaul so that you get results fast. Social Media Marketing Strategy There is no one size fits all approach to social media. That is why we make every effort to learn about your business and devise a strategy that is best suited for your industry. Campaign Reports We want you to be confident that the work we do is working. We’ll provide you with campaign reports and updates along the way so that you can see the results of the work. Paid and Organic Team DMSP is able to address all of your online marketing needs. This includes generating results for both paid and organic social media campaigns. Whether managing ads or creating posts, our team can do it all. Diverse Marketing Experience No matter what anyone says, there is no magic bullet in the digital marketing world. Your website is as important as your paid ads which is as important as social media, and more. By partnering with our firm, we’ll use our experience to always determine the best strategy for you. Take your business to the next level with a marketing agency that actually delivers. Get Started Brian Zippin is the founder of Digital Marketing Service Pro and a Partner at Zip In Media Productions. Since 2009, Brian Zippin has helped 100’s of owners achieve systematic #1 rankings while in addition providing top-quality video content. Company Services Our Blog Contact Portfolios Digital Marketing Services SEO Services Pay Per Click Social Media Marketing Web Designing Link Building Content Writing Video Production As a Google Premier Partner Agency, we’ve joined the cream of the crop in PPC specialists. This designation is reserved for only a small fraction of Google Partners who have demonstrated a consistent track record of success. 954-914-7317 brian@digitalmarketingservpro.com © 2025 All Rights Reserved. Digital Marketing Service Pro LLC Facebook Twitter Youtube Instagram Linkedin"
    },
    {
      "url": "https://www.throwsocial.com/contact",
      "text": "CONTACT | THRōW Social | Tropical Vibe | Party Packages | Games | Cabanas | Live Music | Axe Throwing | Tiki Themed Bar | Delray Beach top of page HOME RESERVATIONS DELRAY RESERVATIONS DC RESERVATIONS PLAN AN EVENT IN DC IN DELRAY BEACH DELRAY BEACH DELRAY HOME PROMOS & EVENTS ACTIVITIES MUSIC CALENDAR MENUS RESERVATIONS PLAN AN EVENT GALLERY & 3D TOUR FAQ MEET GINGER GIFT CARDS CONTACT DC LOCATION DC HOME PROMOS & EVENTS ACTIVITIES MUSIC CALENDAR MENUS RESERVATIONS PLAN AN EVENT GALLERY & 3D TOUR FAQ GIFT CARDS CONTACT MIAMI MIAMI HOME GIFT CARDS GIFT CARDS DELRAY GIFT CARDS DC CONTACT JOBS More Use tab to navigate through the menu items. Need to Reach Us? Washington, D.C. Delray Beach Miami ​THRōW Social® DC 1401 Okie St NE Washington, D.C. 20002 (202)-880-2559 ​ guests@throwsocialdc.com ​ ​THRōW Social® Delray 29 SE 2nd Ave Delray Beach, FL 33444 (800) 561-0755 delrayguests@throwsocial.com ​ ​THRōW Social® Miami 2335 N. Miami Ave. Miami, FL 33127 ​ miamiguests@throwsocial.com ​ To reach The Ginger Brands , visit our website HERE . Follow Us for the Latest Updates! THRōW SOCIAL® DC THRōW SOCIAL® DELRAY THRōW SOCIAL® MIAMI CONTACT DELRAY VISIT OUR SISTER BRAND! KICK AXE THROWING®​ ​ To learn more about The Ginger Brands , visit our website HERE . Fun restaurant in Delray Beach. Best Brunch in Delray Beach. Best Brunch in Miami. ​©2024 Throw SocialL LC ​THRōW Social® Delray 29 SE 2nd Ave. Delray Beach, FL DELRAY CONTACT & HOURS ​THRōW Social® Miami 2335 N. Miami Ave. COMING SOON! MORE INFO! ​THRōW Social® D.C. 1401 Okie St. NE Washington D.C. D.C. SITE bottom of page"
    },
    {
      "url": "https://bocaratonobserver.com/locations/throw-social-delray-beach/",
      "text": "THRōW Social Delray Beach - bocaratonobserver.com Skip to main content Search Subscribe facebook instagram RSS Culture Buzz Destinations Features Style Wellness Food & Drink Bites Cheers Chef Profile Readers’ Choice Restaurant Guide Restaurant News Review Community Around Town Community News Flash Giving Back La Vida Boca Happenings Calendar Editor's Corner Out 'N' About Guides Charity Country Clubs Education Top Docs Top Lawyers Visitors Profiles Country Club Collection Cuisine Scene Health Care Heroes Inspired Home Men On The Move Power Players Professional Edge Top Docs Top Lawyers Wonder Women Fresh Picks Home THRōW Social Delray Beach THRōW Social Delray Beach 29 SE 2nd Ave , Delray Beach , Florida 33444 Print Map Nearby Nearby Events Address 29 SE 2nd Ave , Delray Beach , Florida 33444 Back to Search Results 7700 Congress Ave., Suite 3115 Boca Raton, FL 33487 561-982-8960 info@bocaratonobserver.com About Team Advertise Sponsorships Awards Issue Archive Subscribe Careers Contact Privacy Policy Terms © 2024 A&A Publishing Corp Built with Metro Publisher™"
    },
    {
      "url": "https://www.throwsocial.com/faq",
      "text": "FAQ | Throw Social DC | Music & Event Venue top of page HOME RESERVATIONS PLAN AN EVENT PROMOS & EVENTS ACTIVITIES MUSIC CALENDAR MENUS GALLERY & 3D TOUR FAQ GIFT CARDS CONTACT More Use tab to navigate through the menu items. THRōW Social® Washington, D.C. FAQ Subscribe to get exclusive updates & schedule of music every week. Subscribe! Please confirm your subscription through the email you will receive. Thanks! View 3D immersive tour! FAQ ​ Are you a bar & restaurant where we can just come & have food & drinks? Yes, get the flock in here! Grab a tropical drink, some tasty bites, and lounge in a cabana – yes, we have cabanas! You can reserve them online HERE .  We have an amazing rooftop deck, Live Music , plenty of open seating, three bars, and games like Corn Hole, LED Ping Pong,  and Shuffleboard! PLUS, we have a fabulous stage for DJs, live music & entertainment! Check out our offerings HERE! Note: We have a fourth bar downstairs at our sister location, Kick Axe Throwing®, where you can reserve axe throwing HERE . *WE ARE 21+ AFTER 9 PM EVERY DAY OF THE WEEK! ​ Do you have live music at your venue? Ummmmm, YES! Our live music schedule is FLAMAZING! We have live DJs who perform on our huge stage with a 20' video wall to dance & sing your booty off. We have live GoGo bands every Friday! Grab your crew and come FLOCK ON with us! Be sure you sign up and receive weekly updates as to who's playing! ​ Is there a Cover Charge? Yes, we have a cover charge on Friday and Saturday nights unless otherwise noted! Friday: $20 from 8pm-10pm &  $30 from 10pm-close Saturday: $10 from 8pm-10pm & $20 from 10pm-close *Please note that cover charges are subject to change at any time. ​ What kind of activities & games can we do at Throw Social® ? Ho - ho! Check them out HERE . ​ Do you have a rooftop deck for outdoor dining? Are you looking to take things outside? Because YES! Yes, we do. With outdoor lounges, various backyard games, a full bar, and rooftop Corn Hole! Check out our activities page ! *While we do have some heaters & windscreens, access during winter months may be limited during cold or windy nights. ​ Do we have to rent a Cabana to come hang out? No! We have plenty of other seating available on a walk-in basis. CABANAS!! Tell me how to reserve & what I can add on! Cabana-ooh-na-na! Want a beautiful & guaranteed space for your crew? You can reserve our furnished, fabulous INTERIOR Cabanas, Double Cabanas, or Exterior Rooftop Lounges – ONLINE ! Reserve an inside cabana or one located closest to the stage & dance floor! Regular Cabanas can accommodate up to 10 guests. Double Cabanas can accommodate up to 20 guests for DOUBLE the FUN & DOUBLE the capacity! ​ Cabana reservations are a 3-hour duration, include Complimentary Welcome Shots (for guests 21+), and require a $100 Rental Fee with a Food & Beverage minimum. * Cabana rental fees and pricing varies by day & time, see pricing details here ! ​ *EVERY THURSDAY: ALL CABANA & LOUNGE RENTAL FEES ARE WAIVED WITH 50% OFF FOOD & MINIMUMS. ​ VIP ADD ONS: E mail guests@throwsocialdc.com to add the following: Welcome Bottle of Rosé, Wine or Bubbly Bottle Service Beer Buckets Birthday Banners Small Party (1-20 guests) Food & Beverage Packages. More Info HERE. Open Bar Packages (for parties of 25+ guests only. More Info HERE .) Food Packages (for parties of 25+ guests only. More Info HERE .) ​ Walk-ins - How do they work? We welcome walk-ins! We have plenty of open seating both inside and outside. Cabanas may be booked in advance, so to guarantee availability, definitely rent your cabana ONLINE ! For current availability, click HERE . If it shows a space you want available, your best bet is to RENT ASAP! What ages can visit at Throw Social® ? We welcome everyone at Throw Social ® ! We do ask that all children be kept under the direct supervision of an adult at all times. *NOTE: WE ARE 21+ AFTER 9 PM EVERY DAY OF THE WEEK! I see an extra charge on my credit card. Why? We can assure you we did not charge you extra! This is a temporary pre-authorization that our Point of Sale system, Toast, requires. If you open a tab, a temporary hold will be placed on your credit card for the amount of your initial order. This will fall off your statement once the real charge goes through. Some banks drop this off the statement immediately, but others can take 4-5 days for this to happen, especially after a weekend, so please be patient. Thanks for understanding! ​ What is your Lateness Policy for Cabanas? PLEASE PLAN TO ARRIVE 10 MINUTES BEFORE YOUR START TIME on your cabana rental! You can always grab a drink or put in a food order if you are early. If you do arrive late and there is another reservation after yours, your time will be shortened to end at the original end time. Birthday Parties, Baby Showers, Corporate Parties, Bachelor(ette) Parties... are they hard to arrange? We make it easy! If you only need one cabana or a double cabana, you can rent it yourself online without contacting us HERE . You can bring store-bought (per health code) cupcakes or a cake for your event without notifying us in advance (NO ice cream cakes, please!). No helium balloons, either, as they get stuck in our ceiling fans. Please contact us for groups of 20+. ​ For larger parties and events, connect with us HERE . Packages & pricing for Special Events can be found HERE . For groups larger than 20, our Special Events department can assist you with food or bar packages or a multi-hour session. For weekend events, contact us as far in advance as possible! ​ We offer Small Party VIP Upgrades , too. Email dcguests@throwsocial.com to add on the following: Food & Beverage Packages (1-20 guests) Welcome Bottle of Rosé, Wine or Bubbly Bottle Service Beer Buckets Birthday Banners ​ **We DO NOT allow helium balloons (of any type) into the venue. They tend to escape and cause fan damage. Sorry for the inconvenience!** * Our Special Events team is available for inquiries M - F from 10am - 6pm. Inquiries received outside of those hours will be responded to the next business day. If it is an urgent need, please contact us at 202-880-2559 or guests@throwsocialdc.com . ​ Do you offer catering & food & bar packages? Yes! But if you are a smaller group of 20 or less, you can just order off the menu. For catering or food packages, check out our special event packages HERE or contact us HERE. ​ *Pre-paid Bar Packages are ONLY available to groups of 20 or more or for events two hours or longer. Can I book an event outside of your normal hours? Absolutely! Just email us HERE . More information about Special Events can be found HERE . What is your Cabana/Lounge cancellation policy? You don’t want to party like a flockstar in your cabana? You will get a FULL REFUND up to 24 hours in advance of your rental time. Sorry, but within 24 hours there are no refunds. :'( ​ *If you have booked a Special Event, the cancellation period will be outlined in your personalized contract. ​ Can I change or cancel my booking online? Yes! Up until 24 hours before your rental. Go to your confirmation email and click the blue 'Modify Reservation' button or white 'Cancel Reservation' button (only available up until 24 hours prior to your reservation). You will be able to change the date & time (if available) or cancel. Sorry, there are no refunds within 24 hours of your start time, but you can always transfer your reservation to someone else. ​ Do you have a dress code? We do have standards for venue entry on weekend evenings: ​​ No attire with foul or graphic language or images (unless we think it's funny... just kidding. Save it for the grocery store.) No attire that does not cover your private areas appropriately (keep it classy, for all our sakes!) Backpacks – please leave them at home or return them to your vehicle (because some things you could have in there; alcohol - which puts our liquor license at risk; weapons; enough space to steal our ceramic pineapples - oh, it's happened!). If you have nowhere to put your backpack, please note that a search will be required. A Valid Photo ID with your birthdate A great attitude & an open heart that's ready for some fun! ​ *We reserve the right to wand everyone on weekend evenings & for large events. ​ ​ *We do not deny entry to anyone unless they are underage (we take this VERY seriously); are visibly intoxicated; do not meet our dress code (above) & refuse to change; refuse to put their backpack away or have it searched; or we are at capacity. ​ Are you handicapped accessible? Yes, and yes! ​ Is your venue eco-friendly? Yes, we are! We use StrawFish®'s biodegradable cups and straws, so each sip is sustainable! Is there a designated smoking area? There is a designated smoking area located outside on the rooftop deck past the Corn Hole boards. Marijuana smoking is illegal in public spaces in Washington, DC, and is strictly prohibited and grounds for removal from our venue. ​ How do I find ​THR ō W Social​​ ® DC Throw Social ® DC is located right in the heart of Ivy City in Washington, DC – just across the street from the Hecht Warehouse building. As you face the building, we are the last door on the left. You can also enter through Kick Axe Throwing, as the venues are connected. We are near Other Half Brewery and the Michelin star-awarded Gravitas. Our address is 1401 Okie Street NE, Suite 102, Washington, DC 20002 . What is parking like at ​THR ō W Social​​® DC? There is metered street parking and a parking garage a half-block away available. Parking Garage: Hecht Warehouse | 1496 Okie St NE, Washington, DC 20002 ​ ​ What is Public Transportation like to ​THR ō W Social​​ ® DC? The D4 and E2 buses drop you right at our corner! For timetables and more information regarding public transportation, click HERE . ​ Buses D4 Ivy City-Franklin Square Line E2 Ivy City-Fort Totten Line ​ Have more questions? 202-880-2559 or Email us! guests@throwsocialdc.com ​ ​ ZipByApp Subscribe to get exclusive updates & schedule of music every week. Subscribe! Please confirm your subscription through the email you will receive. Thanks! LeaveReviewDC Share the love, leave us review! ​THRōW Social® D.C. 1401 Okie St. NE STE #102 Washington D.C., 20002 202-880-2559 guests@throwsocialdc.com HOURS M - TH F SA SU CLOSED 7:00 pm  -    2:00 am 11:30 am  -    2:00 am 11:30 am  -  11:00 pm DC RESERVATIONS plan an event VIEW FLOORPLAN 360 VENUE TOUR VISIT OUR SISTER BRAND! KICK AXE THROWING®​ Fun restaurant in Washington, DC. Live Music in DC. Best Brunch in DC. ​©2025 Throw Social LLC bottom of page"
    },
    {
      "url": "https://bocaratonobserver.com/locations/throw-social-delray/",
      "text": "THRōW Social Delray Beach - bocaratonobserver.com Skip to main content Search Subscribe facebook instagram RSS Culture Buzz Destinations Features Style Wellness Food & Drink Bites Cheers Chef Profile Readers’ Choice Restaurant Guide Restaurant News Review Community Around Town Community News Flash Giving Back La Vida Boca Happenings Calendar Editor's Corner Out 'N' About Guides Charity Country Clubs Education Top Docs Top Lawyers Visitors Profiles Country Club Collection Cuisine Scene Health Care Heroes Inspired Home Men On The Move Power Players Professional Edge Top Docs Top Lawyers Wonder Women Fresh Picks Home THRōW Social Delray Beach THRōW Social Delray Beach 29 S.E. 2nd Ave. , Delray Beach , Florida 33444 Print Make a Reservation! Map Nearby Nearby Events Address 29 S.E. 2nd Ave. , Delray Beach , Florida 33444 Phone 800-561-0755 Visit Website Hours Lunch weekends.\r\nDinner Wednesday-Sunday. Cuisine American , Brunch 2022 Readers' Choice Recognition Award Winner Best Cocktail Spot Back to Search Results 7700 Congress Ave., Suite 3115 Boca Raton, FL 33487 561-982-8960 info@bocaratonobserver.com About Team Advertise Sponsorships Awards Issue Archive Subscribe Careers Contact Privacy Policy Terms © 2024 A&A Publishing Corp Built with Metro Publisher™"
    },
    {
      "url": "https://www.pma-dc.org/throw-social-faq",
      "text": "Throw Social FAQ - Property Management Association Skip to content Celebrate PACE Awards, Leasing Professional Awards, Maintenance Awards, Marketing & Advertising Excellence Awards, EPIC Awards and more!! Learn More! ACKNOWLEDGE in your cart View Cart Cart Join Login Contact Us HOME JOIN CALENDAR NEWS STORE ABOUT Vision, Mission & Values Leadership Committees Councils & Forums Corporate Sponsors DIRECTORY All Current Members Management Partners New Supplier Partners Service Providers MEMBERSHIP Membership Benefits My PMA Portal Committee & Council Portal Industry Development Partners PUBLICATIONS Media Kit Newsletter Media Kit EVENTS Annual Meeting Annual Awards Ceremony Annual Golf Outing Annual Lobster Bake Annual Summit PMEXPO Calendar Event Photo Library Photo Library Pre-2024 Photo Library PROGRAMS Awards & Recognition Current Award Winners Community Service Leadership Development Seminars Webinars CAREER CENTER Post a Job Find a Job Contact Us Join Login 2023 Throw Social April Happy Hour Frequently Asked Questions Please take the time to review Throw Social venue policies along with parking instructions below: Venue Policies: No attire with foul or graphic language or images. A Valid Photo ID with your birthdate is needed for entry. Backpacks are prohibited. Directions and Parking: Throw Social® DC is located right in the heart of Ivy City in Washington, DC – just across the street from the Hecht Warehouse building! As you face the building, Throw Social is the last door on the left. You can enter through Kick Axe Throwing also, as the venues are connected. There is metered street parking available and a generous parking garage a half block away from the entrance. We suggest utilizing the garage to prevent tickets/towing with metered parking. Have more questions? Email Bianca Young at bianca@pma-dc.org PMA Questions? Contact Us. Contact 7508 Wisconsin Avenue 4th Floor Bethesda, Maryland 20814 United States 301.657.9200 Quick Links Upcoming Events Calendar Become a Member Login: Member Compass PMA Member Directory Our Members PMA is a thriving community of more than 4,000 property management professionals who manage an estimated 750,000 residential units and in excess of 100 million square feet of commercial, retail and mixed-use space. PMA’s resources include nearly 300 Associate Member firms that provide products and services property managers and properties use daily. Association Management Software Copyright © 2025 - Property Management Association. Legal × Membership & Account Access Is Your Company a Member? If you are an employee of a PMA member company, we invite you to set up an online account to: Access the Member Directory Register for Events Register for Classes Receive Legislative Updates View & Pay Invoices Create an Account Applying for Membership? The members of PMA invite and encourage you to join! By working together, we can achieve our mission to maintain and enhance our industry as a whole. All membership applications for PMA must be approved by the PMA Staff and the Board of Directors. View Membership Information"
    },
    {
      "url": "https://www.throwsocial.com/plan-an-event-in-delray-beach",
      "text": "Plan An Event In Delray Beach | THROW Social top of page HOME RESERVATIONS DELRAY RESERVATIONS DC RESERVATIONS PLAN AN EVENT IN DC IN DELRAY BEACH DELRAY BEACH DELRAY HOME PROMOS & EVENTS ACTIVITIES MUSIC CALENDAR MENUS RESERVATIONS PLAN AN EVENT GALLERY & 3D TOUR FAQ MEET GINGER GIFT CARDS CONTACT DC LOCATION DC HOME PROMOS & EVENTS ACTIVITIES MUSIC CALENDAR MENUS RESERVATIONS PLAN AN EVENT GALLERY & 3D TOUR FAQ GIFT CARDS CONTACT MIAMI MIAMI HOME GIFT CARDS GIFT CARDS DELRAY GIFT CARDS DC CONTACT JOBS More Use tab to navigate through the menu items. PLAN AN EVENT Get Ready to Party like a Flock Star... BIRTHDAYS | BABY SHOWERS | CORPORATE PARTIES | BAR & BAT MITZVAHS | WEDDINGS | BACHELOR & BACHELORETTE PARTIES CONTACT US! DOWNLOAD PDF EVENT CONTACT FORM VIEW 3D IMMERSIVE TOUR! *P lease note that our Special Events team is available for inquiries M - F, 10am - 6pm. Inquiries received outside of those hours will be responded to the next business day. If it is an urgent need, please contact us at delrayguests@thr owsocial.com or (800) 561-0755 . VISIT OUR SISTER BRAND! KICK AXE THROWING®​ ​ To learn more about The Ginger Brands , visit our website HERE . Fun restaurant in Delray Beach. Best Brunch in Delray Beach. Best Brunch in Miami. ​©2024 Throw SocialL LC ​THRōW Social® Delray 29 SE 2nd Ave. Delray Beach, FL DELRAY CONTACT & HOURS ​THRōW Social® Miami 2335 N. Miami Ave. COMING SOON! MORE INFO! ​THRōW Social® D.C. 1401 Okie St. NE Washington D.C. D.C. SITE bottom of page"
    }
  ]
}