{
  "fuentes": [
    {
      "url": "https://www.palmbeachpost.com/story/entertainment/dining/2019/10/23/openings-guanabanas-sleek-sister-restaurant-debuts-on-stuart-waterfront/2453720007/",
      "email": "lbalmaseda@pbpost.com"
    },
    {
      "url": "https://tidehouse.com/faq/",
      "email": "events@tidehouse.com"
    },
    {
      "url": "https://www.tideswaterfront.com.au/get-in-touch/",
      "email": "dining@tideswaterfront.com.au"
    },
    {
      "url": "https://www.themastheadrestaurant.com/visit",
      "email": "info@themastheadrestaurant.com"
    },
    {
      "url": "https://tidehouse.com/contact/",
      "email": "gretta@tidehouse.com"
    },
    {
      "url": "https://tidehouse.com/contact/",
      "email": "info@tidehouse.com"
    },
    {
      "url": "https://tidehouse.com/contact/",
      "email": "teri@tidehouse.com"
    }
  ],
  "mails": [
    "dining@tideswaterfront.com.au",
    "events@tidehouse.com",
    "gretta@tidehouse.com",
    "info@themastheadrestaurant.com",
    "info@tidehouse.com",
    "lbalmaseda@pbpost.com",
    "teri@tidehouse.com"
  ],
  "nombre_sitio": "tidehouse.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.palmbeachpost.com/story/entertainment/dining/2019/10/23/openings-guanabanas-sleek-sister-restaurant-debuts-on-stuart-waterfront/2453720007/",
      "text": "Openings: Guanabanas’ sleek sister restaurant debuts on Stuart waterfront Charlie Kirk killed in shooting at Utah campus event, Donald Trump says News Sports Restaurants Real Estate Opinion Advertise Obituaries eNewspaper Legals DINING Openings: Guanabanas’ sleek sister restaurant debuts on Stuart waterfront Liz Balmaseda lbalmaseda@pbpost.com A sister restaurant to Guanabanas opens in Stuart this weekend, but don’t expect a replica of the casual, lushly landscaped Jupiter favorite. TideHouse Waterfront Restaurant , which debuts Sunday evening, is sleek in look and more global and modern in flavor. Like Guanabanas , TideHouse is a stunner. The sweeping views of the St. Lucie River and live music nights promise to make the new restaurant as destination-worthy as its funky sibling. But Guanabanas co-owner Jon Sullivan says the new restaurant’s location sets it apart. “One of the main differences that people will notice with TideHouse is that the restaurant is on the second floor overlooking a marina. It’s not the lush jungle atmosphere like Guanabanas,” says Sullivan, who is Guanabanas’ vice president and general manager. He notes TideHouse faces southeast, which gives it “a wide expanse view looking down the St. Lucie River.” Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. “So the view is quite different than our quiet, little river at Guanabanas but nonetheless spectacular,” says Sullivan. That said, there is “one big, common thread: outdoor waterfront dining,” he says. Another shared feature: “We will maintain our commitment to high quality, Florida seafood,” says Sullivan. >>Hey, foodies, come dish with us on Facebook, at Post on Food. The menu features comfort-meets-global bites. Expect a diverse range of dishes that travels beyond Guanabanas’ island-y flavors while keeping some focus on fish and seafood. Some items that catch the eye: Florida lobster poutine, a Vietnamese-inspired fresh-catch banh mi, a Nashville-style hot fish sandwich, plus Florida blue crab cakes and a Mediterranean shrimp pasta. Expect flatbreads, ahi poke nachos, a “Pizza Pot Pie” and prime rib. One shareable dish, the Big Boi’s Buffalo Chicken Dip, carries a special meaning on the menu. It honors former Guanabanas chef Justin Miles Todd , who was shot to death on Sept. 22 while coming to the aid of a woman whose boyfriend was assaulting her in Tequesta. TideHouse plans live music nights several times a week, staged by Roots Music Inc., the production company that manages Guanabanas’ mixed-genre entertainment program. _ For more food and dining news, subscribe to Liz Balmaseda’s weekly “At the Table” newsletter . Follow her on Instagram @silkpalm . Location: 915 NW Flagler Ave., Stuart ; 772-444-3166 Hours: Starting Sunday, Oct. 27, the restaurant will be open Monday through Saturday from 4:30 p.m. to 11 p.m., Sunday to 10 p.m., with lunch service to be added soon. Parking: There’s free valet service, with plenty of overflow parking available TideHouse Waterfront Restaurant Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Promote your Event Buy and Sell Licensing & Reprints Help Center Palm Beach Post Store Subscriber Guide Manage Account Give Feedback Newspapers In Education Newsletters Facebook X eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.palmbeachpost.com. All rights reserved."
    },
    {
      "url": "https://tidehouse.com/faq/",
      "text": "FAQ Skip to primary navigation Skip to main content Reserve a Table TideHouse Waterfront Restaurant - Stuart Florida Home Menus Live Music & Events FAQ Contact FAQ Do you take reservations? We do take reservations for your convenience. Please use our OpenTable link on the home page or call 772-444-3166 for your reservation. If you happen to call during our off hours, please feel free to leave your info on our voicemail, and we will call you back as soon as we’re in to confirm your reservation. If you have a group of 15 or more please email our Events Coordinator at events@tidehouse.com for more information. Are you dog friendly? We’re sorry but we do not allow pets in the restaurant. Can you tell me more about your Happy Hour? Our Happy Hour is currently from Tues-Sun from 4-6pm. We offer $5 well liquor, $4 house wine, $4 bottled beer & $8 signature cocktails, as well as 25% off appetizers! What size boat can you accommodate? And/or where can we park our boat? (boater rules and regs) The water depth ranges around 6-8′ throughout the whole marina. We have a single floating dock on the west side of the main marina dock that leads to the yacht club. We ask that if you come by boat to please dress accordingly for coming into an operating restaurant (shirts and shoes of some kind). We also ask that you leave any food or drinks (and cups/tumblers/etc) on your boat. With the new Covid-19 rules regarding alcohol, we can now offer to-go drinks to enjoy on your boat. If you feel you have had too much to drink, please don’t hesitate to ask for a manager for further solutions before getting behind the wheel of your boat. Can we bring our own cake? We are no longer allowing outside cakes or desserts to be brought in to the restaurant. If you bring a dessert with you, we will be happy to store it in our coolers while you enjoy your meal. Can we bring a bottle of wine? Yes, as long as it is not a brand that we carry and there will be a corkage fee that will apply. Do you have any vegetarian/gluten free/vegan options? Yes, absolutely. If you have an allergy or any sort of dietary restriction, please ask your server for our Allergy Menu. Our menu is listed on the website, so if you would like to familiarize yourself before you arrive we invite you to do so. How much are tickets to the _____ show? All of our live music is free! Always has been since day 1! How much is valet? We normally offer complimentary valet for your convenience. We offer our valet service on the weekends only and all other parking is available at a first come-first served basis. Please make sure you’re parking in a designated spot or your vehicle will be booted. We DO NOT have anything to do with the booting company. This is not a service we pay for or have any involvement with. Unfortunately, it is out of our control and we have done the best we can with available signage to designate which spots are available for our guests. If you have any questions, please don’t hesitate to ask a manager upon your arrival. Location 915 NW Flagler Ave. Stuart, Florida Map & Directions 772-444-3166 Hours Mon: Closed Tues-Thurs: 4pm - 9pm Fri: 4pm - 10pm Sat: 3pm - 10pm Sun: 10am - 9pm Sunday Brunch Buffet 10am-2pm Reservations available on Opentable.com HAPPY HOUR 4:00-6:00 Tues-Sun Connect Follow us on Instagram Follow us on Facebook © 2022 TideHouse · All Rights Reserved · Gift Cards · FAQ · Privacy Policy · Terms of Use · Accessibility Website Design by Boyd Marketing CLOSE MORE HOME MENUS Home Menus Live Music & Events FAQ Contact GIFT CARDS This site uses cookies to provide you a great user experience. By using Tidehouse Waterfront Restaurant, you accept our use of cookies. OK"
    },
    {
      "url": "https://www.tideswaterfront.com.au/get-in-touch/",
      "text": "Get in Touch | Tides Waterfront Dining Home On The Menu Lunch Menu Dinner Menu Kids Menu From The Bar Cocktails By The Glass By The Bottle Beer + Spirits Non-Alcoholic Specials | Whats On Specials Whats On Reservations Functions Weddings Functions Events Vouchers Get in Touch Home On The Menu Dinner Menu Lunch Menu From the Bar Cocktails By The Glass By The Bottle Beer, Spirits, Liqueurs, Aperitifs Non-Alcoholic Specials Reservations Functions Weddings Functions Events Vouchers Get in Touch Get in Touch 07 5438 2304 dining@tideswaterfront.com.au BOOK A TABLE To book a table, please use our online booking system. Book a Table VISIT US Upstairs @ Cnr Minchinton Street & Esplanade Bulcock Beach, Queensland 4551 OPENING HOURS Open Monday – Sunday Lunch : 12:00 – 2:30pm Dinner : 5.30pm-8.30pm Name Email Address Subject Message SUMBIT Get in Touch 07 5438 2304 dining@tideswaterfront.com.au BOOK A TABLE To book a table, please use our online booking system. Book a Table VISIT US Upstairs @ Cnr Minchinton Street & Esplanade Bulcock Beach, Queensland 4551 OPENING HOURS Open Monday – Sunday Lunch : 12:00 – 2:30pm Dinner : 5.30pm-8.30pm Name Email Address Subject Message Submit RESERVATIONS TO BOOK A TABLE PLEASE USE OUR ONLINE BOOKING SYSTEM Book a Table VISIT US Upstairs @ Cnr Minchinton Street & Esplanade Bulcock Beach, Queensland 4551 07 5438 2304 dining@tideswaterfront.com.au OPENING HOURS OPEN MONDAY – SUNDAY Lunch: 12:00 – 2:30pm Dinner: 5:30 – 8:30pm FACEBOOK · INSTAGRAM · TRIPADVISER · TWITTER ©️ TIDES WATERFRONT DINING BACK TO TOP"
    },
    {
      "url": "https://www.themastheadrestaurant.com/visit",
      "text": "Reservation Contact — The Masthead Restaurant 0 Skip to Content CLOSURE Call Us! Open Menu Close Menu CLOSURE Call Us! Open Menu Close Menu CLOSURE Call Us! get in touch CALL THE MASTHEAD TODAY! Book your dinner reservation starting at 5 pm LIVE MUSIC EVERY SATURDAY NIGHT! Inquire about private events *Reservations Recommended 250-748-3714 our waterfront spot 1701 Cowichan Bay Rd., Cowichan Bay, BC, V0R 1N0 Dinner Service is from 5 pm - close 7 nights a week Brunch on Saturdays and Sundays - 11.00 am to 2.00 pm Please call to reserve. Phone (250) 748-3714"
    },
    {
      "url": "https://tidehouse.com/contact/",
      "text": "Contact Skip to primary navigation Skip to main content Reserve a Table TideHouse Waterfront Restaurant - Stuart Florida Home Menus Live Music & Events FAQ Contact Contact We’d be happy to hear from you! Fill out the form below for your inquiries. General Management Kitchen Events Please call for Reservations. Main: 772-444-3166 Office: 772-444-3185 General: info@tidehouse.com Billing: teri@tidehouse.com 915 NW Flagler Ave. Stuart, Florida Location 915 NW Flagler Ave. Stuart, Florida Map & Directions 772-444-3166 Hours Mon: Closed Tues-Thurs: 4pm - 9pm Fri: 4pm - 10pm Sat: 3pm - 10pm Sun: 10am - 9pm Sunday Brunch Buffet 10am-2pm Reservations available on Opentable.com HAPPY HOUR 4:00-6:00 Tues-Sun Connect Follow us on Instagram Follow us on Facebook © 2022 TideHouse · All Rights Reserved · Gift Cards · FAQ · Privacy Policy · Terms of Use · Accessibility Website Design by Boyd Marketing CLOSE MORE HOME MENUS Home Menus Live Music & Events FAQ Contact GIFT CARDS This site uses cookies to provide you a great user experience. By using Tidehouse Waterfront Restaurant, you accept our use of cookies. OK"
    }
  ]
}