{
  "fuentes": [
    {
      "url": "https://gastronomicslc.com/2025/04/07/downtown-slc-cocktail-bar-unleashes-western-themed-re-design/",
      "email": "contactus@gastronomicslc.com"
    },
    {
      "url": "https://tipsytampa.co/",
      "email": "typesetit@att.net"
    },
    {
      "url": "https://tipsyflamingomiami.com/home/",
      "email": "tipsy@flamingo.com"
    }
  ],
  "mails": [
    "contactus@gastronomicslc.com",
    "tipsy@flamingo.com",
    "typesetit@att.net"
  ],
  "nombre_sitio": "tipsyflamingomiami.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://gastronomicslc.com/2025/04/07/downtown-slc-cocktail-bar-unleashes-western-themed-re-design/",
      "text": "Downtown SLC cocktail bar unleashes Western-themed re-design – Gastronomic Salt Lake City Skip to content Gastronomic Salt Lake City Utah's oldest food magazine. Call us (385) 429-0650 About Subscribe Best Of SLC 2025 Dining Guide News Industry Search for... Gastronomic Salt Lake City Utah's oldest food magazine. Call us (385) 429-0650 Navigation Menu Navigation Menu About Subscribe Best Of SLC 2025 Dining Guide News Industry Downtown SLC cocktail bar unleashes Western-themed re-design by Stuart Melling April 7, 2025 April 8, 2025 Menu watch , News Flanker Kitchen & Sporting Club It’s all change again at The Parlor – the semi-secret cocktail lounge tucked away at the back of Flanker.    The latest revamp follows the similarly over the top 1980s themed Tipsy Flamingo .  Now known as the Hidden Boot Saloon, the latest refresh draws inspiration from Western flair.  The design is a mix of modern and classic – murals of icons such as Johnny Cash and Dolly Parton sit alongside the likes of Jelly Roll. As ever, the interior design is an impeccable, no expense spared effort – thematic apropos decoration stretches from the jail-cell entry doorway, through to the country-themed glassware.  Heck, there’s even a mechanical bull should you wish to saddle up and show your skills. Flanker – mechanical bull (Gastronomic SLC) Flanker – interior design refresh (Gastronomic SLC) Francesco Lafranconi, VP of beverage and hospitality for the larger group writes,  “At Flanker we pride ourselves on curating immersive experiences that bring our locals together, and our latest pop-up, the Hidden Boot Saloon, is no exception. This experience is a true celebration of cowboy culture, filled with lively music, expertly crafted drinks, and an energetic atmosphere. From the moment you walk through the swinging doors, you’ll feel the Western spirit and know you are in for an exciting, unforgettable evening.” Alongside the visual refresh, the food and cocktail menu has also been suitably updated. As I sipped through a few of Lafranconi’s latest cocktails, I ordered up the seemingly innocuous pigs in blankets. The pastry-wrapped hot links arrived resplendent in a grand trophy. Winner winner, err, sausage dinner. It’s these little humourous twists and turns that ensure the experience always offers something new to discover. And well, frankly, it’s just fun. The Hidden Boot Saloon is expected to stay open throughout the summer – with a variety of western-themed events and specials planned through the lounge’s run.  Be sure to follow Flanker’s socials for the latest news.  Reservations to drink and dine can be made online with the bar open Wed-Thu, 5.00 – 10.00 p.m. and Fri-Sat, 5.00 p.m. – 1.00 a.m. Scion Cider Bar – interior Scion Cider The latest house-made cider is now on tap at this Central 9th spot. Crafted by fine fermenter (remember cider is wine folks) Rio Connelly, the latest release (named EDNA) is also available in cans to go. The bar writes that the release is, “an off-dry sour cider made from 100% WA-grown Columbia Crabapple w/ big tartness, soft tannins, hints of tropical fruit & spice, and seriously session-able at 5.5% ABV.” You can also find a new superfood-powered concoction detailed as “semi-sweet unfiltered cider w/ papaya, açai berry & local honey, fruity, tropical & lightly tart coming in at 6.2% ABV. Also available in cans to-go tonight for your spring skiing adventures this weekend!” Bambara You may recall that chef JV Hernandez recently took the reigns at this restaurant in the Hotel Monaco in downtown SLC. The latest update following the kitchen retooling is the launch of an all-new brunch menu. The restaurant writes that: . . . To start, guests can indulge in an exciting selection of sharable bites, including Blue Cheese Potato Chips made with a tantalizing blend of rich jack cheese and creamy blue cheese, and perfectly seasoned with a bold harissa spice for a touch of heat. For those who lean into the sweeter side of the menu, guests can share the delicately fried Ricotta Donuts that are complemented by smooth champagne-infused dulce de leche drizzle. For a more savory experience, guests can try a menu item that has a delightful twist on classic flavors. The Pastrami Salmon Toast, featuring cured salmon on top of perfectly toasted bread, is enhanced with a smooth muhammara spread and garnished with everything spice and fresh herbs for a bold and flavorful bite. If that sounds exciting, guests who want an even bolder flavor can order the Birria Egg Benedict that highlights a fusion of savory flavors on top of a Salt City English Muffin. A drizzle of zesty chipotle lime hollandaise covers the poached eggs and tender, slow-braised birria, for a perfect bite each time. Sugar House Station – gyro by Greek Tyrant (Gastronomic SLC) Sugar House Station The methodical opening of vendors at this new Sugar House spot has been continuing at a brisk pace.  By my reckoning the full slate are now in action at the food hall.  Joining the launch names (Bird House Chicken, Proper Burger, Canella’s), three new bars by Sugar House Distillery, Casot, and Waterpocket Distillery have revved into gear. In the last few days, Santo Tacos, Pizza Bar, Publik, and Greek Tyrant have all joined in on the fun too.  Pictured above is the gyro by Greek Tyrant – a concept by former Aristo’s owner and chef, Aristides Boutsikakis.   If you missed it, here’s my original preview of the food and drink hall opening just a few weeks ago. The Salt Republic A new seasonal menu is now available at this restaurant on the ground floor of the downtown Hyatt Regency Hotel.  The PR team tells me: . . . The dinner menu offers delectable options for every palate, from the lighter flavors of Sweet Corn Soup, or the local foliage and fresh berries in the Mountain Berry Salad, to heartier options such as Fire Grilled Elk, Spring Bucatini, and the Wagyu Pastrami Smash Burger. For lunch, delight in midday specialties such as Burrata Toast with pickled cherry pepper relish, Fried Oyster Mushrooms with a Korean chili aioli and pickled serrano peppers, Beet Salad with whipped chevre and candied pecans and a twist on luncheon classics like the Grilled Chicken Club on focaccia with pesto aioli and bacon. And for dessert, enjoy a Seasonal Cookie Skillet a la mode or something fruit-forward like the Morello Cherry Tart with dark chocolate ganache. Small bites Kona Grill – A special menu through April 17th will include: Spicy Tuna Taco – Crispy nori, spicy motoyaki, and spring onion, $24 Stuffed Salmon – Brie and crab filling, sesame broccoli, yellow rice, and a decadent butter cream sauce, $39 Seafood Fettuccine Alfredo – Shrimp, bay scallops, mussels, creamy Alfredo sauce, parmesan, and scallions, $39 Mazza – Ted Scheffler in Utah Stories reported that Ali Sabbah’s award-winning Lebanese eatery will offer special lunches every Friday, 11.00 – 2.00. The menu includes three sandwiches with one side of hummus, salad or fries, and a drink of your choice. This will be pick-up only along with needing to pre-order by 9:00 am on Fridays.” STK – A “Bounty from the Seven Seas” limited-time menu available through April 17th includes: Duck & Shuck, two oysters aguachile paired with a glass of Decoy by Duckhorn Sauvignon Blanc, $26 New England Clam Chowder, $17 Spicy Yellowtail Crispy Rice, pickled Fresno and unagi sauce, $27 Grilled Octopus, fingerling potatoes, salsa verde, olives, and smoked paprika aioli, $34 Surf & Turf Fried Rice, wagyu beef, crab, spicy motoyaki, and a fried egg, $41 Purchase a subscription Subscribe to our paid newsletter for $5 and help keep our stories free of automated advertising Subscribe Now Other useful links Free newsletter – signup and receive our weekly newsletter for free Food talk group – chew the fat with other like-minded Utah foodies over on Facebook. Best of SLC 2024 – what you can’t miss in the Beehive right now. Stuart Melling Hi, I’m Stuart, nice to meet you!  I’m the founder, writer and wrangler at Gastronomic SLC.  I’m a multiple-award winning journalist and have written in myopic detail about the Salt Lake City  dining scene for the better part of seventeen years. I’ve worked extensively with multiple local publications from Visit Salt Lake to Salt Lake Magazine, not least helped to consult on national TV.   Pause those credits, yep, that’s me! I’m also a former restaurant critic of more than five years, working for the Salt Lake Tribune.    I’m largely fueled by a critical obsession with rice, alliteration and the use of big words I don’t understand.   What they’re saying about me: “Not inaccurate”, “I thought he was older”, “I don’t share his feelings”. Want to know more? This is why I am the way I am . This article may contain content provided by one of our paid partners. These are some of the best businesses in Utah.    For a list of all our current and past relationships see our partnership history page . Tags: Aristides Boutsikakis Bambara Flanker Kitchen + Sporting Club Greek Tyrant JV Hernandez Kona Grill Mazza Rio Connelly Scion Cider STK Salt Lake City Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Name * Email * Website Comment * Δ Latest Utah food news Wine dinners around the Wasatch to mark in your diary this month September 4, 2025 Paninis to pretzels – what Utah’s food writers have been covering this month September 4, 2025 All the bar and restaurant licenses awarded at August DABS meeting August 29, 2025 Here are all the new names on the Utah food and drink scene August 26, 2025 Urban Hill’s Nick Zocco beats Bobby Flay – taste the winning dish August 26, 2025 Food features There’s still time to grab an Easter treat from this Draper must April 10, 2025 More than 150 Utah restaurants opened this year – how many have you tried? December 30, 2024 Utah’s love for elk in burgers, main entrees is growing – and not just in resort eateries November 21, 2024 Why don’t Utah restaurants display simple letter grades like other states? June 13, 2024 Why are there no Michelin-starred restaurants in Utah? May 18, 2024 Eat Here Now The magic of Sri Annapoorani in South Jordan August 28, 2025 Monte is Utah’s newest entrant in the fine dining space August 20, 2025 The fabulous flavors of Salt Lake City’s Indoor Swap Meet August 7, 2025 Kenny J’s BBQ making waves over in South Jordan August 1, 2025 Bold Haitian flavors available at the unique Makaya Caters July 24, 2025 Quick links Best Of SLC 2024 Utah food and drink news Must read stores General features Food events New restaurants DABS / alcohol news Products Recipes Follow us here Subscribe to our FREE newsletter Paid subscription Follow on Instagram Follow on Facebook RSS feed Email us Work in the industry? Work with us - news partner Work with us - sponsored content Utah Food industry resources Contact us contactus@gastronomicslc.com ‪(385) 429-0650 PO BOX 522065, SLC, UT, 84106 Privacy and disclosure Neve | Powered by WordPress"
    },
    {
      "url": "https://tipsytampa.co/",
      "text": "Bartending Services - Tipsy Tampa Bartender and Events (813)575-4422 Tipsy Tampa Bartending and Events Tipsy Tampa Bartending and Events Tipsy Tampa Bartending and Events Tipsy Tampa Bartending and Events Tipsy Tampa Bartending and Events Tipsy Tampa Bartending and Events Tipsy Tampa Bartending and Events Tipsy Tampa Bartending and Events Home Rental Inventory Florals Arches and Green Walls Dessert Options Table Numbers Signs Lanterns Candles/Votives Linens Table Decor Glassware Flatware and Drink Sets Gift Option Misc Booking Pricing & Packages Signature Drinks Mobile Bar Options Lemonade Bar Add On S’more’s Bar More Home Rental Inventory Florals Arches and Green Walls Dessert Options Table Numbers Signs Lanterns Candles/Votives Linens Table Decor Glassware Flatware and Drink Sets Gift Option Misc Booking Pricing & Packages Signature Drinks Mobile Bar Options Lemonade Bar Add On S’more’s Bar (813)575-4422 Home Rental Inventory Florals Arches and Green Walls Dessert Options Table Numbers Signs Lanterns Candles/Votives Linens Table Decor Glassware Flatware and Drink Sets Gift Option Misc Booking Pricing & Packages Signature Drinks Mobile Bar Options Lemonade Bar Add On S’more’s Bar Proud to Provide Bartending Services for Tampa Bay and South Florida! Proud to Provide Bartending Services for Tampa Bay and South Florida! Proud to Provide Bartending Services for Tampa Bay and South Florida! Proud to Provide Bartending Services for Tampa Bay and South Florida! Contact Us # Pricing and Packages # Booking Why Be Ordinary... When you can \"wow\" your guests with this elegant addition? Searching for that *one thing* that'll make your event perfect? Look no further! Charcuterie boards are a simple yet visually stunning touch to add to your wedding or event. Just let us know your vision and Tipsy Tampa will build the board of your wildest dreams. Perfect for an effortless cocktail hour, a glamorous dessert station, or even a full dinner option! Learn More Want to add a charcuterie board to your event? Click through to see pricing! Find out more About Tipsy Tampa Bartender and Events Why Tipsy? Our Philosophy Our Philosophy At Tipsy Tampa Bartender and Events, we are passionate about serving the best drinks in town. Our team of experienced and skilled bartenders work hard to create cocktails that are not only delicious but also visually stunning. We take pride in sourcing the freshest ingredients and using premium spirits to give you an unforgettable drinking experience. Our Philosophy Our Philosophy Our Philosophy We believe that a great cocktail goes beyond just the taste. It should also be an experience that engages all your senses. From the aroma to the presentation, we strive to create drinks that are as visually stunning as they are delicious. Our goal is to provide you with an environment where you can relax, unwind and enjoy the art of mixology. Our Team Our Philosophy Our Team Our team of bartenders are passionate, creative and knowledgeable. They are constantly experimenting with new techniques and ingredients to create exciting new cocktails. With years of experience behind the bar, they can also recommend the perfect drink to suit your tastes and preferences. About Us About Tipsy Tampa Welcome to Tipsy Tampa! I am Chelsea Lopez, the head bartender and owner. I have been bartending in restaurants and bars for 15 years, and wanted to take my passion and bring it to Tampa Bay and my South Florida community. I have been very fortunate to be a part of so many amazing weddings and events in the Tampa Bay area since Tipsy Tampa started in 2017. We have recently expanded to Miami, Ft. Lauderdale and the Palm Beaches as well as Orlando and Central Florida. Look around the site to learn more about what we do and how we can help make your special day memorable! Book A Consultation Bar Services for Your Event Services We Offer: Bartending Services Drink Menu Creation/Customization Custom Bar Area Open Bar or DIY Bar and More! Pricing & Packages Why tipsy tampa? At Tipsy Tampa, we aim to make this part of your wedding planning a breeze. We work with any budget, any drink preference and any venue type. All of our amazing clients will say we are affordable, flexible and go above and beyond on to make your day memorable! Reviews Meet Our Regional Coordinators A Team To Meet All Your FL Wedding Needs In 2020-2024 Tipsy Tampa had its most successful years EVER with hundreds of upcoming bookings in 2026 and beyond. That's why we've assembled an expert team to meet all of your Florida wedding needs. With the addition of Abby and Gladys as coordinators, Tipsy Tampa is proud to say we cover North Central , South AND Central Florida as well as Sarasota , Bradenton , Fort Myers , and the Palm Beaches . Read on to find your regional coordinator and start making your wedding dreams come to life! Leigha Rybnick - Lead bartender Meet Leigha! Leigha is a TIPSY TAMPA FAVE! She has been in the industry for over 25 years and it shows through her work ethic. Guests love her, we love her, and her drinks are delicious! Book a Consult With Leigha Ashley Price As a regular Tipsy Team member, Ashley learned exactly what it means to throw the perfect party! She brings that knowledge and SO much more to her position as Tipsy's assistant coordinator! You may see her bartending, serving, coordinating because really she does is ALL! Book a Consult With Ashley Kelly Mahaney  - planner - coordinator Kelly has been in planning for years. She is so knowledgeable and knows how to throw the best party. Kelly also offers amazing bridal party options! bridalbashsoflo.com Book a Consult With Kelly Abigail Kay Silva - ASSISTANT Abigail is a Florida native so she was born into the party. With a ton of party planning experience and the perfect personality she was a natural fit. She brings the TIPSY to the TAMPA and the guests love her so much.  Ask Abby any questions and she is sure to help you figure out exactly what is needed for the perfect event. Jamie Haughn Jamie is just awesome. She started with us in 2023 and has been nothing short of amazing. With her 20 years in the business she shakes things up everyday! Photo Gallery Photo Gallery Social Contact Us looking forward to talking about your big day! Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Send me a message about your upcoming event. Do you need help creating a customized bar experience? Do you need to save money? Want to check our availability? Tipsy Tampa Bartender and Events Tampa, Florida, United States (813)575-4422 Payments Click below to pay for your deposit or agreed upon amount from Tipsy Tampa. Please email tipsytampa@gmail.com once you have paid. Thank you! Pay Now Subscribe Sign up to hear from us about specials, sales, and events. Email Address Sign up Copyright © 2025 Tipsy Tampa Bartender and Events - All Rights Reserved. Powered by"
    },
    {
      "url": "https://tipsyflamingomiami.com/home/",
      "text": "Tipsy Flamingo – A Downtown Miami Cocktail Bar for Happy Hour, Music, and Late-Night Energy 0 Skip to Content MENU UPCOMING EVENTS BOOK YOUR EVENT VISIT US Open Menu Close Menu MENU UPCOMING EVENTS BOOK YOUR EVENT VISIT US Open Menu Close Menu MENU UPCOMING EVENTS BOOK YOUR EVENT VISIT US VIBE WITH THE FLOCK. PLAN YOUR NIGHT Tropical, unpretentious, and always a vibe — Tipsy Flamingo is Downtown Miami’s go-to cocktail bar for bold drinks and feel-good music. Whether you're easing into happy hour or riding the late-night wave, Tipsy Flamingo serves up bold cocktails, feel-good music, and a Miami vibe that never misses. It’s the kind of place you stumble into once — and keep coming back to. 🦩 Let the sipping begin 🦩 Let the sipping begin 🦩 Let the sipping begin Original Cocktails Happy Hour Beers & More Original Cocktails $ 17 THE TIPSY FLAMINGO Ketel One Botanicals Grapefruit & Rose, Pink Grapefruit, Agave, Luxardo, Lemon, Angostura Bitters $ 17 $ 16 SOUTH POINTE PALOMA Dobel Diamante, Tamarind, Lime, Sparkling Water $ 16 $ 17 LUXE LOVER No 3 Gin, Strawberry, Vanilla, Lemon, Egg Whites, Sparkling Wine $ 17 $ 18 CLARO QUE SI Plantation Pineapple, Ten To One Rum, Fresh Pineapple, Lime, Whey $ 18 $ 16 SUNBURN RELIEF Ketel One Botanicals Cucumber & Mint, Aloe, Elderflower, Lime $ 16 $ 17 BEACH BONFIRE Union Uno Mezcal, Pineapple‑Infused Honey, Ancho Reyes Chile, Lime, Egg White, Cinnamon $ 17 $ 17 MR. MONTANA Monkey Shoulder Scotch, Tonka, Banana Du Brésil, Chocolate Bitters $ 17 $ 18 MANGO ADOBADO Lobos Reposado, 400 Conejos Mezcal, Mango Shrub, Lime, Saline, Spices $ 18 $ 18 MY ENGLISH IS NOT VERY GOOD LOOKING Canaima Gin, Guava, Orange Bitters, Lime, Cream Cheese Foam, Galleta Maria, Whey $ 18 $ 17 INSTAGRAM MODEL Martell VS Cognac, Dom Benedictine, Apricot, Lemon, Absinthe, Peychaud’s Bitters, Saline $ 17 $ 16 TIPSY COLADA Ron Zacapa, Coffee, Vanilla, Salted Caramel $ 16 $ 21 MESSAGE IN A BOTTLE Cocuy Saroche, Coconut, Soursop, Lime, Coconut Milk $ 21 $ 21 ON MIAMI TIME Dragon Fruit‑Infused Santa Teresa 1796, Grapefruit Cordial, St. Germain, Lime, Thyme Cloud $ 21 DAILY FROM 5 PM TO 9 PM Happy Hour $ 4 BEER & WINE $ 4 $ 5 MIXED DRINKS $ 5 $ 7 CLASSICS $ 7 $ 8 SELECT COCKTAILS* $ 8 *The Tipsy Flamingo, South Pointe Paloma, Sunburn Relief, Luxe Lover Beers & More $ 8 BEERS $ 8 La Rubia, Corona, Michelob Ultra, Stella Artois $ 8 HIGH NOON HARD SELTZERS $ 8 Various Flavors $ 8 KETEL ONE SPRITZERS $ 8 Various Flavors FLOCK SHOTS (MINIMUM ORDER OF 2 SHOTS) $ 13 PRETTY IN PINK Tito’s, Triple Sec, Strawberry, Lemon, Sugar Rim $ 13 $ 11 PABLO ESCOBAR SHOT A shot of Jose Cuervo Tradicional Silver served with lime and our iconic baggies of salt $ 11 COCKTAIL MENU UPCOMING EVENTS Saoco Sundays Last Sunday of the Month | 9PM Old-school reggaetón, cocktails, and a little perreo to close out your weekend. RSVP here for a free welcome drink. Daily Happy Hour 5PM–9PM $4 beers, $5 wine, $6 mixed drinks, $7 select cocktails. Early drinks, tropical vibes. Miami Music Mondays Starting 9PM Local DJs bring the heat. $10 Margaritas keep it cool. Tipsy Tuesdays 9PM–12AM Ladies drink FREE (well drinks). Bring the crew — the vibes are complimentary. Throwback Thursdays 9PM–Close ’90s and 2000s hits all night. Two-for-one Faded Love cocktails to match the mood. Friday & Saturday Vibes Late ’til Later Weekend energy. Elevated cocktails. Let the night run wild. Downtown Miami Jazz Night Every Wednesday | 9PM Live Latin jazz, crisp martinis, and craft charcuterie — every Wednesday at Tipsy Flamingo, starting 8PM. Late Night Happy Hour Thu-Sat | 1AM—Close $4 beer & wine, $5 mixed drinks, $7 classics and shots — every Thu–Sat from 1AM to close. Late nights hit different at Tipsy. Book your event! If you're planning a birthday party, bachelorette party, office happy hour, or just a good ol' get-together, Tipsy Flamingo offers custom private event packages. Tap the button below to inquire about hosting your event with us! The Main Bar Tipsy Flamingo is an intimate venue, perfect for events with 100 guests or less. The space lends itself to more informal gatherings, such as cocktail receptions, happy hours, bachelor/bachelorette parties, and more. Our focus is to provide our guests with a fun yet professional atmosphere anchored by our delicious cocktails, quality music, and excellent service. We offer open bar packages, drink tickets, and custom event packages based on your needs. For more information, tap the button below! Fill out the form! Ready to sip & sway the night away? 💃 Ready to sip & sway the night away? 💃 Ready to sip & sway the night away? 💃 Flock Around With Us Address 40 NE 1st Avenue, Miami FL, 33132 Hours Monday–Thursday 5pm–3am Friday–Saturday 5pm–4am Sunday 5pm–2am Phone (305) 646-9967 About Us Menu Visit Us Book Your Event Upcoming Events Reservations JOIN THE FLOCK! First Name Last Name Email * Thank you for flocking with us! © 2025 Tipsy Flamingo. All rights reserved."
    }
  ]
}