{
  "fuentes": [
    {
      "url": "https://titusville.org/visiting-here/shop",
      "email": "webbanner_shopourstore-tealphrtshirt@2x-300x113-1-200x75.png"
    },
    {
      "url": "https://titusville.org/visiting-here/shop",
      "email": "webbanner_shopourstore-tealphrtshirt@2x-300x113-1-300x113.png"
    },
    {
      "url": "https://titusville.org/visiting-here/shop",
      "email": "webbanner_shopourstore-tealphrtshirt@2x-300x113-1.png"
    },
    {
      "url": "https://titusville.org/visiting-here/shop",
      "email": "info@titusville.org"
    },
    {
      "url": "https://titusville.org/visiting-here/shop",
      "email": "warbirds@valiantaircommand.com"
    },
    {
      "url": "https://www.ashevillechamber.org/about-us/contact-us/",
      "email": "member@ashevillechamber.org"
    },
    {
      "url": "https://members.titusville.org/Employment-Staffing",
      "email": "info@titusville.org"
    },
    {
      "url": "https://titusville.org/your-chamber/board-of-directors",
      "email": "info@titusville.org"
    },
    {
      "url": "https://titusville.org/contact-us",
      "email": "info@titusville.org"
    },
    {
      "url": "https://titusville.org/category/chamber-updates/page/6",
      "email": "info@titusville.org"
    },
    {
      "url": "https://www.cornwallchamber.com/contact",
      "email": "info@cornwallchamber.com"
    },
    {
      "url": "https://www.lexingtonchamber.net/contact-us/",
      "email": "22chamber@lexingtonchamber.net"
    },
    {
      "url": "https://www.lexingtonchamber.net/contact-us/",
      "email": "chamber@lexingtonchamber.net"
    },
    {
      "url": "https://titusville.org/",
      "email": "info@titusville.org"
    },
    {
      "url": "https://titusville.org/reboot/visit-safely",
      "email": "webbanner_shopourstore-1@2x-300x113-1-200x75.png"
    },
    {
      "url": "https://titusville.org/reboot/visit-safely",
      "email": "webbanner_shopourstore-1@2x-300x113-1-300x113.png"
    },
    {
      "url": "https://titusville.org/reboot/visit-safely",
      "email": "webbanner_shopourstore-1@2x-300x113-1.png"
    },
    {
      "url": "https://titusville.org/reboot/visit-safely",
      "email": "info@titusville.org"
    },
    {
      "url": "https://titusville.org/your-chamber",
      "email": "info@titusville.org"
    },
    {
      "url": "https://members.titusville.org/about_the_chamber/welcome_to_titusville.aspx",
      "email": "info@titusville.org"
    },
    {
      "url": "https://www.titusvillechamber.org/Chambers-of-Commerce",
      "email": "info@titusville.org"
    },
    {
      "url": "https://members.titusville.org/Chambers-of-Commerce",
      "email": "info@titusville.org"
    },
    {
      "url": "https://business.springfieldchamber.com/contact",
      "email": "info@springfieldchamber.com"
    },
    {
      "url": "https://titusville.org/your-chamber/staff-members",
      "email": "dibacco@titusville.org"
    },
    {
      "url": "https://titusville.org/your-chamber/staff-members",
      "email": "reichle@titusville.org"
    },
    {
      "url": "https://titusville.org/your-chamber/staff-members",
      "email": "akins@titusville.org"
    },
    {
      "url": "https://titusville.org/your-chamber/staff-members",
      "email": "bates@titusville.org"
    },
    {
      "url": "https://titusville.org/your-chamber/staff-members",
      "email": "hensler@titusville.org"
    },
    {
      "url": "https://titusville.org/your-chamber/staff-members",
      "email": "info@titusville.org"
    },
    {
      "url": "https://titusville.org/visiting-here",
      "email": "info@titusville.org"
    },
    {
      "url": "https://titusville.org/category/news/page/5",
      "email": "info@titusville.org"
    },
    {
      "url": "https://titusville.org/onthemove",
      "email": "nicholas.gow@titusville.com"
    },
    {
      "url": "https://titusville.org/onthemove",
      "email": "akins@titusville.org"
    },
    {
      "url": "https://titusville.org/onthemove",
      "email": "info@titusville.org"
    },
    {
      "url": "https://titusville.org/onthemove",
      "email": "mchesnut@spaceflorida.gov"
    },
    {
      "url": "https://titusville.org/onthemove",
      "email": "troy.post@brevardcounty.us"
    },
    {
      "url": "https://nbbd.com/chamber/press.html",
      "email": "giemza@titusville.org"
    },
    {
      "url": "https://nbbd.com/chamber/press.html",
      "email": "newsletter@titusville.org"
    },
    {
      "url": "https://members.titusville.org/Visiting/Contact_Us.aspx",
      "email": "info@titusville.org"
    },
    {
      "url": "https://titusville.org/your-chamber/membership-benefits",
      "email": "info@titusville.org"
    }
  ],
  "mails": [
    "22chamber@lexingtonchamber.net",
    "akins@titusville.org",
    "bates@titusville.org",
    "chamber@lexingtonchamber.net",
    "dibacco@titusville.org",
    "giemza@titusville.org",
    "hensler@titusville.org",
    "info@cornwallchamber.com",
    "info@springfieldchamber.com",
    "info@titusville.org",
    "mchesnut@spaceflorida.gov",
    "member@ashevillechamber.org",
    "newsletter@titusville.org",
    "nicholas.gow@titusville.com",
    "reichle@titusville.org",
    "troy.post@brevardcounty.us",
    "warbirds@valiantaircommand.com",
    "webbanner_shopourstore-1@2x-300x113-1-200x75.png",
    "webbanner_shopourstore-1@2x-300x113-1-300x113.png",
    "webbanner_shopourstore-1@2x-300x113-1.png",
    "webbanner_shopourstore-tealphrtshirt@2x-300x113-1-200x75.png",
    "webbanner_shopourstore-tealphrtshirt@2x-300x113-1-300x113.png",
    "webbanner_shopourstore-tealphrtshirt@2x-300x113-1.png"
  ],
  "nombre_sitio": "titusville.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://titusville.org/visiting-here/shop",
      "text": "Shop - Titusville FL Chamber of Commerce (321) 348-4748 (321) 348-4748 Your Chamber Member Benefits / Join Board of Directors Staff Members Titusville Area Chamber of Commerce Committees Affinity Partners / Discounts Celebrating 100 Years Visiting Here Adventure Videos Adventure Photos Adventure Maps Ideas & Itineraries Our Welcome Center Explore Our Trails About Launch From Here Share Your Adventure Stay Play Shop Dine Space Nature Our Community Excels A Florida Trail Town RIDE IT DOWN 2025 Brevard’s Scorecard Visit Our Store Show Some Local Love Our Directory Events Chamber Events Community Events Submit an Event News Stories and Adventures Chamber Updates Regional News Contact Us = --Select a page-- Your Chamber Visiting Here Our Community Our Directory Events News Contact Us --Select a Subpage-- Stay Play Shop Dine Space Nature Launch From Here Share Your Adventure LAUNCH YOUR ADVENTURE Shop Titusville, Florida, offers an eclectic mix of shopping opportunities for everyone. Titusville offers conveniently located groceries and supermarket stores, shopping plazas with major and specialty retailers, shops in our Historic Downtown District and a generous assortment of unique shops sprinkled throughout our city. Featured Shopping Options Dusty Rose Antique Mall Go Native Titusville Antique Mall Titusville Mall Eaton Worms – Homebased Publix – Garden Street Publix – Colonial Coast Crossing Stephen’s Jewelers Growing Crazy Blinds of All Kinds Gear Up Surplus Barn Light Electric Publix – Indiavista Center Back Home Leisure Furniture Titus Landing The Shipping Depot Walmart Titusville Down Home Christmas Shoppe 84 Degrees – Homebased Leaf Lounge Virgin Tattoo Company Suzanne’s Studio LLC AREA VISITOR QUICK LINKS ArtsBrevard.org Cruiser’s Guide to Port Canaveral Rocket Launch Schedule The City of Titusville VisitSpaceCoast.com Wildlife Adventure Points [PDF] EPIC Launch Views [PDF] Trail Crossings Safety Tips [PDF] Get Around Town [PDF] Launch From Here Social Welcome Center Dine Nature Play Shop Space Launch View Sites NASA Stay Hotels & Lodging RV & Campgrounds Boat & Kayak Launch Copyright © 2025 Titusville Area Chamber of Commerce. All rights reserved. Phone: (321) 348-4748 | Email | Sitemap Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Member Login Back to Top"
    },
    {
      "url": "https://www.ashevillechamber.org/about-us/contact-us/",
      "text": "Contact Us - Asheville Area Chamber of Commerce Venture Asheville Asheville Area Chamber of Commerce Asheville-Buncombe County Economic Development Coalition AVL 5x5 Vision 2020 search Asheville : Building Community Through Business search Economic Development Chamber of Commerce Become a Member Get Engaged Business Environment Economic Development Strategy Research & Economy Live & Visit News & Events About Us Find a Local Business Home / About Us / Contact Us Contact Us Get in Touch If you need additional information, we are delighted to help. Stop by the Asheville Chamber and Visitor Center or get in touch today. We also invite you to browse our staff directory to find the appropriate department for your inquiry. Address & Directions General Inquiries Address & Directions Physical Address Asheville Chamber and Visitor Center 36 Montford Avenue Asheville, NC 28801 Hours of Operation Asheville Chamber offices: Monday-Friday: 8:30 a.m.-5 p.m. The Visitor Center is open seven days a week. Monday-Friday:  8:30 a.m.-5 p.m. Saturday-Sunday:  9 a.m.-5 p.m. Directions From I-240 Eastbound, exit at 4C Haywood/Montford. Turn right at light onto Haywood Street. At next stop light, turn right on to Montford Ave. The Chamber building is located on the left. From I-240 Westbound, exit at 4C Haywood/Montford. Turn right at light onto Montford Ave. The Chamber building is located on the left. Mailing Address Asheville Area Chamber of Commerce P.O. Box 1010 Asheville, NC 28802 General Inquiries For general information about the Asheville Area Chamber of Commerce, contact us at: Phone: 828.258.6129 Fax: 828.251.0926 member@ashevillechamber.org Please note: We are transitioning our phone system and will not have voicemail available until mid to late June. If you can’t reach particular staff via phone, we encourage you to email or call the Visitor Center desk at 828-258-6129. Or fill out this general inquiry form Share Facebook Twitter Email Social Media Facebook LinkedIn Twitter YouTube Flickr E-News Sign Up Sign Up Return to Top Get Engaged Become a Member Find a Local Business Membership Opportunities Special Programs Chamber FAQ Advocacy Policy Agenda Advocacy Resources Advocacy Initiatives Business Environment Regional Overview Taxes, Incentives, Opportunity Zones Talent & Workforce Commercial Properties & Sites Innovation Small Business Transportation & Infrastructure Economic Development Strategy AVL 5×5 Strategy Advanced Manufacturing Science & Technology Healthcare Talent & Workforce Tourism Small Business Arts & Culture Project Announcements Research & Economy Asheville Rankings Asheville Residential Climate Cost of Living Crime Asheville Economic Indicators Education Asheville Interactive Data and Maps Major Employers Taxes Transportation More Information Live & Visit Visit Asheville Retirement Housing & Neighborhoods Employment & Working Education Health & Wellness Arts & Culture Eat & Drink Play Outdoors News & Events Blog Press Releases Project Announcements About Us Contact Us Meet The Team Mission, Vision and Guiding Principles Chamber Board Twitter Facebook LinkedIn YouTube Instagram Venture Asheville Asheville Area Chamber of Commerce Asheville-Buncombe County Economic Development Coalition AVL 5x5 Vision 2020 ©\n        2025, All Rights Reserved\n            | Privacy Policy"
    },
    {
      "url": "https://members.titusville.org/Employment-Staffing",
      "text": "Employment & Staffing 321.267.3036 321.267.3036 Your Chamber Member Benefits / Join Board of Directors Staff Members Get Involved: Committees Affinity Partners / Discounts Celebrating 100 Years Visiting Here Adventure Videos Adventure Photos Adventure Maps Ideas & Itineraries Our Welcome Center Explore Our Trails About Launch From Here Share Your Adventure Stay Play Shop Dine Space Nature Our Community Excels A Florida Trail Town RIDE IT DOWN 2025 Brevard's Scorecard Visit Our Store Show Some Local Love Our Directory Events Chamber/Community Events Submit an Event News Stories and Adventures Chamber Updates Regional News Be Prepared Contact Us = Employment & Staffing Employment & Staffing Search | Advanced Search | New Members | Coupons and Discounts | All Categories Employment Agencies If your business isn't here, contact us today to get listed! Copyright © 2025 Titusville Area Chamber of Commerce. All rights reserved. Phone: (321) 267-3036 | Fax: (321) 264-0127 | Email | Sitemap Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Member Login Back to Top"
    },
    {
      "url": "https://titusville.org/your-chamber/board-of-directors",
      "text": "Board of Directors - Titusville FL Chamber of Commerce (321) 348-4748 (321) 348-4748 Your Chamber Member Benefits / Join Board of Directors Staff Members Titusville Area Chamber of Commerce Committees Affinity Partners / Discounts Celebrating 100 Years Visiting Here Adventure Videos Adventure Photos Adventure Maps Ideas & Itineraries Our Welcome Center Explore Our Trails About Launch From Here Share Your Adventure Stay Play Shop Dine Space Nature Our Community Excels A Florida Trail Town RIDE IT DOWN 2025 Brevard’s Scorecard Visit Our Store Show Some Local Love Our Directory Events Chamber Events Community Events Submit an Event News Stories and Adventures Chamber Updates Regional News Contact Us = --Select a page-- Your Chamber Visiting Here Our Community Our Directory Events News Contact Us --Select a Subpage-- Member Benefits / Join Titusville Area Chamber of Commerce Committees Get Involved: Events Our Directory Join Chamber Events Chamber Updates Board of Directors Staff Members LAUNCH YOUR BUSINESS Board of Directors The Chamber of Commerce Board of Directors is composed of a dedicated group of business and community leaders who provide strategic guidance, fiduciary oversight, and visionary leadership to support the Chamber’s mission. Representing a diverse cross-section of industries, our Board works collaboratively to promote economic growth, advocate for pro-business policies, and ensure our members and community continue to thrive. Executive Committee Chairman of the Board Amer Hatoum Gear Up Military Surplus Immediate Past Chairman\\ Matthew Morak Jess Parrish Medical Foundation Chairman of the Board Elect Tanya Hudson Paradise Signs and Graphics Vice Chairman Economic Affairs Kevin Daugherty Titusville-Cocoa Airport Authority Vice Chairman Public Affairs Chase Greene John Greene Logistics Company Vice Chairman Financial Affairs Brian Lightle Lightle Beckner Robison, Inc. Vice Chairman Legislative Affairs Amanda Herrnkind Brevard County Property Appraiser’s Office Directors Bryan Boorujy Visual Legacy Productions Yvette Cruz Brevard Public Schools Samantha Decker Parrish Healthcare Lise Engenbretsen Titan Construction & Consulting Robert Geoghagen ACR Solutions LLC Nicholas Gow City of Titusville Lisa Santana Titusville Family YMCA Katherine Sonn Central Florida Spine & Pain Al Taylor Coldwell Banker Coast Realty Jack Pladdys Ph.D Junior Achievement of the Space Coast Grant Haas White Bird Attorneys at Law Michelle Voye Wiedmann Construction & Roofing Liaisons Andrew Lieb Eastern Florida State College Neha Pandit North Brevard Economic Development Zone Tom Abatte City of Titusville Our Board of Directors in Action Chamber Board tours Kennedy Space Center in Titusville, FL. Chairman Edna Wilson addresses members at luncheon Chamber Board Chairman Carla McRae plays “Cherry Bomb” at 2017 Installation Dinner. Scott Larese , Titusville City Manager, plays “The Butler.” Mayor Dan Diesel and City Manager Scott Larese engaging with the members John Belden (right) as “Sleazy” Billy Specht Dennis Franklin (Franklin Special Productions) Dawna Thorstad (center) with Chamber members. Deborah Blair of Community Credit Union (left) Billy Specht and JB Kump Chairman Matthew Morak with Sherriff Wayne Ivey Copyright © 2025 Titusville Area Chamber of Commerce. All rights reserved. Phone: (321) 348-4748 | Email | Sitemap Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Member Login Back to Top"
    },
    {
      "url": "https://titusville.org/contact-us",
      "text": "Contact Us - Titusville FL Chamber of Commerce (321) 348-4748 (321) 348-4748 Your Chamber Member Benefits / Join Board of Directors Staff Members Titusville Area Chamber of Commerce Committees Affinity Partners / Discounts Celebrating 100 Years Visiting Here Adventure Videos Adventure Photos Adventure Maps Ideas & Itineraries Our Welcome Center Explore Our Trails About Launch From Here Share Your Adventure Stay Play Shop Dine Space Nature Our Community Excels A Florida Trail Town RIDE IT DOWN 2025 Brevard’s Scorecard Visit Our Store Show Some Local Love Our Directory Events Chamber Events Community Events Submit an Event News Stories and Adventures Chamber Updates Regional News Contact Us = --Select a page-- Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Contact Us Titusville Area Chamber of Commerce and Welcome Center 419 South Hopkins Avenue Titusville, FL 32796 Phone: (321) 348-4748 Welcome Center: (321) 607-6216 Email: info@titusville.org WordPress Google Maps Plugin Contact Form Name First Last Email I want to receive Vacation Information Relocation Information Mailing Address Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Additional Comments Here are two ways you can stay in touch. Sign up to receive Vacation Planning Tips and Local Adventure Stories. Get insider tips on where to go and what to see to help you plan your visit. Sign up here to for info on new adventures, trail updates & special tours. Sign up for eContact --our Weekly Chamber Newsletter. To receive communication about community events, business news, announcements,  special discounts from our members and more…sign up for our weekly eCONTACT newsletter delivered to your inbox every Thursday for regular alerts to tons of business resources. Copyright © 2025 Titusville Area Chamber of Commerce. All rights reserved. Phone: (321) 348-4748 | Email | Sitemap Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Member Login Back to Top"
    },
    {
      "url": "https://titusville.org/category/chamber-updates/page/6",
      "text": "Chamber Updates Archives - Page 6 of 17 - Titusville FL Chamber of Commerce (321) 348-4748 (321) 348-4748 Your Chamber Member Benefits / Join Board of Directors Staff Members Titusville Area Chamber of Commerce Committees Affinity Partners / Discounts Celebrating 100 Years Visiting Here Adventure Videos Adventure Photos Adventure Maps Ideas & Itineraries Our Welcome Center Explore Our Trails About Launch From Here Share Your Adventure Stay Play Shop Dine Space Nature Our Community Excels A Florida Trail Town RIDE IT DOWN 2025 Brevard’s Scorecard Visit Our Store Show Some Local Love Our Directory Events Chamber Events Community Events Submit an Event News Stories and Adventures Chamber Updates Regional News Contact Us = --Select a page-- Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Chamber Updates Education Committee Update – February 2019 Posted on April 18, 2019. Categorized under: Chamber Updates , Education Committee [gview file=”https://titusville.org/wp-content/uploads/2019/04/EDUCATION-COMMITTEE-MEETING-MINUTES-February-2019-corrected.pdf”] The next Education Committee meeting will take place on March 8, 2019, 9:00 am in the Chamber Boardroom. Education Committee Update – January 2019 Posted on April 18, 2019. Categorized under: Chamber Updates , Education Committee [gview file=”https://titusville.org/wp-content/uploads/2019/04/EDUCATION-COMMITTEE-MEETING-MINUTES-January-2019.pdf”] The next Education Committee meeting will take place on February 8, 2019, 9:00 am in the Chamber Boardroom. Education Committee Update – November 2018 Posted on April 18, 2019. Categorized under: Chamber Updates , Education Committee [gview file=”https://titusville.org/wp-content/uploads/2019/04/EDUCATION-COMMITTEE-MEETING-MINUTES-November-2018.docx”] The next Education Committee meeting will take place on January 11, 2019, 9:00 am in the Chamber Boardroom. Education Committee Update – October 2018 Posted on April 16, 2019. Categorized under: Chamber Updates , Education Committee [gview file=”https://titusville.org/wp-content/uploads/2019/04/EDUCATION-COMMITTEE-MEETING-MINUTES-October-12-2018.pdf”] The next Education Committee meeting will take place on November 9, 2018, 9:00 am in the Chamber Boardroom. Titusville Talking Points – April 2019 Posted on April 16, 2019. Categorized under: Chamber Updates , Economic Development , Regional News The Titusville Talking Points is published quarterly by the City of Titusville to inform its residents of improvements taking place around town.  It features a list of newly established businesses, current and forthcoming construction projects and city government news. In the April 2019 issue, highlights include:   Celebrating the Success of Titus Landing Kayaks By… [Continue Reading] Titusville Area Seniors Honored for Achievements in the Classroom and Community Posted on September 26, 2018. Categorized under: Chamber Updates , Regional News Titusville, September 25, 2018 – The Education Committee of the Titusville Area Chamber of Commerce has announced its 2018-2019 Outstanding Young Adults (OYAs). These 17 students will be honored throughout the school year at the monthly Chamber Membership Luncheons and will compete for a $1,000 scholarship, sponsored by Community Credit Union and Jess Parrish Medical Foundation. OYAs are… [Continue Reading] Education Committee Update – September 2018 Posted on September 26, 2018. Categorized under: Chamber Updates , Education Committee Invitations for the 3rd Annual North Brevard College Night (September 24th) have been sent to middle schools, private schools and home schools from North Brevard to Rockledge. We’ve received about 50 RSVPs from universities to businesses offering certificate courses, student resources and career exploration. The list of participants is online at titusville.org/event/college-night. The 18 finalists… [Continue Reading] Education Committee Update – August 2018 Posted on September 26, 2018. Categorized under: Chamber Updates , Education Committee Chamber staff worked with Education Committee members on this year’s Operation Thank Our Teachers. Teacher Appreciation/ Feeder School Breakfasts took place at Astronaut High School (Aug. 8th) and Titusville High School @ James Madison (Aug. 9th).  We provided breakfast, courtesy of Mr. Submarine and Salads and DIYM Catering, and goody bags full of trinkets and… [Continue Reading] Governmental Affairs Update – August 2018 Posted on September 26, 2018. Categorized under: Chamber Updates , Governmental Affairs Committee The Governmental Affairs Committee met on Thursday, August 16, 2018.  The committee, led by chairman Al Taylor (Coldwell Banker Coast Realty – Al Taylor), discussed the following: Lynda Weatherman, with the Economic Development Committee of Florida Space Coast, was our guest speaker at the August meeting. She presented a program entitled Internet Connect Brevard that encourages building community… [Continue Reading] Education Committee Update – March 2018 Posted on July 24, 2018. Categorized under: Chamber Updates , Education Committee This year’s College Night will take place on September 24th, 5pm-7pm at Titusville Mall. We will notify the principals and counselors so the date can be added to the school calendar. Students will be given a list of very important questions to ask college and trade school representatives. We have reached the final stage of… [Continue Reading] Page 6 of 17 « First ‹ Previous 2 3 4 5 6 7 8 9 10 Next › Last » News Categories Chamber Updates Regional News Stories and Adventures Copyright © 2025 Titusville Area Chamber of Commerce. All rights reserved. Phone: (321) 348-4748 | Email | Sitemap Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Member Login Back to Top"
    },
    {
      "url": "https://www.cornwallchamber.com/contact",
      "text": "Get in Touch | Contact | Cornwall and Area Chamber of Commerce Looking to pay your invoice? Click here > About Events News Resources Sponsorship Partners Ribbon Cuttings Chambers Plan HR Covered Directory Contact Log out Become a Member > Become A Member Have a question or just want to say Hello? Feel free to reach out to us! You can contact us by phone, email or the contact form. We are available and happy to help you! Our business hours are 8:00 AM to 4:00 PM, Monday to Thursday; Closed on Friday's. We're here to help! Simply fill in the form below, and we'll respond within 1-2 business days! Inquiring about... Membership Events Grants & Financial Support Advertising Sponsorships Other Thank you! Your submission has been received! Something went wrong. Please try again. Here's where you can reach us 16 Second Street West, Cornwall, ON K6J 1G2 (613) 933-4004 info@cornwallchamber.com FREQUENTLY Asked Questions How much does a membership cost? The price ranges depending on your business type and the number of employees you have. For a full breakdown, visit our Become a Member page for more details! How can I join? Visit our Become a Member page and sign up at the bottom of the page. We'd love to have you join! How do I pay an invoice? Payment can be made via EFT, cheque, or e-transfer to bero@cornwallchamber.com. Click here for more information. How is the Chamber funded? We are a Non-Profit Organization run by Volunteer Board Members, with our funding coming from Events, Membership Fees, and Sponsorship Revenue. We are not government funded. Why should I become a member? The Cornwall and Area Chamber of Commerce is the voice for our local businesses. We advocate for our members, provide new opportunities, and connect you with the community! Learn more about how we support you here > What are the member benefits? Members can access exclusive offers like discounted insurance policies and shipping, group medical plans, grant opportunities, and more. We also give your business opportunities to grow with our member directory, newsletters, sponsorships, and more! Learn about all the details here > How do I register for the benefits? Some benefits require a code you'll receive once you sign up, and others will automatically apply for being a Chamber member. What is Pub Night? When is the next one? Pub Nights are a monthly networking event hosted by the Cornwall and Area Chamber of Commerce. Each Pub Night is held at a different business (i.e. Schnitzels, Boston Pizza, etc.) Check out our Events page to see when the next Pub Night takes place! Where can I find Government Grants? Government Grants will be posted here on our website and sent to your inbox through our Chamber Newsletters as they become available. Join the Cornwall & Area Chamber of commerce Benefit from all the resources available to help your business thrive, join us at networking events, and more. Become a member Exclusive Discounts Group Medical Plans Chamber Newsletters Sponsorship Opportunities Member Events Exclusive Discounts Group Medical Plans Chamber Newsletters Sponsorship Opportunities Member Events Exclusive Discounts Group Medical Plans Chamber Newsletters Sponsorship Opportunities Member Events 16 Second St W, Cornwall, ON K6J 1G2 (613) 933 - 4004 info@cornwallchamber.com Find what you're looking for: Home About *NEW* Billboard Events & Sponsorships Contact Become a Member Member Directory News Careers Partners Pivot Points FAQ Grants & Financial Support Chamber Members View Account Sign Up Log In Reset Password Purchase a Membership Pay An Invoice Â© All rights reserved by the Cornwall and Area Chamber of Commerce"
    },
    {
      "url": "https://www.lexingtonchamber.net/contact-us/",
      "text": "Contact Us - Lexington Area Chamber of Commerce Skip to content Home Member Directory Expand Member Login Chamber Directory List Virtual Membership Directory About The Chamber Expand Chamber Board of Directors Chamber Team Member Benefits Lexington Leaders Program of Work Community Resources Expand Employment Opportunities Special Deals Portraits of Davidson County Events Expand Host Your Event at The Breeden Insurance Amphitheatre Chamber Ribbon Cutting Ceremonies Join The Chamber Contact Us Search Toggle Menu Search Contact Us Your questions and concerns are important to us, and we want to answer any questions you may have. However, the high volume of messages we receive can make it difficult for us to respond to every one promptly. If you sent us a message/question and haven’t heard back within a week, please call us at 336-248-5929 . Location: 507 East Center Street., Lexington, NC 27292 Contact Information: PH: 336-248-5929 Mail: Lexington Area Chamber of Commerce P.O. Drawer C, Lexington, NC 27293 Follow Us Facebook LinkedIn Contact Us \" * \" indicates required fields Δ Today's Date * MM slash DD slash YYYY Name * First Last Email * Enter Email Confirm Email Main Contact Number * Organization * If not an organization or business, please put N/A. Address * Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Country Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Comments * Please let us know what's on your mind. Have a question for us? Ask away. About The Chamber Community Resources Member Directory Join The Chamber Contact Us Get In Touch! PH: 336-248-5929 chamber@lexingtonchamber.net 507 East Center St. Lexington, NC 27292 Facebook LinkedIn Instagram © 2025 Lexington Area Chamber of Commerce - WordPress Theme by Kadence WP Scroll to top Scroll to top Home Member Directory Toggle child menu Expand Member Login Chamber Directory List Virtual Membership Directory About The Chamber Toggle child menu Expand Chamber Board of Directors Chamber Team Member Benefits Lexington Leaders Program of Work Community Resources Toggle child menu Expand Employment Opportunities Special Deals Portraits of Davidson County Events Toggle child menu Expand Host Your Event at The Breeden Insurance Amphitheatre Chamber Ribbon Cutting Ceremonies Join The Chamber Contact Us Toggle Menu Close Search for: Search"
    },
    {
      "url": "https://titusville.org/",
      "text": "Titusville Area Chamber of Commerce - Titusville, Florida (321) 348-4748 (321) 348-4748 Your Chamber Member Benefits / Join Board of Directors Staff Members Titusville Area Chamber of Commerce Committees Affinity Partners / Discounts Celebrating 100 Years Visiting Here Adventure Videos Adventure Photos Adventure Maps Ideas & Itineraries Our Welcome Center Explore Our Trails About Launch From Here Share Your Adventure Stay Play Shop Dine Space Nature Our Community Excels A Florida Trail Town RIDE IT DOWN 2025 Brevard’s Scorecard Visit Our Store Show Some Local Love Our Directory Events Chamber Events Community Events Submit an Event News Stories and Adventures Chamber Updates Regional News Contact Us = --Select a page-- Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Your Chamber WHO WE ARE Launch Your Vacation VISITING TITUSVILLE Live. Work. Grow. OUR ECONOMY Your Chamber WHO WE ARE Launch Your Vacation VISITING TITUSVILLE Live. Work. Grow. OUR ECONOMY Featured News Blue Origin’s New Glenn Reaches Orbit Save Our Indian River Lagoon 100th Project Celebration: Clams Across the Lagoon DYK? Titusville is a designated TREE CITY USA Brevard Public Schools Named A Purple Star District Blue Origin’s New Glenn Rocket May Launch This Week Brevard County Picks Fox Lake for January’s Top Spot 2024 Launches Easily Break the Previous Record by 29% New Glenn Ready to Go Sand Point is Park of the Month Astronaut High Cheerleaders in Macy’s Parade What’s Happening Now Show Your Colors JOIN. Be a Member Member Directory Coupons and Discounts CHAIRMAN'S CIRCLE TRUSTEES Copyright © 2025 Titusville Area Chamber of Commerce. All rights reserved. Phone: (321) 348-4748 | Email | Sitemap Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Member Login Back to Top"
    },
    {
      "url": "https://titusville.org/reboot/visit-safely",
      "text": "Visit Safely - Titusville FL Chamber of Commerce (321) 348-4748 (321) 348-4748 Your Chamber Member Benefits / Join Board of Directors Staff Members Titusville Area Chamber of Commerce Committees Affinity Partners / Discounts Celebrating 100 Years Visiting Here Adventure Videos Adventure Photos Adventure Maps Ideas & Itineraries Our Welcome Center Explore Our Trails About Launch From Here Share Your Adventure Stay Play Shop Dine Space Nature Our Community Excels A Florida Trail Town RIDE IT DOWN 2025 Brevard’s Scorecard Visit Our Store Show Some Local Love Our Directory Events Chamber Events Community Events Submit an Event News Stories and Adventures Chamber Updates Regional News Contact Us = --Select a page-- Your Chamber Visiting Here Our Community Our Directory Events News Contact Us To Titusville Area CHAMBER website | To CITY of Titusville website | To ZONE website Reboot/Home Reopening Our Workforce Local Love Take The Pledge Pledge Takers Visit Safely Things YOU CAN DO to Visit Safely Although travel restrictions around the Coronavirus pandemic have loosened, most of our businesses are still operating under some sort of restrictions. Enhanced safety measures are in place across the Space Coast and include increased sanitatization processes, physical distancing, and capacity limitations. All of this is in an effort to protect our citizens and our welcomed visitors. We encourage you to call ahead for specific information about your desired destination – many places have modified hours, limited access and availability – so plan before you arrive. You can contact the Titusville Area Chamber of Commerce at 321-267-3036 or info@titusville.org if you would like assistance in planning your itinerary. Click for PDF We also ask you to embrace the  ideas in our Responsible Travel Pledge – and help us protect our assets for f uture visitors – and the people who are lucky enough to live here. Roam Responsibly. I will explore thoughtfully and responsibly, maintaining the utmost respect for everyone and everything I encounter. Educate Myself. I will do my research before traveling, familiarizing myself with local regulations and community concerns, which may have changed over time. Safety First. I will follow public health directives from government officials, including social distancing measures. I will take all necessary steps to minimize health risks to myself and others and stay home if I’m sick. Preserve Florida. I will protect and nurture our pristine outdoor spaces and cultural places, by maintaining a light footprint at every turn and paying special attention to delicate ecosystems. Embrace Community. I will support local businesses and do my part to ensure the long-term prosperity of the places I visit. Celebrate Culture. I will immerse myself in the diverse local cultures and embrace the traditions and practices I encounter. Teach Others. I will lead by example and share these practices with fellow travelers, acknowledging that we all share the responsibility to protect Florida, California, and every one of our glorious states, parks and our people. Thank you, and be safe. We want to thank the Visit California pros for the inspiration for this initiative.  Their commitment to responsible travel is a model, and we have patterned our Responsible Travel Pledge after theirs. Maps We have lots of map to help you plan. Quick Links Wildlife Adventures Iconic Stops Epic Launch Viewing Sites Explore our Trails Itineraries We’ve done some of the work for you! Learn More When you arrive in town, please visit us at one of our locations for insider tips and recommendations. Titusville Area Chamber of Commerce Monday – Friday 9 am – 5 pm 2000 S Washington Avenue Titusville, FL 32780 Titusville Welcome Center Tuesday – Thursday 10 am – 3 pm Friday – Saturday 10 am – 4 pm 419 S Hopkins Avenue Titusville, FL 32796 Or use the links below to explore your options. Copyright © 2025 Titusville Area Chamber of Commerce. All rights reserved. Phone: (321) 348-4748 | Email | Sitemap Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Member Login Back to Top"
    },
    {
      "url": "https://titusville.org/your-chamber",
      "text": "Your Chamber - Titusville FL Chamber of Commerce (321) 348-4748 (321) 348-4748 Your Chamber Member Benefits / Join Board of Directors Staff Members Titusville Area Chamber of Commerce Committees Affinity Partners / Discounts Celebrating 100 Years Visiting Here Adventure Videos Adventure Photos Adventure Maps Ideas & Itineraries Our Welcome Center Explore Our Trails About Launch From Here Share Your Adventure Stay Play Shop Dine Space Nature Our Community Excels A Florida Trail Town RIDE IT DOWN 2025 Brevard’s Scorecard Visit Our Store Show Some Local Love Our Directory Events Chamber Events Community Events Submit an Event News Stories and Adventures Chamber Updates Regional News Contact Us = --Select a page-- Your Chamber Visiting Here Our Community Our Directory Events News Contact Us --Select a Subpage-- Member Benefits / Join Titusville Area Chamber of Commerce Committees Get Involved: Events Our Directory Join Chamber Events Chamber Updates Board of Directors Staff Members LAUNCH YOUR BUSINESS Your Chamber The Titusville Area Chamber of Commerce was founded by volunteers in 1922 and is the oldest chamber in Brevard County. It is a non-profit organization that is funded primarily through membership dues paid by local businesses in Titusville, Florida, as well as various fundraising projects. Benefits of membership include referrals, promotional opportunities, enrollment in business educational seminars, access to networking events, involvement in advocacy initiatives, and several other business-related opportunities.  Our resources can help new, existing, and expanding businesses develop strategies to tackle tough challenges, increase productivity and understand the ever-changing issues that impact business and our community. Citizens and visitors alike look to the Titusville Area Chamber of Commerce for reliable information and references about the best our community has to offer.  Our organization and members share the desire to improve the community and the climate for business.  We help direct the energies of those who believe that a community worth living in is a community worth fighting for. Mission Statement: To develop, enhance, and maintain a strong and diverse business climate and support a prosperous community. The Titusville Area Chamber of Commerce is governed by a volunteer board of directors, and has a professional staff of five. Member Testimonials \"The Titusville Chamber of Commerce has always gone above and beyond to help us. We are so fortunate to have such a committed group of people supporting our community. Boater's Edge salutes you!\" Neisha Haggard Administrator, Boater's Edge \"The Titusville Chamber has been an essential resource for me as I joined the community. If you are in North Brevard and not utilizing the chamber for the resource it can be, then you are missing out. Matthew Morak Director, Jess Parrish Medical Foundation \"AT&T has partnered with the Titusville Area Chamber of Commerce for many years. This Chamber excels at the integration of Business, Government, and Community and brings great value to all three.\" Dan Pollock Regional Director, External & Legislative Affairs, AT&T \"I love working with the Titusville Area Chamber of Commerce! Their events are always exciting and informative and provide opportunities for networking. If you are a new business in the Titusville Area, join the Chamber, it is worth it!\" Alexis Quiros Director of Sales, Extended Stay America Titusville KSC \"The Titusville Area Chamber of Commerce provides a knowledgeable and excellent partnership in North Brevard.  Through their dedication to regional trails and transportation, we have been able to advance a robust trail network and continue to make advancements in multi-modal transportation.\" Sarah Kraum Senior Transportation Planner, Space Coast Transportation Planning Organization \"I love my relationship with the Titusville Chamber of Commerce. They have also made it a point to learn more about me and my business and the goals that I have for growing my business.  I would highly recommend a Chamber membership to anyone who would like to ask. \" Tracy Stroderd Everything Brevard \"The Titusville Area Chamber of Commerce really exemplifies how a chamber should be. It is a wonderful experience and great opportunity to build relationships with other business professionals while promoting your business.\" Steve Johnson Executive Vice President, Savings Safari \"In 2021 we made the decision to join the Titusville Chamber in hopes of finally growing the network into Port St. John and Titusville…  And, what a great decision it has been! They have opened doors and helped make introductions to business owners and decision makers that we could not have opened on our own.    Love the Ville isn’t just a slogan… they mean it. And, the Ville loves them back!\" Mike Snyder Launch Network DMS \"The Outstanding Young Adult program that recognizes exceptional students in the local high schools has made such a huge impact on our students. The Chamber has been recognizing and providing scholarships for these local students for over 30 years. They are always there for their business partners, local schools and anyone in need!\" Kerri Weeks Space Coast Jr/Sr High School \"We have had many opportunities to work with the chamber over the years and they not only give small businesses a voice in government but also help connect members with the community.  It’s not just about building businesses. it’s also about building relationships and giving back to the community.\" Julie Dimmig Marketing Business Relationship Manager, Community Credit Union Florida \"Being a member of the Titusville Chamber of Commerce has helped grow my business as well as help other small business owners. The tools and resources they have for members are worth every dollar spent on membership. I have gained new clients through my affiliation with the chamber and look forward to growing my business because of my membership.\" Sharon Bowen Wise Owl Grant Services \"For over 20 years, the Titusville Chamber has have been my go-to source for current information, materials, and advice about the North Brevard market. The Chamber has made my job easier and helped me to be more effective in my work for the Space Coast!\" Tom Bartosek Space Coast office of Tourism Copyright © 2025 Titusville Area Chamber of Commerce. All rights reserved. Phone: (321) 348-4748 | Email | Sitemap Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Member Login Back to Top"
    },
    {
      "url": "https://members.titusville.org/about_the_chamber/welcome_to_titusville.aspx",
      "text": "Welcome to Titusville - Titusville Area Chamber of Commerce | Titusville, FL Visiting Play Stay Dine Shop Events Maps Photos / Video Coupons Publications Contact Us Live & Work Facts & Figures Quality of Life Health Care Employment Education Housing Local Officials Map Photos / Video Coupons Publications Contact Us Our Economy Facts & Figures Industry Clusters Economic Development Business Retention & Expansion International Business Business Directory Local Events Community Calendar Chamber Calendar Submit an Event About the Chamber Welcome to Titusville Membership Benefits Committees Marketing & Advertising Opportunities New and Renewed Members Chamber Calendar Publications News Board of Directors Staff Members Contact Us Launch From Here Members There is no content for this ContentID. Welcome to Titusville Home > About the Chamber > Welcome to Titusville There is no content for this ContentID. Quick Links Welcome to Titusville Membership Benefits Committees Marketing & Advertising Opportunities New and Renewed Members Chamber Calendar Publications News Board of Directors Staff Members Contact Us Launch From Here Copyright © 2011  Titusville Area Chamber of Commerce.  All rights reserved. 2000 South Washington Avenue | Titusville, FL 32780-4747 Phone: (321) 267-3036 | Fax: (321) 264-0127 | Email Chamber Management Software"
    },
    {
      "url": "https://www.titusvillechamber.org/Chambers-of-Commerce",
      "text": "Chambers of Commerce 321.267.3036 321.267.3036 Your Chamber Member Benefits / Join Board of Directors Staff Members Get Involved: Committees Affinity Partners / Discounts Celebrating 100 Years Visiting Here Adventure Videos Adventure Photos Adventure Maps Ideas & Itineraries Our Welcome Center Explore Our Trails About Launch From Here Share Your Adventure Stay Play Shop Dine Space Nature Our Community Excels A Florida Trail Town RIDE IT DOWN 2025 Brevard's Scorecard Visit Our Store Show Some Local Love Our Directory Events Chamber/Community Events Submit an Event News Stories and Adventures Chamber Updates Regional News Be Prepared Contact Us = Chambers of Commerce Chambers of Commerce Search | Advanced Search | New Members | Coupons and Discounts | All Categories Sort alphabetically by... Name City East Orlando Chamber of Commerce _ 12301 Lake Underhill Road Orlando , FL 32828 Andrew Cole (407) 277-5951 Member Since: 2004 New Places, New Faces, & Help Launching Your Business in The 440 Corridor of East Orlando! Learn More Florida Chamber of Commerce _ 136 S Bronough Street Tallahassee , FL 32302  3309 Christi Morgan (850) 521-1201 Member Since: 1980 Learn More Accelerate Brevard: Chamber of Innovation _ 400 Fortenberry Rd Merritt Island , FL 32952 Jimmy Lane 321.459.2200 Member Since: 1985 Learn More Greater Palm Bay Chamber of Commerce _ 4100 Dixie Highway NE Palm Bay , FL 32905 Nancy Peltonen (321) 951-9998 Member Since: 1985 Learn More Titusville Area Chamber of Commerce _ 419 South Hopkins Avenue Titusville , FL 32796 Erin Akins (321) 348-4748 Member Since: 1924 Serving Port St. John, Titusville, Mims, and Scottsmoor Areas Learn More Melbourne Regional Chamber of East Central Florida _ 1135 W. Nasa Blvd. Melbourne , FL 32901  4740 Michael Ayers (321) 724-5400 Member Since: 1985 Learn More If your business isn't here, contact us today to get listed! Copyright © 2025 Titusville Area Chamber of Commerce. All rights reserved. Phone: (321) 267-3036 | Fax: (321) 264-0127 | Email | Sitemap Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Member Login Back to Top"
    },
    {
      "url": "https://members.titusville.org/Chambers-of-Commerce",
      "text": "Chambers of Commerce 321.267.3036 321.267.3036 Your Chamber Member Benefits / Join Board of Directors Staff Members Get Involved: Committees Affinity Partners / Discounts Celebrating 100 Years Visiting Here Adventure Videos Adventure Photos Adventure Maps Ideas & Itineraries Our Welcome Center Explore Our Trails About Launch From Here Share Your Adventure Stay Play Shop Dine Space Nature Our Community Excels A Florida Trail Town RIDE IT DOWN 2025 Brevard's Scorecard Visit Our Store Show Some Local Love Our Directory Events Chamber/Community Events Submit an Event News Stories and Adventures Chamber Updates Regional News Be Prepared Contact Us = Chambers of Commerce Chambers of Commerce Search | Advanced Search | New Members | Coupons and Discounts | All Categories Sort alphabetically by... Name City Melbourne Regional Chamber of East Central Florida _ 1135 W. Nasa Blvd. Melbourne , FL 32901  4740 Michael Ayers (321) 724-5400 Member Since: 1985 Learn More Titusville Area Chamber of Commerce _ 419 South Hopkins Avenue Titusville , FL 32796 Erin Akins (321) 348-4748 Member Since: 1924 Serving Port St. John, Titusville, Mims, and Scottsmoor Areas Learn More Greater Palm Bay Chamber of Commerce _ 4100 Dixie Highway NE Palm Bay , FL 32905 Nancy Peltonen (321) 951-9998 Member Since: 1985 Learn More Florida Chamber of Commerce _ 136 S Bronough Street Tallahassee , FL 32302  3309 Christi Morgan (850) 521-1201 Member Since: 1980 Learn More Accelerate Brevard: Chamber of Innovation _ 400 Fortenberry Rd Merritt Island , FL 32952 Jimmy Lane 321.459.2200 Member Since: 1985 Learn More East Orlando Chamber of Commerce _ 12301 Lake Underhill Road Orlando , FL 32828 Andrew Cole (407) 277-5951 Member Since: 2004 New Places, New Faces, & Help Launching Your Business in The 440 Corridor of East Orlando! Learn More If your business isn't here, contact us today to get listed! Copyright © 2025 Titusville Area Chamber of Commerce. All rights reserved. Phone: (321) 267-3036 | Fax: (321) 264-0127 | Email | Sitemap Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Member Login Back to Top"
    },
    {
      "url": "https://business.springfieldchamber.com/contact",
      "text": "Contact Us  - Springfield Area Chamber of Commerce Skip to content Menu Home About About Us Strategic Plan History Centennial Board of Directors Committees & Task Forces Contact Us Calendar Our Members Membership Directory Jobs Board Health Insurance Member News Chamber News Video Resources Chamber Check In Making the Most of Your Membership Why Chamber? Video Library New & Renewed Members Member Spotlights Post News & Jobs Navigating Our Website Priorities Economic Development Creating Growth Business Assistance Economic Development News Economic Data Profile Site Selection Networking & Events Events & Networking Events for 2025 Annual Events & Awards Ignite Conference Annual Passes Professional Development Photo Galleries Committees & Task Forces Networking & Events News Business Advocacy Advocacy in Action e-Newsletter Archives Business Advocacy News Community Leadership Visit Local Public Policy State and Federal Advocacy Voter Education Talent & Workforce Growing Our Workforce Talent Development Talent Attraction/ Relocation Talent Retention/ The Network Talent & Workforce News Area Resources Relocating to Springfield Economic Development The Network for Young Professionals City of Springfield Greene County Visit Springfield Join Login Menu Home About About Us Strategic Plan History Centennial Board of Directors Committees & Task Forces Contact Us Calendar Our Members Membership Directory Jobs Board Health Insurance Member News Chamber News Video Resources Chamber Check In Making the Most of Your Membership Why Chamber? Video Library New & Renewed Members Member Spotlights Post News & Jobs Navigating Our Website Priorities Economic Development Creating Growth Business Assistance Economic Development News Economic Data Profile Site Selection Networking & Events Events & Networking Events for 2025 Annual Events & Awards Ignite Conference Annual Passes Professional Development Photo Galleries Committees & Task Forces Networking & Events News Business Advocacy Advocacy in Action e-Newsletter Archives Business Advocacy News Community Leadership Visit Local Public Policy State and Federal Advocacy Voter Education Talent & Workforce Growing Our Workforce Talent Development Talent Attraction/ Relocation Talent Retention/ The Network Talent & Workforce News Area Resources Relocating to Springfield Economic Development The Network for Young Professionals City of Springfield Greene County Visit Springfield Join Login Contact Us Note: If you're not sure which member of our Chamber staff to call, visit our Staff page for a list of our team members. For all other inquiries, please fill out the form below and we will get back to you as soon as we can. You may also reach us by mail: Springfield Area Chamber of Commerce P.O. Box 1687 Springfield, MO 65801-1687 Thank you! First Name Last Name Organization Title Address Line 1 Address Line 2 City State Postal Code Address Type Country United States Canada Afghanistan Aland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo Democratic Republic of Cook Islands Costa Rica Coted Ivoire Croatia Cuba Curacao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea Bissau Guyana Haiti Heard Island and Mc Donald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isleof Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea Democratic Peoples Republic Korea Republic of Kuwait Kyrgyzstan Lao Peoples Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestine Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Reunion Romania Russian Federation Rwanda Saint Barthelemy Saint Helena Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania Thailand Timor Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands British Virgin Islands US Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Sark Phone Email Contact Preference Comments Send Message Springfield Area Chamber of Commerce PO Box 1687 Springfield, MO 65801 (417) 862-5567 info@springfieldchamber.com Powered By GrowthZone © 2025 Springfield Area Chamber of Commerce | Site by GrowthZone Get In Touch! (417) 862-5567 202 S. John Q Hammons Parkway Springfield, MO 65806 info@springfieldchamber.com Additional Resources FAQ Privacy policy Stay Connected! © Springfield Area Chamber of Commerce. All Rights Reserved. Scroll To Top"
    },
    {
      "url": "https://titusville.org/your-chamber/staff-members",
      "text": "Staff Members - Titusville FL Chamber of Commerce (321) 348-4748 (321) 348-4748 Your Chamber Member Benefits / Join Board of Directors Staff Members Titusville Area Chamber of Commerce Committees Affinity Partners / Discounts Celebrating 100 Years Visiting Here Adventure Videos Adventure Photos Adventure Maps Ideas & Itineraries Our Welcome Center Explore Our Trails About Launch From Here Share Your Adventure Stay Play Shop Dine Space Nature Our Community Excels A Florida Trail Town RIDE IT DOWN 2025 Brevard’s Scorecard Visit Our Store Show Some Local Love Our Directory Events Chamber Events Community Events Submit an Event News Stories and Adventures Chamber Updates Regional News Contact Us = --Select a page-- Your Chamber Visiting Here Our Community Our Directory Events News Contact Us --Select a Subpage-- Member Benefits / Join Titusville Area Chamber of Commerce Committees Get Involved: Events Our Directory Join Chamber Events Chamber Updates Board of Directors Staff Members LAUNCH YOUR BUSINESS Staff Members Left to Right: Ashley DiBacco, Sierra Howard, Erin Akins, Amanda Bates, Jeanie Hensler. Chamber Staff President Erin Akins VP of Operations Amanda Bates Director of Member Services Ashley DiBacco Director of Events Azeta Reichle Administrative Assistant Jeanie Hensler Copyright © 2025 Titusville Area Chamber of Commerce. All rights reserved. Phone: (321) 348-4748 | Email | Sitemap Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Member Login Back to Top"
    },
    {
      "url": "https://titusville.org/visiting-here",
      "text": "Visiting Here - Titusville FL Chamber of Commerce (321) 348-4748 (321) 348-4748 Your Chamber Member Benefits / Join Board of Directors Staff Members Titusville Area Chamber of Commerce Committees Affinity Partners / Discounts Celebrating 100 Years Visiting Here Adventure Videos Adventure Photos Adventure Maps Ideas & Itineraries Our Welcome Center Explore Our Trails About Launch From Here Share Your Adventure Stay Play Shop Dine Space Nature Our Community Excels A Florida Trail Town RIDE IT DOWN 2025 Brevard’s Scorecard Visit Our Store Show Some Local Love Our Directory Events Chamber Events Community Events Submit an Event News Stories and Adventures Chamber Updates Regional News Contact Us = --Select a page-- Your Chamber Visiting Here Our Community Our Directory Events News Contact Us --Select a Subpage-- Stay Play Shop Dine Space Nature Launch From Here Share Your Adventure Visiting Here You have arrived. Get a headstart on the fun right here: There are such riches in Titusville it’s a challenge to tell everything you need to know to fully explore and have the great adventures we wish for you. But this video is a great place to start. HEADING TO THE BEACH? Playalinda Beach Stops. Stops 1-10 are open. Stops 2, 3, 8 & 10 are wheelchair accessible. Playalinda Beach is often named as one of the most natural and beautiful beaches on the East Coast, miles of shoreline for walking, fishing, and enjoying the lapping waves. This is part of Canaveral National Seashore and there is a small fee to enter. Some areas may be closed for repair. Always check before you go. For the latest updates, go to nps.gov/cana or call 386-428-3384. Three Days of AMAZEMENT Invent your own fun using the tips we provide here. Explore our space history and future at Kennedy Center Visitors Complex. Get outside and experience the incredible beauty–in every direction. Discover outdoor recreation opportunities that surround you. Just 24 hours? Go here. Download 3-Day Itinerary here. Need a QUICK PEEK around? See Video Views here. natural  landscapes waterside fun and dining incredible wildlife hidden gems photographers love (Warning: These videos will make you fall in love with our town.) Here for a ROCKET LAUNCH? Get our EPIC LAUNCH VIEWING Map . Or…Pick one up at the WELCOME CENTER. To track launches, and stay informed, go to: visitspacecoast.com/launches ACCOMMODATIONS? Oh, My! Explore more. You will discover so many options, including: 1500+ Hotel & Motel Rooms locally 950 RV Sites & Camp Sites Discover great adventures—from viewing an epic rocket launch to watching dolphins play, hiking, cycling, kayaking under the stars, dining on fresh-caught seafood  and exploring the beauty that surrounds you on all sides. Explore Our TRAILS Did you know that three major cycling trails converge here ? Coast to Coast Trail St Johns River-to-Sea Loop East Coast Greenway And Titusville is an official Florida Trail Town. Learn more about trail towns here. You’ll be Surprised Visit these special places. Warbird Air Museum –memorabilia, both military and civilian, WWII air craft, awesome events American Space Museum (and Space Walk of Fame) –knowlegeable docents, amazing collection Harry T. & Harriett V. Moore Cultural Center (and replica Moore homestead) — early civil rights activists killed when their home was bombed on Christmas Eve 1951 White Sands Buddhist Center (largest white granite statutes in Florida, magnificent!) American Police Hall of Fame (and indoor shooting range) Explore Historic Titusville So much history.  Much of it can be reached by simply walking. Wander through Historic Titusville, with the Historic Titusville interactive guide from the City of Titusville and the Titusville Historic Preservation Board.  Extensive and fascinating historical information in easy to use options. The mobile app can be accessed on Apple App Store and Google Play: search for Explore Historic Titusville FL. More Stories & Adventures Capturing authentic opportunities for you. Get more deeply in touch with where to explore by reading all the Stories & Adventures. To get every Story & Adventure published emailed to  you, use this button to sign up: Great adventures #LaunchFromHere Launch From Here describes a place known around the world for space exploration and rich in nature-based recreation –perfect for outdoor adventures nearly every day of the year. Launch From Here is a proud phrase, representing our exploration legacy and holds promise for a future rich in possibility for those who join us here. Launch From Here represents all the things we launch –from rocket ships to cycle races, to business ventures and careers, to families and their dreams. The Launch From Here campaign is a community based effort– by the Titusville Area Chamber Visitors Council with support from the Space Coast Office of Tourism and the City of Titusville—created by people who love to live here for the people who will love to visit here, live here, grow here, stay here. Still have questions? We can help.  Contact the Titusville Area Chamber of Commerce at 321-267-3036. Or visit the TITUSVILLE WELCOME CENTER. Copyright © 2025 Titusville Area Chamber of Commerce. All rights reserved. Phone: (321) 348-4748 | Email | Sitemap Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Member Login Back to Top"
    },
    {
      "url": "https://titusville.org/category/news/page/5",
      "text": "Regional News Archives - Page 5 of 37 - Titusville FL Chamber of Commerce (321) 348-4748 (321) 348-4748 Your Chamber Member Benefits / Join Board of Directors Staff Members Titusville Area Chamber of Commerce Committees Affinity Partners / Discounts Celebrating 100 Years Visiting Here Adventure Videos Adventure Photos Adventure Maps Ideas & Itineraries Our Welcome Center Explore Our Trails About Launch From Here Share Your Adventure Stay Play Shop Dine Space Nature Our Community Excels A Florida Trail Town RIDE IT DOWN 2025 Brevard’s Scorecard Visit Our Store Show Some Local Love Our Directory Events Chamber Events Community Events Submit an Event News Stories and Adventures Chamber Updates Regional News Contact Us = --Select a page-- Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Regional News Hundreds of Local Space Launches – It’s In the Stars Posted on January 18, 2023. Categorized under: Space Exploration January 18, 2023 – Historically, a new launch vehicle was introduced every ten or twenty years, but with several companies bringing new gear online, the outlook is for several new systems and hundreds of launches in the next few years. Relativity Space will be introducing the Terran 1 series of expendable rockets. Most of the... [Continue Reading] Group to Speak on Helping the Lagoon Posted on January 4, 2023. Categorized under: Regional News January 4, 2023 - The Brevard Indian River Lagoon Coalition will give a free presentation on how septic and sewer systems impact the lagoon from 6 to 8 pm at the Titusville High School Performing Art Center on January 19, 2023. Register for Free: https://www.eventbrite.com/e/lagoon-straight-talk-titusville-tickets-474326000837 Website: https://helpthelagoon.org/ Agenda: 5:30-6:00 Tabling Exhibits 6:00-7:00 Presentations 7:00-8:00 Question... [Continue Reading] Playalinda Beach to Open Jan. 3rd with Limited Access Posted on January 2, 2023. Categorized under: Regional News January 2, 2023 -On January 3rd, Playalinda Beach, Canaveral National Seashore will reopen to the public, with limited parking and beach access. The beach and dune resources were severely impacted by hurricanes Ian and Nicole and have been closed since mid-November. The clean-up and restoration processes are ongoing and there is more than half of... [Continue Reading] SLS, Powered by Boeing, A Look Back at November Launch Posted on January 2, 2023. Categorized under: Space Exploration January 2, 2023 - The space industry continues to dazzle with impressive achievements. Returning humans to the Moon has to rank at the very top of this list. Titusville serves as the headquarters location for Boeing's Space and Launch Division, and the aerospace leader has a major role in this endeavor. The following is a... [Continue Reading] Artemis Returning to Earth Posted on December 6, 2022. Categorized under: Space Exploration Orion captured imagery of the Earth and Moon together from its distant lunar orbit, including this image on Nov. 28, 2022, taken from camera on one of the spacecraft’s solar array wings.Image Credit: NASA December 6, 2022 – The Artemis mission has scored some major achievements during the trip around the moon and the spacecraft... [Continue Reading] KSC Visitor Complex A Great Spot to Spot Launches Posted on November 7, 2022. Categorized under: Space Exploration November 7, 2022 – There are many places around Titusville to catch a space vehicle leave a firey trail as it ascends upward, and you can check them out with this handy EPIC Launch Views map. Also, if you plan accordingly, you may be able to schedule a visit to Kennedy Space Center Visitor Complex… [Continue Reading] NASA Announces Crewed Flight Updates for ISS Posted on November 4, 2022. Categorized under: Space Exploration November 4, 2022 - For space buffs, it's hard to beat Titusville. You can literally see the Vehicle Assembly Building looming in the distance and many people can watch launches from their backyard. It's not called the Space Coast for nothing.  Some of the most exciting missions involve brave crews blasting off for a visit... [Continue Reading] A Launch Too Big for One Booster Posted on October 28, 2022. Categorized under: Space Exploration Falcon Heavy. Image Credit: NASA October 28, 2022 - The last time a Falcon Heavy launched from here was more than 3 years ago, so you may want to catch the mission scheduled to fly on November 1. Check out the maps to find the best viewing when this rocket blasts off from Launch Complex... [Continue Reading] Artemis Night Launch Should Be Spectacular Posted on October 26, 2022. Categorized under: Space Exploration October 26, 2022 - If there is one thing we know on the Space Coast, it's this: rocket launches are not easy.  The Artemis I mission is even more complex than most, with the uncrewed Orion spacecraft set to do a test run around the Moon and back. The new launch window on Nov. 14... [Continue Reading] World Space Week Expo at KSC Visitors Center Posted on October 4, 2022. Categorized under: Space Exploration The Space Shuttle Atlantis is on spectacular display at nearby Kennedy Space Center Visitor Center. October 4, 2022 - Rub elbows with some VIPs from the Space Industry at KSC. On Oct 10 at 9 a.m. join Kennedy Space Center Visitor Complex in participating in this year's World Space Week, which is celebrating \"space and... [Continue Reading] Page 5 of 37 ‹ Previous 1 2 3 4 5 6 7 8 9 Next › Last » News Categories Chamber Updates Regional News Stories and Adventures Copyright © 2025 Titusville Area Chamber of Commerce. All rights reserved. Phone: (321) 348-4748 | Email | Sitemap Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Member Login Back to Top"
    },
    {
      "url": "https://titusville.org/onthemove",
      "text": "Our Community Excels - Titusville FL Chamber of Commerce (321) 348-4748 (321) 348-4748 Your Chamber Member Benefits / Join Board of Directors Staff Members Titusville Area Chamber of Commerce Committees Affinity Partners / Discounts Celebrating 100 Years Visiting Here Adventure Videos Adventure Photos Adventure Maps Ideas & Itineraries Our Welcome Center Explore Our Trails About Launch From Here Share Your Adventure Stay Play Shop Dine Space Nature Our Community Excels A Florida Trail Town RIDE IT DOWN 2025 Brevard’s Scorecard Visit Our Store Show Some Local Love Our Directory Events Chamber Events Community Events Submit an Event News Stories and Adventures Chamber Updates Regional News Contact Us = --Select a page-- Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Our Community Excels It’s time to take a close look at Titusville and North Brevard. Significant concentrated advanced manufacturing growth and continued business evolution and innovation in space and aerospace are driving positive outlooks long term for this area, with local, regional and global impacts. LAUNCH FROM HERE or expand to launch something bigger from here. Our partners in economic development are listed on this page . Take advantage of their expertise. Be part of the 21st Century Titusville climb to new heights. North Brevard is at the leading edge of Brevard County’s technology foundation , and it’s steeped in history.  READ ON…learn about our rich history, our 50+ years of space innovation, our abundant nature, and who lives here–our people. Great adventures- -and wonderful life stories–launch from here. ASK THE EXPERTS ABOUT: Site Selection Assistance— current market availability and comparative analysis of real estate Financial Assistance— information on state and local incentives, grants and other support applicable to benefit new projects Customized Data Services — proprietary market research including labor market, utility, transportation and tax costs Talent Pipeline — assistance in connecting you to talent recruitment experts Employee Training —technical training programs and custom training for relocating employees from our educational institutions and in partnership with government entities If you are interested in more information about our economy or if we can connect you to some of our regional economic development partners, we are happy to help.  Contact Erin Akins ( akins@titusville.org ) so we can learn a little more about your goals and help you make the most beneficial connections. PARTNERING FOR OUR FUTURE EDC of FLORIDA’s SPACE COAST The Economic Development Commission of Florida’s Space Coast is a nationally-respected county-wide EDO partnering with the Brevard County Commission and the Space Coast business community. This EDC has been successful in attracting new business investment and expanding existing industry on the Space Coast, supporting efforts of Space Coast military installations, and assisting manufacturing and high tech companies. Contact Trudy McCarthy, MEDP, Executive Vice President TMcCarthy@SpaceCoastEDC.org.  or Tell Us About Your Project THE NORTH BREVARD ECONOMIC DEVELOPMENT ZONE The Zone (North Brevard Economic Development Zone) is a independent district under Florida law that seeks to provide financial and technical assistance to qualified firms considering a relocation or expansion in the northern part of Brevard County, Florida. Learn about the leadership of The Zone or contact Troy Post, CEcD, Executive Director, at 321-264-6750, or at troy.post@brevardcounty.us . CITY OF TITUSVILLE The City of Titusville, under the leadership of City Manager, Scott Larese, has a significant strategic plan (https://www.titusville.com/329/Strategic-Plan) and more recent market studies of value and can provide assistance with incentives, site selection, the permitting process and coordination with partnering agencies. Contact Nicolas Gow, Economic Development Director: 321-567-3774 Email Nicholas Gow Go here for the latest edition of Talking Points. BREVARD COUNTY Brevard County is composed of 5 districts. North Brevard is in District 1. District 1 contains the towns of Cocoa, Scottsmoor, Mims, Titusville, Port St. John, Canaveral Groves and Sharpes and its footprint includes notably Kennedy Space Center, the Merritt Island National Wildlife Refuge and the Indian River Lagoon.   Contact District 1 Commissioner, Rita Pritchett at (321) 607-6901. District 1 offices are located at: 7101 South U.S.1. TOMORROW LAUNCES HERE Help Us Write the Story of Tomorrow on Florida’s Space Coast. Florida’s most innovative community is also its most inviting. This unified brand was developed by the community though extensive research and community conversations– and is for the community—highlighting  the unique opportunities found here.  Be part of something out of this world.  Learn more at https://flspacecoast.org SPACE FLORIDA Space Florida is an independent special district of the state. Similar to an airport or seaport authority, it’s capable of earning profit, borrowing money and partnering with commercial business, as well as federal, state and local governments. This makes Space Florida very flexible when it comes to acting as an industry partner or an agent of economic development.   Contact Matt Chesnut, Director of Business & Economic Development:  321-730-5301 Ext: 256 mchesnut@spaceflorida.gov CAREERSOURCE BREVARD CareerSource Brevard is part of a statewide network of 24 regions, known as CareerSource Florida, administers The Workforce Innovation and Opportunity Act (WIOA), grants and employment/employer support activities, including job recruitment, retention and training, and a Board of Directors with more than 40% representing private industry. FTZ ZONE 136 FTZ ZONE 136 Learn about Canaveral Port Authority and how to operate in FTZ#136. Find out here . Copyright © 2025 Titusville Area Chamber of Commerce. All rights reserved. Phone: (321) 348-4748 | Email | Sitemap Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Member Login Back to Top"
    },
    {
      "url": "https://nbbd.com/chamber/press.html",
      "text": "Titusville Area Chamber of Commerce – Press Releases CONNECT CONTACT NBBD Home Page WEATHER Go & Do Sports Cultural History & Museums Space Nature & Outdoors Non-Profits Houses of Worship Government Education Interactive Site Map Disabilities Services CONTACT BUSINESSES Businesses Directory Restaurants Real Estate EVENTS LISTING Festivals Facebook Downtown Titusville Parks & Recreation Parks Activities Community Center Calendars Wildlife Refuge National Seashore Enchanted Forest Sams House PRESS RELEASES Brevard County City of Titusville Downtown Titusville NASA NASA PR SpaceX PR ULA PR Blue Origin PR Launch Viewing Parrish Medical OUTDOORS National Wildlife Refuge National Seashore Refuge/Seashore MAP Sanctuaries Enchanted Forest Sams House Sanctuaries MAP Ecotourism Photography Space Coast Outdoors Birding Paddling Hiking Biking PARKS Calendars North Area Parks Scottsmoor & Mims Titusville Area Port St. John & Canaveral Groves Disabilities LIBRARIES Mims / Scottsmoor Titusville Port St. John Brevard County Genealogy SOFT ADVENTURES Playgrounds Downtown Titusville Museums & History Refuge & Seashore South Titusville Fishing & more POPULAR North Brevard History Windover Bog People Gopher tortoise Warbird Airshow Edible Plants Black Point Drive Fort Christmas Manatee Hammock Campground Wildlife Festivals Wildlife Rehabilitators St. Johns River Fishing Pier Parrish Medical Sea Turtle Festival N.B. Heritage Foundation ????? Menu with CSS3 Css3Menu.com Titusville Area Chamber of Commerce 2000 South Washington Ave., Titusville Florida 32780 321-267-3036 FAX: 321-264-0127 Office Hours: Mon.-Fri. — 9:00am-5:00pm PRESS RELEASES Click here – to view Titusville, Mims, Scottsmoor, Port. St. John Events. Click here to view the Chamber Community Calendar. Click here to view the Chamber Calendar of Events. North Brevard Events - Click here North Brevard is ready to \"reboot\" responsibly. New Opportunities • New Rules • New Normal City • EDZ • Chamber We are ready to work together to reopen safely, effectively and sustainably for everyone in our community. To help you \"reboot\" your business, we curated this toolbox to offer some of the best advice, direction, guidance and practices in one place. CLICK here for details on the City of Titusville \"reboot\" website. The Titusville Welcome Center The Titusville Welcome Center is located at 419 South Hopkins Avenue in Titusville. Inside the Welcome Center, they provide information about the Titusville Area and events to visitors and bicycle trail users. In the other part of the building, Coast to Coast Bicycle Company will provide rentals, repairs, sales of bicycles and equipment, while also providing group rides and trail events to the community. CLICK HERE FOR MORE INFORMATION About the Titusville Area Chamber of Commerce The Titusville Area Chamber of Commerce was founded by volunteers in 1924. The Chamber is a non-profit organization that is funded through membership dues paid by local businesses and various fundraising projects. The primary focus of the Chamber is directed towards helping its members. Our mission is to develop, enhance and maintain a strong and diverse business climate and support a prosperous community. advertising opportunities Relocation Packet Reach potential new residents with our Relocation Packet. This packet of valuable information is mailed to people outside the Titusville area who have shown an interest in relocating to the area. The relocation packet is provided FREE upon request and includes IMAGES of Titusville (the chamber's directory of members), a city map and promotional marketing material from area businesses. Last year approximately 1,000 relocation packets were mailed to potential new residents. Some of the requested information includes: Homes Apartments Jobs Schools Entertainment Insurance Moving Companies Storage Facilities Medical Care Banks Investment (2006): $120.00 per year (year contract can start at anytime) Contact: Carol Wilson at Titusville Area Chamber of Commerce at 321-267-3036 Requirements: 100 copies (per month) of the marketing piece you wish to include. Flyer must not exceed 8.5\" x 11\". Call for specific details. ADVERTISE IN CHAMBER NEWSLETTER Would you like to advertise your company in the Titusville Chamber's Newsletter free of charge? Run a 40–50 word news brief in the Business Briefs section free of charge. Or perhaps you'd like to run a full color ad? We are now offering color ads to chamber members for a fee, either monthly or you can purchase a six month commitment. Please contact the Chamber for more information on pricing and ad sizes. GIVE US YOUR GOOD NEWS The Titusville Area Chamber of Commerce wants to help promote your business and its achievements. As a free service to its members, the Chamber will include 40–50–word news brief about your business in our ConTACt Newsletter. New employees, grand openings, business anniversaries, new product lines, new services, achievements, and awards are all suitable material to appear in our business briefs section in the newsletter. ConTACt reaches over 1,000 business owners and the general public. This service is only open to Chamber Members. Deadline for submission is the 10th of the month to be included in next month's newsletter. For example, if you submit a brief to us on December 10, the information will then appear in the January newsletter. All submissions are subject to editing and space availability. Please provide us with a press release or simply hand–write your information ON THIS FORM . For questions please call 267-3036 or email at newsletter@titusville.org August 16, 2005 Click for enlargement. Contact: Tracey Giemza 321–267–3036 – Giemza@titusville.org Titusville Area Chamber of Commerce seeks Volunteers Titusville, Fla – The Titusville Area Chamber of Commerce is a non–profit organization that promotes and engages in activities that improve individual business, develop a stronger local economy and create a prosperous community. The Titusville Area Chamber of Commerce was founded by volunteers in 1924, and is in need of volunteers to help assist the chamber staff of 6. Volunteers at the Titusville Chamber of Commerce help staff the busy office in involved in many community activities, helping local businesses, residents and tourists. The needed volunteers will do a variety of tasks, such as: answering phones, helping walk–in clients, and filing. There is no time minimum or maximum. If you enjoy working with the public and meeting new people, the Titusville Chamber is right for you. One need not have experience, as the Chamber will train. The Chamber is a non–profit organization that is funded through membership dues paid by local businesses, and various fundraising projects."
    },
    {
      "url": "https://members.titusville.org/Visiting/Contact_Us.aspx",
      "text": "Contact Us - Titusville Area Chamber of Commerce | Titusville, FL Visiting Play Stay Dine Shop Events Maps Photos / Video Coupons Publications Contact Us Live & Work Facts & Figures Quality of Life Health Care Employment Education Housing Local Officials Map Photos / Video Coupons Publications Contact Us Our Economy Facts & Figures Industry Clusters Economic Development Business Retention & Expansion International Business Business Directory Local Events Community Calendar Chamber Calendar Submit an Event About the Chamber Welcome to Titusville Membership Benefits Committees Marketing & Advertising Opportunities New and Renewed Members Chamber Calendar Publications News Board of Directors Staff Members Contact Us Launch From Here Members There is no content for this ContentID. Contact Us Home > Visiting > Contact Us There is no content for this ContentID. Request Information Comment * Required Please enter a valid number Please enter a valid date Please enter valid credit card information Your Contact Information Email Address * Required Please enter a valid number Please enter a valid date Please enter valid credit card information Phone Number * Required Please enter a valid number Please enter a valid date Please enter valid credit card information First Name * Required Please enter a valid number Please enter a valid date Please enter valid credit card information Last Name * Required Please enter a valid number Please enter a valid date Please enter valid credit card information Business Name Required Please enter a valid number Please enter a valid date Please enter valid credit card information Please click submit only one time.  The transaction may take several seconds. Quick Links Play Stay Dine Shop Events Maps Photos / Video Coupons Publications Contact Us Copyright © 2011  Titusville Area Chamber of Commerce.  All rights reserved. 2000 South Washington Avenue | Titusville, FL 32780-4747 Phone: (321) 267-3036 | Fax: (321) 264-0127 | Email Chamber Management Software Please pass a valid ContentID."
    },
    {
      "url": "https://titusville.org/your-chamber/membership-benefits",
      "text": "Member Benefits / Join - Titusville FL Chamber of Commerce (321) 348-4748 (321) 348-4748 Your Chamber Member Benefits / Join Board of Directors Staff Members Titusville Area Chamber of Commerce Committees Affinity Partners / Discounts Celebrating 100 Years Visiting Here Adventure Videos Adventure Photos Adventure Maps Ideas & Itineraries Our Welcome Center Explore Our Trails About Launch From Here Share Your Adventure Stay Play Shop Dine Space Nature Our Community Excels A Florida Trail Town RIDE IT DOWN 2025 Brevard’s Scorecard Visit Our Store Show Some Local Love Our Directory Events Chamber Events Community Events Submit an Event News Stories and Adventures Chamber Updates Regional News Contact Us = --Select a page-- Your Chamber Visiting Here Our Community Our Directory Events News Contact Us --Select a Subpage-- Member Benefits / Join Titusville Area Chamber of Commerce Committees Get Involved: Events Our Directory Join Chamber Events Chamber Updates Board of Directors Staff Members LAUNCH YOUR BUSINESS Member Benefits / Join Join the Chamber and GROW your business The Titusville Area Chamber of Commerce is a central connector in the North Brevard community, and a vast resource of benefits for local business .  Membership gives you access to educational opportunities, networking , marketing and promotion , discounts and more ! 1. A Strong Economy A positive business environment doesn’t just happen.  It is the result of business and community leaders coming together to improve this place we call home. 2. Business Advocacy Your business is affected by decisions made at the local, state and federal levels.  The Chamber helps ensure elected officials consider issues important to business. 3. Get Connected The greatest power of a Chamber is in helping businesses make connections – whether it be with other businesses or potential customers. MEMBERSHIP LEVELS The Titusville Chamber offers a tiered-dues approach to member investment, based on the level of involvement you want to have in YOUR chamber. BASE MEMBERSHIP Base membership in the chamber offers a wide range of benefits, including: New Member Coupons, valued at over $1000 Networking Opportunities at over 70 events a year The opportunity to make a difference at over 40 committee meetings a year Display space for business cards or brochures in our lobby Profile listing on the Chamber’s website directory, including the ability to map and get directions Secure online e-mail system (protecting your info while still allowing customers to reach you) Link to your web page and social media pages Opportunity to submit coupons for member to member and consumer discounts Ribbon Cuttings and Grand Opening support 50-word business brief monthly in our monthly newsletter Subscription to monthly newsletter about community information and events Referrals-phone, website and Chamber/Welcome Center walk-ins Use of Chamber logo in advertising & promotion Press Release Distribution Access to Broadcast E-mail Service Base rates vary depending on the type of membership. $350 – Business $265 – Home Based Business $150-$350 – Non-Profit Organization (varies based on number of full-time employees) $150- Individual We also have discounts for multiple businesses with a single owner.  Contact us for more information on that opportunity! Package 1 - $525 Package 1 offers all of the benefits of base membership, PLUS the following: Enhanced Profile Listing in Website Directory Listing Highlighted Products & Services Added 1 complimentary Broadcast Email 2 tickets to a Chamber luncheon Package 2 - $775 Package 2 offers all of the benefits of base membership and Package 1, PLUS the following: Listing Size Increased Logo Included in Listing An additional Broadcast Email (total 2) 2 additional tickets to a Chamber luncheon (total 4) Table at our annual Taste of Titusville 2 tickets to Taste of Titusville INVESTOR LEVEL BENEFITS We offer a special category of investment for those companies that seek to align themselves with an organization that is proven to deliver action and results.  These premium level memberships are for champions that support the work of the Titusville Area Chamber of Commerce and want to help insure our continued capacity to deliver results. Trustee - $2500 In addition to all of the benefits listed in our enhanced packages, trustees are recognized as an integral partner in our programs.  As such, they receive the following additional benefits: Priority listing in online directory (rises to the top for applicable searches) Ability to add photos and videos to directory listing Pre-registration for one at every monthly Chamber luncheon Trustee recognition on website homepage and in weekly e-mail communications One complimentary luncheon sponsorship 4 tickets to our annual Board Installation event 2 players and a greenside banner at our annual Networking on the Green Golf Tournament 4 broadcast e-mails each year Inclusion in our Relocation Packages Our investors also receive Concierge Support to insure they are taking full advantage of their membership benefits.  Chamber staff will make personal check-ins at least quarterly to insure we are exceeding your expectations. Chairman's Circle - $5000 This is the premium partner position at the Titusville Area Chamber of Commerce, and as such receives recognition and inclusion in all of our programs. In addition to the benefits listed in the enhancement packages, they receive the following: Priority placement (top of page) in online directory Ability to add photos and videos to directory listing Chairman Circle recognition on website homepage and in weekly e-mail communications Rotating banner ad on website homepage Pre-registration for two at every monthly Chamber luncheon One complimentary luncheon sponsorship 8 tickets to our annual Board Installation event Logo inclusion on all major events Corporate foursome and a greenside banner at our annual Networking on the Green Golf Tournament 8 broadcast e-mails each year Inclusion in our Relocation Packages Our investors also receive Concierge Support to insure they are taking full advantage of their membership benefits.  Chamber staff will make personal check-ins at least quarterly to insure we are exceeding your expectations. THE BOTTOM LINE You can’t afford to NOT be a member of the Titusville Area Chamber of Commerce. As a member, you not only reap the tangible benefits of your investment, but you are also contributing to the economic success of your entire community. We enable our members to accomplish collectively what no one of us could do individually. JOIN BELOW. JOIN TODAY: Join as a Business... Please use this form to join the Titusville Area Chamber of Commerce as a business. This includes our base membership level, enhanced investment options, and investor level partnerships. BUSINESS JOIN FORM Join as a Home-Based Business... Please use this form to join the Titusville Area Chamber of Commerce as a Home-Based Business. Your address will be used for internal communications, but will not be displayed on your directory listing. HOME-BASED JOIN FORM Join as a Non-Profit Organization... Please use this form to join the Titusville Area Chamber of Commerce as a Non-Profit Organization. Your primary category listing will be as a Non-Profit Organization and you can select one additional category to list your business under. NON-PROFIT JOIN FORM Join as an Individual... Please use this form to join the Titusville Area Chamber of Commerce as an Individual. You will be listed under our Individual category on our directory. This is an ideal option for political candidates, public figures, and anyone interested in supporting the Chamber that does not need to utilize the full business benefits and multiple listings in the directory. INDIVIDUAL JOIN FORM Join under an existing member... This unique membership level is primarily for businesses that are adding additional locations, a second business, or are otherwise associated with an existing member. Please submit your information through this form and a member of the team will get back with you to verify your affiliation and process your membership. REQUEST MORE INFORMATION CONSIDER THESE THREE ADDITIONAL THOUGHTS: 1. Your business community working together can affect your future. 2. You can make a further impact by working within a smaller focused group (education committee, area visitors council, governmental affairs). 3. The stronger your Chamber, the more valuable your membership in it . Member Testimonials \"The Titusville Chamber of Commerce has always gone above and beyond to help us. We are so fortunate to have such a committed group of people supporting our community. Boater's Edge salutes you!\" Neisha Haggard Administrator, Boater's Edge \"The Titusville Chamber has been an essential resource for me as I joined the community. If you are in North Brevard and not utilizing the chamber for the resource it can be, then you are missing out. Matthew Morak Director, Jess Parrish Medical Foundation \"AT&T has partnered with the Titusville Area Chamber of Commerce for many years. This Chamber excels at the integration of Business, Government, and Community and brings great value to all three.\" Dan Pollock Regional Director, External & Legislative Affairs, AT&T \"I love working with the Titusville Area Chamber of Commerce! Their events are always exciting and informative and provide opportunities for networking. If you are a new business in the Titusville Area, join the Chamber, it is worth it!\" Alexis Quiros Director of Sales, Extended Stay America Titusville KSC \"The Titusville Area Chamber of Commerce provides a knowledgeable and excellent partnership in North Brevard.  Through their dedication to regional trails and transportation, we have been able to advance a robust trail network and continue to make advancements in multi-modal transportation.\" Sarah Kraum Senior Transportation Planner, Space Coast Transportation Planning Organization \"I love my relationship with the Titusville Chamber of Commerce. They have also made it a point to learn more about me and my business and the goals that I have for growing my business.  I would highly recommend a Chamber membership to anyone who would like to ask. \" Tracy Stroderd Everything Brevard \"The Titusville Area Chamber of Commerce really exemplifies how a chamber should be. It is a wonderful experience and great opportunity to build relationships with other business professionals while promoting your business.\" Steve Johnson Executive Vice President, Savings Safari \"In 2021 we made the decision to join the Titusville Chamber in hopes of finally growing the network into Port St. John and Titusville…  And, what a great decision it has been! They have opened doors and helped make introductions to business owners and decision makers that we could not have opened on our own.    Love the Ville isn’t just a slogan… they mean it. And, the Ville loves them back!\" Mike Snyder Launch Network DMS \"The Outstanding Young Adult program that recognizes exceptional students in the local high schools has made such a huge impact on our students. The Chamber has been recognizing and providing scholarships for these local students for over 30 years. They are always there for their business partners, local schools and anyone in need!\" Kerri Weeks Space Coast Jr/Sr High School \"We have had many opportunities to work with the chamber over the years and they not only give small businesses a voice in government but also help connect members with the community.  It’s not just about building businesses. it’s also about building relationships and giving back to the community.\" Julie Dimmig Marketing Business Relationship Manager, Community Credit Union Florida \"Being a member of the Titusville Chamber of Commerce has helped grow my business as well as help other small business owners. The tools and resources they have for members are worth every dollar spent on membership. I have gained new clients through my affiliation with the chamber and look forward to growing my business because of my membership.\" Sharon Bowen Wise Owl Grant Services \"For over 20 years, the Titusville Chamber has have been my go-to source for current information, materials, and advice about the North Brevard market. The Chamber has made my job easier and helped me to be more effective in my work for the Space Coast!\" Tom Bartosek Space Coast office of Tourism Copyright © 2025 Titusville Area Chamber of Commerce. All rights reserved. Phone: (321) 348-4748 | Email | Sitemap Your Chamber Visiting Here Our Community Our Directory Events News Contact Us Member Login Back to Top"
    }
  ]
}