{
  "fuentes": [
    {
      "url": "https://www.pba.edu/academics/schools/centers-of-excellence/titus-franchising/board/",
      "email": "titus_center@pba.edu"
    },
    {
      "url": "https://titussteel.com/contact-us/",
      "email": "sales@titussteel.com"
    },
    {
      "url": "https://www.321area.com/florida/titusville/shopping/titus-landing.htm",
      "email": "info@agdevgroup.com"
    },
    {
      "url": "https://www.foundationsforfreedom.net/References/NT/Pauline/Titus/Titus_Introduction.html",
      "email": "info@foundationsforfreedom.net"
    },
    {
      "url": "https://tituslanding.com/contact/",
      "email": "bmcadams@skywayflorida.com"
    },
    {
      "url": "https://tituslanding.com/contact/",
      "email": "cmusselman@exxcel.com"
    },
    {
      "url": "https://tituslanding.com/contact/",
      "email": "mcremens@exxcel.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "josedimas@imcolumber.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "santiago@imcolumber.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "sean@rokhardware.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "bkoch@richelieu.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "bsmallwood@hardwareimagination-tech.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "cesilia@imcolumber.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "customerservice@nbhco.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "customerservice@ebbradley.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "customerservice@wurthbaersupply.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "customerservice@wurthwoodgroup.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "dcook@mansply.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "erik@dakotahardwoods.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "gary@dakotahardwoods.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "jimerickson@aetnaplywood.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "joel@dakotahardwoods.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "klutke@mansply.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "kniemeyer@hdlusa.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "ktheis@rockler.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "lisah@woodworker.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "mgroves@advancedhardwaresupply.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "mike@tjhardware.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "mikec@charlesmcmurray.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "mountainsales@wurth.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "orders@macmurraypacific.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "pacificsales@wurth.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "ron@usifaz.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "roseh@hghhardware.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "ruben@imcolumber.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "scottlipp@aetnaplywood.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "smarcus@richelieu.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "southernsales@wurth.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "tims@hghhardware.com"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "email": "usa@titusplus.com"
    },
    {
      "url": "https://www.titustalent.com/contact-us/",
      "email": "info@titustalent.com"
    },
    {
      "url": "https://www.titusbuilt.com/contact",
      "email": "info@titusbuilt.com"
    },
    {
      "url": "https://www.linkedin.com/company/titus-transport",
      "email": "recruiting@titustrans.com"
    },
    {
      "url": "https://www.mallsinamerica.com/florida/titus-landing",
      "email": "cmusselman@exxcel.com"
    },
    {
      "url": "https://foundationsforfreedom.net/References/NT/Others/Titus/Titus0/Titus_Introduction.html",
      "email": "info@foundationsforfreedom.net"
    },
    {
      "url": "https://www.legistorm.com/person/bio/469390/Scott_D_Titus.html",
      "email": "congress@legistorm.com"
    }
  ],
  "mails": [
    "bkoch@richelieu.com",
    "bmcadams@skywayflorida.com",
    "bsmallwood@hardwareimagination-tech.com",
    "cesilia@imcolumber.com",
    "cmusselman@exxcel.com",
    "congress@legistorm.com",
    "customerservice@ebbradley.com",
    "customerservice@nbhco.com",
    "customerservice@wurthbaersupply.com",
    "customerservice@wurthwoodgroup.com",
    "dcook@mansply.com",
    "erik@dakotahardwoods.com",
    "gary@dakotahardwoods.com",
    "info@agdevgroup.com",
    "info@foundationsforfreedom.net",
    "info@titusbuilt.com",
    "info@titustalent.com",
    "jimerickson@aetnaplywood.com",
    "joel@dakotahardwoods.com",
    "josedimas@imcolumber.com",
    "klutke@mansply.com",
    "kniemeyer@hdlusa.com",
    "ktheis@rockler.com",
    "lisah@woodworker.com",
    "mcremens@exxcel.com",
    "mgroves@advancedhardwaresupply.com",
    "mike@tjhardware.com",
    "mikec@charlesmcmurray.com",
    "mountainsales@wurth.com",
    "orders@macmurraypacific.com",
    "pacificsales@wurth.com",
    "recruiting@titustrans.com",
    "ron@usifaz.com",
    "roseh@hghhardware.com",
    "ruben@imcolumber.com",
    "sales@titussteel.com",
    "santiago@imcolumber.com",
    "scottlipp@aetnaplywood.com",
    "sean@rokhardware.com",
    "smarcus@richelieu.com",
    "southernsales@wurth.com",
    "tims@hghhardware.com",
    "titus_center@pba.edu",
    "usa@titusplus.com"
  ],
  "nombre_sitio": "tituslanding.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.pba.edu/academics/schools/centers-of-excellence/titus-franchising/board/",
      "text": "Advisory Board | PBA • Palm Beach Atlantic University Palm Beach Atlantic University Toggle menu Toggle search Search Submit Academics Toggle submenu PBA Academics Overview Majors & Degrees Undergraduate Programs Graduate, Professional & Certificate Programs PBA Online Schools & Centers Tutoring Careers & Outcomes Catalogs Admissions Toggle submenu PBA Admissions Overview Undergraduate Admissions Graduate and Professional Admissions PBA Online Visit PBA Financial Aid Toggle submenu Financial Aid Overview How to Apply for Aid Types of Aid & Scholarships Tuition & Fees Policies & FAQ Info for Parents & Families Calculate Your Charges Veterans Benefits Campus Life Toggle submenu Campus Life Overview Student Stories Student Activities & Leadership Recreation & Sports Housing & Dining Campus Living Christian Community Campus Health & Safety West Palm Beach & South Florida PBA Library Athletics About PBA Toggle submenu About PBA Overview Mission, Vision & Purpose Values & Guiding Principles PBA Leadership Academic & Spiritual Growth PBA Facts & Data PBA Publications Our Locations Information for PBA Online Current Students Parents & Families Alumni Info Visit PBA Apply Give God-Sized Dreams Home » Academics » Schools & Centers » Centers of Excellence » Titus Center for Franchising » Advisory Board Titus Center Advisory Board At the Titus Center for Franchising, we are steadfast in our commitment to becoming the preeminent global leader in franchise education. Our esteemed Advisory Board members are instrumental in driving this vision forward. Below, we present an overview of our mission, expectations, and the exciting opportunities for involvement. Contact Us Menu Menu Meet Our Team Advisory Board Resources for the Franchise Community Selling Franchises Summit Learn More about John T. Hewitt Learn More about Mary Kennedy Thompson Learn More about Scott Abbott Sponsor the Summit What You'll Learn Scholarships JJ Prendamano Annual Scholarship Morrow Hill Annual Scholarship Chick-fil-A West Palm Beach Annual Scholarship FIRE35 Future Leader Annual Scholarship Don Dwyer, Sr. Endowed Scholarship Kobel Family Annual Scholarship Seiber Family Endowed Scholarship Titus Center Birdie Fund Annual Scholarship Titus Center - News Titus Center for Franchising Presents Five Scholarships to Outstanding Students Britain’s Biggest International Franchise Show Leading Through Change: Lessons on Whistling in the Dark from Mary Kennedy Thompson Shay Kleinschmidt, FranFund’s Veteran VP of Lending, Joins Titus Advisory Board The Recipe of a Successful Discovery Day: Insights from Ray Titus, CEO of United Franchise Group The Titus Center for Franchising Adds 12 New Members to its Advisory Board The Titus Center for Franchising Advisory Board Approaches 100 Member Companies Titus Center for Franchising Adds Eight companies and 12 members to its Advisory Board Titus Center for Franchising Advisory Board Adds 6 companies and 7 members Titus Center for Franchising Advisory Board Adds 8 companies and 17 members Titus Center for Franchising Student Tanica de Agrela Selected for FranServe Mini-Internship Titus Center Students Attend Franchise Springboard Titus Center for Franchising Advisory Board Adds 4 companies and 7 members Palm Beach Atlantic University’s Titus Center for Franchising Director to Present at Pet Franchise Expo Business Leader to Speak to Palm Beach Atlantic University’s Titus Center for Franchising Palm Beach Atlantic University’s Titus Center for Franchising Announces Five Scholarships Why Franchisors Need Franchise Fees Titus Center for Franchising Advisory Board Attracts Franchisor Ellen Rohr Titus Center for Franchising Advisory Board Attracts Richard Davies, QFP Titus Center for Franchising Advisory Board Attracts Brian Maciak, TBC Corp. Titus Center for Franchising Advisory Board Attracts Patrick McGee, MPK Equity Partners Business-Savvy Students Pair Up to Buy Franchise Titus Center - Contact Us Our Mission The Titus Center for Franchising is dedicated to empowering students and business professionals by teaching the transformative values of business format franchising. Our aim is to enhance lives and foster the development of socially-conscious communities worldwide through franchising. While our primary focus is on nurturing undergraduate talent, we are equally committed to providing comprehensive professional education to all stakeholders within the franchise sector. The center fosters strong industry relationships through networking, mentorship, and practical learning experiences. Titus Center proudly proclaims: Educating the Next Franchise Generation. Expectations for Advisory Board Members We deeply value the expertise and contributions of our Advisory Board members and have established clear expectations to ensure a mutually rewarding partnership: Engagement in Our Meetings Actively participate in at least one of our biannual meetings held in April and November, with dates communicated well in advance. Each member organization is invited to appoint two representatives to the Advisory Board to facilitate continuous engagement. Financial Partnership Commit to a financial contribution of $5,000 over two years, with a minimum annual donation of $2,500. Consider supporting additional sponsorship opportunities for Titus Center events. Sharing Expertise and Resources Provide valuable insights, tools, and strategies to support the Titus Center in achieving its mission. Collaborate with staff to assess current programs and develop new initiatives that address the evolving needs of the franchise community. Advocacy and Networking Champion the Titus Center within your professional circles and the broader franchise community. Assist in attracting top-tier franchise professionals to engage with the Center. Mentorship and Collaboration Mentor aspiring franchise students. Contribute to our goal of offering an impartial platform for franchise professionals to exchange ideas and insights. The Opportunity Joining our Advisory Board means becoming part of an influential network of franchise leaders committed to shaping the future of franchise education. Together, we can: Inspire and cultivate the next generation of franchise professionals. Drive innovation and excellence within the industry. Build communities that exemplify the social impact potential of franchising. We extend our heartfelt gratitude to our advisors for their invaluable contributions, which helps the Center achieve excellence in every aspect of our mission and advance franchise education globally. Membership Payment Portal: Each Advisory Board member company donates $2,500 annually to support the operations of Titus Center. This portal is the most efficient way to donate to Titus Center. Palm Beach Atlantic University is a 501(c)(3) organization. When you donate you will receive a receipt. Please note: Where the form asks if you’d like to give on behalf of an organization please check that box and type in Titus Center. You may use this portal for other donations to PBA and the Titus Center. We appreciate and rely on your contributions! Each member company can list two individual board members. For Membership Donations Upcoming Meetings Fall Advisory Board Meeting: Wednesday, Nov. 19, 2025 starting with breakfast at 7:30 a.m. The meeting will be on the PBA Campus in West Palm Beach. Networking Party: Nov. 18, 2025, 5:00 to 7:00 p.m. Location to be announced. Advisory Board events are for Advisory Board members and invited guests. PBA has arranged discounts with many of the hotels. Several are within walking distance to campus. Find a Hotel Schedule a meeting with Dr. Hayes to learn more Advisory Board The mission of the Titus Center for Franchising is to educate students and business professionals so that they can use franchising to better their lives as employees and/or business owners and ultimately to use franchising as a vehicle to create socially-conscious communities worldwide. While our primary focus is on recruiting and teaching undergraduate students, the Center is also committed to providing professional education for all members of the franchise sector. We expect our advisors to: Attend at least one of two meetings annually. Meetings occur in April and November and are announced well in advance. Each member company can list two team members on the Advisory Board. Contribute a financial gift of at least $5,000 over a two-year period. We ask our members to contribute a minimum of $2,500 annually. We also ask members to consider sponsoring events produced by the Center. Your annual contribution includes listing two members of your team on our board. Offer ideas, tools and resources to help the Titus Center fulfill its operational mission and its aspiration to become the “first choice” for franchise education internationally. Help the Titus Center staff evaluate its programs and provide expertise that will help the staff develop new programs to satisfy the expectations and needs of the franchise community. Advocate for the Center among colleagues and business and franchise communities with the goal of attracting the “best minds” in franchising to help the Center fulfill its mission, to provide an unbiased forum where franchise professionals can collaborate, to mentor students of franchising, and to invest in franchise education. ANTHONY BAMBINO 3 Natives CEO/Founder WARREN LEWIS Akerman, LLP Chair of the Franchise & Licensing Practice Group KELSEY STUART Bloomin’ Blinds CoFounder & CEO KRISTOPHER STUART Bloomin’ Blinds CoFounder & COO BUTCH MOGAVERO Boulder Designs and Border Magic President & CEO MADALINA IORDACHE Bright Pink Agency President & CEO MATTHEW CANCINO Bright Pink Agency Director of Business Development PAUL BOSLEY Business Finance Depot Owner ERIK AMICK Chick-Fil-A Franchisee ROB MORRIS Chick-Fil-A Franchisee KEVIN DUBOIS Clean Franchise Brands CEO NICK BOARIU, CFE Clothes Bin Franchise Co-Founder MARC DOUGLAS Clothes Bin Franchise Co-Founder SAM STANOVICH Craveworthy Brands SVP Franchise Leadership and Alliances COURTNEY NEWELL Crumbl Cookies CEO, Crowned Marketing & Communications JAMIL NEWELL, P.E. Crumbl Cookies CEO, Agbara Engineering ANDREA LILY, CFE Corporate Cleaning Group VP of Franchising SHAY BERMAN Digital Resource Founder & President BRICE SULLIVAN Digital Resource National Sales Manager TONI HARRIS TAYLOR Drastic Results Marketing & Sales Coaching Marketing and Sales Coach WILLIAM EDWARDS Edwards Global Services, Inc. Chief Executive Officer ROBERT JONES Edwards Global Services, Inc. Chief International Officer JASON KILLOUGH, MBA, CFE The Entrepreneur Authority Franchise Consultant MATT PUSEY ERAGroup ERA Group North America Chief Operating Officer CHARLIE SMITH Expense Reduction Analysts – North America Chief Executive Officer TREVOR RAPPLEYE FranchiseFilming CEO & Storyteller ANTHONY CHERKASSKIY Fintech Accountants & Advisors Marketing Specialist NATALYA HUMMER, CPA Fintech Accountants & Advisors Principal MATT RITTER Fish Consulting, LLC Co-Manager Director LANE FISHER Fisher Zucker, LLC Partner ZACK FISHMAN Fishman PR & Franchise Elevator PR Chief Growth Officer BRAD FISHMAN Fishman PR & Franchise Elevator PR Co-CEO TARIQ JOHNSON Franchise Empire Founder and CEO CAREY GILLE Franchise FastLane CEO and Co-Founder DON TARINELLI Franchise FastLane Executive Vice President of Development JOE CARUSO Franchise Info Partner MICHAEL WEBSTER Franchise Info Lead Specialist and Partner GARY GARDNER Franchise Update Media Owner GEOFF SEIBER FranFund CEO SHAY KLEINSCHMIDT FranFund VP of Lending AARON ROSE FranPartners Founder BEN SCHMALE FranPartners Co-Founder ALESIA VISCONTI FranServe Inc. CEO, President ROSS BLACK Get Simple Box CEO and Founder KEITH GERSON Gerson Advisory Services, LLC President & CEO JOSH WISE GrassRoots Turf Founder & CEO GARY LISKOVICH Harmonyze Co-founder & CEO JONNY GREENSPAN Harmonyze Co-founder & CTO MARCI KLEINSASSER Home Franchise Concepts Vice President, Marketing – Franchise Development JARRETT SMITH Home Franchise Concepts Director, Executive Office JEFF DUDAN Homefront Brands Chairman and CEO TIM TANG Hughes Director CARL UDLER Hughes Sr. Director Marketing Sheila Fischer International Franchise Association SVP Sales PAUL ROCCHIO International Franchise Association SVP, Development & Member Services JOSEPH MOHAY Ignite Visibility President, Franchise Division RED BOSWELL International Franchise Professionals Group President JOHN BRICE Killer Foods LLC Founding Partner PETER HOLT GIL MARQUES KTA Financial Services Co-Founder and COO SHANNON MARQUES KTA Financial Services Managing Member JOHN S. LACY, CPWA The Lacy Wealth Management Group Managing Director ANDREW BECKMAN, CFE Location3 Founder JULIE WHITNEY Location3 Director of Business Development ALAN BURGER McDonald Hopkins Law Attorney JACK DAY Meals of Hope Director of Franchise Operations STEPHEN POPPER Meals of Hope Founder, President and CEO MARTIN JOKSIMOVIC MFV Expositions President JUSTIN WOOD MFV Expositions Senior Account Executive BRANDEN GRIMSHAW The Mole Hunter Founder JONATHAN D. HILL Morrow Hill Co Founder PATRICK P. MCGEE MPK Equity Partners CYNTHIA BROWN National Life Group Financial Advisor BERNARD MARKEY Navigator Partners, LLC. Managing Partner WILLIAM STEWART Navigator Partners, LLC. Managing Partner FRANK TORAL Neighborhood Kids Schools Founder & CEO BRAD STEVENSON Neighborly Chief Development Officer ROY ASSAD Network Lead Exchange President KATHY LIVINGSTON Oliver’s Nannies Founder & President MARK SCHNURMAN The Perfect Franchise Founder & Managing Partner JOHN CLANCY Planet Fitness Midwest Managing Member MARK PARKS Preveer President OWEN GAHAN Priority Financial Solutions LLC Owner WILLIAM F. GAHAN Priority Financial Solutions LLC Advisor KYLE MCEUEN ProfitKeeper CFE MATTHEW SCHUBERT ProfitKeeper Senior Vice President of Sales CAROL R. HOLLOWAY Property Stewards Founder and CFO R. MARK HOLLOWAY Property Stewards Founder and CEO STEVEN P. WHITE PUROCLEAN President & Chief Operating Officer LANDY RANDOLPH RAAMP President SCHUYLER “ROCKY” REIDEL Reidel Law Firm Managing Attorney DREW ALFANO Retro Fitness Director of Business Development LARRY STRAIN Retro Fitness Chief Development Officer UNNAT BAK Revscale AI Founder & CEO AARON HARPER Rolling Suds Franchise Founder & CEO RANDY PIANIN Royal Restaurant Group, LLC Chief Executive Officer ROGER W. WEBB R&R Group Holdings, LLC Managing Member GARY RATNER Salty Dawg Pet Salon Partner/Investor APRIL PORTER Secretsos Founder JARED MOSS Secretsos TIM VOGEL Scenthound Founder & CEO MONICA TAPIA-MULARSKI Season 2 Consign Co-Founder ERICA SCHRIEBER Season 2 Consign Co-Founder BRON LAUNSBY Slick City Franchise Group LLC Slick City Action Parks LLC Founder & CEO THOMAS HIGHAM Stanford Franchise Pros Managing Partner KISSEL GOLDMAN Stanton Optical Senior Vice President of Operations RICHARD PERNA Stanton Optical Regional Vice President of Franchise Operations RODNEY A. WOODSTOCK TBC Corp. Senior Director, Real Estate Operations & Property Management STEVEN V. MILLER TBC Corporation & Affiliated Companies Senior Corporate Counsel CHASE EMERSON TBC Corporation & Affiliated Companies Senior Director, Franchise Development JACK JOHNSON The Franchise Insiders CEO JILL JOHNSON The Franchise Insiders President FAIZUN KAMAL The Franchise Pros. CEO KRISTI MAILLOUX Three20 Capital Group Managing Partner TODD RECKNAGEL Three20 Capital Group Managing Partner JIMI GIBSON Thrive Internet Marketing Agency Vice President of Brand Communication ANTHONY M. FOLEY Tint World Director of Franchise Development CHARLES J. BONFIGLIO Tint World Founder/CEO DONGWON DONOVAN KWAK Town X Group / Era Group Korea, Cambodia, Vietnam, Laos CEO HYUNGSEOK JOHN YOON ESQ., CFE Town X Group Founder/Chairman CORY HIBBARD Transworld Business Advisors Vice President of Operations DAVID WHEELER Tsource Vice President of Technology and Security MONICA FEID Thunderly Marketing COO & Co-Founder SCOTT WHITE Thunderly Marketing CEO & Co-Founder KEN HUTCHESON U.S. Lawns President AJ TITUS United Franchise Group and Signarama President RAY TITUS United Franchise Group Founder and CEO ERIC JOHNSON, CFE U.S. Commercial Service Global Team Leader – Franchising KATHRYN DYE U.S. Department of Commerce Sr. International Trade Specialist JASON R. ANDERSON Vast CoWorking Group President JEFFREY LEACH Vendasta Director, Enterprise Sales CHRIS DEIANNI Vendasta (Broadly division) Head of Business Development MITCHELL NOLAN Vett3d Brands Co-Founder DAN CLAPS Voda Cleaning and Restoration CEO . Honorary Members STEVE LIEBER Burgerfi EVP Franchising CHERYL BABCOCK Nova Southeastern University Lecturer and Director TONY FOLEY United Franchise Group Retired MADISON JOBE Wingstop Restaurants, Inc. Retired JOHN DIEP Enterprise Florida, Inc. Regional Director Titus Center for Franchising Schedule a meeting with Dr. Hayes Send Email Phone: 561-803-2093 Palm Beach Atlantic University 901 S Flagler Drive West Palm Beach, FL 33401 561-803-2000 Contact Us PBA News & Articles PBA Events Calendar myPBA Offices & Departments Maps & Directions Faculty & Staff Directory Careers at PBA Transcripts EASE Grant Performance Measures Procurement PBA Campus Store Department of Public Safety Title IX Concerns Report an Ethics Concern © Copyright 2024 Palm Beach Atlantic University GDPR & Privacy HEERF Reporting Facebook Twitter Instagram LinkedIn YouTube Back to top"
    },
    {
      "url": "https://titussteel.com/contact-us/",
      "text": "Get in Touch with Titus Steel – Expert Steel Services Get a Quote US: 1-800-536-5908 Canada: 1-888-564-7904 Send us an Email sales@titussteel.com Get a Quote CALL TOLL FREE 1-888-564-7904 1-888-564-7904 Titus Steel About Us Gallery Our Products Wear Impact Steel Endura ENDURA Dual ENDURA Nitro Creusabro 8000 Steel Creusabro Dual (with Titanium Carbide Plates) Grizzly Decks, Screens & Grates Titus Manganese Steel TITUS AR Titus AR 500 Titus AR 600 Steel Castings Technical & Mechanical Comparison Mold and Die Steels DC53 DCMX Toolox 33 Toolox 44 Steel PX5 NAK55 NAK80 DH2F DH31-EX Dynamic Armor Plates Dynamic Armor 500 Dynamic Armor 600 DYNAMIC MIL-A-46100 Pile Caps and Points Standard Pile Points Rock Injector Pile Points Concrete Pile Points Splicers WELDING PROCEDURE H-Pile Welding Procedure for Splicers TECHNICAL REPORTS Driving into Sloping Rock TITUS “HD” ROCK INJECTOR VS THE OSLO POINT 800 Ton Static Load Test Grouser Bars Weld-On Procedure Custom Steel Processing Brochures Warranty Terms and Conditions of Sale FAQ Blog Contact Us Contact Us Titus Steel Contact Us Contact Us Today For any inquiries, contact us today, and our team will get back to you soon. Please leave this field empty. Δ Our Locations Titus Steel Canada (Head Office – Toronto Ontario) 6767 Invader Crescent, Mississauga, Ontario, L5T 2B7 Toll Free: 1-888-564-7904 (905) 564-2446 (905) 564-2450 sales@titussteel.com Titus Steel USA (East Coast Distribution) 9 Dean Dr, Cartersville, Georgia Toll Free: 1-888-564-7904 sales@titussteel.com Download our brochures Download Titus Steel provides solutions and products to your steel and molding challenges. Navigation Home About Us Our Products Warranty Brochures Contact Us FAQ Socialize with Us Connect with us at our social networks below. Working Hours Monday: 8 am to 5 pm Tuesday: 8 am to 5 pm Wednesday: 8 am to 5 pm Thursday: 8 am to 5 pm Friday: 8 am to 5 pm Titus Steel Canada 6767 Invader Crescent, Mississauga, Ontario, L5T 2B7 Phone: (905) 564-2446 Titus Steel USA 9 Dean Dr, Cartersville, Georgia Toll Free: 1-888-564-7904 Copyright © 2022 Titus Steel."
    },
    {
      "url": "https://www.321area.com/florida/titusville/shopping/titus-landing.htm",
      "text": "Titus Landing - Shopping - Titusville - Titusville Explore More Areas Near By Lakeland, FL Orlando, FL Daytona Beach, FL Treasure Coast, FL Tampa, FL Trending Austin,TX Denver,CO Atlanta,GA Fort Lauderdale,FL Dallas,TX Find More Locations Claim My Business Login Sign Me Up Titus\r\n\t\t\t\t\t\t\t\t\t\t\tLanding Shopping $ Call Us Get There Website US 1 @\r\n\t\t\t\t\t\t\t\t\t\t\t\tHarrison Titusville, FL 32780 Titusville Rate and review â â â â â Is This Your Listing? Are you the owner of\r\n\t\t\t\t\t\t\t\t\t\t\tTitus Landing in Brevard County Florida? Send us more details! Claim Your\r\n\t\t\t\t\t\t\t\t\t\t\t\tBusiness Or Contact Us Description The Titus Landing Facebook Page\r\n\t\t\t\t\t\t\t\t\t\t\t\twill have all the latest and greatest information about the progress of\r\n\t\t\t\t\t\t\t\t\t\t\t\tthe redevelopment of the new Titus Landing! Upcoming\r\n\t\t\t\t\t\t\t\t\t\t\tEvents Frequently Asked Questions Places You\r\n\t\t\t\t\t\t\t\t\t\t\tShould Consider Titus Landing Photos News & Articles Christmas Lights Around Cocoa Beach Recent Jobs People Connected Is Titus Landing one of your Favorite\r\n\t\t\t\t\t\t\t\t\t\t\t\tPlaces? Add to My Connections Plug Updates Say Something or Ask a Question about Titus Landing Say Something Add Photos Recommended Ratings & Reviews Service Cleanliness Bang for your Buck Parking & Accessibility Quality of Product Rate & Review Related places Bling Rider 490 C Garden St.,\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tTitusville FL, 32796 For the riders who want it all, and more! Bling\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tRider allows you to find that must have jewelry and apparel to be\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tthe envy of everyone at any rally or event.... Titusville Cozy Cottage Soy Candles 203 N Brown Ave,\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tTitusville FL, 32796 Wedding, Baby Shower, Party Favors...Call today\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tto place your order.\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t321-258-1515. Titusville The Titusville Peddler,llc- Mantiques 1139 S. Hopkins Ave,\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tTitusville FL, 32780 Mantiques- specializes in man-cave accessories.\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tWe sell everything from vintage gas pumps to neon signs and\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tPetroleum collectibles. YES â women welcomed! Titusville Dusty Rose Antique Mall 1101 S Washington Ave,\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tTitusville FL, 32780 The Dusty Rose Antique Mall is situated in\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tHistoric Downtown Titusville on US Highway 1, and has been in\r\n\t\t\t\t\t\t\t\t\t\t\t\t\toperation for more than 30 years!\r\n\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tWe are NORTH... Titusville Home Add My\r\n\t\t\t\t\t\t\t\t\t\tEvent Add My\r\n\t\t\t\t\t\t\t\t\t\tBusiness Memorial Day 2021 Restaurants Nightlife Events Things to\r\n\t\t\t\t\t\t\t\t\t\tDo Sports Family Recreation Travel Real Estate Jobs Directory × Eat Things to Do Save Vote Nightlife Events Family Shop Real Estate Sports Travel Jobs Join My Community 321area.com would like to send you latest updates Join Now Remind me\r\n\t\t\t\tlater Sections Nightlife Restaurants Events Travel Recreation Photographers Live Music & Bands Jobs Real Estate The Loop Things to do Community Business Toolbox Add Your Business Post Your Event Advertise with Us Business Directory Connect with MyArea Network Sign Up Now About Contact Us Partners Privacy Policy Sitemap Careers Popular Areas Cape Canaveral Cocoa Cocoa Beach Downtown Melbourne Eau Gallie Arts District Melbourne Merritt Island Palm Bay Rockledge Titusville Communities eSports Fitness Family & Parenting EDM Health & Beauty Breweries Business & Finance Arts & Theater Golf Vegetarian Foodie Fashion All logos and trademarks in this site are property of their respective owner.\r\n\t\t\t\t\t\tThe comments and listings are property of their posters. All the rest Copyright © 2021 by MyArea Network, Inc . All Rights Reserved. Powered by Terms and conditions ."
    },
    {
      "url": "https://www.foundationsforfreedom.net/References/NT/Pauline/Titus/Titus_Introduction.html",
      "text": "Book of Titus : An Introduction, Map Outline and Purpose - The Bible Teaching Commentary : Titus BFF Home About Us About Us Approach Beliefs Biography Contact us Donations Pray for us! Facebook-BFF Mission Biblical All Bible articles OT NT Life Truths All topics Discipleship Marriage articles Overcoming Anxiety Parenting Languages Translators Amharic Bengali Burmese Chichewa Chinese ä¸­æ India Bengali Hindi Oriya Telugu Luganda Spanish RSS Feed Store Store Tweet to @PaulJBucknell 7 BFF Digital Libraries hold quality slides, audio/videos, more! The teacher's dream! BFF is now on Facebook ! Please visit and join us in releasing God's powerful Word to our generation! God's peace can help us live above anxieties as we learn to trust in Him! The Life Core: Discovering the Heart of Great Training Newest! The Lord Your Healer Discover Him and Find His Healing Touch Learn about the first steps of discipleship! Discover the power of God's Word! Find out where Christ leads us! The Bible Teaching Commentary on Genesis: The Book of Foundations Commentaries that specialize on training the teacher! Redemption Through the Scriptures: Great biblical and chronological study! Also has study guide! Like what you see on BFF? Share your insights, comments, etc. now! Shaped into God's Community Book of Titus The Bible Teaching Commentary The Book of Titus: An Introduction, Map and Outline Paul J. Bucknell _________________________ Titus Outline | Titus Map | Titus Commentary (see below) Intro to Titus | Titus 1:1-4 | Titus 1:5-9 | Titus 2:1-2 | Titus 3:9-15 Purpose Titus: An Introduction, Outline And Purpose serves as the introduction to the Book of Titus in The Bible Teacher's Commentary series. Several colored diagrams are included. Introduction to Titus âFor this reason I left you in Crete, that you might set in order what remains, and appoint elders in every city as I directed you\" (Titus 1:1-4). Introduction We might call ourselves the post-modern generation, a generation that is clever and knowledgeable. But we do not need to look far to find that this generation is, in fact, a very confused generation. One would think that with all this money, advanced training and specialists about that we would be more advanced, but it is not true. We agree we still have the war problem. The past generations could not eliminate that either. But how is it that we have allowed our society to be so confused as to deny what we beforehand would call the facts of life. Instead of esteeming love, beauty and faithfulness in areas like marriage, relationships and the arts, society now promotes hatred, violence, envy and unfaithfulness. Justice and courts have degenerated into influence control centers: you pay we decide. We would be fools, however, if we thought the problem was only out there, outside the church. The church has seemingly picked up the same problems. If we study the problem a bit closer, the confusion in the world is, in fact, accentuated by the confusion in the church. As the church goes, so goes the community. The church is the salt and light in the world. When the church tolerates immorality, then the society herds in that direction. When will the church learn and appreciate the power of the Gospel? We again desire the she becomes the precious and beautiful rather than the stained and worldly. Yes, we know that many people call themselves the church that is not the church at all. For them, it is only a religion. But even still, the church, the real church, has a mission and nothing could keep her back if she would only live by her calling. Why is it that segments of the church dare to lead the women from their families into the work place? Why is it that the church wants to push homosexuals into church leadership? Why is that church leaders condone and even encourage divorce as a choice of life? Whatever happened to morality and the holiness of marriage? The Apostle Paul foresaw at the end of his life a great tsunami of attacks coming against the church of God. He responded with three letters. We call them the Pastoral Epistles : 1 Timothy, 2 Timothy and Titus. After Paulâs first imprisonment, he was released. He visited different places including the island of Crete, an island only 160 miles long south of Greece and Turkey in the Mediterranean Sea. He wrote this letter to Titus around 62 A.D. from somewhere in Macedonia. Fortunately, Paul has clarified many questions regarding the place of the church in the midst of attack. If you have questions, Titus has an answer for many questions. But we must remember to ask the right questions. Sometimes, we look for answers that fit comfortably in with our lifestyles. If so, you might not be happy with the answers that you find. If the bottom line is that you want to find a church that is comfortable and fits with your standards, then you had better recognize that you are of the world. But if deep down, even though you are desperately struggling, you hope to know and please God, then you will find clear direction in this book. Even the most earnest Christian recognizes that he or she can be too affected by the world. Paul at some point had visited the island of Crete for he says in Titus 1:5 âI left you in Crete.â The church had sprung up just as it has in almost every city on this globe. God had been at work. The church grew up and informal churches started in the different cities across the island. But troubles developed. Jesus told the parable of the tares, âThe kingdom of heaven may be compared to a man who sowed good seed in his field. âBut while men were sleeping, his enemy came and sowed tares also among the wheat, and went awayâ (Matthew 13:24-25). Did you note when the enemy came and planted discord and confusion? It was when the men were sleeping. Evidently, some men were sleeping in this case too. I have come to realize that through Godâs promises we can have a wonderfully strong, church, family and individual lives. We can be effective serving. But if we let down our guard, trouble rushes in. Many of the troubles occur when we are sleeping, that is, not keeping our watch. The church at Crete faced special problems. Missionary tours are often too brief. As a result, solid churches are not established. Perhaps it was because people were not sufficiently familiar with the Word of God. It took a bit longer to raise up trusted leaders. In any case, we find Paul writing the letter of 1 Timothy to Timothy who was then stationed at Ephesus and Titus at Crete. Paulâs death was eminent. Within another year or so, he would write 2 Timothy and under Nero be martyred probably about 64 A.D. Most of BFF articles such as this one is nicely formatted for printing. Check out the great number of articles on the BFF Biblical Training Library all for one low cost . Or just order the printed copy or download of the Inductive Bible Study in Titus which comes with student handouts in pdf and .doc to edit. For Crete, however, it was time for godly leaders to be appointed. During the time of informal fellowship, Christians became prey to all sorts of self-appointed leaders and affected by their false teaching. When good leaders do not rise up, bad leaders will infiltrate and devastate the flock. Paul was exercising his apostleship by delegating Titus to appoint elders on his behalf. This letter, then, not only is a directive to Titus on how to âset the church in orderâ (verse 1:5) but also a public statement of Titusâ authority and a statement on how the church should conduct itself. In many ways, this message fits our times. Yes, we have good leaders. But as we think of the church in general, it is being chewed apart almost without even knowing it. The wolves have come in. They are picking off Christians who have made themselves separate from the church. So though there be leaders and a church body, many no longer think it important to be part of the local church. And there again, there are as many public pulpits, some of which are good and others wretched. When I was in India, I saw a Christian family watching one of these money-maker preachers. These false prophets undermine the care of the true caretakers of the flock. Discernment of these false shepherds cannot be gained because we do not know them but only hear their words. We all need the message here in this Book of Titus. We need a defining message for the church for it is from understanding who she is, that we can understand her mission. The letter is very cohesive and basically consists in advice from Paul to Titus. Key verbs mark off each chapter. Chapter 1 âset in order and appoint elders.â Chapter 2 âSpeak the things which are fitting for sound doctrine.â Chapter 3 âRemind them to be subject to rulers â¦ be ready for every good deed.â The key thought of this book, and the hope of the church is simply, âGood people do good deeds.â We need to choose good leaders to have good churches (chapter 1). We need to have godly people to be zealous for good deeds (chapter 2). We need to be reminded that our goodness comes from Christ and from that relationship grows many more good deeds (chapter 3). Of course, the opposite is true too and the church in Crete was facing a number of difficulties. They had ungodly leaders who were distorting the truth of the Gospel and creating havoc in the church. They had ungodly people who were living counter-Christian lives. They had no testimony. They had a general spirit of rebellion that, so to speak, disguised the power of the saving Gospel of Christ Jesus. Doesnât this sound much like our age? How sad. Fortunately, we have the advice from Paul to guide the church. In the outline below, please remember the original letter did not have chapters or verse numbers, but these are themes which are clearly seen as one section is compared with another. Purpose of Titus: Shaped into Godâs Community Every bride looks beautiful. But behind that veil is a woman that needs to be shaped into a woman with beautiful inner qualities. This is her life call. So it is with the bride of Christ. A calling doesnât bring all the glories of the church in a moment. She can grow. The difference is that now she belongs to Christ. God through Paul is calling the church to take significant strides closer to what she should be. Outline of Titus Shaped into Godâs Community (The Book of Titus) Three means God develops His people: A. Appoint Transformed Leaders (1:1-16) B. Cultivate Sanctified People (2:1-15) C. Teach Vibrant Gospel Truth (3:1-15) Paul affirms Titusâ authority to appoint godly leaders (Chapter 1) and instruct Godâs people in godly behavior (Chapter 2) so that they might gain a proper understanding of the gospel (Chapter 3) and as a result be a godly people who will be full of good deeds. In simpler words, we can say the purpose is to âCreate a godly people full of good deeds.â The challenge and application of Titus We have a great challenge before us. If we as Godâs people are faithful to what is said here in Titus, we will be greatly used of God to reshape the society about us. We will reflect Christâs glory more and more. As we see the glorious works of Christ worked through our lives, we will personal be enriched. This is the reason God has left this scripture for us. If we are faithful choosing right leaders, conform to Christâs calling for our lives and faithfully hold to the Gospel truths, we will see a host of good deeds coming from our lives much like the rays of the sun. Light will shine in a dark world. => Next: Titus 1:1-4 Introduction Other related articles from Biblical Foundations for Freedom : Detecting Error Inside and Outside the Church. Building a Great Marriage! Book of Titus: The Bible Teacher's Commentary Titus Outline | Titus Map | Titus Commentary (see below) Intro to Titus | Titus 1:1-4 | Titus 1:5-9 | Titus 2:1-2 | Titus 3:9-15 Titus 1:1a Calling | Titus 1:1-4 _Introduction | Titus 1:1-3 Calling | Titus 1:4 Training | Titus 1:1-4 Questions Titus 1:5-9 Introduction | Titus 1:5 Organization | Titus 1:5 Leadership | Titus 1:6-9 Standards | Titus 1:5-9 Questions Titus 2:1-2 Introduction | Titus 2:1 Beliefs | Titus 2:2 Lives | Titus 2:1-2 Questions Titus 3:01-4 Questions | Titus 3:09-15 Introduction | Titus 3:09-11 Conversation Titus 3:12-14 Relationships | Titus 3:15 Goodbyes | Titus 3:09-15 Questions _________________________ Book of Titus - Inductive Bible Training Study Questions Series Learn how to do inductive Bible Studies! Purchase here Inductive Bible Study Questions: Introduction | Book study Study Questions: Titus 1:1-4 | Titus 1:5-9 | Titus 1:10-16 Titus 2:1-10 | Titus 2:11-15 | Titus 3:1-8 | Titus 3:9-15 BFF Homepage | Top | About us | Pray for us | BFF's Approach | BFF Store | BFF RSS | Topics | OT | NT Biblical Foundations for Freedom ( BFF ) Rev. Paul J. Bucknell Follow @PaulJBucknell info@foundationsforfreedom.net Scriptures  typically quoted from the New American Standard Bible unless noted: \n    (C) Copyright The Lockman Foundation 1988 Looking for Revival?"
    },
    {
      "url": "https://tituslanding.com/contact/",
      "text": "Titus Landing Shopping 0 Skip to Content ABOUT DIRECTORY LEASING CONTACT Open Menu Close Menu ABOUT DIRECTORY LEASING CONTACT Open Menu Close Menu ABOUT DIRECTORY LEASING CONTACT INTERESTED IN LEASING? Located along the booming Space Coast, Titus Landing is the perfect location for your business. Visit our leasing page to learn more about the Titusville area or contact us today to apply for a lease. We’d love to be home to your establishment. LEARN MORE ABOUT LEASING HOW CAN WE HELP YOU? PROPERTY MANAGEMENT Cathy Musselman Email 614-816-1417 Mike Cremeans Email 614-816-4766 LEASING VenditaAI (813) 726-4853 (Office) Email: bmcadams@skywayflorida.com (813) 690-1390 (Mobile) Brandy McAdams CONTACT FORM Name * First Name Last Name Email * Subject * Message * Thank you! Copyright 2018 Titus Landing  | Request Maintenance  | S Washington Ave, Titusville, FL 32780 CONTACT"
    },
    {
      "url": "https://www.titusplus.com/us/en/contact",
      "text": "Contacts | Titus Close navigation Products Solutions Resources Company Careers Contacts Products Hinges Connectors TouchControl systems Drawers Soft closing systems Sliding door systems Shelf supports Accessories Solutions Hydraulic damping & damping systems Plastic Moulding Ultrasound fastening - Titusonic Automated assembly systems Die casting technologies FastFit Resources Download area Certificates Titus Expertise Product Selector Extranet Company About us Our Values Milestones Quality Trade shows News Select country: United States Titus Group Products Solutions Resources Company Careers Contacts Select country: United States Open search query Open navigation Hinges Connectors TouchControl systems Drawers Soft closing systems Sliding door systems Shelf supports Accessories Hydraulic damping & damping systems Plastic Moulding Ultrasound fastening - Titusonic Automated assembly systems Die casting technologies FastFit Download area Certificates Titus Expertise Product Selector Extranet About us Our Values Milestones Quality Trade shows News Contacts Any questions? Please contact the relevant office below or email us at [email protected] . Our sales and engineering teams are here to provide you with more information, answer any question you might have and advise you on the solutions we can provide to take your business ahead. Offices Distributors - Choose yout country - Albania Argentina Australia Austria Belarus Belgium Belize Bosnia and Hercegovina Brazil Bulgaria Canada Chile China Colombia Costa Rica Croatia Cyprus Czech Republic Denmark Dominican Republic Egypt El Salvador Estonia Finland France Germany Greece Guatemala Honduras Hong Kong, China Hungary India Indonesia International Ireland Israel Italy Japan Jordan Kosovo Latvia Lebanon Lithuania Macedonia Malaysia Mexico Moldova Montenegro New Zealand Nicaragua Norway Panama Paraguay Philippines Poland Portugal Romania Russia Serbia Singapore Slovakia Slovenia South Africa Spain Sweden Switzerland Syria Taiwan, China Thailand The Netherlands Tunisia Turkey Ukraine United Arab Emirates United Kingdom United States Venezuela Vietnam Titus Group Titus Precision Company 900 W Connexion Way Columbia City, IN 46725 United States (260) 244-6114 (260) 244-5995 [email protected] - Choose your state - Alabama Arizona Arkansas California Colorado Connecticut Florida Georgia Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Massachusetts Michigan Minnesota Missouri Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Portland Rhode Island South Carolina South Dakota Tennessee Texas Utah Virginia Washington Wisconsin Wyoming Advanced Hardware Supply Inc. 12324 West Executive Drive Boise, ID 83713 United States (208) 321-8089 [email protected] www.advancedhardwaresupply.com Aetna Plywood 6350 Brookville Road Indianapolis, IN 46219 United States (317) 353-6281 [email protected] www.aetnaplywood.com Aetna Plywood 1931 Eleventh St Rockford, IL 61104 United States (815) 968-0921 [email protected] www.aetnaplywood.com Aetna Plywood 1401 St. Charles Rd. Maywood, IL 60153 United States (708) 343-1515 www.aetnaplywood.com Charles McMurray Company 2520 North Argyle Ave. Fresno, CA 93709-0569 United States (559) 292-5751 [email protected] www.charlesmcmurray.com Compi Distributors 5900 Equitable Road Kansas City, MO 64120 United States (816) 228-9998 (816) 228-9989 Compi Distributors 6387 Canadian Cross Drive Springfield, IL 62711 United States (217) 529-5553 (217) 529-6955 Compi Distributors 2855 Haag Road Arnold, MO 63010 United States (636) 296-1111 (636) 296-1411 Compi Distributors 2160 Industrial Court Ozark, MO 65721 United States (417) 986-1222 (417) 551-4880 Dakota Hardwoods 11630 Rojas El Paso, Texas 79936 United States (915) 590-9663 (915) 590-9664 Dakota Hardwoods 641 W. Mockingbird Ln. Dallas, TX 75247 United States (972) 677-7437 www.dakota.com Dakota Hardwoods 5910 West by Northwest Blvd #400 Houston, TX 77040 United States (713) 939-9663 (713) 481-8499 Dakota Hardwoods 5550 Cameron St. Suite B Scott, LA 70583 United States (337) 232-2628 [email protected] www.dakotahardwoods.com Dakota Hardwoods 6301 E Stassney Austin, TX 78744 United States (512) 389-9773 (512) 386-8271 Dakota Hardwoods 6805-C Imperial Drive Waco, TX 76712 United States (254) 772-9663 (254) 772-9664 Dakota Premium Hardwoods Po Box 23302 Woodway, Waco, TX 76712 United States (254) 772-9663 [email protected] [email protected] E.B. Bradley Co. 1150 N Red Gum St Anaheim, CA 92806-2500 United States (714) 238-6280 [email protected] www.ebbradley.com E.B. Bradley Co. 4120 W Windmill Ln Las Vegas, NV 89139-5855 United States (702) 818-2320 [email protected] www.ebbradley.com E.B. Bradley Co. 2980 Oates St Sacramento, CA 95691-9702 United States (916) 329-1090 [email protected] www.ebbradley.com E.B. Bradley Co. 3433 Arden Rd Hayward, CA 94545-3905 United States (510) 732-5140 [email protected] www.ebbradley.com E.B. Bradley Co. 4465 NE 150th Ct Portland, OR 97230-1032 United States (503) 252-0801 [email protected] www.ebbradley.com E.B. Bradley Co. 7024 S 234th St Kent, WA 98032-5029 United States (253) 856-8855 [email protected] www.ebbradley.com E.B. Bradley Co. 5602 Bickett St Vernon, CA 90058-3606 United States (323) 585-9201 [email protected] www.ebbradley.com E.B. Bradley Co. 5640 S 40th St Phoenix, AZ 85040-3908 United States (602) 276-9000 [email protected] www.ebbradley.com E.B. Bradley Co. 3200 E Trent Ave Spokane, WA 99202-4456 United States (509) 535-1797 [email protected] www.ebbradley.com E.B. Bradley Co. 9586 Distribution Ave San Diego, CA 92121-2312 United States (858) 684-5063 [email protected] www.ebbradley.com Groupo Imco Lumber San Antonio 4441 Centergate San Antonio, TX 78217 United States (210) 967-9663 [email protected] www.imcolumber.com Grupo Imco Lumber Austin Austin, TX 73301 United States [email protected] www.imcolumber.com Grupo Imco Lumber Brownsville 3640 E. Ruben Torres Sr. Blvd Brownsville, TX  78526 United States (956) 878-3993 [email protected] www.imcolumber.com Grupo Imco Lumber Dallas Dallas, TX 75001 United States (956) 348-9154 [email protected] www.imcolumber.com Grupo Imco Lumber Donna 405 Expressway 83 Donna, TX 78537 United States (956) 878-3993 [email protected] www.imcolumber.com Grupo Imco Lumber Laredo 518 Crossroads St. Laredo, TX 78045 United States (956) 878-3993 [email protected] www.imcolumber.com Grupo Imco Lumber Mission 1300 Trinity St Mission, TX 78572 United States (956) 878-3993 [email protected] www.imcolumber.com Hardware Direct 1215 F Avenue SE Hickory, NC 28602 United States (828) 326-0887 (828) 326-8712 www.gethardwaredirect.com Hardware Distributors Ltd. 5 Industrial Blvd Sauk Rapids, MN 56379 United States (320) 255-9850 [email protected] www.hdlusa.com Hardware Imagination Tech 4300 NW 37th Avenue Miami, FL 33142 United States (813) 882-0322 [email protected] www.hardwareimagination.com HGH Hardware Supply 1454 Field Park Cir NW Marietta, GA 30066 United States (770) 429-5656 (770) 429-5594 HGH Hardware Supply 2679 Peachtree Square Atlanta, GA 30360 United States (770) 248-9501 (770) 449-5166 [email protected] HGH Hardware Supply 402 Harding Industrial drive Nashville, TN 37211 United States (615) 333-1111 (615) 333-1007 [email protected] www.hghhardware.com HGH Hardware Supply 3912 2nd Avenue South Birmingham, AL 35222 United States (205) 595-4655 (205) 510-4233 [email protected] www.hghhardware.com Holdahl Company 27075 Mueller Place Sioux Falls, SD 57108 United States (605) 368-2277 (605) 368-2208 www.holdahlcompany.com Holdahl Company 301 43rd Street NW Fargo, ND 58102 United States (701) 277-7070 (701) 277-0710 www.holdahlcompany.com Holdahl Company 5650 Metro E Drive Pleasant Hill, IA 50327 United States (763) 231-3130 www.holdahlcompany.com Mac Murray Pacific 568 7Th Street San Francisco, CA 94103 United States (415) 552-5500 [email protected] www.macmurraypacific.com Manufacturers Supply Company 4235 Corporate Exchange Drive Hudsonville, MI 49426 United States (616) 669-4190 [email protected] [email protected] www.mansply.com National Builders Hardware 1019SE 10th Ave Portland, OR 97293 United States (503) 233-5381 [email protected] www.nbhco.com Oharco (Richelieu) 8109 F Street Omaha, NE 68127 United States (402) 342-4489 Oharco (Richelieu) 2900 W Sencore Drive Sioux Falls, SD 57107 United States (800) 228-9460 Oharco (Richelieu) 5685 NE 16th Street Des Moines, IA 50313 United States (800) 362-2474 Outwater Plastics Inc 24 River Road Bogota, NJ 07603 United States (201) 498-8750 www.outwaterplastics.com Richelieu 1029 Riverside Street Portland, MA 04103 United States (207) 797-0152 www.richelieu.com Richelieu 3280 Green Pointe Parkway NW, Suite 100 Norcross, GA 30092 United States (770) 326-9457 (770) 326-6467 www.richelieu.com Richelieu 7004 Benjamin Road, Unit 110 Tampa, FL 33634 United States (813) 886-0138 (813) 559-1848 www.richelieu.com Richelieu 2580 NC Highway 49 Burlington, NC 27217 United States (336) 350-8574 www.richelieu.com Richelieu 39 Techview Drive Cincinnati, OH 45215 United States (513) 554-3770 www.richelieu.com Richelieu 90 New Britain Avenue Rocky Hill, CN 06067 United States (860) 529-7704 www.richelieu.com Richelieu 47 Anderson Road Cheektowaga, NY 14225 United States (716) 893-9663 (716) 893-9680 www.richelieu.com Richelieu 3410 Park Central Blvd. North Pompano Beach, FL 33064 United States (954) 968-2900 (954) 968-3284 www.richelieu.com Richelieu 626 West 28th Street Hialeah, FL 33010 United States (305) 885-1700 (305) 885-3311 www.richelieu.com Richelieu 201 Brozzini Ct, Suite R Greenville, SC 29615 United States (864) 299-5080 (864) 299-3404 www.richelieu.com Richelieu 2720 Cofer Road Richmond, VI 23224 United States (800) 989-9933 www.richelieu.com Richelieu 5373 West 79th Street Indianapolis, IN 46268-1699 United States (317) 879-2050 www.richelieu.com Richelieu 132 Beaver Brook Road Lincoln Park, NJ 07035 United States (973) 317-1400 www.richelieu.com Richelieu 6311 Porter Road, Units 10 – 13 Sarasota, FL 34240-9618 United States (941) 377-8000 (941) 377-5700 www.richelieu.com Richelieu 3555 Fiscal CT Riviera Beach, FL 33404 United States (561) 863-8111 (561) 863-0081 www.richelieu.com Richelieu 8648 Glenmont Drive, Suite 150 Houston, TX 77036 United States (972) 484-8980 www.richelieu.com Richelieu 2707 Longate Drive Memphis, TN 38132 United States (901) 332-7714 www.richelieu.com Richelieu 3455 WD Judge Drive, Building 400, Unit 160 Orlando, FL 32808 United States (407) 339-5777 (407) 339-0402 www.richelieu.com Richelieu 213 North Road Thomasville, NC 27360 United States (336) 475-2191 www.richelieu.com Richelieu 1250 Brunswick Avenue Far Rockaway, NY 11691 United States (718) 337-3000 [email protected] [email protected] www.richelieu.com Richelieu 150 Chatham Parkway Savannah, GA 31408 United States (912) 965-0600 www.richelieu.com Richelieu 207 York Street Rochester, NY 14611 United States (585) 436-7540 www.richelieu.com Richelieu 3410 Davie Road, Suite 407 Davie, FL 33314-1639 United States (954) 922-8804 (954) 927-2653 www.richelieu.com Richelieu 621 Airpark Center Drive Nashville, TN 37217 United States (615) 399-2580 (615) 399-9041 www.richelieu.com Richelieu 1327 Wood Branch Drive, Unit P Charlotte, NC 28273 United States (704) 599-8817 www.richelieu.com Richelieu 6350 Church Road Hanover Park, IL 60133 United States (847) 451-9300 www.richelieu.com Richelieu 237 N River Road Suite 2 Mount Clemens, MI 48043 United States (586) 264-1240 www.richelieu.com Richelieu 51 Concord Street North Reading, MA 01864-2601 United States (978) 357-3646 www.richelieu.com Richelieu 103 Central Avenue Mont Laurel, NJ 08054 United States www.richelieu.com Richelieu 60 – 01 31st Avenue, Space C & F Woodside, NY 11377 United States (718) 371-0450 (718) 371-0453 www.richelieu.com Richelieu 4222 Edison Avenue Fort Myers, FL 33916-4826 United States (239) 332-0725 (239) 332-0758 www.richelieu.com Richelieu 7660 Phillips Highway, Unit 10 Jacksonville, FL 32256 United States (904) 731-7775 (904) 731-7721 www.richelieu.com Richelieu 2600 Greengate Drive Greensboro, NC 27406 United States (336) 841-5100 (336) 887-8677 www.richelieu.com Richelieu 2510 Stanley Gault Parkway, Unit 200 Louisville, KY 40223-4178 United States (502) 618-2626 www.richelieu.com Richelieu 9249 King James Drive Dallas, TX 75247 United States (972) 484-8980 www.richelieu.com Rockler Companies Inc. 4365 Willow Drive Medina, MN 55340 United States (800) 279-4441 [email protected] www.rockler.com ROK Hardware 1351 N Kreamer Blvd Anaheim, CA 92806 United States (800) 763-8390 [email protected] www.rokhardware.com/ T-J Hardware Inc. 3111 Amherst Dr N E Albuquerque, NM 87110 United States (505) 881-4325 [email protected] www.tjhardware.com US Industrial Fasteners 2026 East Cedar Street Tempe, AZ 85281 United States (480) 967-8702 [email protected] www.usifaz.com Woodworkers Supply Inc. 1108 North Glenn Road Casper, WY 82601 United States (800) 648-3953 [email protected] www.woodworker.com Wurth Baer Supply Company 180 Leetsdale Industrial Drive Leetsdale, PA 15056-1017 United States (800) 289-2237 [email protected] [email protected] Wurth Baer Supply Company 33 Pearl Street Lancaster, NY 14086-1922 United States (800) 289-2237 [email protected] www.wurthbaersupply.com Wurth Baer Supply Company 13390 Cloverdale Street Oak Park, MI 48237-3208 United States (800) 289-2237 [email protected] www.wurthbaersupply.com Wurth Baer Supply Company 40 Industry Drive West Haven, CT 06516-1442 United States (800) 289-2237 (888) 558-2237 [email protected] www.wurthbaersupply.com Wurth Baer Supply Company 1750 Made Industrial Drive Middletown, OH 45044 United States (800) 289-2237 (888) 558-2237 [email protected] www.wurthbaersupply.com Wurth Baer Supply Company 1300 Morse Avenue Elk Grove Village, IL 60007 United States (800) 289-2237 [email protected] www.wurthbaersupply.com Wurth Baer Supply Company 900 13th Avenue Bethlehem, PA 18018 United States (800) 289-2237 (888) 558-2237 [email protected] www.wurthbaersupply.com Wurth Baer Supply Company 5928 Court Street Syracuse, NY 13206-1799 United States (800) 289-2237 [email protected] www.wurthbaersupply.com Wurth Baer Supply Company N28W23240 Roundy Drive Pewaukee, WI 53072 United States (800) 289-2237 [email protected] www.wurthbaersupply.com Wurth Baer Supply Company 8295-8301 National Highway Pennsauken, NJ 08110 United States (800) 289-2237 [email protected] Wurth Baer Supply Company 1758 N Topping Ave Kansas City, MO 64120 United States (800) 289-2237 [email protected] www.wurthbaersupply.com Wurth Baer Supply Company 998 Valley Belt Road Brooklyn Heights, OH 44131 United States (800) 289-2237 [email protected] www.wurthbaersupply.com Wurth Baer Supply Company 1693 Fenpark Drive Fenton, Missouri 63026 United States (800) 289-2237 (888) 558-2237 [email protected] www.wurthbaersupply.com Wurth Baer Supply Company 2 Van Buren Blvd. Bldg.18 Guilderland, NY 12085 United States (800) 289-2237 [email protected] www.wurthbaersupply.com Wurth Baer Supply Company 178 Campbell St. Williamsport, PA 17701 United States (570) 326-9156 [email protected] www.wurthbaersupply.com Wurth Baer Supply Company 9 Delta Drive Londonderry, NH 03053 United States (603) 232-4480 [email protected] www.wurthbaersupply.com Wurth Baer Supply Company 7842 N. Moller Road Indianapolis, IN 46268 United States (800) 289-2237 [email protected] www.wurthbaersupply.com Wurth Baer Supply Company 70 Pawtucket Ave Rumford, RI 02916-2448 United States (800) 289-2237 (888) 558-2237 [email protected] www.wurthbaersupply.com Wurth Baer Supply Company 3740 Zane Trace Road Columbus, OH 43228-3853 United States (800) 289-2237 [email protected] www.wurthbaersupply.com Wurth Baer Supply Company 698 Angenese St Harrisburg, PA 17110 United States (800) 289-2237 (888) 558-2237 [email protected] www.wurthbaersupply.com Wurth Baer Supply Company 105 Fieldview Drive Versailles, KY 40383 United States (800) 292-2754 [email protected] www.wurthbaersupply.com Wurth Louis and Company 2110 E Raymond Ave B-2 Phoenix, AZ 85040 United States (602) 243-0242 [email protected] Wurth Louis and Company 2970 E La Palma Ave Unit A Anaheim, CA 92806 United States (800) 422-4389 ext. 1 [email protected] Wurth Louis and Company 730 S Clearwater Loop Road #110 Post Falls, ID 83854 United States (800) 422-4389 [email protected] Wurth Louis and Company 427 Bird St Benton, AK 72015 United States (501) 778-6500 [email protected] www.wurthlac.com Wurth Louis and Company 11965 Lakeland Park Suite 100 Baton Rouge, LA 70809 United States (800) 444-0043 [email protected] www.wurthlac.com Wurth Louis and Company 3353 N 25th E Idaho Falls, ID 83401 United States (208) 524-3898 [email protected] Wurth Louis and Company 3023 Interstate Dr San Antonio, TX 78219 United States (800) 444-0043 [email protected] Wurth Louis and Company 6125 S Valley View Blvd Suite B Las Vegas, NV 89118 United States (702) 616-2972 [email protected] Wurth Louis and Company 7564 W Victory Road Boise, ID 83709 United States (800) 244-8490 [email protected] Wurth Louis and Company 895 Columbia St Brea, CA9 2821 United States (714) 529-1771 [email protected] www.wurthlac.com Wurth Louis and Company 4201 Charter Avenue Oklahoma City, OK 73106 United States (800) 444-0043 [email protected] www.wurthlac.com Wurth Louis and Company 12848 NE Airport Way Portland, OR 97230 United States (800) 452-2621 [email protected] Wurth Louis and Company 551 Garden Oaks Blvd. Houston, TX 77018 United States (800) 798-4150 [email protected] www.wurthlac.com Wurth Louis and Company 4691 Havana St Denver, CO 80238 United States (303) 375-1810 [email protected] Wurth Louis and Company 3080 N. Great Southwest Pkwy. Grand Prairie, TX 75050 United States (800) 444-0043 [email protected] www.wurthlac.com Wurth Louis and Company 476 East Riverside Drive #3A Saint George, UT 84790 United States (801) 285-8800 [email protected] Wurth Louis and Company 2620 S 900 W Salt Lake City, UT 84119 United States (801) 285-8800 [email protected] Wurth Louis and Company 9107 Polaris Lane N/E Suite F Lacey, WA 98516 United States (800) 452-2621 [email protected] Wurth Louis and Company 999 Linda Vista Dr San Marcos, CA 92078 United States (800) 422-4389 [email protected] Wurth Wood Group 634 Melrose Avenue Nashville, TN 37211 United States (844) 461-6942 [email protected] www.wurthwoodgroup.com Wurth Wood Group 581 Trade Center Street Montgomery, AL 36108 United States (800) 392-8024 [email protected] www.wurthwoodgroup.com Wurth Wood Group 1640 Mims Ave., SW Birmingham, AL 35211 United States (800) 272-6486 [email protected] www.wurthwoodgroup.com Wurth Wood Group 723 Old Trinity Road Decatur, AL 35601 United States (800) 321-6886 [email protected] www.wurthwoodgroup.com Wurth Wood Group 3440 Armour Ave. Mobile, AL 36617 United States (877) 531-7468 [email protected] www.wurthwoodgroup.com Wurth Wood Group Atlanta 4250 Golf Acres Drive Charlotte, NC 28208 United States (704) 394-9479 www.wurthwoodgroup.com Download area Titus Expertise Extranet Terms and Conditions Privacy Policy Titus Group Twitter Titus Group Facebook Titus Group Youtube Titus Group Linkedin Titus Group Instagram © 2025 Titus Group Production: Innovatif Close search menu Search Search engine on the website of Titusplus Close Select Country Europe Albania Austria Belarus Belgium Bosnia and Hercegovina Bulgaria Croatia Cyprus Czech Republic Denmark Estonia Finland France Germany Greece Hungary Ireland Italy Kosovo Latvia Lithuania Macedonia Moldova Montenegro Norway Poland Portugal Romania Russia Serbia Slovakia Slovenia Spain Sweden Switzerland The Netherlands Turkey Ukraine United Kingdom The Americas Argentina Belize Brazil Canada Chile Colombia Costa Rica El Salvador Guatemala Honduras Mexico Nicaragua Panama Paraguay United States Venezuela Asia Australia China English (International) Chinese Hong Kong, China India Indonesia Israel Japan Jordan Lebanon Malaysia New Zealand Philippines Singapore South Korea Syria Taiwan, China Thailand United Arab Emirates Vietnam Africa Egypt South Africa Tunisia International International Back to top"
    },
    {
      "url": "https://www.titustalent.com/contact-us/",
      "text": "Contact Us | Titus Talent Strategies Skip to content Talent Strategies Talent Acquisition Talent Optimization Titus+ Membership Partnership Plans Titus U Culture Creators Speak Industries Accounting & Finance Architecture Biotech & Pharmaceutical Construction Engineering Healthcare Legal Manufacturing Marketing Non-Profit Sales Technology Insights Blog Events Podcasts Case Studies Talent Checkup About Our Process Our Why Our Values Leadership Team Who We Help FAQ Titus Strategic Network Speakers Corner Give Global Commitment to DEI Contact Us CONNECT WITH TITUS Our Talent Strategists Are Here to Help. Our mission at Titus is to help companies hire, train, and retain top talent to maximize their impact. Whether you’re looking for top talent, building high-performing teams, or optimizing your existing recruiting process, we are here to help. TITUS FROM COAST TO COAST. From day one Titus has been a remote company, however we do have offices for meetings. MILWAUKEE 309 North Water Street Suite 430 Milwaukee, WI 53202 CHICAGO 401 North Michigan Avenue Suite 1200 Chicago, IL 60611 GRAND RAPIDS 250 Monroe NW Suite 400 Grand Rapids, Michigan, 49503 MINNEAPOLIS 100 South Fifth Street 19th Floor Mi nneapolis, MN 55402 MADISON 2810 Crossroads Drive Suite 4000 Madison, WI 53718 INDIANAPOLIS 201 North Illinois Street Suite 1245 Ind ianapolis, IN 46204 ORLANDO 111 N Orange Ave Orlando, FL 32801 PLANO 6860 Dallas Pkwy Suite 200 Plano, TX 75024 ATLANTA 260 Peachtree Street NW Suite 2200 Atlanta, GA 30303 APPLETON 4321 College Avenue Suite 200 Appleton, WI 54915 PORTLAND 111 SW Fifth Avenue Suite 3150 Portland OR, 97204 SAN DIEGO 402 West Broadway Suite 400 San Diego, CA 92101 TAMPA 100 S. Ashley Drive Tampa, FL 33602 FAQs What makes Titus unique? We ditch the list of job responsibilities, instead working with our partners to uncover desired outcomes for each role. We disrupt the status quo by looking at the whole person – cognitive and behavioral abilities, passion and purpose – not just work experience. Who would I typically work with? Our partners range from small and mid-size to enterprise companies. We usually work with human resources, hiring leaders and executives directly.. How does your pricing compare to contingent recruiting firms? Our multiple billing options, no hidden fees and no outrageous finders-fee percentages makes our process a win/win for everyone. How will you work with me? There’s a reason we call our clients \"partners\". We believe to be successful at recruiting, we need a transparent relationship with our partners that encourages strong communication between everyone on the hiring team. We want our partners to begin and continue working with us knowing that we have their backs. Our promise and investment from day one is their satisfaction. We promise that you will be so satisfied with our partnership that you will refer us to other companies. If this is not the case, we commit to making it right. We own it, we’re honest, and we reach solutions together. What industries does Titus serve? Our team of hiring consultants are equipped to help with hard-to-fill roles across all industries. Whether your company focuses on construction, technology, healthcare, finance, or beyond, we will deliver leaders and employees for your organization whose purpose and performance aligns with your goals so you can maximize your impact. Does Titus only do recruiting? Because we are a talent strategy company, our goal is to be your partner from hire to retire. These are the key areas that we help address in any organization: employee attraction, hiring selection and onboarding, discovering and retaining high performers, team development, leadership and employee training, and employee engagement. If you don’t have an office in my location, can you still work with me? Yes. Technology is a game-changer! It does not matter where you are, you will still get the same dedicated team working on your open positions. Can Titus handle international recruitment? We regularly work with US based companies and conduct international searches where the candidate is required to speak fluent English. Still have questions? Feel free to send us an email, give us a call, or try our chatbot and one of our dedicated relationship managers will get back to you shortly. info@titustalent.com (877) 300-4829 TITUS INSIGHTS Refreshing perspectives and practical expertise from the Titus team. View All Insights View All Case Studies Talent Strategies Committed To Radical Generosity Our dedication to radical generosity keeps us focused on what matters most, and it allows us to make a trusted and lasting impact on the world around us. It’s the foundation of our culture and our partnerships. Read More Blog What Is The Predictive Index? Podcast Talent Talks: Building a Business That Builds People with Kevin Hohe Quick Links Talent Strategies Contact Industries Join Our Team Insights Talent Checkup About Privacy Policy Stay Connected We put employees first with the belief that hiring, training and rewarding the best people who match vision and values is the way to build. © 2025 Titus Talent Strategies. All Rights Reserved. Site Designed and Developed by 5by5 - A Change Agency"
    },
    {
      "url": "https://www.titusbuilt.com/contact",
      "text": "Contact Titus Built | Custom Home Builder in Fairfield CT Home Services Portfolio Highlighted Projects Elevated Home A New Wave of Waterfront Living Kitchen Overhaul Cozy Living Golf Simulator About Us Testimonial Blog Contact Us Facebook Linkedin Twitter Instagram Pinterest Houzz Link Contact Us Contact Us If you like our work and want to learn more about us and see what we can do for you; contact us, we’ll get back to you. Current Areas We Perform Work Above How Did You Hear About Us ?* Google Ad Google Search Houzz Magazine Ad Mailing/Newsletter Referal Social Media Truck/Job Sign Website Other Log Into Your Project Contact us Titus Built 9D Brookside Place  West Redding, CT 06896 203-834-0275 info@titusbuilt.com Quick Links Portfolio Showcase Testimonial Contact Us Blog Sign up to stay up to date Subscribe to our newsletter to be in the know Subscribe Lastudioicon-b-instagram Facebook Pinterest Twitter Houzz Linkedin Link Website by 203MG Start typing and press Enter to search View more"
    },
    {
      "url": "https://www.linkedin.com/company/titus-transport",
      "text": "Titus Transport | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Sign in Join now Titus Transport Truck Transportation Denton, Texas 1,326 followers We Serve! See jobs Follow Discover all 197 employees Report this company About us Titus Transport has provided nationwide premium transportation services for over 20 years.  We take great care of our drivers, so they in turn take great care of our customers.  Our top priorities are safety and customer service, and we utilize progressive technology and logistics network solutions to help address these priorities. Year after year we achieve over 98% on-time delivery, operating 24/7, 365 days a year come rain, snow, or shine. \n\nMore about us:\n•\tPrivately held, financially conservative.\n•\tWe have grown with blue-chip customers, primarily in the food industry, into a multi-million/year, 48-state carrier. \n• \tIn addition to company drivers, our over-the-road drivers serve many top food industry customers, both retailers and food manufacturers.\n•\tOur capacity and freight network stretches from the Atlantic to the Pacific and from the Canadian to the Mexican borders.  We have an especially strong presence in Central, Midwest, Southeastern and East Coast states and are expanding.\n•\tWe have a great deal of experience in both transitioning current and starting up new, dedicated grocery transportation operations.\n•\tOur goal is to be a valued partner with our customers at pick-up points such as warehouses and particularly at delivery points/customer stores.  We pride ourselves on excellent customer service and are accustomed to adapting to unplanned circumstances common to the food industry such as inclement weather, increased demand, and major events.\n\nInterested? Contact us about employment opportunities!\n\nCurrently hiring: over-the-road drivers, owner operators, company drivers\n\nWant more information? See http://www.titustrans.com for more informaiton on the company and minimum driver qualifications \n\nCall 940-331-0060\nOnline application at \nEmail: recruiting@titustrans.com Website http://www.titustrans.com External link for Titus Transport Industry Truck Transportation Company size 501-1,000 employees Headquarters Denton, Texas Type Privately Held Locations Primary 2800 Shoreline Drive, Suite 310 Denton, Texas 76210, US Get directions Employees at Titus Transport BARBARA HETT Accounting Professional Carol Johnson Payroll and Billing at Titus Transportation AJ Biery Senior Sales Executive at Titus Transportation Tanya Anderson Hard working individual, self motivated and a team member. See all employees Updates Titus Transport 1,326 followers 2d Report this post Don Cabor, CDS as always keeping us informed. Don Cabor, CDS Transportation Safety Leader | Regional Safety Manager | 35+ Years in Transportation | Private Pilot | PADI Divemaster | Emergency First Responder | Former US Army Reserves 2d 🍂 Fall driving = new challenges.\n\nFoggy mornings. Shorter days. Low sun + glare.\n\nAt Titus Transport, we remind our team: safety isn’t seasonal—it’s about adjusting to conditions every mile.\n\n👉 What’s your top tip for handling fall driving hazards? #TitusTransport #FallDriving #FleetSafety #TruckingSafety Like Comment Share Titus Transport reposted this Don Cabor, CDS Transportation Safety Leader | Regional Safety Manager | 35+ Years in Transportation | Private Pilot | PADI Divemaster | Emergency First Responder | Former US Army Reserves 1w Report this post 🚸 Back-to-School means safety matters more than ever.\n\nThis month, kids are back in classrooms, buses are on the roads, and school zones are active again. At Titus Transport, we know it only takes a moment of distraction to change a life forever.\n\nThat’s why we’re proud to share that as of August, our entire fleet is now 100% onboard with Luma Learning LMS—giving every driver access to continuous training. Combined with technology like Netradyne and the dedication of our people, we’re building a safety culture that goes beyond compliance.\n\nHere’s to a safe September—for our drivers, our communities, and everyone sharing the road. #TitusTransport #BackToSchoolSafety #LumaLearning #SafetyCulture #FleetSafety #TruckingSafety #Netradyne 20 10 Comments Like Comment Share Titus Transport 1,326 followers 1mo Report this post Exciting news from Titus Transport! We're thrilled to announce key executive leadership transitions that are paving the way for continued growth and operational excellence.\nJacob Cullison has been promoted to Chief Executive Officer! Jacob's leadership has been instrumental in enhancing our operations, safety, and efficiency across our terminal network. His deep understanding of our business and clear vision will drive us forward.\nWe're also celebrating Derek Lindsey's promotion to Chief Financial Officer. Derek has been a key contributor to our financial stewardship and will be crucial to our long-term strategic goals.\nA huge thank you to Mark Foglietta for his distinguished service as CFO. Mark will transition to a senior advisory role, and we're grateful his expertise will remain a valuable asset to Titus.\nThese changes reinforce our commitment to building a strong, agile, and future-ready organization. We're proud of our team and excited for what's ahead! #TitusTransport #Leadership #Transportation #Logistics #SupplyChain #ExecutiveNews #Growth 65 13 Comments Like Comment Share Titus Transport reposted this Continental 1,861,563 followers 2mo Report this post When Melinda Tillman, Fleet Coordinator at Titus Transport, says, “TrukFix led to a remarkable average decrease of over $83 in overall spend per service call”, it speaks volumes. Titus Transport relies on Continental’s #TrukFix Emergency Roadside Assistance to ensure its fleet operates 24/7/365. The program’s intuitive, user-friendly interface makes case submission simple, even for those without a tire background. \n\nAccording to Melinda, the distinctive factor separating Continental from its competitors lies in the heightened visibility it provides over fleet operations.\n\nTrukFix, available to national account customers in the U.S. and Canada, is Continental’s emergency roadside assistance program, offering fast, reliable emergency breakdown support for tires and tire-related issues. Minimum downtime. Maximum convenience.\n\nFor more: https://ow.ly/A63k50Wj8ab #FleetManagement #SmartMobility View C2PA information 132 8 Comments Like Comment Share Titus Transport 1,326 followers 12mo Edited Report this post Recently Stephen Fowler , Vice President of Recruiting,  sat down for a Podcast With KJ Media to discuss Recruiting, Recognition, and Retention in the Transportation Industry. They discuss some keys to those three points. It ultimately leads to Respect as the determining factor in the success to those three keys . Enjoy and we welcome any feedback in the comments. KJ Media 1,214 followers 12mo 🎙  **New Episode Alert: Attention Retention Podcast** 🎙️\n\nIn this episode, Jackie McManus , CEO of KJ Media, sits down with Stephen Fowler , VP of Recruiting at Titus Transport , to unpack the strategies behind Titus Transport’s impressive 49% reduction in driver turnover. Fowler shares the company’s approach to maximizing recruitment efficiency through team training, KPI-driven development, and call monitoring. These methods ensure the recruitment process is streamlined and effective, helping Titus secure top talent in a competitive market.\n\nA major highlight of the conversation is how Titus achieved such a significant reduction in turnover. They cut turnover by nearly half by focusing on hiring quality candidates, improving information management, and enhancing overall driver satisfaction. This focus on quality over quantity has paid off, helping the company retain its drivers long-term.\n\n**Tune in now to uncover the secrets behind their success!** 🎧 https://lnkd.in/efjfazgn #AttentionRetention #DriverRecruitment #TruckingLeadership #RetentionStrategies #IndustryInsights Reduce Driver Turnover by 49%: Titus Transport’s Retention Secrets https://www.youtube.com/ 36 Like Comment Share Join now to see what you are missing Find people you know at Titus Transport Browse recommended jobs for you View all updates, news, and articles Join now Similar pages Giddy Up Inc. Truck Transportation Charlotte, North Carolina TITUS TRANSPORT HOLDINGS, LLC Freight and Package Transportation Denton, Texas OnLine Transport Truck Transportation Greenfield, IN Koch Companies Truck Transportation Golden Valley, Minnesota S & H TRANSPORTATION INC Truck Transportation DURHAM, North Carolina Schneider Truck Transportation Green Bay, WI Mk Trucking Transportation/Trucking/Railroad Pass Christian, Mississippi Titus Transport Ltd Transportation, Logistics, Supply Chain and Storage East Tamaki, Auckland Frontier Transport Truck Transportation McQueen Logistics Transportation, Logistics, Supply Chain and Storage Show more similar pages Show fewer similar pages Browse jobs Talent Agent jobs 34,094 open jobs Sales Specialist jobs 129,703 open jobs Director jobs 1,220,357 open jobs Manager jobs 1,880,925 open jobs Driver jobs 1,122,731 open jobs More searches More searches Asset Coordinator jobs Fleet Coordinator jobs Director of Operations jobs Food Director jobs Branch Manager jobs Director of Food And Beverage jobs Engineering Manager jobs Truck Driver jobs Coordinator jobs Director of Accounting jobs General Counsel jobs Director of Business Development jobs Financial Director jobs Director of Engineering jobs Marketing Director jobs President jobs Sales Specialist jobs Head jobs Director jobs Human Resources Director jobs Manager jobs Dispatcher jobs Driver jobs Account Manager jobs Transportation Manager jobs Fleet Manager jobs Teacher jobs Advisor jobs LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at Titus Transport Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://www.mallsinamerica.com/florida/titus-landing",
      "text": "Titus Landing - store list, hours, (location: Titusville, Florida) | Malls in America Enter search query ☰ Home Shopping malls Stores Locator & Map Your position: Malls in America > Florida > Titus Landing Titus Landing (location: Titusville, Florida) List of stores (29), shopping hours Name: Titus Landing Address: 2540 S Washington Ave, Titusville, FL - Florida 32780 ( map ) Coordinates: 28.5852231, -80.8028806 City & State: Titusville , Florida # of stores: 29 » Go to the store list Phone: 614 816 1417 Email: cmusselman@exxcel.com Web: https://tituslanding.com/ Content posted/updated by Lisa Thompson on 03/14/2023. Improve this listing, suggest edits about Titus Landing. Titus Landing rating: 2.3 /5 ( 45 %), 16 votes Write a review » Titus Landing details Titus Landing shopping information - stores in mall (29), detailed hours of operations, directions with map and GPS coordinates. Location: Titusville, Florida, 2540 S Washington Ave, Titusville, FL - Florida 32780. Black Friday and holiday hours. Look at selection of great stores located in Midtown plaza and read reviews from customers and write your own review about your visit at the mall. Don't miss rate the mall. Phone: 614 816 1417. Number of stores in Titus Landing: 29 Don't forget to write a review about visiting the Titus Landing. Titus Landing hours of operations Store hours may vary. Monday: 9:00 AM - 9:00 PM Tuesday: 9:00 AM - 9:00 PM Wednesday: 9:00 AM - 9:00 PM Thursday: 9:00 AM - 9:00 PM Friday: 9:00 AM - 9:00 PM Saturday: 9:00 AM - 9:00 PM Sunday: 9:00 AM - 8:00 PM Titus Landing location, map Directions to Titus Landing » Store directory and map of Titus Landing Open full size plan » Store list - Stores in Titus Landing Regular stores: AT&T BB&T Bealls Chipotle Mexican Grill Coldwell Banker Color Bar: A Kristen Decker Concept Salon Cosmic Creamery and Creations Down Home Christmas Shoppe Dunkin Donuts E-Smoker Online Vape Lounge Epic theatre Eye Doctor’s Optical Outlets Firehouse Subs Frankie’s Wings Hobby Lobby Le Crave Café Lee Spa & Nails Massage Envy Miracle City Harley-Davidson Motor Company Parrish Medical Center Pet Supermarket Pizza@ Titus Landing Rack Room Shoes Salsas Mexican Restaurant Simply Amazing Unique Boutique Tuesday Morning UBreak Ifix Ulta Wayback Burgers Outdated stores (closed): Panera Rue21 Write a review about Titus Landing Help shoppers and write review about your visit and shopping in Titus Landing. Don't miss rating of this shopping location! Review text (* required) Your name (* required) Share photos of Titus Landing: Upload review photos - drop files here or Your rating 4 stars We do not collect any personal information and we do not provide any of the information to third-party services. Read 4 reviews Kim Jason - Feb 19, 2022 In desperate need of a Homegoods & a TJ Max, that would really make it a destination mall! Savannah - Feb 13, 2022 I would love to see chickfila, chilis, Outback, Starbucks, home goods, etc. David Boyd - Nov 17, 2019 It would be awesome to see a guitar center or sam ash move in there. Lots of musicans in the area with no music supply store. Linda burgess - Nov 14, 2018 I like every store and restruant there we need a chic fil a badly Search USA malls near you: Search USA shopping malls near you: Search popular stores in America: Type store name: Do not miss Black Friday opening hours Shopping malls locator Dead malls in USA Best stores, shops and boutiques by alphabets: A B C D E F G H I J K L M N O P Q R S T U V W X Y Z All Malls by states: Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Puerto Rico Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming Contact us Help update our content Read our privacy policy Do Not Sell My Personal Information © Malls Online Information 2016 - 2025 To Top"
    },
    {
      "url": "https://foundationsforfreedom.net/References/NT/Others/Titus/Titus0/Titus_Introduction.html",
      "text": "Book of Titus : An Introduction, Map Outline and Purpose - The Living Commentary : Titus BFF Home About Us About Us Approach Beliefs Biography Contact us Donations Pray for us! Facebook-BFF Mission Biblical All Bible articles OT NT Life Truths All topics Discipleship Marriage articles Overcoming Anxiety Parenting Languages Translators Amharic Bengali Burmese Chichewa Chinese ä¸­æ India Bengali Hindi Oriya Telugu Luganda Spanish RSS Feed Store Store Tweet Knowing God: Experience & Love Him BFF is now on Facebook with interesting photos and resources! Please visit and join us in releasing God's powerful Word to our generation! Learn about the first steps of discipleship! Discover the power of God's Word! Find out where Christ leads us! Ten studies to get closer to God! Check out sales on purchases of BFF Digital Libraries! pdfs, powerpoints, audio/videos, handouts, more! Ten steps away from anxiety and closer to God! Includes study guide! Like what you see on BFF? Share your insights, comments, etc. now! Shaped into God's Community Book of Titus Living Commentary Series The Book of Titus: An Introduction, Map and Outline Paul J. Bucknell _________________________ Titus Outline | Titus Map Intro to Titus 1:1-4 | Titus 1:1 Calling | Titus 1:1-3 Mission | Titus 1:4 Training | Titus 1:1-4 Bible Study Questions Purpose Titus: An Introduction, Outline And Purpose serves as the introduction to the Book of Titus in The Living Commentary series. Several colored diagrams are included. Introduction to Titus âFor this reason I left you in Crete, that you might set in order what remains, and appoint elders in every city as I directed you\" (Titus 1:1-4). Introduction We might call ourselves the post-modern generation, a generation that is clever and knowledgeable. But we do not need to look far to find that this generation is, in fact, a very confused generation. One would think that with all this money, advanced training and specialists about that we would be more advanced, but it is not true. We agree we still have the war problem. The past generations could not eliminate that either. But how is it that we have allowed our society to be so confused as to deny what we beforehand would call the facts of life. Instead of esteeming love, beauty and faithfulness in areas like marriage, relationships and the arts, society now promotes hatred, violence, envy and unfaithfulness. Justice and courts have degenerated into influence control centers: you pay we decide. We would be fools, however, if we thought the problem was only out there, outside the church. The church has seemingly picked up the same problems. If we study the problem a bit closer, the confusion in the world is, in fact, accentuated by the confusion in the church. As the church goes, so goes the community. The church is the salt and light in the world. When the church tolerates immorality, then the society herds in that direction. When will the church learn and appreciate the power of the Gospel? We again desire the she becomes the precious and beautiful rather than the stained and worldly. Yes, we know that many people call themselves the church that is not the church at all. For them, it is only a religion. But even still, the church, the real church, has a mission and nothing could keep her back if she would only live by her calling. Why is it that segments of the church dare to lead the women from their families into the work place? Why is it that the church wants to push homosexuals into church leadership? Why is that church leaders condone and even encourage divorce as a choice of life? Whatever happened to morality and the holiness of marriage? The Apostle Paul foresaw at the end of his life a great tsunami of attacks coming against the church of God. He responded with three letters. We call them the Pastoral Epistles : 1 Timothy, 2 Timothy and Titus. After Paulâs first imprisonment, he was released. He visited different places including the island of Crete, an island only 160 miles long south of Greece and Turkey in the Mediterranean Sea. He wrote this letter to Titus around 62 A.D. from somewhere in Macedonia. Fortunately, Paul has clarified many questions regarding the place of the church in the midst of attack. If you have questions, Titus has an answer for many questions. But we must remember to ask the right questions. Sometimes, we look for answers that fit comfortably in with our lifestyles. If so, you might not be happy with the answers that you find. If the bottom line is that you want to find a church that is comfortable and fits with your standards, then you had better recognize that you are of the world. But if deep down, even though you are desperately struggling, you hope to know and please God, then you will find clear direction in this book. Even the most earnest Christian recognizes that he or she can be too affected by the world. Paul at some point had visited the island of Crete for he says in Titus 1:5 âI left you in Crete.â The church had sprung up just as it has in almost every city on this globe. God had been at work. The church grew up and informal churches started in the different cities across the island. But troubles developed. Jesus told the parable of the tares, âThe kingdom of heaven may be compared to a man who sowed good seed in his field. âBut while men were sleeping, his enemy came and sowed tares also among the wheat, and went awayâ (Matthew 13:24-25). Did you note when the enemy came and planted discord and confusion? It was when the men were sleeping. Evidently, some men were sleeping in this case too. I have come to realize that through Godâs promises we can have a wonderfully strong, church, family and individual lives. We can be effective serving. But if we let down our guard, trouble rushes in. Many of the troubles occur when we are sleeping, that is, not keeping our watch. The church at Crete faced special problems. Missionary tours are often too brief. As a result, solid churches are not established. Perhaps it was because people were not sufficiently familiar with the Word of God. It took a bit longer to raise up trusted leaders. In any case, we find Paul writing the letter of 1 Timothy to Timothy who was then stationed at Ephesus and Titus at Crete. Paulâs death was eminent. Within another year or so, he would write 2 Timothy and under Nero be martyred probably about 64 A.D. Most of BFF articles such as this one is nicely formatted for printing. Check out the great number of articles on the BFF Biblical Training Library all for one low cost . The special study Inductive Bible Study in Titus comes with student handouts in pdf and .doc to edit. A printed copy or download can be ordered. For Crete, however, it was time for godly leaders to be appointed. During the time of informal fellowship, Christians became prey to all sorts of self-appointed leaders and affected by their false teaching. When good leaders do not rise up, bad leaders will infiltrate and devastate the flock. Paul was exercising his apostleship by delegating Titus to appoint elders on his behalf. This letter, then, not only is a directive to Titus on how to âset the church in orderâ (verse 1:5) but also a public statement of Titusâ authority and a statement on how the church should conduct itself. In many ways, this message fits our times. Yes, we have good leaders. But as we think of the church in general, it is being chewed apart almost without even knowing it. The wolves have come in. They are picking off Christians who have made themselves separate from the church. So though there be leaders and a church body, many no longer think it important to be part of the local church. And there again, there are as many public pulpits, some of which are good and others wretched. When I was in India, I saw a Christian family watching one of these money-maker preachers. These false prophets undermine the care of the true caretakers of the flock. Discernment of these false shepherds cannot be gained because we do not know them but only hear their words. We all need the message here in this Book of Titus. We need a defining message for the church for it is from understanding who she is, that we can understand her mission. The letter is very cohesive and basically consists in advice from Paul to Titus. Key verbs mark off each chapter. Chapter 1 âset in order and appoint elders.â Chapter 2 âSpeak the things which are fitting for sound doctrine.â Chapter 3 âRemind them to be subject to rulers â¦ be ready for every good deed.â The key thought of this book, and the hope of the church is simply, âGood people do good deeds.â We need to choose good leaders to have good churches (chapter 1). We need to have godly people to be zealous for good deeds (chapter 2). We need to be reminded that our goodness comes from Christ and from that relationship grows many more good deeds (chapter 3). Of course, the opposite is true too and the church in Crete was facing a number of difficulties. They had ungodly leaders who were distorting the truth of the Gospel and creating havoc in the church. They had ungodly people who were living counter-Christian lives. They had no testimony. They had a general spirit of rebellion that, so to speak, disguised the power of the saving Gospel of Christ Jesus. Doesnât this sound much like our age? How sad. Fortunately, we have the advice from Paul to guide the church. In the outline below, please remember the original letter did not have chapters or verse numbers, but these are themes which are clearly seen as one section is compared with another. Purpose of Titus: Shaped into Godâs Community Every bride looks beautiful. But behind that veil is a woman that needs to be shaped into a woman with beautiful inner qualities. This is her life call. So it is with the bride of Christ. A calling doesnât bring all the glories of the church in a moment. She can grow. The difference is that now she belongs to Christ. God through Paul is calling the church to take significant strides closer to what she should be. Outline of Titus Shaped into Godâs Community (The Book of Titus) Three means God develops His people: A. Appoint Transformed Leaders (1:1-16) B. Cultivate Sanctified People (2:1-15) C. Teach Vibrant Gospel Truth (3:1-15) Paul affirms Titusâ authority to appoint godly leaders (Chapter 1) and instruct Godâs people in godly behavior (Chapter 2) so that they might gain a proper understanding of the gospel (Chapter 3) and as a result be a godly people who will be full of good deeds. In simpler words, we can say the purpose is to âCreate a godly people full of good deeds.â The challenge and application of Titus We have a great challenge before us. If we as Godâs people are faithful to what is said here in Titus, we will be greatly used of God to reshape the society about us. We will reflect Christâs glory more and more. As we see the glorious works of Christ worked through our lives, we will personal be enriched. This is the reason God has left this scripture for us. If we are faithful choosing right leaders, conform to Christâs calling for our lives and faithfully hold to the Gospel truths, we will see a host of good deeds coming from our lives much like the rays of the sun. Light will shine in a dark world. => Next: Titus 1:1-4 Introduction Other related articles from Biblical Foundations for Freedom : Detecting Error Inside and Outside the Church. Building a Great Marriage! More on Purpose and structure of Titus: Intro to Titus | Titus 3:9-15 Book of Titus: The Living Commentary Book of Titus Introduction | Titus Outline | Titus Map Titus 1:1a Calling | Titus 1:1-4 _Introduction | Titus 1:1-3 Calling | Titus 1:4 Training | Titus 1:1-4 Questions Titus 1:5-9 Introduction | Titus 1:5 Organization | Titus 1:5 Leadership | Titus 1:6-9 Standards | Titus 1:5-9 Questions Titus 2:1-2 Introduction | Titus 2:1 Beliefs | Titus 2:2 Lives | Titus 2:1-2 Questions Titus 3:01-4 Questions | Titus 3:09-15 Introduction | Titus 3:09-11 Conversation Titus 3:12-14 Relationships | Titus 3:15 Goodbyes | Titus 3:09-15 Questions _________________________ Book of Titus - Inductive Bible Training Study Questions Series Learn how to do inductive Bible Studies! Purchase here Titus Inductive Bible Study Questions: Introduction | Book study Study Questions: Titus 1:1-4 | Titus 1:5-9 | Titus 1:10-16 Titus 2:1-10 | Titus 2:11-15 | Titus 3:1-8 | Titus 3:9-15 BFF Homepage | Top | About us | Pray for us | BFF's Approach | BFF Store | BFF RSS | Topics | OT | NT Biblical Foundations for Freedom ( BFF ) Rev. Paul J. Bucknell Follow @PaulJBucknell info@foundationsforfreedom.net Scriptures  quoted from the New American Standard Bible unless noted (C) Copyright The Lockman Foundation 1988 Looking for Revival?"
    },
    {
      "url": "https://www.legistorm.com/person/bio/469390/Scott_D_Titus.html",
      "text": "Scott Titus - Previously held position: House Judiciary Committee (May 2023-Jan. 2025) \n            Rep. Jim Jordan (R-OH), Detailee - Biography | LegiStorm Home Solutions Industries Media Congress Government Relations Grassroots Advocacy Research Job Searching Products CongressStorm Overview Buy Staff Contact Lists Congress by the Numbers Find a Member Official Expenses Salaries Turnover Townhalls Premium Documents Buy Policy Reports Congressional Record Search Premium Earmarks (2008-2010) Financial Disclosures Foreign Gifts Pro Privately Funded Travel Pro LobbyStorm Overview New Filings Premium Client Search Premium Lobbyist Search Premium Revolving Door Premium Top Lobbying Firms Premium StateStorm Overview State Legislators Premium State Legislative Staff Premium State Executive Staff Premium StormFeed Congressional, Federal and State Press Releases Pro Pricing Resources News Caught Our Eye DevBlog Weekly Newsletters Subscriptions Mobile App Subscribe Now About About LegiStorm About Our Data LegiStorm in the News Media Kit Contact Claim Your Page Contact Us Call Us: 202-360-4172 Request Demo Start Free Login Forgot Password Don't have an account? Register now! Menu Search Account LegiStorm » Get LegiStorm App » Get LegiStorm Pro Free Demo Weekly Updates LegiStorm is constantly adding new information on the people, places and reports in our database. In the past week, LegiStorm added: 817 new people 101 new organizations 784 new photos 1961 job history records for people in our database 424 education records for people in our database 1770 contact addresses, emails and URLs (LinkedIn, Facebook, etc.) 5 new people through the revolving door 121 new policy reports 254 new trips to our privately funded travel database 49 new personal financial disclosures 18034 new press releases 17 new town halls 53 new hearings Caught Our Eye Rss Disclosures vary sharply for Bahrain, Saudi trip by Caleb Mynatt on 09/08/2025 Citigroup vet deposits expertise into finance committee by Sean McGlinn on 09/04/2025 GOP dominates alumni ranks of Top 25 football schools by Caleb Mynatt on 09/02/2025 Physicians' group prescribes lobbying for health policy by Sean McGlinn on 08/29/2025 Lobbyist swaps derivatives policy for House fintech job by Sean McGlinn on 08/28/2025 » More from Caught Our Eye Social Media Follow @LegiStorm DevBlog Rss LegiStorm adds House Q2 salaries and expenses 2025-09-04 Latest Senate salary and expense records published 2025-06-20 LegiStorm adds House Q1 salaries and expenses 2025-06-10 LegiStorm adds House Q4 salaries and expenses 2025-03-05 » More from our DevBlog Report inaccuracy on page Scott Titus Is this you? Claim this page to update your photo and bio info. Summary Salaries Disclosures Analytics Non-Salary Payments Trips Personal Finances Lobbying Lobbyist Overview Client Overview Registrant Overview LDA Filings FARA Filings Gifts StormFeed More … Less … Biographical Subscribers to LegiStorm Pro see biographical and contact information about Scott D. Titus, including gender. Click here to see more LegiStorm Pro benefits and subscribe, or log in to your Pro account. Employment History Subscribers to LegiStorm Pro see an employment history for Scott D. Titus. Any jobs we have listed will show up here for LegiStorm Pro subscribers. Click here to see more LegiStorm Pro benefits and subscribe, or log in to your Pro account. Congressional Salary Subscribers to LegiStorm Pro see the salary paid to congressional aide Scott D. Titus, graphed year by year to illuminate trends. Click here to see more LegiStorm Pro benefits and subscribe, or log in to your Pro account. Home About Us About Congressional Salaries Salaries FAQ Contact Us Privacy Policy Terms of Use Join Us © LegiStorm LegiStorm LLC 1025 Thomas Jefferson St. NW Suite 400 West Washington, DC 20007 (202) 360-4172 / congress@legistorm.com"
    }
  ]
}