{
  "fuentes": [
    {
      "url": "https://www.tobaccoroadfc.com/",
      "email": "info@tobaccoroadfc.com"
    },
    {
      "url": "https://www.st-group.com/about-us/management/executive-board/",
      "email": "info@st-group.com"
    },
    {
      "url": "https://tobaccoroadsac.com/contact-us/",
      "email": "info@tobaccoroadsac.com"
    },
    {
      "url": "https://tobaccoroadsearch.com/contact/",
      "email": "matt@tobaccoroadsearch.com"
    },
    {
      "url": "https://www.powertobaccoglobal.com/contactus.html",
      "email": "contact@power-tobacco.com"
    },
    {
      "url": "https://www.tobaccoroadfc.com/staff",
      "email": "info@tobaccoroadfc.com"
    },
    {
      "url": "https://tobaccoroadsac.com/about-us/",
      "email": "info@tobaccoroadsac.com"
    },
    {
      "url": "https://tobaccoroad.com/about",
      "email": "info@tobaccoroad.com"
    },
    {
      "url": "https://tobaccoroad.com/about",
      "email": "rank@organicspecialties.net"
    }
  ],
  "mails": [
    "contact@power-tobacco.com",
    "info@st-group.com",
    "info@tobaccoroad.com",
    "info@tobaccoroadfc.com",
    "info@tobaccoroadsac.com",
    "matt@tobaccoroadsearch.com",
    "rank@organicspecialties.net"
  ],
  "nombre_sitio": "tobacco-road.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.tobaccoroadfc.com/",
      "text": "Tobacco Road FC Cart 0 Home Tickets + Merch USL2 U20 USLA Academy NCASA Amatuer Back 2025 USL Academy Cup Registration Tickets + Merch Back 2025 Open Trial Bright Leaf Battalion Facilities 2025 Schedule 2024 Roster 2023 Roster 2023 Schedule 2020 Roster 2019 Roster 2018 Roster 2017 Roster Back 2025 Open Trial U19 Academy 2024 U19 Schedule Cart 0 Home Tickets + Merch 2025 USL Academy Cup Registration Tickets + Merch USL2 2025 Open Trial Bright Leaf Battalion Facilities 2025 Schedule 2024 Roster 2023 Roster 2023 Schedule 2020 Roster 2019 Roster 2018 Roster 2017 Roster U20 USLA Academy 2025 Open Trial U19 Academy 2024 U19 Schedule NCASA Amatuer From the Community. For the Community. Scroll A MESSAGE FROM THE FOUNDERS We are thrilled to have represented the bull city in semi-professional soccer for the past 10 seasons! Our team's mission is to achieve national success by promoting local rivalry and supporting local soccer, which is why we chose to name our club Tobacco Road FC. Our players consist of talented amateurs and elite collegians from the soccer-rich schools in our area, all sharing the same dream of playing soccer at the highest level. Our goal in creating this club was to wholeheartedly embrace the local identity of the bull city and to inspire local youth to strive for greatness while establishing a legacy that our community can truly rally behind. This team was created with a profound love for the game and embodies the true spirit of Durham. We truly believe in the potential of our city and in the power of local soccer. We will continue to work passionately to make TRFC a club that our community can proudly support and celebrate together. Our Story Tobacco Road FC has a rich history starting from the early 2000s as a grassroots organization. Originally known as Clockwork Orange and led by Drew Moss, our club quickly became a top destination for talented unsigned professionals and recent college graduates looking for elite competition. Over the years, our club has seen transitions in leadership, with Brad Acosta and later Jimmy Willman taking the helm and maintaining our standard of success. Under Willman's guidance, we secured a new sponsor and rebranded as Telepathic Graphics. Brian Wellman then took over as our technical leader and guided our club to dominate the North Carolina Adult Amateur State Cup. We also played friendly matches against local professional and collegiate teams to further elevate our game. Under the current leadership of Cedric Burke, we rebranded as Tobacco Road FC and established ourselves as a semi-professional franchise in the National Premier Soccer League (NPSL) in 2016. In our debut season, we had a successful run in the conference playoffs and narrowly missed out on a national quarterfinal appearance. Following that season, we were awarded a franchise in the United Soccer League's (USL) Premier Development League (PDL). Notably, UNC Chapel Hill alumni Zach Wright and Alan Winn became our club's first Major League Soccer (MLS) signees after our inaugural 2017 PDL campaign. In addition to competing in the PDL, we also maintain a reserve team in the Triangle Adult Soccer League (TASL), which is one of the largest amateur adult leagues in the country. Since our inception, we have won an impressive 18 out of 25 bi-annual 1st division league championships. At Tobacco Road FC, we are proud of our journey and committed to continuing our legacy of success and growth. USL2 - 2025 Season Schedule Follow us on Instagram! Coaching Staff Cedric Burke, sporting director & head coach Davis Boyle, assistant coach Matthew waldrop, Head of goalkeeping Jason Small, assistant coach Our Story Staff Tobacco road FC info@tobaccoroadfc.com Hours Follow Instagram Facebook Pinterest Use the Newsletter Block below to collect email addresses. Email Address Sign Up Thank you! Powered by Squarespace"
    },
    {
      "url": "https://www.st-group.com/about-us/management/executive-board/",
      "text": "Executive Board - Scandinavian Tobacco Group Go to content Cookies About us Facts and figures Sustainability Vision and strategy Reports and Documents Management Executive Board Board of Directors Our Brands Governance Our Tobacco Making of Tobacco History of Tobacco Investor Investor Portal News Shareholder information Outlook Financial calendar Annual General Meeting Debt Information Financial Reports Presentations Capital Markets Day 2023 Careers Contact Delivery Instructions Management Share LinkedIn Facebook Twitter Email Executive Board Executive Board Board of Directors Scandinavian Tobacco Group has a two-tier management structure consisting of the Board of Directors and the Executive Management. The two governing bodies are independent of one another and have no overlapping members. The Board of Directors appoints the CEO and other members of the Executive Management. The Executive Management prepares for the Board of Director’s approval and implements the Group’s overall strategy. The Executive Management is responsible for the day-to-day management of the business. The Executive Management, i.e. the formally registered management of the company, consists of the CEO and the CFO. The day-to-day operation of the company is managed by a wider group, namely the Executive Board. NIELS FREDERIKSEN CEO Read more MARIANNE RØRSLEV BOCK EXECUTIVE VICE PRESIDENT AND CFO Read more RÉGIS BROERSMA CHIEF COMMERCIAL OFFICER Read more YULIA LYUSINA SENIOR VICE PRESIDENT, STRATEGY , TRANSFORMATION & SUSTAINABILITY Read more Jesper Madsen CHIEF SUPPLY CHAIN OFFICER Read more Thomas Kolber Chief Human Resources Officer Read more NIELS FREDERIKSEN CEO Niels Frederiksen (1964) became CEO of Scandinavian Tobacco Group in March 2015 and has held various positions in the Group since 1999, including Senior Vice President and Executive Vice President. Niels is currently also the Chairman of the board of directors of Boman A/S. MARIANNE RØRSLEV BOCK EXECUTIVE VICE PRESIDENT AND CFO Marianne Rørslev Bock (1963) joined Scandinavian Tobacco Group in 2018 as Executive Vice President and Chief Financial Officer (CFO). Marianne Rørslev Bock joined the Group from a position as CFO of Brdr. Hartmann and has previously held various finance leadership positions in Danisco (1994-2012). Marianne is currently also Chairman of the board of directors of the Axel Muusfeldts Foundation and Axel Muusfeldts Fond Holding A/S, and Vice Chairman of the board of directors of the Danish Financial Supervisory Authority (Chairman of the Accounting Committee), and she is a member of the board of directors of Mahia 17 ApS, Dagrofa ApS (Chairman of the Audit Committee), as well as a member of the Danish Committee on Corporate Governance. RÉGIS BROERSMA CHIEF COMMERCIAL OFFICER Régis Broersma (1977) joined Scandinavian Tobacco Group in 2002 and has since held various positions in the Group including Managing Director of Scandinavian Tobacco Group Germany and President of General Cigar Co. Ltd. Régis became Senior Vice President of the North America Branded Business Division in 2018 and Senior Vice President of the Smoking Tobacco & Accessories Division in 2019. In April 2020, he became Senior Vice President of North America Branded and Rest of World (RoW) Division. In March 2024, Régis became Chief Commercial Officer for the Group's commercial organisation. YULIA LYUSINA SENIOR VICE PRESIDENT, STRATEGY , TRANSFORMATION & SUSTAINABILITY Yulia Lyusina (1986) joined Scandinavian Tobacco Group as Senior Vice President of Strategy, Transformation & Sustainability in 2019. Prior to this, Yulia has worked for 8 years in the Boston Consulting Group, and she has held different positions at other consulting and audit companies before that. Yulia is also a member of the Advisory Board of Unify Partners P/S. Jesper Madsen CHIEF SUPPLY CHAIN OFFICER Jesper Madsen (1975) joined Scandinavian Tobacco Group as Chief Supply Chain Officer in 2023. Prior to this, he spent more than seven years with Nilfisk A/S where he was Chief Operating Officer since 2017. Jesper has also held various leadership positions in operations in Nilfisk A/S, Royal Copenhagen A/S and GN Netcom A/S. Jesper is currently also a member of the board of directors of Toms Gruppen A/S and Gerda og Victor B. Strand Holding A/S. Thomas Kolber Chief Human Resources Officer Thomas Kolber (1971) joined Scandinavian Tobacco Group as Chief Human Resources Officer in 2024. Prior to joining STG, Thomas spent four years at Knauf Ceiling Solutions where he was Chief People and Change Officer since 2020. Thomas has also held various human resource leadership positions in organisations including Nets (a division of Nexi Group), Copenhagen Airports and Carlsberg Group. Thomas is also Managing Director of Martho ApS. Explore our must-win battles stories FROM ROUGH DIAMOND TO BUSINESS LEADER Read More A DISCIPLINED AND FOCUSED APPROACH TO M&A Read More SEEKING THE SINGLE TRUTH Read More INCREASING EFFICIENCY, TOGETHER Read More Company News Keep up with news and press releases from Scandinavian Tobacco Group by subscribing to our company announcements. Check out our latest news here SUBSCRIBE Quick Links Vision and strategy Governance STG Annual Report 2024 Get In Touch info@st-group.com Contact us © 2019 Scandinavian Tobacco Group A/S Privacy policy Confirm your age To view this website you must be at least 18 years old. I confirm that I am 18 years or older Proceed to website"
    },
    {
      "url": "https://tobaccoroadsac.com/contact-us/",
      "text": "Contact Us – Tobacco Road Sacramento Home Lounges Products Cigars Pipes Tobacco Accessories Events Sports on TV Monthly Specials Holiday Promotions Member Events Master Calendar About About Us Contact Us Find Us Connect With Us Gallery VIP Membership (916) 489-4590 Map To Tobacco Road info@tobaccoroadsac.com Home Lounges Products Cigars Pipes Tobacco Accessories Events Sports on TV Monthly Specials Holiday Promotions Member Events Master Calendar About About Us Contact Us Find Us Connect With Us Gallery VIP Membership GET IN TOUCH WITH US Please leave us a comment or question here: Please enable JavaScript in your browser to complete this form. Name * First Last Email * Comment or Question * Email Submit If you are at all unsatisfied with any Tobacco Road purchase or experience, please contact us directly and give us the opportunity to rectify the situation. The satisfaction of our customers is always our number one priority. Address: 2709 Marconi Avenue, Sacramento CA 95821 Phone number: (916) 489-4590 Email: info@tobaccoroadsac.com We are open: Mondays – Fridays: 11 AM – 8 PM Saturdays: 10 AM – 7 PM Sundays: 11 AM – 6 PM Please contact us to arrange a no-contact pickup. Find us on: We Proudly Accept Tobacco Road does not sell tobacco or tobacco-related products to anyone under the age of 21. Contact Us Questions? Feedback? Send us a message and we'll get back to you. Send Message CONTACT US Tobacco Road 2709 Marconi Avenue, Sacramento CA 95821 (916) 489-4590 info@tobaccoroadsac.com https://tobaccoroadsac.com FIND US CONNECT WITH US GALLERY © 2025 · Tobacco Road Sacramento · Privacy Policy Connect With Us GALLERY Type and press Enter to search"
    },
    {
      "url": "https://tobaccoroadsearch.com/contact/",
      "text": "Contact | Tobacco Road Search Submit Your Resume Home About US How We Work Job Openings Contact Contact Contact Us By Email CONTACT INFORMATION matt@tobaccoroadsearch.com (919) 749-8504 Apex, NC Sitemap Home Submit Your Resume About US Request Talent How We Work Job Openings Contact Twitter Widget Copyright 2017 © Tobacco Road Search. All Rights Reserved"
    },
    {
      "url": "https://www.powertobaccoglobal.com/contactus.html",
      "text": "Contact Us - Power Tobacco Co.，Ltd. 简体中文 English Home About Us Company Profile Our Advantage Video Our Brands Grandlead Skylead Cambodia Cigarette Asia Star Padrino Business OEM&ODM Cigar Cigarette Blog Company News Industry News FAQ Contact Us Home About Us Company Profile Our Advantage Video Our Brands Grandlead Skylead Cambodia Cigarette Asia Star Padrino Business OEM&ODM Cigar Cigarette Blog Company News Industry News FAQ Contact Us English 简体中文 English You are here: Home2 » Contact Us Contact us * Email Name * Message Submit * Verify Code Our Brands Grandlead Skylead Cambodia Cigarette Asia Star Padrino ABOUT US Company Profile Our Advantage Video BLOG Company News Industry News CONTACT US E-mail：contact@power-tobacco.com ADD : No.2777, National Road No.4, Ou Oknha Heng Village, Phumi Ou Oknha Heng Commune, Prey Nob District,  Preah Sihanouk Ville, The Kingdom of Cambodia Copyright © 2021 Power Cigar Tobacco Co. Ltd.All rights reserved"
    },
    {
      "url": "https://www.tobaccoroadfc.com/staff",
      "text": "Tobacco Road FC - Staff Cart 0 Home Tickets + Merch USL2 U20 USLA Academy NCASA Amatuer Back 2025 USL Academy Cup Registration Tickets + Merch Back 2025 Open Trial Bright Leaf Battalion Facilities 2025 Schedule 2024 Roster 2023 Roster 2023 Schedule 2020 Roster 2019 Roster 2018 Roster 2017 Roster Back 2025 Open Trial U19 Academy 2024 U19 Schedule Cart 0 Home Tickets + Merch 2025 USL Academy Cup Registration Tickets + Merch USL2 2025 Open Trial Bright Leaf Battalion Facilities 2025 Schedule 2024 Roster 2023 Roster 2023 Schedule 2020 Roster 2019 Roster 2018 Roster 2017 Roster U20 USLA Academy 2025 Open Trial U19 Academy 2024 U19 Schedule NCASA Amatuer From the Community. For the Community. Coaching Staff Cedric Burke, sporting director & head coach Davis Boyle, assistant coach Matthew waldrop, Head of goalkeeping Jason Small, assistant coach Tobacco road FC info@tobaccoroadfc.com Hours Follow Instagram Facebook Pinterest Use the Newsletter Block below to collect email addresses. Email Address Sign Up Thank you! Powered by Squarespace"
    },
    {
      "url": "https://tobaccoroadsac.com/about-us/",
      "text": "About Us – Tobacco Road Sacramento Home Lounges Products Cigars Pipes Tobacco Accessories Events Sports on TV Monthly Specials Holiday Promotions Member Events Master Calendar About About Us Contact Us Find Us Connect With Us Gallery VIP Membership (916) 489-4590 Map To Tobacco Road info@tobaccoroadsac.com Home Lounges Products Cigars Pipes Tobacco Accessories Events Sports on TV Monthly Specials Holiday Promotions Member Events Master Calendar About About Us Contact Us Find Us Connect With Us Gallery VIP Membership About Us Home About Us Our Story Tobacco Road Sacramento was established in 2000 with the aspiration of serving the greater Sacramento area with the widest variety of cigars, pipes, tobaccos and accessories in the region. After two moves, we have settled at our current location which boasts the area’s largest humidor, coziest smoking lounges and friendliest service. We encourage you to come visit us. Our Shop Tobacco Road Sacramento is currently located at 2709 Marconi Ave. , just south of Fulton Ave., in the Town & Country Village shopping center – near Trader Joe’s and Sprouts Market. Our main entrance faces Marconi Ave. and our building is surrounded by tons of free parking. We are proud to offer one of the largest and most desirable selections of cigars , pipes, tobacco and tobacco-related products anywhere in Northern California. Our Lounges We are also proud of our two spacious and comfortable TV/smoking lounges . The private lounge (in back) is exclusively reserved for Tobacco Road members and their guests. The main lounge (in front) is open to all customers and is the perfect spot to have an indoor smoke over a conversation with a friend (or one of our many friendly patrons), or over a game on TV, or over some reading on your mobile device, or over a beverage or bite to eat (there are many nearby options for to-go meals and snacks). We also have a soft drink refrigerator, a kitchen and restrooms (for customers only), excellent temperature control throughout the entire space and a state-of-the-art ventilation system. Whether you aren’t sure what you need, or you’re seeking something specific, or you want to learn more about the many options — our knowledgeable staff is standing by to welcome and assist you. The atmosphere is relaxed and welcoming. There’s often a game on. Our customers are pleasant. Our events are fun. We offer regular monthly specials and holiday promotions on all kinds of cigars, pipes and tobacco products. Come and see us at the biggest and best tobacco retailer and smoking lounge in the region. Contact Us Questions? Feedback? Send us a message and we'll get back to you. Send Message Tobacco Road Sacramento does not sell tobacco or tobacco-related products to anyone under the age of 21. CONTACT US Tobacco Road 2709 Marconi Avenue, Sacramento CA 95821 (916) 489-4590 info@tobaccoroadsac.com https://tobaccoroadsac.com FIND US CONNECT WITH US GALLERY © 2025 · Tobacco Road Sacramento · Privacy Policy Connect With Us GALLERY Type and press Enter to search"
    },
    {
      "url": "https://tobaccoroad.com/about",
      "text": "Tobacco Road: Your Source for Quality Tobacco Products | Tobacco Road Home About Products Leather Buckles Contact Videos Home About Products Leather Buckles Contact Videos UNIQUE LEATHERS SKILLED CRAFTING CONCIOUS DESIGNES SIGNATURE BUCKLS Shop Tobacco Road Quality Leather Accessories Hand Crafted In USA Since 1984 Why Our Products Are One Of A Kind Want to know why our customers are so happy with their purchase? Learn about what sets us apart from the rest.. Unique leathers Imitation is the best form of compliment, however when it comes to classic veg-tanned Leather, no modern process comes close. Click here to find out why... Learn More Skilled Crafting By respecting manufacturing traditions that require time tested machinery, quality raw materials and years of skill and talent, our products are one of a kind. Click here to find out why... Learn More Conscious Design Our products are built to look amazing for whatever you life style. Designed to be unique, highly functional and extremely durable, Built for a life time. Click here to find out why... Learn More Signature Buckles Our belt buckles are ethically sourced from Europe where pollution is strictly controlled, castings and finishing are perfect, and their designs are a one of a kind art form. Click here to find out why... Learn More F rom Boutiques to Online sales: The Rebirth of Tobacco Road's Timeless Craftsmanship Robert Currea, Tobacco Road founder I was born the son to a diplomat and the grandson of a shoe manufacture in Colombia. Growing up I resided in Miami and enjoyed restoring antique cars and fishing. Just after high school, my father became very ill and we moved back to Colombia. Upon his death I attended Florida International University, where I earned a dual bachelors degree in Finance and in International Business. To pay for my education, I continued to restore cars eventually selling them in Germany and importing them as well. This not only gave me the opportunity to travel extensively through out Europe, but on one of those trips, meeting a belt manufacturer in Madrid. I helped designee and learned to manufacture items in his factory that I would bring back on my trips to Miami. When they started selling well to local boutiques, I incorporated as Shovelle Inc. in 1982. I eventually expanded sales across the U.S. and Canada. With the decline of the dollar to Euro exchange rate, I had to start manufacturing my own products in Miami using American leather and only importing European buckles. Inspired by a local Miami bar, in 1984 I trademarked my line of American belts as Tobacco Road Belt Co. After attending multiple international trade shows the product line expanded to stores in Germany, France, New Zealand, Australia, Japan, Caribbean Islands, Venezuela and Colombia. In the late 80's many manufacturing brands started to move their production to China, but my trips there found nothing near the quality I was accustomed to delivering. So I remained committed to sourcing raw materials from Europe and continued to manufacture in Miami and continued using the traditional European techniques I had learned along the way. Despite fierce competition from these cheaper imports and synthetic lookalikes, I succeeded by focusing on delivering hand crafted quality, and selling primarily to boutique stores that valued our craftsmanship and unique leathers and buckles. By the early 2000s, I was selling to over 500 boutiques. I had chosen not to sell online during the DOT COM bubble, to avoid competing with my retailers who many were now good friends. However, after the 9/11 attacks and the 2008 financial crisis, these small mom and pop business faced devastating challenges.  A few couldn't pay past invoices and others could no longer afford my products. The final blow to my market came during the COVID-19 pandemic. Fortunately I had worked hard to eliminate debt in order to keep my business alive. Through private label work for a few customers  that had a strong on line presence I was able to cover overhead. However the Tobacco Road Belt line production came to a screeching halt. In 2023, I decided to focus entirely on rebuilding the Tobacco Road brand on line, focusing first on cigar cases. I offered a limited line of cigar cases on Etsy with amazing results. After reconnecting with suppliers I began offering a broader selection of leather textures and colors and added in a few belts. I will also eventually start selling to retailors as the market stabilizes. Meanwhile, your online purchases and feed back will most defiantly help shape the future of Tobacco Road. I appreciate your support as I work to recapture the brand's reputation and loyalty. Thank you for taking the time to read my story. Feel free to reach out if you have any questions or comments. Robert Currea Customer Reviews See what our customers are saying about Tobacco Road. Not only did Tobacco Road knock it out of the park on this order but they did on my last. I was so impressed... I canât say enough about the craftsmanship, speed and professionalism of this shop. Thanks again for a great buying experience. Ryan Mallary USA I highly recommend this shop! I purchased a cigar case for my father and I could not be happier with this one. It is beautifully crafted, sturdy, and perfect for travel. I had some concerns about shipping time, and Robert was kind and accommodating. It looks even better in person, canât wait to gift this! Sage USA âââââ âââââ Connect Get in touch for inquiries and support. Follow reach out info@tobaccoroad.com 305-266-6677 Enter your email address Submit your information now Â© 2025. All rights reserved. Powered by Organic Specialties www.organicspecialties.net"
    }
  ]
}