{
  "fuentes": [
    {
      "url": "https://sccgmanagement.com/partners/toms-watch-bar/",
      "email": "stephen.crystal@sccgmanagement.com"
    },
    {
      "url": "https://tomswatchbar.com/location/ilani/privacy/",
      "email": "asst@devongleason.com"
    },
    {
      "url": "https://tomswatchbar.com/location/ilani/privacy/",
      "email": "bfarris@sifpartners.com"
    },
    {
      "url": "https://tomswatchbar.com/location/ilani/privacy/",
      "email": "eduarda.ramos@motionprod.pt"
    },
    {
      "url": "https://tomswatchbar.com/location/ilani/privacy/",
      "email": "rafael.correia@motionprod.pt"
    },
    {
      "url": "https://tomswatchbar.com/press/oms-watch-bar-brings-elevated-sports-viewing-and-entertainment-experience-to-indianapolis/",
      "email": "asst@devongleason.com"
    },
    {
      "url": "https://tomswatchbar.com/press/oms-watch-bar-brings-elevated-sports-viewing-and-entertainment-experience-to-indianapolis/",
      "email": "bfarris@sifpartners.com"
    },
    {
      "url": "https://tomswatchbar.com/press/oms-watch-bar-brings-elevated-sports-viewing-and-entertainment-experience-to-indianapolis/",
      "email": "eduarda.ramos@motionprod.pt"
    },
    {
      "url": "https://tomswatchbar.com/press/oms-watch-bar-brings-elevated-sports-viewing-and-entertainment-experience-to-indianapolis/",
      "email": "rafael.correia@motionprod.pt"
    },
    {
      "url": "https://tomswatchbar.com/orlando/private-events/",
      "email": "asst@devongleason.com"
    },
    {
      "url": "https://tomswatchbar.com/orlando/private-events/",
      "email": "bfarris@sifpartners.com"
    },
    {
      "url": "https://tomswatchbar.com/orlando/private-events/",
      "email": "eduarda.ramos@motionprod.pt"
    },
    {
      "url": "https://tomswatchbar.com/orlando/private-events/",
      "email": "rafael.correia@motionprod.pt"
    },
    {
      "url": "https://tomswatchbar.com/privacy-policy/",
      "email": "asst@devongleason.com"
    },
    {
      "url": "https://tomswatchbar.com/privacy-policy/",
      "email": "bfarris@sifpartners.com"
    },
    {
      "url": "https://tomswatchbar.com/privacy-policy/",
      "email": "eduarda.ramos@motionprod.pt"
    },
    {
      "url": "https://tomswatchbar.com/privacy-policy/",
      "email": "rafael.correia@motionprod.pt"
    },
    {
      "url": "https://tomswatchbar.com/houston/",
      "email": "asst@devongleason.com"
    },
    {
      "url": "https://tomswatchbar.com/houston/",
      "email": "bfarris@sifpartners.com"
    },
    {
      "url": "https://tomswatchbar.com/houston/",
      "email": "eduarda.ramos@motionprod.pt"
    },
    {
      "url": "https://tomswatchbar.com/houston/",
      "email": "rafael.correia@motionprod.pt"
    },
    {
      "url": "https://tomswatchbar.com/los-angeles/",
      "email": "asst@devongleason.com"
    },
    {
      "url": "https://tomswatchbar.com/los-angeles/",
      "email": "bfarris@sifpartners.com"
    },
    {
      "url": "https://tomswatchbar.com/los-angeles/",
      "email": "eduarda.ramos@motionprod.pt"
    },
    {
      "url": "https://tomswatchbar.com/los-angeles/",
      "email": "rafael.correia@motionprod.pt"
    },
    {
      "url": "https://tomswatchbar.com/minneapolis/",
      "email": "asst@devongleason.com"
    },
    {
      "url": "https://tomswatchbar.com/minneapolis/",
      "email": "bfarris@sifpartners.com"
    },
    {
      "url": "https://tomswatchbar.com/minneapolis/",
      "email": "eduarda.ramos@motionprod.pt"
    },
    {
      "url": "https://tomswatchbar.com/minneapolis/",
      "email": "rafael.correia@motionprod.pt"
    },
    {
      "url": "https://tomswatchbar.com/national-harbor/private-events/",
      "email": "asst@devongleason.com"
    },
    {
      "url": "https://tomswatchbar.com/national-harbor/private-events/",
      "email": "bfarris@sifpartners.com"
    },
    {
      "url": "https://tomswatchbar.com/national-harbor/private-events/",
      "email": "eduarda.ramos@motionprod.pt"
    },
    {
      "url": "https://tomswatchbar.com/national-harbor/private-events/",
      "email": "rafael.correia@motionprod.pt"
    },
    {
      "url": "https://www.minneapolis.org/directory/toms-watch-bar/",
      "email": "info@minneapolis.org"
    },
    {
      "url": "https://tomswatchbar.com/location/denver-coors-field/covid-19-updates/",
      "email": "asst@devongleason.com"
    },
    {
      "url": "https://tomswatchbar.com/location/denver-coors-field/covid-19-updates/",
      "email": "bfarris@sifpartners.com"
    },
    {
      "url": "https://tomswatchbar.com/location/denver-coors-field/covid-19-updates/",
      "email": "eduarda.ramos@motionprod.pt"
    },
    {
      "url": "https://tomswatchbar.com/location/denver-coors-field/covid-19-updates/",
      "email": "rafael.correia@motionprod.pt"
    },
    {
      "url": "https://www.forbes.com/sites/garystern/2022/11/02/toms-watch-bar-finds-a-financial-partner-and-is-growing-rapidly/",
      "email": "corrections@forbes.com"
    },
    {
      "url": "https://www.forbes.com/sites/garystern/2022/11/02/toms-watch-bar-finds-a-financial-partner-and-is-growing-rapidly/",
      "email": "feedback@forbes.com"
    }
  ],
  "mails": [
    "asst@devongleason.com",
    "bfarris@sifpartners.com",
    "corrections@forbes.com",
    "eduarda.ramos@motionprod.pt",
    "feedback@forbes.com",
    "info@minneapolis.org",
    "rafael.correia@motionprod.pt",
    "stephen.crystal@sccgmanagement.com"
  ],
  "nombre_sitio": "tomswatchbar.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://sccgmanagement.com/partners/toms-watch-bar/",
      "text": "Discover The Exclusive TOMS Watch Bar Experience - SCCG Management Home Content About Us Our Services Partners Careers SCCG Research Contact Search Tom’s Watch Bar About TOMS Watch Bar TOMS Watch Bar is a unique bar, restaurant, and entertainment venue that showcases a curated selection of premium watches. Founded in 2016, TOMS has locations in Las Vegas, Chicago, and Miami, offering an upscale and immersive experience for watch enthusiasts and casual guests alike. Key Features and Qualities Full-Service Bar and Restaurant: TOMS Watch Bar features a fully-stocked bar with an extensive menu of craft cocktails, fine wines, and elevated bar fare. The food and beverage program is a key part of the TOMS experience. Luxury Watch Displays: While serving as a premium bar and restaurant, TOMS also features an impressive collection of over 1,000 watches from over 30 prestigious brands, including Rolex, Omega, Breitling, and more. Hospitality and Events: In addition to regular bar and dining operations, TOMS Watch Bar offers premium hospitality services such as bottle service, private events, and VIP experiences. The venue is well-suited for hosting a wide range of corporate and social gatherings. Knowledgeable Staff: The TOMS team consists of passionate watch enthusiasts and hospitality professionals who provide personalized attention and expertise to customers. Innovative Technology: TOMS leverages cutting-edge technology, including touchscreen watch displays and virtual try-on capabilities, to enhance the customer experience. Overall, TOMS Watch Bar stands out as a unique hybrid concept that seamlessly blends a luxury watch retail environment with an upscale bar, restaurant, and event venue. This innovative approach provides customers with an immersive and memorable hospitality experience. SCCG Management Announces Strategic Partnership with Tom’s Watch Bar to Enhance Retail Sports Bar Experiences in Tribal and Retail Casinos One-Pager Visit website Download PDF Contact person Stephen A. Crystal Founder & CEO Stephen.Crystal@sccgmanagement.com The Gambling Industry’s Global Connector Get in touch! Stephen A. Crystal Stephen.Crystal@sccgmanagement.com +1 (702) 427-9354 (mobile) +1 (725) 502-5033 (whatsapp) 105 E\n\t\t\t\tReno Ave. Suite 8, Las Vegas, NV 89119 Site map About Partners Content SCCG NextGen Contact us Services Follow Us Instagram Twitter LinkedIn Recognized by Design & development by"
    },
    {
      "url": "https://tomswatchbar.com/location/ilani/privacy/",
      "text": "Privacy Policy | Tom’s Watch Bar Skip to content Reserve Your Private Event Select a Location | Menu | Private Events | Fan Club | Press | Careers Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center Menu Private Events Fan Club Press Careers Select a Location Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center Privacy Policy admin 2025-06-03T20:03:58+00:00 TOM’S WATCH BAR – PRIVACY POLICY Welcome to Tom’s Watch Bar. This Privacy Policy explains how we collect, secure, use and disclose your Personal Information. By using our Site, you agree to this Privacy Policy. If you do not agree to the practices in this Privacy Policy or our Terms of Use, you may not use our Site. “Personal Information” is information that uniquely identifies you or can identify you by combining it with other data. It includes your name and email addresses, phone numbers, account numbers and other information associated with you. The legal name and definition of personal information differs from jurisdiction to jurisdiction. Information Collected from You We may collect Personal Information you provide directly to us, such as your name, postal address, email address, zip code, phone number, date of birth and dining preferences. We may also collect personal information about you when you sign up for a mailing list, a mobile app, provide information as part of a purchase or contact us through our email address or social media pages. We may collect your username, password, and other information if you register for an account or participate in a survey, rewards program, contest or promotion with us. We may collect financial account information and other payment information that you submit to us for order processing, using a third party vendor. We may collect geolocation information, if you are using a mobile application and you consent to this function on that mobile platform. When you visit our website, we collect your IP address and device ID. We collect other data that may not be Personal Information, such as your activity on the site, the websites you visited before and after our Site, and the type of device you used to access our site. If our Site links you to other websites or mobile applications, those websites and mobile applications do not operate under this Privacy Policy. You should examine the privacy policies posted on those other websites and mobile applications to understand their procedures for collecting, using, and disclosing personal information. Use of Your Information We collect your information to provide you with our products and services, improve customer service by understanding your preferences, analyze online behavior and administer our site more effectively, communicate promotions and services available from us and our affiliated companies, and provide you with the best possible customer experience. We also collect your information to respond to your inquiries or requests, post your comments or statements on message boards or in our online forums, create and deliver personalized promotions based on your purchases and other interactions with us, and send you communications about offerings from Tom’s Watch Bar and our affiliated companies. We use your information to improve our online services, including to perform data analysis, audits, fraud monitoring and prevention, identify usage trends, determine the effectiveness of our promotional campaigns, and to operate and expand our business activities. We use your information to provide you with services and products, including responding to inquiries, fulfilling orders and requests, providing catering, processing payments, providing support and troubleshooting, providing our rewards program and other promotions, and communicating with you. We may also use your information to assess inquiries and qualifications for potential employment or franchise-related opportunities. We may use your information for other purposes necessary to carry out our obligations under this Privacy Policy, our Terms of Use or the law, or for any other purposes with your consent. Sharing of Your Information We may share information, in the aggregate, regarding your online browsing preferences to evaluate our products or allow the third parties we work with to better serve our users. We will not share personally identifiable information in these instances, other than as described in this Privacy Policy. We may disclose your Personal Information for processing with our Service Providers pursuant to a written contract. These Service Providers will not sell or share the Personal Information; retain, use or disclose it for any other purpose; or combine it with Personal Information that the Service Provider receives from other sources. We do not share your information with third parties to directly market their products to you. We may provide user information to third-party service providers or vendors for purposes such as providing information technology services such as website hosting, computer systems maintenance, or data security and privacy services, initiating direct marketing programs on our behalf, processing payments, orders and deliveries, maintaining or developing our services, products and other contracted promotional opportunities we provide. We may share your information with law enforcement, investigators or others to identify, contact or bring legal action against one in violation of this Privacy Policy, our Terms of Use, or who may otherwise be causing injury to or interference with our rights or property, or those of our users, customers or others. We may share your information with our business successors, in the context of a merger, acquisition or other combination or sale of assets. In such transactions, confidential customer information generally is one of the transferred business assets. If you consent to receive marketing communications from third parties, we may, from time to time, share the information you provide to us with a few carefully selected third party marketing partners that we believe offer products or services that may be of interest to you. If you would like us to stop providing your information to our third-party marketing partners, you may opt-out by emailing us at telltom@tomswatchbar.com or sending a letter to 44 Cook Street, Suite 600, Denver, CO 80206. Opting Out of Marketing Communications If you no longer wish to receive ongoing marketing communications from us, unsubscribe as explained in the marketing communication itself, or by emailing “unsubscribe” in the subject line of an email to telltom@tomswatchbar.com or by writing us at: Tom’s Watch Bar Corporate Privacy, 44 Cook Street, Suite 600, Denver, CO 80206. Our text messaging is governed by our Terms and Conditions . You can cancel marketing (SMS) texts at any time by testing “STOP.” We will send you an SMS message to confirm that you have been unsubscribed. After this, you will no longer receive SMS messages from us. If you want to join again, just sign up as you did the first time and we will start sending SMS messages to you again. Also, there are “do not track” or similar browser choices available to internet users with respect to online web activity, but given the present lack of consensus of what constitutes an informed election, appropriate trigger or breadth of scope of such choice, our Site will not operate any differently when a “do not track” signal is received. Security Protections for Your Information We employ a variety of security measures, such as Secure Socket Layer (SSL) technology, firewalls, and internal policies, to protect against the loss, misuse or alteration of your Personal Information under our control. No data security system or method of transmission over the Internet is completely secure, however, and we cannot guarantee your Personal Information will be free from disclosure or misuse. We only keep your Personal Information for as long as it is necessary for the purposes set out in this privacy notice, unless a longer retention period is required or permitted by law (such as tax, accounting, or other legal requirements). When we have no ongoing legitimate business need to process your Personal Information, we will either delete or anonymize such information, or, if this is not possible (for example, because your Personal Information has been stored in backup archives), then we will securely store your Personal Information and isolate it from any further processing until deletion is possible. Data Movement You understand and agree that any information you submit may be stored in the United States. We may maintain the Personal Information it collects from you on computers located outside of your state, province, country, or other government jurisdiction where the data protection laws may differ from those from your jurisdiction. We process data, including Personal Information, in the United States. We do not transfer your Personal Information to another country without the existence of adequate security and privacy controls. We transfer Personal Information to the United States only with your consent or to perform a contract with you, and consistent with the practices described in this Privacy Policy. Cookies and Similar Technologies A part of offering personalized service, we sometimes use cookies to store and understand more information about you. A cookie is a small amount of data that is sent to your browser from a Web server and stored on your computer’s hard drive. As text files, the cookies cannot read information on your hard drive, run programs or deliver viruses to your computer. We may use cookies, tags or similar items to allow faster and easier access to your information and to monitor traffic on the site and measure traffic patterns to improve functionality. We may also use cookies when you select products such as gift cards, place them in an online shopping cart, and purchase them, to keep a record of your browsing activity and purchase. Session cookies are stored on the user’s hard drive temporarily and are deleted when the user ends the browsing session. Session cookies are useful for things like keepings item in a shopping cart while the user continues to browse. Persistent cookies stay on the user’s hard drive until they expire, even after the browser is closed. Persistent cookies are useful for remembering things like login information. In addition, we use the following types of cookies: “Essential” cookies are necessary for moving around and using our Site. Essential cookies do not gather information about you for marketing purposes and do not remember where you have been on the internet. You cannot disable essential cookies. “Functional” cookies remember your choices, settings, or preferences from one visit to the next, and changes you have made to customizable areas of the Site. “Analytics” cookies collect information about your use of our Site, including which pages you visit, and whether you experience any errors, so we can improve your experience on our Site. “Targeting” cookies automatically collect information such as Internet Protocol (IP) addresses, browser type and language, Internet service provider (ISP), referring and exit websites and applications, operating system, date/time stamp, and other information designed to customize your experience on our and other sites. We may share this information with Google. We use Cookies and other technologies, such as pixels, web beacons, and clear GIF files, to help manage our online advertising program. These technologies may enable us (or third-party advertising services with whom we work) to learn which advertisements bring users to the Tom’s Watch Bar Online Services. They may also help track your actions online over time and across different web sites or platforms to measure statistics of our marketing efforts, and to deliver electronic advertisements that may be more relevant to individual consumers and that will improve the consumer experience. For information about how tracking works for online advertising purposes, visit https://www.aboutads.info/choices . We permit third-party analytics companies, such as Google Analytics, to store cookies on your computer to provide us with insight into traffic sources, to better understand our visitors and to tailor content to you. These third-party vendors may also display our advertisements on other websites based on your internet usage. You can opt-out of Google Analytics for Display Advertising by using Google’s Ads Settings. Some web browsers and mobile applications include a Do Not Track feature or setting you can activate to indicate your desire not to have your online browsing activities monitored and collected. At present, given the lack of uniformity for these features, our website does not respond to such signals. Collecting Information from Children Our Site and systems are not designed for children, and we do not knowingly collect information from any person under the age of 21. If we learn that such a child has provided us with Personally Information, we will immediately delete it. If you learn that a child has provided us with Personal Information, the parent or guardian should contact us at telltom@tomswatchbar.com and we will immediately delete it. Your California Privacy Rights If you are a California resident, you have certain rights under California Consumer Privacy Act (CCPA) and other data protection laws, including: the right to “opt-out” of our sale of your Personal Information to any third parties; the right to request us to stop sharing your Personal Information to third parties; the right to know what Personal Information we have collected about you and how we use and share it; the right, with some exceptions, to have your Personal Information deleted from our possession or control; the right to correct inaccuracies in your Personal Information; and the right to receive equal service and pricing from us even if you exercise any of your privacy rights. You may submit requests for access or erasure of your personal information by calling toll-free (within the U.S. only) by emailing telltom@tomswatchbar.com . If you submit a request for access or erasure of personal information, you will be required to verify your identity by answering certain questions. If you act through an authorized agent, we may seek confirmation that the individual is acting on your behalf. We will not disclose or delete any information until your identity is verified. If you or your authorized agent are making a request for erasure, we will ask you to confirm again that you want us to delete your personal information before processing your deletion request. Our response to a request is at no cost to you. We endeavor to respond to a verifiable consumer request within forty-five (45) days of its receipt. If we require more time, we will inform you of the reason and extension period in writing. Under the California “Shine the Light” law, California residents may request information about our disclosures of certain categories of personal data to third parties (i.e., our affiliates) for such third parties’ direct marketing purpose, by emailing telltom@tomswatchbar.com or writing to: Tom’s Watch Bar Corporate Privacy, Attn: California Privacy Rights, 44 Cook Street, Suite 600, Denver, CO 80206. If you are under 18 years old, a California resident, and a registered user of any Site where this policy is posted, California Business and Professions Code Section 22581 permits you to request and obtain removal of content or information you have publicly posted. To make such a request, please send an email with a detailed description of the specific content or information to telltom@tomswatchbar.com . Your request does not ensure complete or comprehensive removal of what you have posted and the law may not require or allow removal even if requested. For information about the categories, sources and recipients of Personal Information we collected over the last 12 months, click here or scroll to the bottom of this Privacy Policy. Contact Us If you have any questions about this Privacy Policy, please contact us at telltom@tomswatchbar.com . You can also write to us at Tom’s Watch Bar Corporate Offices, Attn: Terms of Use, 44 Cook Street, Suite 600, Denver, CO 80206. Last modified: March 8, 2024 LINKED CALIFORNIA DISCLOSURE: We have collected the following categories of Personal Information in the past twelve (12) months Categories of Personal Information Category Examples Collected A. Identifiers Contact details, such as real name, alias, postal address, telephone or mobile contact number, unique personal identifier, online identifier, Internet Protocol address, email address, and account name YES B. Personal information categories listed in the California Customer Records statute Name, contact information, education, employment, employment history, and financial information YES C. Protected classification characteristics under California or federal law Gender and date of birth YES D. Commercial information Transaction information, purchase history, financial details, and payment information YES E. Biometric information Fingerprints and voiceprints NO F. Internet or other similar network activity Browsing history, search history, online behavior, interest data, and interactions with our and other websites, applications, systems, and advertisements YES G. Geolocation data Device location YES H. Audio, electronic, visual, thermal, olfactory, or similar information Images and audio, video or call recordings created in connection with our business activities NO I. Professional or employment-related information Business contact details in order to provide you our services at a business level or job title, work history, and professional qualifications if you apply for a job with us NO J. Education Information Student records and directory information NO K. Inferences drawn from other Personal Information Inferences drawn from any of the collected Personal Information listed above to create a profile or summary about, for example, an individual’s preferences and characteristics YES We may also collect other Personal Information outside of these categories instances where you interact with us in person, online, or by phone or mail in the context of receiving help through our customer support channels; participation in customer surveys or contests; and facilitation in the delivery of our Services and to respond to your inquiries. Sources of Personal Information From you directly (such as when you make a purchase, participate in or register for promotions, offers, programs, contests or sweepstakes, or communicate with us): Identifiers; Personal information categories listed in the California Customer Records statute; Protected Classifications; Commercial Information; Online Activity; Sensory Information; Employment Information; and Inferences. From your devices (such as when you browse or use our website): Identifiers; Commercial Information; Online Activity; Geolocation Data; Sensory Information; and Inferences. From your family or friends (such as when they contact us on your behalf, or refer you for one of our contests, sweepstakes or other participatory events): Identifiers; Protected Classifications; Commercial Information; Employment Information; and Inferences. From our affiliated companies: Identifiers; Personal information categories listed in the California Customer Records statute; Protected Classifications; Commercial Information; Online Activity; Geolocation Data; Sensory Information; Employment Information; and Inferences. From vendors who provide services on our behalf: Identifiers; Personal information categories listed in the California Customer Records statute; Protected Classifications; Commercial Information; Online Activity; Geolocation Data; Sensory Information; Employment Information; and Inferences. From our business partners (such as our licensees, franchisees and promotional partners): Identifiers; Personal information categories listed in the California Customer Records statute; Protected Classifications; Commercial Information; Online Activity; Geolocation Data; Sensory Information; Employment Information; and Inferences. From social networking services: Identifiers; Protected Classifications; Commercial Information; Online Activity; Geolocation Data; Sensory Information; Employment Information; and Inferences. From online advertising technology companies: Identifiers; Protected Classifications; Commercial Information; Online Activity; Geolocation Data; Sensory Information; Employment Information; and Inferences. From government entities: Identifiers; Personal information categories listed in the California Customer Records statute; Protected Classifications; Commercial Information; Online Activity; Geolocation Data; Sensory Information; Employment Information; and Inferences. From data aggregators and consumer data resellers: Identifiers; Protected Classifications; Commercial Information; Online Activity; Geolocation Data; Sensory Information; Employment Information; and Inferences. From public databases: Identifiers; Protected Classifications; Commercial Information; Online Activity; Geolocation Data; Sensory Information; Employment Information; and Inferences. Sharing of Personal Information Tom’s Watch Bar has not disclosed or sold any Personal Information to third parties for a business or commercial purpose in the preceding twelve (12) months. We will not sell Personal Information in the future belonging to website visitors, users, and other consumers. Toggle Navigation Cincinnati Denver Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Pittsburgh Sacramento San Diego Petco Park Seattle ©2024 Tom’s Watch Bar . All right reserved. Privacy Policy | Terms & Conditions × Choose your location Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center Page load link Go to Top"
    },
    {
      "url": "https://tomswatchbar.com/press/oms-watch-bar-brings-elevated-sports-viewing-and-entertainment-experience-to-indianapolis/",
      "text": "Tom’s Watch Bar Brings Elevated Sports Viewing and Entertainment Experience to Indianapolis – Tom's Watch Bar Skip to content Reserve Your Private Event Select a Location | Menu | Private Events | Fan Club | Press | Careers Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center Menu Private Events Fan Club Press Careers Select a Location Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center Tom’s Watch Bar Brings Elevated Sports Viewing and Entertainment Experience to Indianapolis Yahoo! Finance Tom’s Watch Bar Brings Elevated Sports Viewing and Entertainment Experience to Indianapolis December 2, 2024 LINK Tom’s Watch Bar, the rapidly expanding premier venue for sports viewing and entertainment, today announced the opening of its newest location in the heart of downtown Indianapolis. Located at 140 S. Illinois Street, steps away from Lucas Oil Stadium and Gainbridge Fieldhouse, the 10,000-square-foot venue is the 13th location for the Company as it continues its rapid expansion to deliver a unique game day experience to sports fans across the country. Tom’s Watch Bar continues to transform the sports-dining concept, taking an innovative approach to create a high-energy atmosphere with upscale menu items that replicates the excitement of being at a live stadium. Amid a period of robust real estate activity in the city of Indianapolis, Tom’s Watch Bar is proud to be part of efforts to revitalize the downtown area, opening its doors and offering a centralized spot for local and visiting fans to cheer on their favorite sports teams and professional athletes. Capitalizing on sports’ growing entertainment landscape, Tom’s Watch Bar delivers an exceptional experience that serves the increasing demand from sports fans, driven by fantasy leagues, sports betting, and expanding sports categories, particularly for women’s sports, including the WNBA. Its state-of-the-art audio-visual systems and customized sound technology ensure fans never miss a moment as leagues continue to expand their event days and engagement opportunities. “We are thrilled to open the doors of Tom’s Watch Bar in such an iconic sports town as Indianapolis, a perfect place for our unique approach to viewing and experiencing the excitement of game day,” said Brooks Schaden, Co-CEO of Tom’s Watch Bar. “Our mission is to deliver an exceptional experience for our guests, replicating and rivaling in-person live games, from the camaraderie and competition felt across the venue to the incredible service and atmosphere delivered by our team members. Our innovative approach combines premium viewing technology with an elevated food and beverage program, creating an immersive atmosphere that appeals to both die-hard sports fans and casual viewers alike.” At the core of Tom’s Watch Bar’s appeal is its immersive 360-degree viewing technology, featuring a central oversized “stadium” screen surrounded by 135 HD displays. The venue’s audio system allows fans to tune into their preferred games, ensuring they never miss a moment of action. This addition to the Indianapolis sports scene comes at a time when sports consumption is at an all-time high, with digital viewership projected to reach 90 million Americans by 2025. The Indianapolis Tom’s Watch Bar features the biggest bar in Indiana. The venue includes operable windows that open to a large patio, perfect for enjoying the atmosphere of downtown Indianapolis. Guests can enjoy signature menu items, including Tom’s Famous Prime Rib Dip, Poke Bowls and Pickle Brined Crispy Chicken, served through a unique service model that delivers food hot in under eight minutes and beverages cold in under three minutes. Beyond its everyday sports viewing experience, Tom’s Watch Bar Indianapolis also delivers a unique private event venue. Offering flexible seating arrangements, the space can accommodate groups of varying sizes, from intimate team gatherings to full-venue buyouts. Alumnae groups and loyal sports enthusiasts are regulars for viewing parties at Tom’s Watch Bar. For more information about Tom’s Watch Bar Indianapolis or to make reservations for upcoming events, visit www.tomswatchbar.com. By coderprojahangir@gmail.com | 2025-05-08T23:14:03+00:00 February 19, 2025 | Share This Story, Choose Your Platform! Facebook X Reddit LinkedIn WhatsApp Telegram Tumblr Pinterest Vk Xing Email Toggle Navigation Cincinnati Denver Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Pittsburgh Sacramento San Diego Petco Park Seattle ©2024 Tom’s Watch Bar . All right reserved. Privacy Policy | Terms & Conditions × Choose your location Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center Page load link Go to Top"
    },
    {
      "url": "https://tomswatchbar.com/orlando/private-events/",
      "text": "Best Private Event Venue in Orlando | Tom's Watch Bar Skip to content 8050 International Drive, Suite 1000 Orlando, FL 32819 Reserve Your Private Event Orlando | Menu | Private Events | Fan Club | Press | Careers Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center Menu Private Events Fan Club Press Careers ORLANDO 8050 International Drive, Suite 1000\nOrlando, FL 32819 407-308-0602 GET DIRECTIONS Location Info Change Location × Choose your location Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center Private Events admin 2025-09-10T17:12:54+00:00 Orlando’s Best Private Event Venue Whether You Know Exactly What You Want or Need Help Crafting the Details, Our Professional Event Planners Will Work With You to Create a Fully Customized Experience. Let Us Help You Create Something Extraordinary RESERVE YOUR EVENT Your event is easy as 1, 2, 3 Select your space Find the perfect area to match your event size and vibe. Build your perfect menu Craft a food and drink lineup your guests will love. Customize your experience Tailor the décor, layout, and extras to fit your vision. Select your space Find the perfect area to match your event size and vibe. Build your perfect menu Craft a food and drink lineup your guests will love. Customize your experience Tailor the décor, layout, and extras to fit your vision. Select Your Space in the Heart of Orlando Choose from a variety of flexible spaces designed to host events of any size. Whether you’re planning a corporate gathering after a convention at the Orange County Convention Center or a lively watch party before the game at Amway Center, we’ll help you find the perfect setting to match your vibe in downtown Orlando. Venue Specifications Venue Capacity 490 seated, 600 reception AV 130 CUstomizable Televisions, Wireless Microphones, Sound System Highlights Rooftop Bar and Restaurant in the heart of International Drive and 2.5 miles from the Convention Center 360 Room Seated: 128 Reception: 200 Center Field Left Seated: 96 Reception: 150 Center Field Right Seated: 74 Reception: 150 Center Field Upper View Exterior Exterior 2 Exterior 3 Full Swing Suites Interior Mezzanine Seated: 120 Reception: 150 Outfield Patio Seated: 106 Reception: 125 Patio 2 Room and Entrance Room and Stairs Upper View Room Build your perfect menu A Custom Menu, Just the Way You Want It In Orlando From Tom’s Famous Favorites to Custom Sushi Stations and everything in between, we’ll help you craft a menu that perfectly fits your event. Whether you’re planning a buffet, chef-attended stations, passed appetizers, or plated meals, our team delivers some of the best event catering in Orlando. Pair it all with signature cocktails or custom-crafted drinks—think citrus-infused spritzes, tropical rum blends, and other Orlando-inspired favorites—designed just for your group. No matter the style, no matter the flavor—your perfect menu starts here. Dietary Options Available Vegetarian Vegan Gluten-Free Customize your experience Make the event your own, right near Orlando’s SoDo District. From personalized décor and custom seating layouts to A/V setups and special touches, our event specialists will help tailor every detail to reflect your unique style and purpose. casino poker table Light Up Ping Pong Table djs & live music margarita bar tequila tasting gelato bar popup casino poker table Light Up Ping Pong Table djs & live music margarita bar tequila tasting gelato bar popup Let’s Celebrate Together Celebrate life’s biggest moments with your loved ones in an exciting, high-energy setting—where unforgettable memories are made for the events that matter most. Bachelor & Bachelorette Parties Learn More Rehearsal Dinners & Welcome Parties Learn More Weddings Learn More Graduation Parties Learn More Bar Mitzvah's Learn More Bachelor & Bachelorette Parties Learn More Weddings Learn More Rehearsal Dinners & Welcome Parties Learn More Graduation Parties Learn More Bar Mitzvahs Learn More Reserve your important date Your Orlando Event Planner, Every Step of the Way Whether you’re organizing a private celebration near I‑Drive or a corporate gathering after the Orange County Convention Center, our local event specialists are here to help with every detail. Schedule a 30-minute consultation to start planning with confidence. Anne Marie Case Vice President Event Sales 407.724.2711 acase@tomswatchbar.com Orlando’s Venue For Every Occasion From Corporate Gatherings to Orlando Celebrations and Private Watch Parties, we’re ready to host your event with configurable indoor and outdoor spaces offering beautiful views of Orlando’s skyline. Orlando Corporate Events Orlando Networking Event Venue Sports Events Conference & Workshop Venue in Orlando Best Place to Host Social Gatherings Orlando Corporate Events Orlando Corporate Events Host a productive and memorable corporate event just off International Drive, perfect for company holiday parties, team building, client presentations, and team meetings. With state-of-the-art A/V technology, customizable event spaces, and chef-driven menus, we create a professional yet fun atmosphere for your group. Our experienced event planners will tailor every detail to help you achieve your business goals with ease. Orlando Networking Event Venue Orlando Networking Event Venue Create meaningful connections right in the heart of Orlando. Our flexible event spaces and high-energy atmosphere are ideal for networking mixers, industry meetups, and professional gatherings near W Sand Lake Rd, Creative Village, and Downtown Orlando. With customizable layouts and Orlando-inspired craft cocktails, your event will feel effortless, engaging, and uniquely local. Sports Events Sports Event Take your sports viewing to the next level—Orlando style. Whether you’re planning a fantasy football draft, a college game day watch party, or an alumni gathering for UCF, Rollins, or Valencia fans, our immersive A/V setup and flexible spaces deliver an unforgettable experience. From football Sundays to rivalry weekends, bring your crew together and cheer on your team just minutes from W Sand Lake Rd and I‑Drive. Conference & Workshop Venue in Orlando Conference & Workshop Venue in Orlando Host your next conference event or workshop in a space that blends professionalism with Orlando energy. Located near top venues like the Orange County Convention Center and major hotels such as the Hyatt Regency Orlando, Rosen Centre, and Hilton Orlando, our venue offers high-tech A/V systems, customizable layouts, and chef-driven menus. Whether it’s a breakout session, post-conference mixer, or private workshop, Tom’s Watch Bar ensures your event is engaging, seamless, and successful. Best Place to Host Social Gatherings Best Place to Host Social Gatherings Celebrate life’s big moments in the heart of Orlando. Whether you’re hosting a birthday bash, wedding after-party, fantasy football draft, or private watch party, our versatile spaces and immersive viewing experience set the vibe. Located near Orlando’s trendiest districts like Ivanhoe Village, Mills 50, and Creative Village, we’re a go-to destination for social groups, alumni clubs, and locals looking to make their next gathering unforgettable. Private Event FAQs – Where can I host a private event in Orlando? Tom’s Watch Bar in Orlando offers the perfect venue for a wide range of private events, from corporate gatherings and networking mixers to sports watch parties, professional conferences, birthday celebrations, weddings, and holiday parties. Located near popular destinations like International Drive and the Orange County Convention Center, our flexible event spaces can accommodate groups of all sizes and styles. With tailored services, customizable menus, and state-of-the-art A/V capabilities, Tom’s Watch Bar ensures your private event is both memorable and effortless to plan. + How far in advance should I book my event? For the best availability at our Orlando location—especially during busy times like holiday seasons, major sports events at the Amway Center, or conventions at the Orange County Convention Center—we recommend booking as early as possible. Our dedicated private event planner is here to help you check availability and secure your date, ensuring your event is seamless and memorable. + Which Orlando venues have outdoor spaces for private events? Tom’s Watch Bar in Orlando features multiple patios that are perfect for private events, offering a refreshing outdoor experience. Enjoy great views of the Orlando skyline and stunning sunsets while hosting your gathering in a vibrant yet comfortable setting. Our outdoor spaces are ideal for everything from casual celebrations to professional mixers, making your event truly memorable. + What are popular venues for networking events in Orlando? When it comes to networking events in Orlando, Tom’s Watch Bar stands out as the premier venue. With its flexible event spaces, vibrant atmosphere, and customizable layouts, it’s the ideal spot for mixers, industry meetups, and professional gatherings. Located near key areas like Creative Village and downtown Orlando, Tom’s Watch Bar offers a great combination of local flavor, craft cocktails, and state-of-the-art amenities to ensure your networking event is both productive and unforgettable. + How much does it cost to rent a private event space in Orlando? The cost to rent a private event space in Orlando varies depending on your event size, space selection, and specific needs. At Tom’s Watch Bar, we offer multiple flexible spaces and customizable packages designed to fit a variety of budgets. Our private event planner is ready to work with you to tailor the perfect setup and menu that aligns with your vision and budget. Contact us today to discuss your event details and get a personalized quote. + Where can I host my company holiday party in Orlando? Tom’s Watch Bar is one of the best venues in Orlando to host your company holiday party. Conveniently located near W Sand Lake Road, International Drive, and Kirkman Road, we offer flexible event spaces customizable for groups of all sizes. Enjoy premium food options—from chef-driven menus to custom sushi stations—paired perfectly with craft cocktails. Plus, elevate your celebration with live music or DJ options to keep the energy high. Whether you’re planning a festive cocktail party, sit-down dinner, or lively holiday celebration, our private event planners will help design an unforgettable experience tailored to your company’s style. + What parking and transportation options are available for our guests? Guests attending events at Tom’s Watch Bar in Orlando will find convenient parking options nearby. There is a dedicated parking lot on-site, plus ample street parking available along W Sand Lake Road and International Drive. Valet parking services may also be offered for larger events—check with our event team for availability. For those using public transportation, several Lynx bus routes serve the area, making it easy to reach the venue. Rideshare services like Uber and Lyft are widely available and offer a quick, hassle-free option for arriving and departing from the venue. + Where can I host a hybrid or virtual event in Orlando? Tom’s Watch Bar is the perfect venue in Orlando for hybrid or virtual events. Whether you’re hosting a fantasy football draft with friends across the country or coordinating a corporate event connecting multiple locations and satellite offices, our advanced live-streaming capabilities and flexible event spaces create a seamless, integrated experience. Our expert A/V team ensures every participant—near or remote—feels fully engaged and part of the event. TOM'S WATCH BAR Orlando Location 8050 International Drive, Suite 1000 Orlando, FL 32819 407-308-0602 Monday - 4:00 pm - 12:00 am Tuesday - 4:00 pm - 12:00 am Wednesday - 4:00 pm - 12:00 am Thursday - 4:00 pm - 12:00 am Friday - 11:00 am - 12:00 am Saturday - 11:00 am - 12:00 am Sunday - 11:00 am - 12:00 am GET DIRECTIONS Toggle Navigation Cincinnati Denver Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Pittsburgh Sacramento San Diego Petco Park Seattle ©2024 Tom’s Watch Bar . All right reserved. Privacy Policy | Terms & Conditions Page load link There’s no better place to watch every game than Tom’s Watch Bar. 360° viewing • Electric game day atmosphere   locations nationwide • Private & semi-private spaces Elevated watch party experience RESERVE NOW Go to Top"
    },
    {
      "url": "https://tomswatchbar.com/privacy-policy/",
      "text": "Privacy Policy | Tom’s Watch Bar Skip to content Reserve Your Private Event Select a Location | Menu | Private Events | Fan Club | Press | Careers Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center Menu Private Events Fan Club Press Careers Select a Location Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center Privacy Policy admin 2025-06-03T20:03:58+00:00 TOM’S WATCH BAR – PRIVACY POLICY Welcome to Tom’s Watch Bar. This Privacy Policy explains how we collect, secure, use and disclose your Personal Information. By using our Site, you agree to this Privacy Policy. If you do not agree to the practices in this Privacy Policy or our Terms of Use, you may not use our Site. “Personal Information” is information that uniquely identifies you or can identify you by combining it with other data. It includes your name and email addresses, phone numbers, account numbers and other information associated with you. The legal name and definition of personal information differs from jurisdiction to jurisdiction. Information Collected from You We may collect Personal Information you provide directly to us, such as your name, postal address, email address, zip code, phone number, date of birth and dining preferences. We may also collect personal information about you when you sign up for a mailing list, a mobile app, provide information as part of a purchase or contact us through our email address or social media pages. We may collect your username, password, and other information if you register for an account or participate in a survey, rewards program, contest or promotion with us. We may collect financial account information and other payment information that you submit to us for order processing, using a third party vendor. We may collect geolocation information, if you are using a mobile application and you consent to this function on that mobile platform. When you visit our website, we collect your IP address and device ID. We collect other data that may not be Personal Information, such as your activity on the site, the websites you visited before and after our Site, and the type of device you used to access our site. If our Site links you to other websites or mobile applications, those websites and mobile applications do not operate under this Privacy Policy. You should examine the privacy policies posted on those other websites and mobile applications to understand their procedures for collecting, using, and disclosing personal information. Use of Your Information We collect your information to provide you with our products and services, improve customer service by understanding your preferences, analyze online behavior and administer our site more effectively, communicate promotions and services available from us and our affiliated companies, and provide you with the best possible customer experience. We also collect your information to respond to your inquiries or requests, post your comments or statements on message boards or in our online forums, create and deliver personalized promotions based on your purchases and other interactions with us, and send you communications about offerings from Tom’s Watch Bar and our affiliated companies. We use your information to improve our online services, including to perform data analysis, audits, fraud monitoring and prevention, identify usage trends, determine the effectiveness of our promotional campaigns, and to operate and expand our business activities. We use your information to provide you with services and products, including responding to inquiries, fulfilling orders and requests, providing catering, processing payments, providing support and troubleshooting, providing our rewards program and other promotions, and communicating with you. We may also use your information to assess inquiries and qualifications for potential employment or franchise-related opportunities. We may use your information for other purposes necessary to carry out our obligations under this Privacy Policy, our Terms of Use or the law, or for any other purposes with your consent. Sharing of Your Information We may share information, in the aggregate, regarding your online browsing preferences to evaluate our products or allow the third parties we work with to better serve our users. We will not share personally identifiable information in these instances, other than as described in this Privacy Policy. We may disclose your Personal Information for processing with our Service Providers pursuant to a written contract. These Service Providers will not sell or share the Personal Information; retain, use or disclose it for any other purpose; or combine it with Personal Information that the Service Provider receives from other sources. We do not share your information with third parties to directly market their products to you. We may provide user information to third-party service providers or vendors for purposes such as providing information technology services such as website hosting, computer systems maintenance, or data security and privacy services, initiating direct marketing programs on our behalf, processing payments, orders and deliveries, maintaining or developing our services, products and other contracted promotional opportunities we provide. We may share your information with law enforcement, investigators or others to identify, contact or bring legal action against one in violation of this Privacy Policy, our Terms of Use, or who may otherwise be causing injury to or interference with our rights or property, or those of our users, customers or others. We may share your information with our business successors, in the context of a merger, acquisition or other combination or sale of assets. In such transactions, confidential customer information generally is one of the transferred business assets. If you consent to receive marketing communications from third parties, we may, from time to time, share the information you provide to us with a few carefully selected third party marketing partners that we believe offer products or services that may be of interest to you. If you would like us to stop providing your information to our third-party marketing partners, you may opt-out by emailing us at telltom@tomswatchbar.com or sending a letter to 44 Cook Street, Suite 600, Denver, CO 80206. Opting Out of Marketing Communications If you no longer wish to receive ongoing marketing communications from us, unsubscribe as explained in the marketing communication itself, or by emailing “unsubscribe” in the subject line of an email to telltom@tomswatchbar.com or by writing us at: Tom’s Watch Bar Corporate Privacy, 44 Cook Street, Suite 600, Denver, CO 80206. Our text messaging is governed by our Terms and Conditions . You can cancel marketing (SMS) texts at any time by testing “STOP.” We will send you an SMS message to confirm that you have been unsubscribed. After this, you will no longer receive SMS messages from us. If you want to join again, just sign up as you did the first time and we will start sending SMS messages to you again. Also, there are “do not track” or similar browser choices available to internet users with respect to online web activity, but given the present lack of consensus of what constitutes an informed election, appropriate trigger or breadth of scope of such choice, our Site will not operate any differently when a “do not track” signal is received. Security Protections for Your Information We employ a variety of security measures, such as Secure Socket Layer (SSL) technology, firewalls, and internal policies, to protect against the loss, misuse or alteration of your Personal Information under our control. No data security system or method of transmission over the Internet is completely secure, however, and we cannot guarantee your Personal Information will be free from disclosure or misuse. We only keep your Personal Information for as long as it is necessary for the purposes set out in this privacy notice, unless a longer retention period is required or permitted by law (such as tax, accounting, or other legal requirements). When we have no ongoing legitimate business need to process your Personal Information, we will either delete or anonymize such information, or, if this is not possible (for example, because your Personal Information has been stored in backup archives), then we will securely store your Personal Information and isolate it from any further processing until deletion is possible. Data Movement You understand and agree that any information you submit may be stored in the United States. We may maintain the Personal Information it collects from you on computers located outside of your state, province, country, or other government jurisdiction where the data protection laws may differ from those from your jurisdiction. We process data, including Personal Information, in the United States. We do not transfer your Personal Information to another country without the existence of adequate security and privacy controls. We transfer Personal Information to the United States only with your consent or to perform a contract with you, and consistent with the practices described in this Privacy Policy. Cookies and Similar Technologies A part of offering personalized service, we sometimes use cookies to store and understand more information about you. A cookie is a small amount of data that is sent to your browser from a Web server and stored on your computer’s hard drive. As text files, the cookies cannot read information on your hard drive, run programs or deliver viruses to your computer. We may use cookies, tags or similar items to allow faster and easier access to your information and to monitor traffic on the site and measure traffic patterns to improve functionality. We may also use cookies when you select products such as gift cards, place them in an online shopping cart, and purchase them, to keep a record of your browsing activity and purchase. Session cookies are stored on the user’s hard drive temporarily and are deleted when the user ends the browsing session. Session cookies are useful for things like keepings item in a shopping cart while the user continues to browse. Persistent cookies stay on the user’s hard drive until they expire, even after the browser is closed. Persistent cookies are useful for remembering things like login information. In addition, we use the following types of cookies: “Essential” cookies are necessary for moving around and using our Site. Essential cookies do not gather information about you for marketing purposes and do not remember where you have been on the internet. You cannot disable essential cookies. “Functional” cookies remember your choices, settings, or preferences from one visit to the next, and changes you have made to customizable areas of the Site. “Analytics” cookies collect information about your use of our Site, including which pages you visit, and whether you experience any errors, so we can improve your experience on our Site. “Targeting” cookies automatically collect information such as Internet Protocol (IP) addresses, browser type and language, Internet service provider (ISP), referring and exit websites and applications, operating system, date/time stamp, and other information designed to customize your experience on our and other sites. We may share this information with Google. We use Cookies and other technologies, such as pixels, web beacons, and clear GIF files, to help manage our online advertising program. These technologies may enable us (or third-party advertising services with whom we work) to learn which advertisements bring users to the Tom’s Watch Bar Online Services. They may also help track your actions online over time and across different web sites or platforms to measure statistics of our marketing efforts, and to deliver electronic advertisements that may be more relevant to individual consumers and that will improve the consumer experience. For information about how tracking works for online advertising purposes, visit https://www.aboutads.info/choices . We permit third-party analytics companies, such as Google Analytics, to store cookies on your computer to provide us with insight into traffic sources, to better understand our visitors and to tailor content to you. These third-party vendors may also display our advertisements on other websites based on your internet usage. You can opt-out of Google Analytics for Display Advertising by using Google’s Ads Settings. Some web browsers and mobile applications include a Do Not Track feature or setting you can activate to indicate your desire not to have your online browsing activities monitored and collected. At present, given the lack of uniformity for these features, our website does not respond to such signals. Collecting Information from Children Our Site and systems are not designed for children, and we do not knowingly collect information from any person under the age of 21. If we learn that such a child has provided us with Personally Information, we will immediately delete it. If you learn that a child has provided us with Personal Information, the parent or guardian should contact us at telltom@tomswatchbar.com and we will immediately delete it. Your California Privacy Rights If you are a California resident, you have certain rights under California Consumer Privacy Act (CCPA) and other data protection laws, including: the right to “opt-out” of our sale of your Personal Information to any third parties; the right to request us to stop sharing your Personal Information to third parties; the right to know what Personal Information we have collected about you and how we use and share it; the right, with some exceptions, to have your Personal Information deleted from our possession or control; the right to correct inaccuracies in your Personal Information; and the right to receive equal service and pricing from us even if you exercise any of your privacy rights. You may submit requests for access or erasure of your personal information by calling toll-free (within the U.S. only) by emailing telltom@tomswatchbar.com . If you submit a request for access or erasure of personal information, you will be required to verify your identity by answering certain questions. If you act through an authorized agent, we may seek confirmation that the individual is acting on your behalf. We will not disclose or delete any information until your identity is verified. If you or your authorized agent are making a request for erasure, we will ask you to confirm again that you want us to delete your personal information before processing your deletion request. Our response to a request is at no cost to you. We endeavor to respond to a verifiable consumer request within forty-five (45) days of its receipt. If we require more time, we will inform you of the reason and extension period in writing. Under the California “Shine the Light” law, California residents may request information about our disclosures of certain categories of personal data to third parties (i.e., our affiliates) for such third parties’ direct marketing purpose, by emailing telltom@tomswatchbar.com or writing to: Tom’s Watch Bar Corporate Privacy, Attn: California Privacy Rights, 44 Cook Street, Suite 600, Denver, CO 80206. If you are under 18 years old, a California resident, and a registered user of any Site where this policy is posted, California Business and Professions Code Section 22581 permits you to request and obtain removal of content or information you have publicly posted. To make such a request, please send an email with a detailed description of the specific content or information to telltom@tomswatchbar.com . Your request does not ensure complete or comprehensive removal of what you have posted and the law may not require or allow removal even if requested. For information about the categories, sources and recipients of Personal Information we collected over the last 12 months, click here or scroll to the bottom of this Privacy Policy. Contact Us If you have any questions about this Privacy Policy, please contact us at telltom@tomswatchbar.com . You can also write to us at Tom’s Watch Bar Corporate Offices, Attn: Terms of Use, 44 Cook Street, Suite 600, Denver, CO 80206. Last modified: March 8, 2024 LINKED CALIFORNIA DISCLOSURE: We have collected the following categories of Personal Information in the past twelve (12) months Categories of Personal Information Category Examples Collected A. Identifiers Contact details, such as real name, alias, postal address, telephone or mobile contact number, unique personal identifier, online identifier, Internet Protocol address, email address, and account name YES B. Personal information categories listed in the California Customer Records statute Name, contact information, education, employment, employment history, and financial information YES C. Protected classification characteristics under California or federal law Gender and date of birth YES D. Commercial information Transaction information, purchase history, financial details, and payment information YES E. Biometric information Fingerprints and voiceprints NO F. Internet or other similar network activity Browsing history, search history, online behavior, interest data, and interactions with our and other websites, applications, systems, and advertisements YES G. Geolocation data Device location YES H. Audio, electronic, visual, thermal, olfactory, or similar information Images and audio, video or call recordings created in connection with our business activities NO I. Professional or employment-related information Business contact details in order to provide you our services at a business level or job title, work history, and professional qualifications if you apply for a job with us NO J. Education Information Student records and directory information NO K. Inferences drawn from other Personal Information Inferences drawn from any of the collected Personal Information listed above to create a profile or summary about, for example, an individual’s preferences and characteristics YES We may also collect other Personal Information outside of these categories instances where you interact with us in person, online, or by phone or mail in the context of receiving help through our customer support channels; participation in customer surveys or contests; and facilitation in the delivery of our Services and to respond to your inquiries. Sources of Personal Information From you directly (such as when you make a purchase, participate in or register for promotions, offers, programs, contests or sweepstakes, or communicate with us): Identifiers; Personal information categories listed in the California Customer Records statute; Protected Classifications; Commercial Information; Online Activity; Sensory Information; Employment Information; and Inferences. From your devices (such as when you browse or use our website): Identifiers; Commercial Information; Online Activity; Geolocation Data; Sensory Information; and Inferences. From your family or friends (such as when they contact us on your behalf, or refer you for one of our contests, sweepstakes or other participatory events): Identifiers; Protected Classifications; Commercial Information; Employment Information; and Inferences. From our affiliated companies: Identifiers; Personal information categories listed in the California Customer Records statute; Protected Classifications; Commercial Information; Online Activity; Geolocation Data; Sensory Information; Employment Information; and Inferences. From vendors who provide services on our behalf: Identifiers; Personal information categories listed in the California Customer Records statute; Protected Classifications; Commercial Information; Online Activity; Geolocation Data; Sensory Information; Employment Information; and Inferences. From our business partners (such as our licensees, franchisees and promotional partners): Identifiers; Personal information categories listed in the California Customer Records statute; Protected Classifications; Commercial Information; Online Activity; Geolocation Data; Sensory Information; Employment Information; and Inferences. From social networking services: Identifiers; Protected Classifications; Commercial Information; Online Activity; Geolocation Data; Sensory Information; Employment Information; and Inferences. From online advertising technology companies: Identifiers; Protected Classifications; Commercial Information; Online Activity; Geolocation Data; Sensory Information; Employment Information; and Inferences. From government entities: Identifiers; Personal information categories listed in the California Customer Records statute; Protected Classifications; Commercial Information; Online Activity; Geolocation Data; Sensory Information; Employment Information; and Inferences. From data aggregators and consumer data resellers: Identifiers; Protected Classifications; Commercial Information; Online Activity; Geolocation Data; Sensory Information; Employment Information; and Inferences. From public databases: Identifiers; Protected Classifications; Commercial Information; Online Activity; Geolocation Data; Sensory Information; Employment Information; and Inferences. Sharing of Personal Information Tom’s Watch Bar has not disclosed or sold any Personal Information to third parties for a business or commercial purpose in the preceding twelve (12) months. We will not sell Personal Information in the future belonging to website visitors, users, and other consumers. Toggle Navigation Cincinnati Denver Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Pittsburgh Sacramento San Diego Petco Park Seattle ©2024 Tom’s Watch Bar . All right reserved. Privacy Policy | Terms & Conditions × Choose your location Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center Page load link Go to Top"
    },
    {
      "url": "https://tomswatchbar.com/houston/",
      "text": "Houston Sports Bar & Restaurant | Houston Tom's Watch Bar Skip to content 1201 Caroline Street, Suite 161 Houston, TX 77002 Reserve Your Private Event Houston | Menu | Private Events | Fan Club | Press | Careers Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center Menu Private Events Fan Club Press Careers HOUSTON 1201 Caroline Street, Suite 161\nHouston, TX 77002 281-619-1779 GET DIRECTIONS Location Info Change Location × Choose your location Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center HOUSTON admin 2025-09-10T20:49:47+00:00 Houston’s Biggest Sports Bar Houston’s Biggest Sports Party 50+ beers 65+ screens 50+ SPECIALTY COCKTAILS Every Game. Every Day. All The Games That Matter. featured Events in Houston event guide Filter: FOOTBALL NBA NHL All Loading events... Show More join tom’s fan club Enjoy a $1 pint of beer or signature cocktail on your next visit. Get A $1 Drink BEST FOOD IN SPORTS Level-up your game-day experience with a menu that goes beyond the ordinary. From elevated sports bar classics to chef-driven dishes and bold, crave-worthy flavors, every bite is crafted to delight. Pair it with an ice-cold beer, a handcrafted cocktail, or a refreshing seltzer, and you might just forget you’re in a sports bar. Dietary Options Available Vegetarian Vegan Gluten-Free View Menu host your next event with us Our dedicated event planner is here to guide you every step of the way in creating the perfect event. From curating the ideal menu and selecting the right music to designing stunning visuals and beyond, we’ll ensure every detail reflects your vision. Trust us to bring your dream event to life with seamless coordination and personalized touch. Plan your event Best Houston Texans Bar in Houston At Tom’s Watch Bar, every Texans game day feels like the real thing. Fans crowd in for big screens, full game audio, and food and drinks made for football. Located at Houston, it’s the best place to gather for every touchdown and big defensive stop. Grab jumbo wings, cold beer, and settle in with fellow fans. From opening week to the postseason, this is where the local fan base comes together. Learn More Other Popular NFL Teams Beyond the home crowd, Tom’s welcomes NFL fans from across the league. Dallas Cowboys , Kansas City Chiefs , Green Bay Packers , New Orleans Saints fans know they’ll catch every snap here. With screens everywhere and sound tuned to the biggest games, you’ll always find your matchup on. Being Social Experience the thrill of the best events, surrounded by passionate fans who share your excitement and energy. Follow Tom’s Watch One Game Here, And You’ll Get It. Finally, screens as big as your love of the game! Our oversized stadium screens deliver an immersive 360° viewing experience, so every seat feels like the best in the house. Located in Downtown Houston near Minute Maid Park and the Toyota Center, Tom’s Watch Bar is where Texans, Astros, Rockets, and Dynamo fans come together. Conveniently located near Discovery Green and the Convention Center, it’s the perfect pre-game and post-game hangout. With larger-than-life screens and game day excitement, Tom’s captures the passion of Houston sports culture. Enjoy signature dishes and craft cocktails inspired by local flavors while cheering with fellow fans. Whether it’s football, baseball, basketball, or soccer, every game is better at Tom’s. TOM'S WATCH BAR Houston Location 1201 Caroline Street, Suite 161 Houston, TX 77002 281-619-1779 Monday - 4:00 pm - 12:00 am Tuesday - 4:00 pm - 12:00 am Wednesday - 4:00 pm - 12:00 am Thursday - 4:00 pm - 12:00 am Friday - 11:00 am - 12:00 am Saturday - 11:00 am - 12:00 am Sunday - 11:00 am - 12:00 am GET DIRECTIONS Toggle Navigation Cincinnati Denver Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Pittsburgh Sacramento San Diego Petco Park Seattle ©2024 Tom’s Watch Bar . All right reserved. Privacy Policy | Terms & Conditions Page load link join tom’s fan club Enjoy a $1 pint of beer or signature cocktail on your next visit. Get A $1 Drink Go to Top"
    },
    {
      "url": "https://tomswatchbar.com/los-angeles/",
      "text": "Los Angeles Sports Bar & Restaurant | LA Tom's Watch Bar Skip to content 1011 S Figueroa St., b101, Los Angeles, CA 90015 Reserve Your Private Event Los Angeles | Menu | Private Events | Fan Club | Press | Careers Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center Menu Private Events Fan Club Press Careers LOS ANGELES 1011 S Figueroa St., b101,\nLos Angeles, CA 90015 213-746-8667 Location Info Change Location × Choose your location Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center LOS ANGELES admin 2025-09-10T20:57:26+00:00 Los Angeles’ Biggest Sports Bar Los Angeles’ Biggest Sports Party 50+ beers 180+ screens 50+ SPECIALTY COCKTAILS Every Game. Every Day. All The Games That Matter. featured Events in Los Angeles event guide Filter: FOOTBALL NBA NHL All Loading events... Show More join tom’s fan club Enjoy a $1 pint of beer or signature cocktail on your next visit. Get A $1 Drink BEST FOOD IN SPORTS Level-up your game-day experience with a menu that goes beyond the ordinary. From elevated sports bar classics to chef-driven dishes and bold, crave-worthy flavors, every bite is crafted to delight. Pair it with an ice-cold beer, a handcrafted cocktail, or a refreshing seltzer, and you might just forget you’re in a sports bar. Dietary Options Available Vegetarian Vegan Gluten-Free View Menu host your next event with us Our dedicated event planner is here to guide you every step of the way in creating the perfect event. From curating the ideal menu and selecting the right music to designing stunning visuals and beyond, we’ll ensure every detail reflects your vision. Trust us to bring your dream event to life with seamless coordination and personalized touch. Plan your event Best Los Angeles Rams Bar in Los Angeles At Tom’s Watch Bar, every Rams game day feels like the real thing. Fans crowd in for big screens, full game audio, and food and drinks made for football. Located at Los Angeles, it’s the best place to gather for every touchdown and big defensive stop. Grab jumbo wings, cold beer, and settle in with fellow fans. From opening week to the postseason, this is where the local fan base comes together. Learn More Other Popular NFL Teams Beyond the home crowd, Tom’s welcomes NFL fans from across the league. Los Angeles Chargers , San Francisco 49ers , Las Vegas Raiders , Green Bay Packers fans know they’ll catch every snap here. With screens everywhere and sound tuned to the biggest games, you’ll always find your matchup on. Being Social Experience the thrill of the best events, surrounded by passionate fans who share your excitement and energy. Follow Tom’s Watch One Game Here, And You’ll Get It. Finally, screens as big as your love of the game! Our oversized stadium screens deliver an immersive 360° viewing experience, so every seat feels like the best in the house. Located in the heart of Downtown LA and just steps away from Crypto.com Arena and LA Live, Tom’s Watch Bar is the go-to destination for sports fans in Los Angeles. Whether you’re catching a Lakers, Clippers, Kings, or Sparks game, or celebrating a big win at BMO Stadium or Dodger Stadium, Tom’s offers the ultimate watch party experience. With massive 360° screens and an electric atmosphere, you’ll feel like you’re part of the action, whether it’s an NBA showdown, NHL rivalry, or a major UFC fight night. Root for your favorite teams, including the USC Trojans and UCLA Bruins, while enjoying our chef-crafted game-day bites and local craft beers. Tom’s Watch Bar is where LA fans gather for every big game. TOM'S WATCH BAR Los Angeles Location 1011 S Figueroa St., b101, Los Angeles, CA 90015 213-746-8667 Monday - 3:00 pm - 12:00 am Tuesday - 3:00 pm - 12:00 am Wednesday - 3:00 pm - 12:00 am Thursday - 3:00 pm - 12:00 am Friday - 11:00 am - 12:00 am Saturday - 11:00 am - 12:00 am Sunday - 11:00 am - 12:00 am GET DIRECTIONS Toggle Navigation Cincinnati Denver Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Pittsburgh Sacramento San Diego Petco Park Seattle ©2024 Tom’s Watch Bar . All right reserved. Privacy Policy | Terms & Conditions Page load link join tom’s fan club Enjoy a $1 pint of beer or signature cocktail on your next visit. Get A $1 Drink Go to Top"
    },
    {
      "url": "https://tomswatchbar.com/minneapolis/",
      "text": "Minneapolis Sports Bar & Restaurant | Minneapolis Tom's Watch Bar Skip to content 609 Hennepin Ave. Minneapolis, MN 55403 Reserve Your Private Event Minneapolis | Menu | Private Events | Fan Club | Press | Careers Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center Menu Private Events Fan Club Press Careers MINNEAPOLIS 609 Hennepin Ave.\nMinneapolis, MN 55403 612-430-6113 Location Info Change Location × Choose your location Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center MINNEAPOLIS admin 2025-09-10T20:59:35+00:00 Minneapolis’ Biggest Sports Bar Minneapolis’ Biggest Sports Party 50+ beers 100+ screens 50+ SPECIALTY COCKTAILS Every Game. Every Day. All The Games That Matter. featured Events at The Target Center event guide Filter: FOOTBALL NBA NHL All Loading events... Show More join tom’s fan club Enjoy a $1 pint of beer or signature cocktail on your next visit. Get A $1 Drink BEST FOOD IN SPORTS Level-up your game-day experience with a menu that goes beyond the ordinary. From elevated sports bar classics to chef-driven dishes and bold, crave-worthy flavors, every bite is crafted to delight. Pair it with an ice-cold beer, a handcrafted cocktail, or a refreshing seltzer, and you might just forget you’re in a sports bar. Dietary Options Available Vegetarian Vegan Gluten-Free View Menu host your next event with us Our dedicated event planner is here to guide you every step of the way in creating the perfect event. From curating the ideal menu and selecting the right music to designing stunning visuals and beyond, we’ll ensure every detail reflects your vision. Trust us to bring your dream event to life with seamless coordination and personalized touch. Plan your event Best Minnesota Vikings Bar in Minneapolis At Tom’s Watch Bar, every Vikings game day feels like the real thing. Fans crowd in for big screens, full game audio, and food and drinks made for football. Located at Minneapolis, it’s the best place to gather for every touchdown and big defensive stop. Grab jumbo wings, cold beer, and settle in with fellow fans. From opening week to the postseason, this is where the local fan base comes together. Learn More Other Popular NFL Teams Beyond the home crowd, Tom’s welcomes NFL fans from across the league. Green Bay Packers , Chicago Bears , San Francisco 49ers , Detroit Lions , Kansas City Chiefs fans know they’ll catch every snap here. With screens everywhere and sound tuned to the biggest games, you’ll always find your matchup on. Being Social Experience the thrill of the best events, surrounded by passionate fans who share your excitement and energy. Follow Tom’s Watch One Game Here, And You’ll Get It. Finally, screens as big as your love of the game! Our oversized stadium screens deliver an immersive 360° viewing experience, so every seat feels like the best in the house. Located in Downtown Minneapolis near Target Center and Target Field, Tom’s Watch Bar is the go-to spot for Vikings, Twins, Timberwolves, Lynx, and Wild fans. Just a short walk from Nicollet Mall, it’s the perfect spot to meet up before or after the game. Catch every play on our 360° screens, surrounded by the energy of fellow Minnesota fans. Enjoy craft beers and hearty game-day fare while cheering on your favorite teams. Whether it’s the NHL playoffs, NFL Sundays, or NBA matchups, Tom’s is where Minnesota fans unite. TOM'S WATCH BAR Minneapolis Location 609 Hennepin Ave. Minneapolis, MN 55403 612-430-6113 Monday - 4:00 pm - 12:00 am Tuesday - 4:00 pm - 12:00 am Wednesday - 4:00 pm - 12:00 am Thursday - 4:00 pm - 12:00 am Friday - 11:00 am - 12:00 am Saturday - 11:00 am - 12:00 am Sunday - 11:00 am - 12:00 am GET DIRECTIONS Toggle Navigation Cincinnati Denver Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Pittsburgh Sacramento San Diego Petco Park Seattle ©2024 Tom’s Watch Bar . All right reserved. Privacy Policy | Terms & Conditions Page load link join tom’s fan club Enjoy a $1 pint of beer or signature cocktail on your next visit. Get A $1 Drink Go to Top"
    },
    {
      "url": "https://tomswatchbar.com/national-harbor/private-events/",
      "text": "Best Private Event Venue in National Harbor | Tom's Watch Bar Skip to content 200 American Way Oxon Hill, MD 20745 Reserve Your Private Event National Harbor | Menu | Private Events | Fan Club | Press | Careers Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center Menu Private Events Fan Club Press Careers NATIONAL HARBOR 200 American Way\nOxon Hill, MD 20745 301-960-3936 GET DIRECTIONS Location Info Change Location × Choose your location Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center Private Events admin 2025-09-03T18:23:54+00:00 National Harbor’s Best Private Event Venue Whether You Know Exactly What You Want or Need Help Crafting the Details, Our Professional Event Planners Will Work With You to Create a Fully Customized Experience. Let Us Help You Create Something Extraordinary RESERVE YOUR EVENT Your event is easy as 1, 2, 3 Select your space Find the perfect area to match your event size and vibe. Build your perfect menu Craft a food and drink lineup your guests will love. Customize your experience Tailor the décor, layout, and extras to fit your vision. Select your space Find the perfect area to match your event size and vibe. Build your perfect menu Craft a food and drink lineup your guests will love. Customize your experience Tailor the décor, layout, and extras to fit your vision. Select your space Choose from a variety of flexible spaces designed to host events of any size. Whether it’s a large corporate gathering or a lively watch party, we’ll help you find the perfect setting to match your vibe. Venue Specifications Venue Capacity 350 seated, 500 reception AV 80 Customizable Televisions, Wireless Microphone, Sound System Highlights 2 Topgolf Bays, two blocks from the Gaylord Hotel and a block from the waterfront Club Level Seated: 50 Reception: 70 Field Level Seated: 50 Reception: 80 Left Field Patio Seated: 50 Reception: 80 Partial Venue Seated: 125 Reception: 200 Right Field Patio One Seated: 50 Reception: 80 Right Field Patio Two Seated: 50 Reception: 80 The Dugout/Upper Deck Seated: 50 Reception: 80 Topgolf Bay One Seated: 15 Topgolf Bay Two Seated: 15 Build your perfect menu A Custom Menu, Just the Way You Want It From Tom’s Famous Favorites to Custom Sushi Stations and everything in between, we’ll help you craft a menu that perfectly fits your event. Whether you prefer a buffet, chef stations, passed appetizers, or plated meals, our team will tailor every detail to match your vision. Pair it all with signature cocktails or custom-crafted drinks designed just for your event. No matter the style, no matter the flavor—your perfect menu starts here. Dietary Options Available Vegetarian Vegan Gluten-Free Customize your experience Make the event your own. From personalized décor and custom seating layouts to AV setups and special touches, our event specialists will work with you to bring your vision to life. casino poker table Light Up Ping Pong Table djs & live music margarita bar tequila tasting gelato bar popup casino poker table Light Up Ping Pong Table djs & live music margarita bar tequila tasting gelato bar popup Let’s Celebrate Together Celebrate life’s biggest moments with your loved ones in an exciting, high-energy setting—where unforgettable memories are made for the events that matter most. Bachelor & Bachelorette Parties Learn More Rehearsal Dinners & Welcome Parties Learn More Weddings Learn More Graduation Parties Learn More Bar Mitzvah's Learn More Tailgate Learn More Bachelor & Bachelorette Parties Learn More Weddings Learn More Rehearsal Dinners & Welcome Parties Learn More Graduation Parties Learn More Bar Mitzvahs Learn More Tailgate Party Learn More Reserve your important date Need Help Planning Your Event? Need help planning your special event? Our private event specialists are here to assist with every detail. Schedule a 30-minute consultation for expert advice. MARC BEZBATCHENKO Vice President Event Sales (771) 242-5471 The Venue for Every Occasion From Corporate Gatherings to Celebrations and Private Watch Parties, We’re Ready to Host Your Event. Corporate Events Networking Events Sports Events Professional Conferences Social Gatherings Corporate Events Corporate Events Host a productive and memorable corporate event at Tom’s Watch Bar. With state-of-the-art A/V capabilities, customizable spaces, and chef-driven menus, we provide the perfect setting for team meetings, client presentations, and company celebrations. Let our event planners tailor every detail to meet your professional goals. Networking Events Networking Event Create meaningful connections in a dynamic setting. Our flexible event spaces and vibrant atmosphere are ideal for networking mixers, industry meetups, and professional gatherings. With customizable layouts and craft cocktails, Tom’s Watch Bar makes networking effortless and enjoyable. Sports Events Sports Event Take your sports viewing to the next level. From private watch parties to fantasy drafts, Tom’s Watch Bar offers immersive A/V capabilities and transformable spaces designed for sports enthusiasts. Bring your group together and cheer on your favorite team in an unforgettable setting. Professional Conferences Professional Conferences Host your next conference or workshop in a venue that combines professionalism with entertainment. With high-tech A/V systems, transformable spaces, and personalized menus, Tom’s Watch Bar ensures your event is engaging, seamless, and successful. Social Gatherings Social Gathering Celebrate life’s big moments at Tom’s Watch Bar. From birthday parties and weddings to fantasy drafts and private watch parties, our versatile spaces, personalized menus, and immersive entertainment options make every gathering unforgettable. Private Event FAQs – What types of events can I host at Tom’s Watch Bar? Tom’s Watch Bar is perfect for corporate events, networking mixers, sports watch parties, professional conferences, birthday celebrations, weddings, and holiday parties. Our flexible spaces and tailored services accommodate events of all sizes and themes. + How far in advance should I book my event? We recommend booking as early as possible, especially for peak seasons like holidays and major sporting events. Contact us to check availability and secure your date. + What is included with a private event booking? Every booking includes access to our flexible spaces, customizable menus, craft cocktails, and immersive A/V capabilities. Additional options, such as decorations or entertainment, can be arranged upon request. + Can I host a hybrid or virtual event? Yes, we offer live-streaming capabilities for hybrid or virtual events. Our A/V team will help set up a seamless connection to engage your remote attendees. + Are there parking or transportation options for guests? Yes, most locations offer ample parking or are conveniently located near public transportation. Contact your selected venue for specific details. + What are my options for transforming the space for my event? We specialize in creating unique environments to match your vision. Options include: - Custom furniture configurations (e.g., lounge areas). - Adding features like a lighted dance floor. - Designing custom food and drink stations. - Setting up gaming options like cornhole or pop-a-shot. + What are my options for configuring A/V at Tom’s Watch Bar? Our state-of-the-art A/V capabilities include: - 360° screens and high-definition displays for presentations or branding. - Customizable sound zones for speeches, music, or live commentary. - Wireless connectivity and live-streaming options. + Can I personalize my event with branding or special touches? Absolutely! From displaying your company logo on our screens to creating custom menus, signature cocktails, or themed desserts, we’ll help personalize your event to make it truly one-of-a-kind. + Do you offer assistance with event planning? Yes, our professional event planners will guide you through every step, including space configurations, menu design, A/V setup, and more. Schedule a consultation to get started. + What makes Tom’s Watch Bar the best choice for private events? At Tom’s Watch Bar, we offer unparalleled flexibility, including transformable spaces, customizable menus, immersive A/V capabilities, and unique gaming options. Our team is dedicated to making every detail extraordinary, ensuring your event is both seamless and unforgettable. TOM'S WATCH BAR National Harbor Location 200 American Way Oxon Hill, MD 20745 301-960-3936 Monday - 11:00 am - 12:00 am Tuesday - 11:00 am - 12:00 am Wednesday - 11:00 am - 12:00 am Thursday - 11:00 am - 12:00 am Friday - 11:00 am - 12:00 am Saturday - 11:00 am - 12:00 am Sunday - 11:00 am - 12:00 am GET DIRECTIONS Toggle Navigation Cincinnati Denver Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Pittsburgh Sacramento San Diego Petco Park Seattle ©2024 Tom’s Watch Bar . All right reserved. Privacy Policy | Terms & Conditions Page load link There’s no better place to watch every game than Tom’s Watch Bar. 360° viewing • Electric game day atmosphere   locations nationwide • Private & semi-private spaces Elevated watch party experience RESERVE NOW Go to Top"
    },
    {
      "url": "https://www.minneapolis.org/directory/toms-watch-bar/",
      "text": "Tom's Watch Bar | Meet Minneapolis Skip to content Meetings & Events Minneapolis Convention Center Weddings Groups Sports Minneapolis Partners Media About Us Things To Do Events Eat & Drink Plan Your Trip 0 Saved Navigation Things To Do Arts, Theater & Dance Music & Nightlife Budget-Friendly Sports & Recreation Nature & Outdoors Tours & Experiences Family Fun Shopping Health & Wellness Itineraries Seasonal First Time Essentials Events Festivals & Fairs Top Events by Season Holidays Downtown Minneapolis Eat & Drink Minneapolis Restaurants International Cuisine Coffee Shops, Bakeries & Sweet Treats Minneapolis Bars Beer, Cocktails and Wine Farmers Markets & Food Trucks Desserts Hotels Neighborhoods Downtown Northeast Minneapolis South Minneapolis Dinkytown and Surrounding U of M Area West Bank & Cedar Riverside Southwest Hiawatha & Howe Phillips Bde Maka Ska/Isles Near North & Camden Powderhorn University Whittier & Lyndale Lowry Hill & Kenwood Bryn Mawr Plan Your Trip Maps & Transportation Hotels Itineraries Accessibility Guide to Minneapolis Neighborhoods Explore the Cultural Districts Minneapolis LGBTQ+ Community Minneapolis Black Community Visitor Guide Subscribe to Our Newsletter Meetings & Events Minneapolis Convention Center Weddings Groups Sports Minneapolis Partners Media About Us Tom's Watch Bar Email Website Details Amenities Details Hours: Mon-Thur 4pm-11pm Fri-Sun 11am-11pm Price Range: $$ The ultimate sports watching experience - featuring oversized screens and 360 degree viewing rooms so every seat is the best seat in the house. Elevated sports bar fare, and a large selection of tap beer, along with creative cocktails will satisfy every sports fan. Contact Information Tom's Watch Bar cdahlson@tomswatchbar.com 609 Hennepin Ave Minneapolis,\n                            Minnesota\n                            55403 Phone: (612) 430-6113 Amenities Accessible Meet Minneapolis is an accredited Destination Marketing Organization from Destinations International. Land and Water Acknowledgment Contact Information Meet Minneapolis 801 Marquette Ave S, Suite 100, Minneapolis, MN 55402 612-767-8000 Meet Minneapolis Visitor Center On Nicollet 505 Nicollet, Suite 100, Minneapolis, MN 55402 1-888-676-6757 Minneapolis Convention Center 1301 Second Ave S, Minneapolis, MN 55403 612-335-6000 Things To Do Arts, Theater & Dance Music & Nightlife Budget-Friendly Sports & Recreation Nature & Outdoors Tours & Experiences Family Fun Shopping Health & Wellness Itineraries Seasonal First Time Essentials Events Festivals & Fairs Top Events by Season Holidays Downtown Minneapolis Eat & Drink Minneapolis Restaurants International Cuisine Coffee Shops, Bakeries & Sweet Treats Minneapolis Bars Beer, Cocktails and Wine Farmers Markets & Food Trucks Desserts Hotels Neighborhoods Downtown Northeast Minneapolis South Minneapolis Dinkytown and Surrounding U of M Area West Bank & Cedar Riverside Southwest Hiawatha & Howe Phillips Bde Maka Ska/Isles Near North & Camden Powderhorn University Whittier & Lyndale Lowry Hill & Kenwood Bryn Mawr Plan Your Trip Maps & Transportation Hotels Itineraries Accessibility Guide to Minneapolis Neighborhoods Explore the Cultural Districts Minneapolis LGBTQ+ Community Minneapolis Black Community Visitor Guide Subscribe to Our Newsletter Meetings & Events Minneapolis Convention Center Weddings Groups Sports Minneapolis Partners Media About Us 75 ° F Visitor Guide This Website uses cookies to enhance your visitor experience. Learn More Accept Quick Search Top Searches Plan A Trip Top Events by Season Neighborhoods Minneapolis Community Safety Updates Music & Nightlife Itineraries Eat & Drink Minneapolis & Surrounding Area Maps Location Map"
    },
    {
      "url": "https://tomswatchbar.com/location/denver-coors-field/covid-19-updates/",
      "text": "Denver Sports Bar & Restaurant | Denver Tom's Watch Bar Skip to content 1601 19th Street Unit 101, Denver, CO 80202 Reserve Your Private Event Denver Coors Field | Menu | Private Events | Fan Club | Press | Careers Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center Menu Private Events Fan Club Press Careers DENVER COORS FIELD 1601 19th Street\nUnit 101, Denver, CO 80202 303-872-7557 Location Info Change Location × Choose your location Cincinnati Denver Coors Field Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Chase Field Pittsburgh Sacramento San Diego Petco Park Seattle Center DENVER COORS FIELD admin 2025-09-10T15:13:40+00:00 Denver’s Biggest Sports Bar Denver’s Biggest Sports Party 50+ beers 100+ screens 50+ SPECIALTY COCKTAILS Every Game. Every Day. All The Games That Matter. featured Events in Denver event guide Filter: FOOTBALL NBA NHL All Loading events... Show More join tom’s fan club Enjoy a $1 pint of beer or signature cocktail on your next visit. Get A $1 Drink BEST FOOD IN SPORTS Level-up your game-day experience with a menu that goes beyond the ordinary. From elevated sports bar classics to chef-driven dishes and bold, crave-worthy flavors, every bite is crafted to delight. Pair it with an ice-cold beer, a handcrafted cocktail, or a refreshing seltzer, and you might just forget you’re in a sports bar. Dietary Options Available Vegetarian Vegan Gluten-Free View Menu host your next event with us Our dedicated event planner is here to guide you every step of the way in creating the perfect event. From curating the ideal menu and selecting the right music to designing stunning visuals and beyond, we’ll ensure every detail reflects your vision. Trust us to bring your dream event to life with seamless coordination and personalized touch. Plan your event Best Denver Broncos Bar in Denver At Tom’s Watch Bar, every Broncos game day feels like the real thing. Fans crowd in for big screens, full game audio, and food and drinks made for football. Located at Denver Coors Field, it’s the best place to gather for every touchdown and big defensive stop. Grab jumbo wings, cold beer, and settle in with fellow fans. From opening week to the postseason, this is where the local fan base comes together. Learn More Other Popular NFL Teams Beyond the home crowd, Tom’s welcomes NFL fans from across the league. Kansas City Chiefs , Lions , Texans , Steelers fans know they’ll catch every snap here. With screens everywhere and sound tuned to the biggest games, you’ll always find your matchup on. Being Social Experience the thrill of the best events, surrounded by passionate fans who share your excitement and energy. Follow Tom’s Watch One Game Here, And You’ll Get It. Finally, screens as big as your love of the game! Our oversized stadium screens deliver an immersive 360° viewing experience, so every seat feels like the best in the house. Located in the heart of Denver’s vibrant LoDo (Lower Downtown) neighborhood and just steps from Coors Field, Tom’s Watch Bar is the ultimate game-day destination for Rockies fans and sports lovers across the city. Surrounded by top attractions like McGregor Square, Union Station, and the buzzing Ballpark District, it’s the perfect pre-game, post-game, or all-game hangout. With wall-to-wall 360° screens and an unmatched viewing experience, fans gather here to cheer on the Denver Broncos, Nuggets, Rockies, Avalanche, and Colorado Buffaloes—as well as college football, UFC fights, and national sports events. Whether it’s Opening Day at Coors, a playoff run, or a major rivalry game, the energy at Tom’s is second to none. Our chef-driven menu offers bold takes on game-day favorites, with craft cocktails and local brews from Colorado’s best breweries—making every bite and sip part of the celebration. Tom’s Watch Bar is more than just a sports bar—it’s Denver’s home for fans, watch parties, and unforgettable moments. TOM'S WATCH BAR Denver Coors Field Location 1601 19th Street Unit 101, Denver, CO 80202 303-872-7557 Monday - 4:00 pm - 12:00 am Tuesday - 4:00 pm - 12:00 am Wednesday - 4:00 pm - 12:00 am Thursday - 4:00 pm - 12:00 am Friday - 11:00 am - 12:00 am Saturday - 11:00 am - 12:00 am Sunday - 11:00 am - 12:00 am GET DIRECTIONS Toggle Navigation Cincinnati Denver Houston Ilani Indianapolis Las Vegas Los Angeles Minneapolis Mohegan Sun National Harbor Navy Yard Orlando Phoenix Pittsburgh Sacramento San Diego Petco Park Seattle ©2024 Tom’s Watch Bar . All right reserved. Privacy Policy | Terms & Conditions Page load link join tom’s fan club Enjoy a $1 pint of beer or signature cocktail on your next visit. Get A $1 Drink Go to Top"
    },
    {
      "url": "https://www.forbes.com/sites/garystern/2022/11/02/toms-watch-bar-finds-a-financial-partner-and-is-growing-rapidly/",
      "text": "Tom’s Watch Bar Finds A Financial Partner And Is Growing Rapidly Newsletters Games Share a News Tip Featured Featured America's Top Next-Gen Wealth Advisors | Paid Program Student Visionaries: Celebrating Teen Leaders Raising Money To End Blood Cancers | Paid Program Best-In-State Top Next-Gen Wealth Advisors 2025 Breaking News White House Watch Daily Cover Stories AI’s Nuanced Impact And A Quest To Quantify It DNA of Success Embracing And Bracing For AI Facing A Volatile Market, C-Suites Look To The CFO For Strategic Guidance Your Four-Part Blueprint To Unlock AI Value In 2025 | Paid Program By The Numbers: Meet The Forbes 30 Under 30 Europe Class Of 2025 Dell Technologies BrandVoice | Paid Program Scaling AI Get Your Data AI-Ready | Paid Program QUIZ: Are You Making The Most Of Your Retirement Plan? | Paid Program Shaping The Future-Ready Mobility: In Conversation With JLR And TCS | Paid Program The Pacesetter Playbook: An Executive’s Guide To  Advancing Enterprise AI | Paid Program Next Billion-Dollar Startups 2025 CXO Spotlight: The Executive's Guide to AI Video Series Billionaires Billionaires See All World's Billionaires Forbes 400 America's Richest Self-Made Women China's Richest India's Richest Indonesia's Richest Korea's Richest Thailand's Richest Japan's Richest Australia's Richest Taiwan's Richest Singapore's Richest Philippines' Richest Hong Kong's Richest Malaysia's Richest Money & Politics Innovation Innovation See All Workflow Collaboration Enterprise AI AI Agentic AI Big Data Cloud Cloud 100 Consumer Tech Creator Economy Cybersecurity Digital Transformation Enterprise Tech Future Of Work Gaming Healthcare Innovation Rules Retail Industry SAP BrandVoice | Paid Program Science Social Media Sustainability & Climate Transportation Venture Capital Technology TikTok BrandVoice | Paid Program Metronome BrandVoice | Paid Program Leadership Leadership See All Under 30 C-Suite CEO Network CFO Network CHRO Network CIO Network CMO Network Leadership Strategies Careers Education Featured Partners Deloitte BrandVoice SAP BrandVoice Stand Together BrandVoice First Tee BrandVoice Dell Technologies BrandVoice Forbes EQ | Paid Program ForbesBLK Forbes Research ForbesWomen Money Money See All Banking & Insurance ETFs & Mutual Funds Fintech Hedge Funds & Private Equity Investing Investor Hub Markets Personal Finance Retirement Taxes Top Advisor | SHOOK Wealth Management Forbes Digital Assets Forbes Digital Assets See All News Crypto Prices NFT Prices Research Learn Crypto Basics BTC DeFi Web3 Education NFTs Crypto Investments Events Crypto Portfolios Business Business See All Aerospace & Defense Energy Food & Drink Hollywood & Entertainment Law Manufacturing Media Policy Retail SportsMoney Entertainment Digest Small Business Small Business See All Entrepreneurs Franchises Small Business Strategy Lifestyle Lifestyle See All Arts Boats & Planes Cars & Bikes Dining ForbesLife Forbes Travel Guide Spirits Style & Beauty Travel Vices Watches Real Estate Real Estate See All Commercial Real Estate Forbes Global Properties Residential Real Estate Forbes Vetted Forbes Vetted See All Mattress & Sleep Bed Frames Mattresses Mattress Toppers Pillows Sheets & Bedding Sleep Products Home Bathroom Cleaning & Laundry Decor Furniture Heating & Cooling Hobbies Home Office Kitchen & Dining Outdoor Pets Storage & Organization Tools Wine & Bar Fashion Accessories Clothing Eyewear Footwear Jewelry Handbags & Purses Lingerie & Sleepwear Outdoor & Fitness Apparel Outerwear Watches Kids & Baby Gear Baby Gear Kids Clothes & Accessories Nursery Pregnancy & Postpartum Toys & Books Gear Apparel & Accessories Bikes Camping & Hiking Climbing Fishing & Hunting Fitness Golf Running Tennis & Racket Sports Tools & Tech Training & Recovery Water Sports Wellness Winter Sports Beauty & Grooming Haircare Makeup Nailcare Shaving Skincare Personal Products Wellness & Self Care Tech & Electronics Audio Cameras Computers, Tablets & Accessories Gaming Home Office Online Tools Smart Home Devices Smartphones, Smartwatches & Accessories Streaming TVs Travel Cruises Hotels & Lodging Luggage Travel Products Gifts Father's Day Holiday Mother's Day Valentine's Day Wedding Deals Coupons Black Friday Cyber Monday Amazon Prime Day Beauty & Grooming Big Sales Fashion Gear Home Tech & Electronics Travel Deals Mattress & Sleep Coupons Coupons See All Most Popular Macy's Zappos Vivid Seats SeatGeek Groupon DoorDash Stubhub Shutterfly Fashion H&M Nordstrom Zenni Optical Neiman Marcus Shopbop Ulta Beauty Zales Jos. A. Bank Software & VPNs NordVPN ExpressVPN Surfshark Squarespace Norton QuickBooks VistaPrint TurboTax Electronics Samsung Verizon Sonos Newegg Lenovo B&H eBay HP Sportswear & Gear adidas Nike Dick's Sporting Goods HOKA New Balance Athleta Alo Yoga RTIC Mattress & Sleep Mattress Firm Purple Mattress Bear Mattress Brooklinen Nectar Avocado Mattress Nolah Brooklyn Bedding Travel Booking.com Hotels.com Emirates Expedia Away Hilton Priceline Great Wolf Lounge Home & Garden Walmart Wayfair Edible Arrangements Instacart The Home Depot Lowe's Frontgate Total Wine View All Stores Lists Lists See All 30 Under 30 50 Over 50 Top Colleges Advisor Advisor See All Credit Cards Best Credit Cards Travel Credit Cards 0% APR Credit Cards Balance Transfer Credit Cards Business Credit Cards Best First Credit Card Mortgages & Loans Best Mortgage Lenders Mortgage Refinance Lenders Personal Loans Business Loans Bad Credit Loans Debt Consolidation Loans Debt Relief Companies Student Loans Refinance Private Student Loans Banking Best CD Rates High Yield Savings Accounts Money Market Accounts Checking Accounts Business Checking Accounts Budgeting Apps Best Online Banks Insurance Health Insurance Companies Medicare Life Insurance Companies Best Car Insurance Companies Cheapest Car Insurance Companies Pet Insurance Companies Travel Insurance Companies Homeowners Insurance Companies Business Services How to Start a Business LLC Services Payroll Services HR Software HRIS Systems PEO Services Applicant tracking Systems Domain Registrars Hosting Services Website Builders Ecomm Platforms Landing Page Builders VOIP Services Answering Services Project Management Software Task Management Software Gantt Chart Software VPNs Anti Virus Software Password Managers Home Services Moving Companies Long Distance Moving Companies Car Shipping Companies Home Warranty Companies Solar Companies Solar Panels Home Security Companies Home Security Systems Internet Providers Cheapest Internet Providers Fastest High Speed Internet Providers Pest Control Companies Education Forbes Advisor UK Forbes Advisor CA Forbes Advisor AU Health Health See All Mental Health Best Online Therapy Online Therapy that Takes Insurance Online Psychiatrists Best Online Dating Sites & Apps Best Senior Dating Sites Best LGBTQ Dating Sites CBD CBD Gummies CBD Oil CBD Creams CBD for Anxiety CBD for Pain Supplements Protein Powder Preworkout Collagen Powders Creatine Supplements CoQ10 Supplements Hearing Health Best Hearing Aids OTC Hearing Aids Affordable Hearing Aids Medical Devices Best Medical Alert Systems Best Medical Alert Systems with Fall Detection Diet & Weight Loss Best Weight Loss Plans Newsletters Newsletters See All Forbes Daily Editorial Newsletters Forbes Games Forbes Games See All Frase by Forbes Pinpoint by LinkedIn Queens by LinkedIn Crossclimb by LinkedIn More From Forbes More From Forbes Forbes Video Forbes 101 Forbes Magazine Forbes Asia Free Issue of Forbes © 2025 Forbes Media LLC. All Rights Reserved. Advertise with Forbes Forbes Licensing & Syndication Report a Security Issue Editorial Values and Standards Site Feedback Contact Us Careers at Forbes Tips Corrections Privacy Do Not Sell My Personal Information Terms AdChoices Reprints & Permissions Lifestyle Dining Tom’s Watch Bar Finds A Financial Partner And Is Growing Rapidly By Gary Stern , Contributor. Forbes contributors publish independent expert analyses and insights. I cover the restaurant industry. Follow Author Nov 02, 2022, 08:47am EDT Share Save Comment This article is more than 2 years old. Former Smashburger co-founder Tom Ryan has introduced Tom’s Watch Bar, which has 120 150 TVs at each location, and is expanding quickly. Pictured is its LA Live outpost. Courtesy of Tom's Watch Bar In 2014, Tom Ryan, one of the co-founders of Smashburger, saw an opportunity in the bustling sports bar category, and co-founded Tom’s Watch Bar at the entertainment complex La Live in Los Angeles. At the beginning, it was self-capitalized. Ryan says Tom’s Watch Bar drew on “changing demography, viewing choices, fan engagement and gender balance.” How could Tom’s Watch Bar compete against the existing sports bar chains such as Beef O Brady’s, Hurricane Grill & Wings and Walk-On’s Sports Bistreaux? Ryan replies that “My partners and I take familiar thematics that most Americans know and find modern perspectives and next generational approaches to execute them in new ways.” Ryan built it up to the point where Tom’s Watch Bar had grown to six sports bars including venues at Coors Field in Denver, Mohegan Sun Resort/Casino in Connecticut where the WNBA Connecticut Sun play, and at the Vegas Strip in the NY NY Hotel and Casino, and its newest in Minneapolis, located in proximity to the Target Center (Timberwolves/Lynx) and Target Field (Twins). His first five were self-financed. Knowing how much capital it would take to expand quickly, savvy Ryan hired Stephens, a family-owned investment fund, which helped secure financing of $30 million for expansion, with Sagad Credit Partners, an international alternative asset manager based in Toronto. “That’s always been our approach. Use internal founding capital for start-up and then when you get a point, we go outside to fund accelerated growth,” he explains. Now Tom’s Watch bar has seven new sports bars in construction; all company-owned, none franchised. All are being built near stadiums or high-traffic entertainment centers. MORE FROM FORBES ADVISOR Best Travel Insurance Companies By Amy Danise Editor Best Covid-19 Travel Insurance Plans By Amy Danise Editor These new locations planned for 2023 include three in Washington, D.C., with one each in Orlando, Houston, Sacramento and Pittsburgh. He says that traditional sports bars “cater to the last generation market” that tend to watch one sporting event at a time. But the 25-to-45-year-old generation who are avid sport fans watch multiple events at once and can do so in Tom’s Watch Bar’s 360-degree viewing room. They watch their local favorites, but also concentrate on Fantasy League players or follow sports betting. While many sports bars attract a 70% to 75% male audience, Tom’s Watch Bar’s clientele is closer to 50% male and 50% female who come to watch the WNBA among many sports. In addition, three of the existing Tom’s Watch Bars have Top Golf Swing Suites as part of the experience, in addition to hockey, soccer, baseball and carnival games. Tom’s Watch Bar also pays teams “a partnership fee across the season that works with our store level economic models,” Ryan says. It allows it to “target fan bases for pregame, postgame, home game and away game fan parties,” he adds. Ryan says that each Tom’s Watch Bar includes anywhere from 120 to 150 televisions. “Our broad promise is sports all the time. You’d be hard-pressed not to find the game you’re interested in,” he says. Moreover, it prints it TV-watching schedule two weeks in advance, enabling friends, couples and fans to plan their visits. Sports bars are known for specializing in high margin liquor and beverage sales rather than lower margin food items. Indeed, Ryan says that about 45% to 50% of its revenue derives from liquor and beverage sales. He describes the menu as “elevated bar food combined with upscale signature dishes.” For example, it offers a sushi-grade tuna tower, lobster and shrimp macaroni and cheese, and Nashville hot fried chicken on cornbread, besides the requisite chicken wings. Reactions from Tom’s clientele at the Los Angeles outpost on Yelp were favorable but mixed. Allen from Fullerton, Calif, chose Tom’s “to watch some football since they have a plethora of TVs so it’s a good spot to watch some sports.” He described his burger “as pretty decent,” and he placed his order online. But he added “the beers can cost you as much as if you were at a game.” Cindy on Yelp described the atmosphere at Tom’s in Los Angles as “super awesome with everyone rooting for their team.” She was also pleased with her 40-ounce beer. She also liked the buffalo wings, which were “tasty and tender,” but thought the cost of $28 for a dozen, was a bit steep. Since it’s opening sites from Florida to California, Ryan says it has hired a COO, Shannon McNiel who has experience with Darden Restaurants and Texas Roadhouse, and can develop managerial talent as well as rely on his known connections. “That way we can establish a national footprint sooner rather than later,” he says, dedicated to sustained expansion nationwide. Editorial Standards Reprints & Permissions LOADING VIDEO PLAYER... FORBES’ FEATURED Video © 2025 Forbes Media LLC. All Rights Reserved. AdChoices Privacy Statement Your Privacy Choices Cookie Preferences Digital Terms of Sale Terms of Service Contact Us Send Us Feedback Report a Security Issue Jobs At Forbes Reprints & Permissions Forbes Press Room Advertise"
    }
  ]
}