{
  "fuentes": [
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "email": "info@rivervillegrill.com"
    },
    {
      "url": "https://torchedbarandgrill.com/events",
      "email": "flags@2x.png"
    },
    {
      "url": "https://hometeambbq.com/",
      "email": "employment@hometeambbq.com"
    },
    {
      "url": "https://www.gibbethillgrill.com/",
      "email": "info@gibbethill.com"
    },
    {
      "url": "https://torchedbarandgrill.com/",
      "email": "flags@2x.png"
    },
    {
      "url": "https://www.sidebargrill.com/contact-us/",
      "email": "hero-contact@2x.jpg"
    }
  ],
  "mails": [
    "employment@hometeambbq.com",
    "flags@2x.png",
    "hero-contact@2x.jpg",
    "info@gibbethill.com",
    "info@rivervillegrill.com"
  ],
  "nombre_sitio": "torchedbarandgrill.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "text": "Contact Us - Riverville Bar & Grill Skip to content Our location (608) 424-0020 Menu Menu Our location (608) 424-0020 Get in touch We’d love to hear from you. Here’s how you can reach us! Call us! Want to make a reservation or have a question? (608) 424-0020 Have a question? Fill out my online form . Copyright 2025 © Riverville Bar & Grill Design & Development: Accent Graphix Design Studio Home Browse our Menu Mexican Specials Menu Gallery Contact Us #image_title ×"
    },
    {
      "url": "https://torchedbarandgrill.com/events",
      "text": "Live Events | Torched Bar & Grill – Cape Coral’s Tiki Music Spot Home About Us Events Contact Us Events at Torched Bar & Grill, Cape Coral, FL Live Music. Real Vibes. Plan a Party live music. Come for the food, stay for the community. Catch live music, DJs, themed nights, and local favorites nearly every day of the week. Check out our upcoming events below or follow us on Facebook to stay in the loop. DISCOVER your neighborhood bar MENU Home About Us Events Contact Us RESOURCES Our Menu Cocktail Menu Sponsorship & Partner Program Catering HELPFUL LINKS Terms of Service Privacy Policy Advertising Disclosure Concept owned & operated by the Paradygm Hospitality Group Copyright @ 2025 - All rights reserved."
    },
    {
      "url": "https://hometeambbq.com/",
      "text": "Barbecue Restaurant - Home Team BBQ Menu/Locations Order Online open daily Menu/Locations Merch Our Story Events News Catering Catering follow Order Online Here Aspen, CO Columbia Downtown Charleston Greenville, SC Mt. Pleasant Sullivan’s Island West Ashley LARGE PICK-UP & DELIVERY Full-Service Catering Seasonal Menus Start a quote A barbecue restaurant combining traditional processes and techniques of classical cuisine with the simplicity of comfort food, bbq, and southern fare. At Home Team BBQ we have taken a unique approach by bringing the fundamentals of the “white tablecloth” world to the low and slow ideals of BBQ. In our barbecue restaurants, we believe in keeping it fresh and local, and sending guests happily on their way after a good time has\r\nbeen had by all. With a menu of award-winning food, ever-evolving bar offerings, a fun and family friendly atmosphere, catering options, and live entertainment, it makes it easy to root for Home Team BBQ! JOIN THE HOME TEAM! Join a tight-knit crew of dedicated teammates who work together at your neighborhood go-to spot for College Football to serve up great BBQ, good vibes, and top-tier guest experiences. We are seeking driven candidates who are organized, professional, and have a love for the food and beverage industry. \r\n\r\nHome Team BBQ offers competitive salaries, a benefits program including employer-paid health insurance, paid time off, a 401k plan with employer match, quarterly profit sharing and opportunities for personal/professional growth. Interested candidates should submit resumes to employment@hometeambbq.com AND apply online at hometeambbq.com. View our job openings! EVENTS MUSIC FOOD good times SMELL WHAT’S COOKING join our loyalty program! Register your Pig Points sign in here to earn PIG POINTS and take advantage of our latest deals! Have our team cater to yours BOOK THE 'QUE! We’re nothing without our community! Please reach out if you are interested in having Home Team BBQ support a community event or fundraiser. CLICK HERE FOR MORE INFO FOR DAILY SPECIALS AND HAPPENINGS Follow @HOMETEAMBBQ Open post by hometeambbq with ID 18048291680311836 Open post by hometeambbq with ID 18236484373289920 Open post by hometeambbq with ID 18086006425843624 Open post by hometeambbq with ID 18061672235604520 COLUMBIA, SC @HOMETEAMBBQCOLA Aspen, CO @HOMETEAMBBQASPEN GREENVILLE, SC @HOMETEAMBBQGVL locations Aspen, CO 970-236-2040 Ext 2 Columbia (803) 724-3900 dtwn Charleston 843-225-7427 4 Greenville, SC 864-686-7427 Mt. Pleasant 843-225-7427 5 Sullivan’s Island 843-225-7427 3 West Ashley 843-225-7427 2 Interested in joining the team? check out Careers employment@hometeambbq.com Contact Us Press Our Story Loyalty Program Community Copyright 2025 home team bbq | Privacy Policy | by SDCO Partners https://hometeambbq.com/wp-content/themes/hometeambbq We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. OK"
    },
    {
      "url": "https://www.gibbethillgrill.com/",
      "text": "Gibbet Hill Grill - Gibbet Hill Grill Skip to content Gibbet Hill Grill Primary Menu Home About Menus Private Events Trails Contact News Careers Instagram Facebook Careers Instagram Facebook Gibbet Hill Grill 61 Lowell Road Groton, MA 01450 978-448-2900 Make a Reservation Buy a Gift Card Purchase a Gibbet Hill Grill Gift Card Gibbet Hill Grill Gift Card $ 25.00 – $ 250.00 Denomination Choose an option $25 $50 $75 $100 $125 $150 $200 $250 Clear Gibbet Hill Grill Gift Card quantity Add to cart SKU: GiftCard-GHG Category: Uncategorized Description Additional information Description All physical Gibbet Hill Grill Gift Cards are sent via USPS Priority Mail, shipping calculated at checkout. – OR – IF YOU WOULD LIKE TO PURCHASE AN INSTANTLY DOWNLOADABLE GIFT CARD, PLEASE CLICK HERE . Gift cards are redeemable at Gibbet Hill Grill, as well as Scarlet Oak Tavern, The Bancroft, and The Double Bull Taphouse. Additional information Weight 1 oz Dimensions 3.375 × 2.125 × 0.1 in Denomination $25, $50, $75, $100, $125, $150, $200, $250, Custom To purchase larger/different denominations, add multiple cards to the basket and indicate your preference in the comments. × A Farm to Table Restaurant Gibbet Hill Grill is at the forefront of the local food movement. We are one of the only restaurants in New England that has a multi-acre livestock and produce farm on site, and our chef shapes the menu around what is seasonally available. Located on the 100-acre Gibbet Hill Farm in Groton, MA, guests can experience farm-to-table dining while enjoying the beautiful landscape of Gibbet Hill. Menus Produce from our own farm DINNER LUNCH Cocktails WINE BEER Dessert KIDS Learn about our Beverage and Cocktail Program DINNER Dinner menu is served Monday - Friday, 4pm - close, and Saturday & Sunday, 11:30am - close. All items available for takeout. Please click HERE if you would like to place your order online. The dining room is closed from 3pm-4pm, Monday - Friday. During this time, guests may sit in our bar or lounge and order from the Mid-Day menu . GLUTEN-SENSITIVE MENU Appetizers Farmhouse Grilled Cheeses Locally sourced cheeses, tomato soup 14. Bombas Bravas Potato croquette, serrano ham, garlic aioli, Manchego 17. Bao Buns Pork belly, hoisin BBQ, cilantro, farm slaw 15. Thai Red Curry Mussels Lemongrass, ginger, garlic, coconut milk, sourdough 20. Blistered Farm Vegetables Garlic-lemon aioli, cider gastrique, pickled peppers, spicy seed crisp 15. Cindy's Crab Dip Jumbo lump crabmeat, Vermont cheddar 25. Cheese Board Selection of New England cheeses, house made jam, candied walnuts, toasted bread 23. Add Charcuterie 12. Yellowfin Tuna Coconut sushi rice, ginger, wakame, avocado-wasabi purees 20. Soups & Salads New England Clam Chowder Cup   8 . Bowl 11. Summer Bisque Cup 8. Bowl 11. Watermelon Salad Cucumber, pickled garlic scapes, cilantro, chili oil, peanuts 16. Summer of '25 Farm greens, confit beets, shaved fennel, fruit, toasted almonds, goat cheese, berry vinaigrette 17. Gibbet Hill Salad Baby lettuce, farm vegetables, buttermilk ranch Side    9 . Full   13 . Classic Caesar Sourdough croutons, shaved pecorino Side    9 . Full   13 . Salad Add-ons Grilled Chicken  11. 4 Jumbo Shrimp*  16. Steak Tips*  25. Salmon*  21. Entrees Scottish Organic Salmon* Flint corn grits, garlicky greens, sauce creole, giardiniera 31. Rack of Lamb Apricot cous cous, harissa carrots, vadouvan lebneh, pickled cranberries 38. Rigatoni Bolognese Beef, pork, lamb, ricotta, parmesan, basil  32 . Seared Yellowfin Tuna Confit potato, snap beans, oven-roasted tomato, olive crumble, garlic aioli 34. Garlic & Herb Chicken English pea risotto, summer vegetables, charred onion salsa verde 30. Bone-in Veal Chop Chive spaetzle, braised red cabbage, port wine demi  58 . Gnocchi Verano Farm vegetables, pickled rhubarb, pistachio, pecorino, arugula, mint 26. Steak Frites* Hanger steak, farm greens, pickled onion, bone marrow butter, truffle fries 34. Crispy Potato-Crusted Haddock Sweet corn and bacon chowder 28. Chicken Pot Pie Roasted chicken, potato, carrots, peas 23. Maximilian Burger* Cheddar, lettuce, pickles, rosemary aioli, fries 19. From the Grill Served with choice of two farm sides. Substitute a Gibbet Hill or Caesar Salad 7. Add 2. for Mushrooms as a farm side USDA Choice Black Angus Sirloin Steak Tips 32. 12 oz. New York Sirloin 39. 12 oz. Bone-in Rib Eye 51. 20 oz. Filet Mignon 6 oz.  36. / 10 oz.  47. Hanger Steak 32. 10 oz. Porterhouse 56. 24 oz. Steak Add-ons    3. Truffle Butter • Bordelaise • Blue Cheese Compound Butter • Sautéed Mushrooms • Bearnaise • Barbecue Sauce • Steak Sauce • Caramelized Onions • Bone Marrow Butter • Sunny Side Egg* Two(2) Jumbo Shrimp 8. Roasted Bone Marrow* 8. Farm Sides Daily Harvest 10. Mashed Yukon Gold Potato 6. Idaho Baked Potato 5. make it loaded 3. Mushrooms cremini, oyster, shiitake 11. Mac & Cheese buttery bread crumbs 10. French Fries 7. *Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of food borne illness. LUNCH Our lunch menu is served Monday - Friday, 11:30am-3:00pm. Please call the restaurant for takeout orders during our lunch hours. The dining room is closed from 3pm-4pm, Monday - Friday. During this time, guests may sit in our bar or lounge and order from the Mid-Day menu . GLUTEN-SENSITIVE MENU Appetizers Blistered Farm Vegetables Garlic-lemon aioli, cider gastrique, pickled peppers, spicy seed crisp 15. Bombas Bravas Potato croquette, serrano ham, garlic aioli, Manchego 17. Cindy's Crab Dip Jumbo lump crabmeat, Vermont cheddar 25. Cheese Board Selection of New England cheeses, house made jam, candies walnuts, toasted bread 23. Add charcuterie 12. Summer Bisque Cup 8. Bowl 11. New England Clam Chowder Cup   8 . Bowl 10. Salads Maplebrook Burrata Snap beans, basil-pea puree, cucumber, serrano ham, shaved fennel, white balsamic, pepitas 17. Gibbet Hill Salad Baby lettucs, farm vegetables, buttermilk ranch Side    9 . Full   13 . Watermelon Salad Cucumber, pickled garlic scapes, cilantro, chili oil, peanuts 16. Classic Caesar Sourdough croutons, shaved pecorino Side    9 . Full   13 . Summer of '25 Farm greens, confit beets, shaved fennel, berries, toasted almonds, goat cheese, berry vinaigrette 17 . Salad Add-ons Grilled Chicken  11. 4 Jumbo Shrimp*  16. Steak Tips*, 6oz.  17. Salmon*  21. Bowls Steak & Sunnies Sirloin tips, 2 farm eggs, fried potatoes, giardiniera, greens, rosemary aioli 25 . Farm Egg & Smoked Haddock Scramble Crème fraiche, scallion, cucumber, watercress, dill, fried potatoes 18. Harvest Grain Carolina Gold and wild rice, vegetables, seed crumble, goat cheese, preserved lemon vinaigrette  17 . Sandwiches Buttermilk Fried Chicken Farm pepper hot sauce, coleslaw, house pickles, fries 18. Maximilian Burger* Cheddar, lettuce, pickles, malt vinegar aioli, fries 19. Pulled Pork Cheddar cheese, house made BBQ, brioche bun, fries 16. Farmhouse Grilled Cheeses Locally sourced cheeses, tomato soup 14. Grilled Chicken Caprese Tomato, fresh mozzarella, basil, balsamic reduction, sourdough, fries 16. Entrees Scottish Organic Salmon* Flint corn grits, garlicky greens, sauce creole, giardiniera 31. Crispy Potato-Crusted Haddock Sweet corn and bacon chowder 28. Gnocchi Verano Farm vegetables, pickled rhubarb, pistachios, pecorino, arugula, mint 26. Steak Frites* Farm greens, pickled onion, bone marrow butter, truffle fries Hanger, 10 oz. 34. Filet 6 oz.  38. / Filet 10 oz. 49. Chicken Pot Pie Roasted chicken, potato, carrots, peas 23. New York Sirloin Mashed potato, seasonal vegetable, bordelaise sauce 39. DESSERTS Carrot Cake Cream cheese frosting 10. Chocolate Pot de Crème Salted caramel 10. Cookies & Milk Homemade cookies, glass of cold milk 10. Toscanini's Ice Cream or Seasonal Sorbet 10. *Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of food borne illness. Cocktails Tried & True 10-Year Punch House-bottled rum punch, made with our Webber Restaurant Group select, local Bully Boy rum. Enough for seconds! 24. El Barrio Don Julio tequila, Cocchi Americano, mandarin shrub, lemon, torched rosemary 14. Smoke & Dagger Mezcal Rosaluna, Rhum JM, Giffard Abricot Du Roussillon, Amaro Braulio, lime, Thai chili 14. Wood 'n Teeth Old Forester rye whiskey, amaro-balsamic, Angostura bitters, smoked cherry tobacco cube 15. Dalliance Strawberry-thyme vodka, elderflower liqueur, lemon, sparkling wine 14. Gatekeeper Evan Williams bonded bourbon, pineapple-cinnamon syrup, Becherovka, lime, Amargo bitters, Scotch spritz 14. Aviation Fizz Empress Elderflower Rose gin, Luxardo Maraschino, Crème de Violette, lemon sparkling wine 14. Blood Orange Sangria White wine, blood orange & elderflower liqueur, brandy, citrus, sparkling wine 14. Creole 75 Hine XO Cognac, Pierre Ferrand Orange Curaçao, meyer lemon, mini bottle of Nicolas Feuillate Champagne 38. Summer Solstice Homefield Advantage Farm-inspired cocktails, crafted by our bartenders 14. Drop Anchor Privateer New England Reserve rum, Smith & Cross rum, passion fruit, grapefruit, lime, clove, cinnamon, amaro Nardini, orgeat, Angostura bitter 14. Berry Blossom Sour Old Forester bourbon, raspberry, orange blossom honey, lemon, egg white 15. Mirtillo Spritz Blueberry gastrique, lemoncello, sparkling wine, seltzer 14. The Archives Cicada (c. 2014) Song Cái gin, cucumber-celery, falernum, broVo genepy, lime, lemon oil 14. Improved Whiskey Cocktail (c. 1887) Old Forester rye, Luxardo Maraschino, absinthe, Peychaud's & Angostura bitters 14. Warday's Cocktail (c. 1930) Hayman's gin, Daron Calvados, Yellow Chartreuse, Cocchi Vermouth Di Torino 15. Dandy Cocktail (c. 1930) Old Forester rye, Cap Corse Rouge, Combier, Angostura Bitters 14. Non-Alcoholic Libations We are pleased to offer non-alcoholic craft cocktails, designed with the same fresh ingredients and creativity found in our boozy beverages. Please note, non-alcoholic spirits, mixes and beers do contain trace amounts of alcohol (<0.5%). Andalusia DHOS Orange, orgeat, passion fruit, hibiscus, seltzer 12. Rum New Fashioned CleanCo spiced rum, orange twist, sugar cube, orange bitters, Luxardo cherry 12. Smoke Show Fluère Smoked Avage, lime, agave nectar, Tajin 12. WINE To view our entire wine list, please click HERE . WHITE & SPARKLING BY THE GLASS G.D. Vajra \"Rosabella\" Rosé 13 Torre di Luna Pinot Grigio 10. Valravn Chardonnay 14. Tohu Sauvignon Blanc 13. Blackbird \"Dissonance\" (semillon-sauv blanc) 12. Domaine Landron 13. Raimund Prum \"Essence\" Riesling 12. RED WINES BY THE GLASS Averæn Pinot Noir 15. Patriarch Cabernet Sauvignon 17. Oxford Landing Cabernet Sauvignon 12. Domaine Bousquet Reserve Malbec 12. Es Okay (cab-mourvèdre-merlot-pinot noir-touriga) 12. Babylonstoren \"Babel\" 14. Valle Reale Montepulciano 12. J.L. Chave \"Mon Coeur\" 15. BEER Lager Budweiser, 5.0% 6. Bud Light, 4.2% 6. Coors Light, 4.2% 6. Corona Extra, 4.6% 6. Heineken, 5.0% 6. Sam Adams, 4.9% 6. Michelob Ultra, 4.2% 6. Stella Artois, 5.0% 6. Porter + Stout Founders Porter, 6.5% 7. Left Hand Milk Stout, 6.0% 7. Old Rasputin Russian Imperial Stout, 9.0% 8. Ale Lagunitas A Little Sumpin, 7.5% 7. Castle Island Candlepin, 4.4% 7. Rising Tide Ishmael Copper, 4.9% 7. IPA Dogfish Head 60 Minute, 6.0% 7. Founders All Day, 4.7% 7. Night Shift Santelli, 6.0% 8. Other Downeast Original Blend Cider, 5.1% 6. Lucky Pigeon \"Eclectus\" Blonde Ale (gluten free), 5.0% 9. Lucky Pigeon \"Rock Dove\" IPA (gluten free), 6.5% 9. Draft Beer Coastal Mass/Gibbet Hill Captain Max IPA, 7.0% 9. Bissell Brothers Substance IPA, 6.6% 9. Allagash White Belgian Ale, 5.1% 8. Lawson's Sip of Sunshine, 8.0% 9. Fiddlehead IPA, 6.2% 8. Von Trapp Bohemian Pilsner, 5.4% 8. Carlson Orchards Oak Hill Blend Cider, 4.5% 7. Austin Street Brewery Patina Pale Ale, 5.3% 8. Guinness Stout, 4.2% 7. Wachusett Brewing Blueberry, 4.5% 8. Deciduous Won't Back Down Oatmeal Porter, 8.0% 9. Narragansett Lager, 5.0% 6. Dessert DESSERT Carrot Cake $10 Cream cheese frosting Blueberry Cobbler $10 Vanilla ice cream Vanilla Cheesecake $10 Berries, Graham cracker crumble Chocolate Pot de Crème $10 Salted caramel Chamomile Panna Cotta $10 Apple mint syrup, pistachio florentine Cookies & Milk $10 Homemade cookies, glass of cold milk Toscanini’s Sorbet $6 HOT DRINKS GHG Irish Coffee  $11 Housemade Irish cream, Paddy Irish whiskey Millionaire's Coffee  $12 Kahlua, Grand Marnier, Frangelico, housemade Irish cream Maple Toddy  $12 Buffalo Trace, Hollis Hills maple, lemon, Angostura bitters DESSERT WINES Michel Chiarlo \"Nivole\"  $10 Moscato d'Asti, It 2019 La Fleur Renaissance  $15 Sauternes, Fr 2016 Susana Balbo Late Harvest Torrontés  $18 Moscato d'Asti, It 2019 PORTS & SHERRIES Hidalgo \"La Gitana\" Manzanilla  $10 El Maestro Sierra 12-year Amontillado  $20 Quinta do Noval \"Black\" Ruby  $8 Warre's LBV 2008  $10 Warre's 10-year Otima Tawny  $11 Ramos Pinto 20-year Tawny  $20 Taylor 30-year Tawny  $27 KIDS ENTREES PASTA WITH BUTTER AND PARMESAN 11. MAC & CHEESE 13. Entrees below include one farm side SIRLOIN STEAK TIPS 19. BLACK ANGUS CHEESEBURGER 14. CHICKEN FINGERS 16. GRILLED CHICKEN 15. GRILLED CHEESE SANDWICH 11. FARM SIDES Daily Harvest Yukon Gold Mashed Potato French Fries Mushrooms Mac & Cheese Chocolate Chip Cookie, Ice Cream or Sorbet complimentary with meal, Ice Cream Cookie Sandwich: 2.00. Beverage and Cocktail Program Cocktails Gibbet Hill Grill's Cocktail Menu evolves seasonally, and during harvest season, you will see much of our cocktail menu ingredients come directly from our farm. Local distillers, creative recipes, house made syrups, and tinctures shape our specialty cocktail list. Wines At Gibbet Hill Grill we believe that wine should be considered a regular part of every meal, and that a wine list should not be pretentious or inaccessible to anyone. Subsequently our wines are all carefully chosen to provide both quality and an excellent pairing for Chef’s food. The wine list maintains its own set of core values, and all the wines fall into at least three of these categories to even be considered. Incredible quality Small production or family owned Innovative find Structured perfectly for food Surprising value Special connection to our team Every wine on our list has been tasted, and as we continue to rotate the wines with the season and vintage changes, any and all wines will be reviewed before being presented to our guests. In the meantime, we will continue to strive to find new wines that can’t be found in local restaurants in order to provide our guests with an interesting, innovative, food-based wine list that is worth coming back to explore. In 2016, we added our own label to the wine list, Patriarch, a red blend that was blended by our own wine director, Kate Webber. The goal was to create a red blend that appealed to a wide audience and but would also pair with a large number of menu items across our restaurants. The varietals change with every new vintage. Beer In 2022 we partnered with one of our favorite local breweries, Channel Marker, to create a New England style IPA brewed exclusively for Webber Restaurant Group restaurants. After months of recipe testing, tasting, and refining with a team of WRG beer lovers, Captain Max was born. Captain Max is a New England style, hazy IPA that features Citra, Mosaic, and Cashmere hops. These hops drive forward flavors and aromas of freshly peeled oranges, clementines, and a subtle hint of passionfruit. Private Events We are pleased to offer private events at Gibbet Hill and at The Barn at Gibbet Hill.  If you are interested in learning more about a private event , please click on the \"Plan Your Event\" button below and fill out the form. Gibbet Hill Grill can host events up to 35 guests on our mezzanine level during regular business hours (excluding Saturday evenings). For weddings and larger events, please contact The Barn at Gibbet Hill . Plan Your Event The Mezzanine Parties of up to 35 seated guests for a plated dinner are welcome in this spacious and versatile space.  Guests enjoy use of the upstairs silo, and fireside mezzanine which overlooks the bar and lounge. The Silo A coveted setting for special occasions of up to 8 guests each, our two silo rooms offer stunning views of Gibbet Hill and unique dining experiences. Meet the Team Martha Lisio, General Manager Martha’s formal education includes studying accounting at Babson College, but after one too many audits, she realized she needed to be around more people and less paper. Moving to Marco Island, Florida, she began her career in the restaurant industry and also spent some time as a mate on a parasail boat.  Having successfully shunned the stress of corporate life for six years, she returned to Massachusetts and rediscovered her high school sweetheart. Celebrating their fourth wedding anniversary at Gibbet Hill Grill, table 28 to be exact, she told her husband, “I love the energy in this room, I could work here.”  The rest is history.  Martha joined the team in 2005 and was promoted to general manager in 2015. Joe Salisbury, Farm Manager Armed with a degree in Plant, Soil & Insect Sciences from UMass Amherst, Gibbet Hill Farm Manager, Joe Salisbury, has been farming in New England for the last decade.  From blueberry farming in the Berkshires, to greenhouse management in Deerfield to kitchen gardener at the historic Island Inn, off the coast of central Maine on Monhegan Island, Joe’s passion for sustainable farming has continued to grow.  Working with the chefs at Island Inn, allowed him to reconnect small scale farming to the culinary world which ultimately led him to Gibbet Hill. When he’s not at work on the farm, you might find him learning a new language or in the kitchen incorporating freshly harvested produce he’s grown into pickled items or into a savory meal such as butternut squash mac & cheese or tarragon chicken. Contact Hours OPEN DAILY 11:30am - 9pm Lunch Menu Monday - Friday 11:30am - 3:00pm Mid-Day Menu Monday - Friday 3:00pm - 4:00pm Served in bar & lounge Dinner Menu Monday - Friday 4:00pm - 9:00pm Saturday & Sunday 11:30am - 9:00pm Bar & Lounge Monday - Sunday 11:30am - 9:00pm CLICK HERE TO MAKE A RESERVATION. Gibbet Hill History & Trail Map 61 Lowell Road Groton, MA 01450 978-448-2900 info@gibbethill.com Interested in working at Gibbet Hill Grill? Get in touch with us Newsletter SIGN UP FOR THE NEWSLETTER Subscribe Loading... Thank you! You have successfully joined our subscriber list. Gibbet Hill Grill on Instagram Instagram did not return a 200. Gibbet Hill Grill on Twitter Please check your Twitter Application details, that you have specified the number of tweets to load, if you have ran out of API requests, or if your account is set to private 61 Lowell Road. Groton, MA 01450 978-448-2900 info@gibbethill.com by ICS Webber Restaurant Group Make a Reservation Click HERE to make a reservation. If you need a reservation for more than 4 guests, please call the restaurant directly. When making an online reservation, be sure choose “Cannot Climb Stairs” when applicable. Private Dining Request Gibbet Hill Grill can host events up to 35 guests on our mezzanine level during regular business hours (excluding Saturday evenings). For weddings and larger events, please contact The Barn at Gibbet Hill. To enter an Event Request, please fill out the following form."
    },
    {
      "url": "https://torchedbarandgrill.com/",
      "text": "Torched Bar & Grill | Cape Coral’s Live Music Tiki Bar Home About Us Events Contact Us Tiki Bar & Grill in Cape Coral, Florida Island Vibes The Menu Plan a Party Escape the Ordinary Call Us (239) 257-2870 Visit Us 2408 Surfside Blvd Ste 101, Cape Coral, FL 33991 Get Directions Locally BUILT. Community Inspired. Where Cape Coral comes to eat, drink, and feel like family. Torched Bar & Grill is a true local hangout in Cape Coral, Florida. We’re a tiki-style bar and grill built for the people who keep our community moving. Veterans, first responders, and hospitality pros are part of the Torched family, and we show it every day with respect, service, and perks that go beyond the plate. We serve flame-grilled favorites, ice-cold cocktails, and laid-back island vibes from morning to last call. Whether you're off shift, visiting for the weekend, or a Cape Coral native, Torched is where good food and good people always come together. Ask your server about our “ITB” program for hospitality workers and enjoy exclusive all-day discounts. 125,000+ Locals Served 12 Live Shows a Month 32 Beers Selection 10 Years Supporting Veterans The Heart of Cape Coral More Than Dinner Dinner. Drinks. Music. At Torched, we don’t just serve meals... we deliver moments. From sizzling plates that light up the room to cocktails that kick harder than a Friday night band, every visit is an experience worth talking about. Order Online A NEW ERA of hospitality A NEW ERA DISCOVER your neighborhood bar MENU Home About Us Events Contact Us RESOURCES Our Menu Cocktail Menu Sponsorship & Partner Program Catering HELPFUL LINKS Terms of Service Privacy Policy Advertising Disclosure Concept owned & operated by the Paradygm Hospitality Group Copyright @ 2025 - All rights reserved."
    },
    {
      "url": "https://www.sidebargrill.com/contact-us/",
      "text": "Contact Us - Sidebar Grill 778.298.7433 | Now Hiring View Menu Promotions Order Online Book A Table Live Music Home About Us Menu Events & News Event Venue Gift Cards Contact Us CONTACT US Get In Touch Please leave your name, email and message and we will respond within 48 hours. If you have an urgent request, please feel free to call us directly. 778.298.7433 info@sidebargrill.com View Form Unit B – 100 20018 83A Ave Langley BC, V2Y 3R4 Underground Parking Available SUNDAY TO THURSDAY 11am  - 11pm FRIDAY & SATURDAY 11am  - 12am Get Directions Get In Touch Please leave your name, email and message and we will respond within 48 hours. If you have an urgent request, please feel free to call us directly at: 778-298-7433. First Name * Last Name * Email * Phone Message 778.298.7433 info@sidebargrill.com Unit B – 100 20018 83A Ave Langley BC, V2Y 3R4 Underground Parking Available Available to serve you seven days a week: Monday – Thursday 10:00am-11:00pm Friday and Saturday 9:00am – 12:00am Sunday 9:00am - 11:00pm Home About Us Menu Events & News Private Dining Gift Cards Contact Us"
    }
  ]
}