{
  "fuentes": [
    {
      "url": "https://grrestaurant.com/about-us/",
      "email": "info@grrestaurant.com"
    },
    {
      "url": "https://proofva.com/contact",
      "email": "proof@villagiogroup.com"
    },
    {
      "url": "https://www.uptowncr.com/vendors/tortugas-florida-kitchen-bar",
      "email": "scott@tortugasflorida.com"
    }
  ],
  "mails": [
    "info@grrestaurant.com",
    "proof@villagiogroup.com",
    "scott@tortugasflorida.com"
  ],
  "nombre_sitio": "tortugasflorida.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://grrestaurant.com/about-us/",
      "text": "About Us - Gary Rack Restaurant Management Group Skip to content About Us Our Restaurants Press Careers Contact Main Menu About Us Our Restaurants Press Careers Contact About Us Our mission is delivering better guest experiences Our Story Gary Rack Restaurant Group, founded by entrepreneur Gary Rack, delivers complete management and operations services in South Florida with a three-restaurant track record thus far, continuously evolving into a more dynamic organization. We work with clients who share our dedication to creating spectacular guest experiences with the perfect blend of amazing food and a fun atmosphere. And, we do it with the help of our expert executive chef, Demetrio Zavala. Forward-thinking diners will love our restaurants’ modern take on traditional dishes, and our staff members are trained extensively in providing the best experiences possible for guests. We ensure our values are instilled in every team so diners get consistent high-end service in a laid-back environment. Hip, Unique Ambiance Relax in style at our chic, modern restaurants Remarkable Cuisine Exceptionally fresh, farm-to-table meals Outstanding Service Friendly and attentive staff Our Specialties Try our food made by real people, with love Farmhouse Kitchen Farm-to-table concept that serves local ingredients sourced by South Florida vendors RACK'S FISH HOUSE The freshest South Florida seafood prepared in a simple and delicious way Meet The Team Gary Rack Founder & Owner Gary Rack is a self-made entrepreneur who lives life to the fullest. He is a true family man, building his restaurants and management group with family values in mind. He believes in putting quality time with family and friends first, alongside some amazing food and wine. Gary treats his staff like they’re part of the family. He says, “There is no greater reward than to watch your employees succeed to the point where you’ve bettered their lives, their financial ability, and their quality of living. We believe in coaching and training employees to understand that hard work, dedication, integrity, and honesty will lead them down the road of financial success, freedom, and stability within our company.” Gary created Gary Rack Restaurant Management Group so he could share his love of food and combine it with an exceptional dining culture. He opened FarmHouse Boca and Racks Fish House + Oyster Bar, followed by FarmHouse Delray, with the help of a renowned executive chef who aligned with Gary’s vision for a better guest experience. Neighborhood dining in South Florida will never be the same, as Gary has created places for all to gather and enjoy unique dishes and concepts. Demetrio Zavala Directory of Culinary Demetrio Zavala joins the Gary Rack Restaurant Management Group after an already successful career. He’s appeared on the Food Network numerous times, on various TV shows, and is an eight-time Chopped Champion. He started his career in Washington, D.C., and worked under several famous chefs in New York, becoming more and more interested in farm-to-table cooking. He started growing his own vegetables so he supports seasonal menus, sometimes changing them every six weeks. He has also worked at a Michelin-rated restaurant and has other high-end experience that helps him deliver uniquely delicious dishes. Demetrio’s father was in the military, so he was born at Fort Carson army base in Colorado but grew up in Delray Beach, Florida. He now has kids and grandchildren, and he’s proud to have a son that plays football and a daughter in the military. Home About Us Our Restaurants Events Press Careers Contact Us 800 Fairway Drive, Ste 292, Deerfield Beach, FL 33441 (561) 251-9028 info@grrestaurant.com FarmHouse Boca FarmHouse Delray Racks Fish House FarmHouse Racks Fish House Grrestaurant Copyright © 2025 Gary Rack Restaurant Management Group"
    },
    {
      "url": "https://proofva.com/contact",
      "text": "Contact Us | Proof Kitchen + Bar | Manassas, VA About About Proof Our Team Visit MurLarkey Careers Gift Cards Contact Us Menu Menu Lunch Dinner Brunch Kids Dessert MurLarkey Cocktails Happenings Private Dining Order Online Gift Cards Reserve Contact Us Get in touch with us – We’re here to help! Whether you have questions about our menu, events, or private dining, our team is ready to assist. Reach out today! Join us in Manassas Address: 9861 Discovery Blvd. Suite 115 Manassas, VA 20109 Phone: (703) 789-2655 Email: proof@villagiogroup.com Hours Monday - Thursday: 11:00 AM - 10:00 PM Friday: 11:00 AM - 11:00 PM Saturday: 10:00 AM - 11:00 PM Sunday: 10:00 AM - 9:00 PM Email us Fill out the form below and we'll get back to you as soon as we can. First Name: Last Name: Email: Phone: Message: What is the nature of your message? General Inquiry Private Event & Catering Employment Gift Cards Other Send Your Message! Visit Proof Kitchen + Bar 9861 Discovery Blvd. Suite 115 Manassas, VA 20109 (703) 789-2655 Hours Monday - Thursday: 11:00 AM - 10:00 PM Friday: 11:00 AM - 11:00 PM Saturday: 10:00 AM - 11:00 PM Sunday: 10:00 AM - 9:00 PM Quick Links Reservations Gift Cards Careers Private Dining & Catering Contact Subscribe to our email list Stay informed on all the latest news, events, and happenings at PROOF. Indulge in our other Villagio Hospitality Group Experiences: © 2025 Proof Kitchen + Bar. All rights reserved. Website Design & Development by Taps + Tables Give Us the Details! Your Contact Information First Name * Last Name * Email Address * Phone Number Ext. Company Your Event Details Nature of this Event (e.g., Birthday Party or Business Dinner) Event Date Start Time End Time Number of People (approx.) * Is there any additional information you would like to add? How did you hear about us? Select an option EventUp Instagram Facebook Venues by Tripleseat Search Engine Email Other Please specify Close Private Event Inquiry Please give us a little information about your event. We'll reach out to you to discuss the details within 2 business days. Email the Manager Please email the manager of the location at which you'd like to play: Close"
    },
    {
      "url": "https://www.uptowncr.com/vendors/tortugas-florida-kitchen-bar",
      "text": "Tortugas Florida Kitchen & Bar | Uptown Community Resources Home About us Services All Vendors Auto Services Beauty & Wellness Boutique & Shops Home Improvement In-Home Services (Mobile) Medical Services Pet Services Professional Services Rentals & Activities Restaurants & Catering Careers Charities Hurricane Preparations Vendor Application Support All Vendors Restaurants & Catering Tortugas Florida Kitchen & Bar Tortugas Florida Kitchen & Bar Average star rating: No ratings yet Tortugas is located in beautiful Flagler Beach overlooking the water. If you are looking for a casual restaurant with great American food? This is the place to be! Amazing food, inspiring libations, live entertainment and beautiful ocean views! Open Monday, Tuesday, Wednesday & Thursday -11:00- 9:00 Friday, Saturday, & Sunday- 11:00 - 10:00 Email scott@tortugasflorida.com Phone (386) 439-0098 Office 608 S Ocean Shore Blvd, Website Click to View Visit website Facebook Like on Facebook Instagram Follow on Instagram Twitter Follow on Twitter LinkedIn Follow on LinkedIn YouTube Subscribe on YouTube TikTok Follow on TikTok View services Services Services & Information American Cuisine Live Entertainment Happy Hour Catering No items found. Average star rating: No ratings yet We had a great view, awesome service & great food. After several days of rain, we were looking for dinner with a view. I had the chicken tacos & my husband had the pork belly tacos, both had Caribbean rice. Shout out to our server Christiana, she was excellent. We will definitely be back. -P.G. Nice bar/restaurant by the beach. Live music. It was crowded but the food and service was great. We sat outdoors and it started raining but the servers were helpful and moved our table under the shelter and drew some curtain things down to help shield the rain from getting in the patio area. We enjoyed the wings and frozen Pina Coladas. They also had a cute photo spot with a greenery backstop and a lighted sign that says \"Island Vibes\". -Eyleah Molinski Promotions Special Offers and Discounts for You Check out the latest coupons and special promotions from our featured vendor. Save Big Browse through our exclusive offers and grab the best deals today! Limited Time Don't miss out on these amazing discounts. Get them before they're gone! Learn More Sign Up Tortugas Florida Kitchen & Bar Contact details Contact this vendor today to get your project needs taken care of. Email scott@tortugasflorida.com Phone (386) 439-0098 Office 608 S Ocean Shore Blvd, Website https://www.tortugasflorida.com/ https://www.tortugasflorida.com/ 1-386-356-2386 Information Home About us Support Charities Hurricane Preparations Register as a vendor Services Restaurants & Catering Beauty & Wellness In-Home Services (Mobile) Boutique & Shops Auto Services Rentals & Activities Professional Services Pet Services Medical Services Home Improvement Download Our App! Â© 2025 Uptown Community Resources. All rights reserved. Disclaimers Privacy Policy Terms of Service"
    }
  ]
}