{
  "fuentes": [
    {
      "url": "https://www.surfsidebeach.org/142/Contact",
      "email": "town@surfsidebeach.org"
    },
    {
      "url": "https://www.visitsurfsidebeach.com/contact.html",
      "email": "ebanisch@surfsidebeach.org"
    },
    {
      "url": "https://www.visitsurfsidebeach.com/contact.html",
      "email": "info@visitmyrtlebeach.com"
    },
    {
      "url": "https://www.visitsurfsidebeach.com/contact.html",
      "email": "town@surfsidebeach.org"
    },
    {
      "url": "https://www.surfsidebeach.org/27/Government",
      "email": "town@surfsidebeach.org"
    },
    {
      "url": "https://www.safehavencommunityservices.org/contact",
      "email": "info@safehavencommunityservices.org"
    },
    {
      "url": "https://miami.kidsoutandabout.com/content/surfside-community-center",
      "email": "smccready@townofsurfsidefl.gov"
    },
    {
      "url": "https://www.melvillela.com/contact",
      "email": "mayor@melvillela.com"
    },
    {
      "url": "https://www.melvillela.com/contact",
      "email": "mayor@melvillela.gov"
    }
  ],
  "mails": [
    "ebanisch@surfsidebeach.org",
    "info@safehavencommunityservices.org",
    "info@visitmyrtlebeach.com",
    "mayor@melvillela.com",
    "mayor@melvillela.gov",
    "smccready@townofsurfsidefl.gov",
    "town@surfsidebeach.org"
  ],
  "nombre_sitio": "townofsurfsidefl.gov",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.surfsidebeach.org/142/Contact",
      "text": "Contact | Surfside Beach, SC Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Services Business Floodplain VISITORS I Want To Search Home I Want To Contact Contact 9 1 1 2 Town Council Read about the Town Council and find out how to reach them. Town Staff Access a staff directory for the Town of Surfside Beach. Town Council Town Staff Beaches Forms FOIA Inquiries Employment Parking Notify Me® Contact Us Town Hall 210 Highway 17 S Surfside Beach, SC Phone: 843-913-6111 Fax: 843-238-5432 Email the Town Staff Directory Quick Links Surfside Beach Fishing Pier For more information contact: 843-913-6360 Bids, RFPs & RFQs Code of Ordinances Customer Service Survey Live Pier & Ocean View Town Council /QuickLinks.aspx Helpful Links Home Site Map Contact Us Surfside Beach Fishing Pier Information Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.visitsurfsidebeach.com/contact.html",
      "text": "Surfside Beach Contacts Surfside Beach Contact Information Surfside Beach Info About Surfside Beach Beach Access & Parking Weather Forecast Attractions Map PDF Autism Friendly Travel Town of Surfside Beach Where to Stay Hotels & Motels Vacation Rentals, Beach Houses & Condo Rentals All Accommodations Things to Do Event Calendar Amusements & Fun Parks Golf, Sports, Mini Golf Museums, Gardens, Libraries Parks, Zoo, Outdoors Shows, Movies, Theater Surfside Pier Water Sports & Fishing Nearby Attractions All Attractions Dining Breakfast & Lunch Dessert & Bakery Fast Food Full Service Pizza & Deli Specialty, Other Take-Out & Delivery Lounges & Pubs All Dining Shopping Clothing & Beach Wear Food & Groceries General Merchandise Gifts & Souvenirs Home, Art, Decorating Sports, Golf, Fishing Thrift Shops, Flea Market All Shopping Real Estate Residential Properties Commercial Properties Residential Rentals Commercial Rentals Investment Properties Land & Building Lots Property Management Services All Real Estate Services Local Directory Accommodations Hotels & Motels Vacation Rentals All Accommodations Shopping Clothing & Beach Wear Food & Groceries General Merchandise Gifts & Souvenirs Home, Art, Decorating Sports, Golf, Fishing Thrift Shops, Flea Market All Shopping Real Estate Residential Properties Commercial Properties Residential Rentals Commercial Rentals Investment Properties Land & Building Lots Property Management Services All Real Estate Services Attractions Amusements & Fun Parks Golf, Sports, Mini Golf Museums, Gardens, Libraries Parks, Zoo, Outdoors Shows, Movies, Theater Water Sports, Fishing Nearby Attractions All Attractions Dining Breakfast & Lunch Dessert & Bakery Fast Food Full Service Pizza & Deli Specialty, Other Take-Out & Delivery Lounges & Pubs All Dining Services Advertising & Promotion Auto Services & Transportation Banks, Financial, Insurance Boating & Marinas Building & Construction Events & Weddings Fitness & Wellness Fraternal Organizations, Clubs Government & Political Hair Salons & Spas Kennels & Pet Services Legal Services Medical & Dental Photography & Video Religion & Spiritual Repairs, Parts, Service Storage, Moving, Shipping Tours & Sightseeing Other Services All Services Gallery Contact Home Contact Us Please use the form below to contact us or request more information. Your name, email and message are required. HTML is prohibited. Your Name: Company Name: Address: City: State: South Carolina Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District Of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming Canadian Provences Alberta British Columbia Manitoba New Brunswick Newfoundland Northern Mariana Is Northwest Territories Nova Scotia Ontario Prince Edward Island Province du Quebec Saskatchewan Yukon Territory US Teritories American Samoa Armed Forces Americas Armed Forces Europe Armed Forces Pacific Guam Puerto Rico Virgin Islands Zip: Phone: Your E-Mail: Your Message: Enter the above characters (not case sensitive) New Challenge Additional Contact information: Surfside Beach Town Hall - (843) 913-6111 town@surfsidebeach.org Surfside Beach Events - (843) 839-2879 ebanisch@surfsidebeach.org Area Visitor Information - (800) 356-3016 info@visitmyrtlebeach.com Privacy Policy Surfside Beach The Family Beach On South Carolina's Grand Strand"
    },
    {
      "url": "https://www.surfsidebeach.org/27/Government",
      "text": "Government | Surfside Beach, SC Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Services Business Floodplain VISITORS I Want To Search Home Government Government Surfside Beach is a \"Council Form\" of government with seven members on the Town Council, including the mayor. The mayor presides over council meetings, performs ceremonial duties, calls special meetings, acts as the informational liaison to the governor in times of emergency, and acts and votes as a member of the council. The mayor has no additional statutory authority beyond that of other councilmembers. The Council appoints the Administrator and oversees all aspects of town business and operations. See a Town Organizational Chart (PDF) . To view a map of the 2 square miles incorporated, the Town of Surfside Beach, click HERE Version OptionsGovernmentHeadline . 9 1 1 2 Agendas & Minutes Access easily searchable meeting agendas and minutes for various boards, commissions, and committees. Committees Our committees play a pivotal role in our Town governance to achieve our vision. Departments Read about the various departments of the government of Surfside Beach. Employment The Town of Surfside Beach maintains a policy of Equal Employment Opportunity and, therefore, does not discriminate in employment opportunities or practices on the basis of race, color, religion, sex, national origin, age disability, veteran status, or any other characteristic protected by law. Ordinances The official Town Code of Ordinances is maintained in the Town Clerk's Office. SC Government Visit the official website of the State of South Carolina. SCIWAY SCIWAY is South Carolina's \"front door\": the largest and most comprehensive directory of South Carolina information on the Internet. Town Council Read about the Town Council. Agendas & Minutes Committees Accommodations Tax Board of Zoning Appeals Business Committee Community Garden Committee Construction Board of Appeals Grand Strand Water & Sewer Advisory Board Keep Surfside Beach Beautiful Committee Parking Committee Pier Committee Planning Commission Stormwater Committee Surfside Beach Historical Society Senior Committee Advisory Board Departments Administration Court Pay Pivot Parking Tickets Pay All Other Tickets Events Family Festival Annual Christmas Tree Lighting Surfside Beach Christmas Parade Halloween Rod Run Car Show | CAN Meatball Challenge | Halloween Golf Cart Parade Surfside Beach Hula & Fire Dancer Show Crafter's Cove Surfside Beach Farmers Market My Olive Shack's Festival of Arts & Crafts Market KSBB Beach Sweeps Surf Dreams Foundation Surf Contest & Take a Kid Surfing Day Surfside Beach Fishing Pier Dedication Ceremony Veterans Day Service The Town of Surfside Beach's 60th Anniversary/Birthday Celebration Christmas Movie under the stars in Martin Field Breakfast with Santa Health & Wellness Fair (previously know as the Senior Fair) all adults are welcome to attend Yuletide Golf Cart Parade Trolley of Christmas Lights Surfside Beach Fire & Police Department - Santa Ride Business with a Twist Annual BBQ Festival Easter Egg Hunt & Children's Fair Music in Memorial Park Arbor Day Tree Planting Celebration Anything But BBQ Feast Surfside Beach Community Yard Sale Easter Sunrise Service Community Yard Sale WORRELL 1000 Catamaran Race 2024 Memorial Day Golf Cart Parade 4th of July Golf Cart Parade Memorial Day Service Music on the Surfside Beach Fishing Pier Salute From The Shore 9/11 Memorial Stair Climb Surfside Beach Fire Department Open House Christmas Tour of Homes Business After Hours Underdog Ribbon Cutting Ribbon Cutting Grand Opening Mulligan's Lagoon Mini Golf Halloween Trick-or-Treat Town Map Surfside Beach Fire Department Blood Drive Community Day at Harrison Park Harrison Park Ribbon Cutting Ceremony Surfside Rotary Turkey Trot Elf on the Shelf #shoplocal Surfside Beach Fishing Pier LOGO Contest Surfside Beach Kite Festival Fishing With A Cop End of Summer Fireworks Festival Hurricane Preparedness Seminar Finance Business Licensing Fiscal Transparency Hospitality & Accommodations Tax Forms Fire About the Department FAQ's Fire Marshal's Office Public Education and Outreach Department Reports Blood Drive Flooding Planning, Building & Zoning Building & Zoning Forms Tree City Police Community Alert Program (CAP) Police Department Employment Police Services Public Works Photo Gallery Recycling Sanitation Schedule Storm Drain Illicit Discharge Fact Sheet (PDF) Stormwater Fee Fact Sheet (PDF) Surfside Beach Town Organizational Chart Employment Jobs Ordinances SC Government SCIWAY Town Council Proclamations Resolutions Robert's Rules of Order Beaches Forms FOIA Inquiries Employment Parking Notify Me® Contact Us Town Hall 210 Highway 17 S Surfside Beach, SC Phone: 843-913-6111 Fax: 843-238-5432 Email the Town Staff Directory Quick Links Surfside Beach Fishing Pier For more information contact: 843-913-6360 Bids, RFPs & RFQs Code of Ordinances Customer Service Survey Live Pier & Ocean View Town Council /QuickLinks.aspx Helpful Links Home Site Map Contact Us Surfside Beach Fishing Pier Information Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.safehavencommunityservices.org/contact",
      "text": "Contact Safe Haven Community Services: Get in Touch for Foster, Kinship, and Adoption Support — Safe Haven Community Services 0 Skip to Content About Services Foster Care Kinship Care Adoption Training Annual Training New Family Training New Family Training Resources Contact Information Session Volunteer Community Resources Kids Waiting For Adoption Care Giver Portal Care Giver  Portal (Extended Reach) Care Giver Portal Tutorials Family Gallery FAQs Foster FAQs Kinship FAQs Adoption FAQs Donate English Back-To-School Open Menu Close Menu Open Menu Close Menu About Services Foster Care Kinship Care Adoption Training Annual Training New Family Training New Family Training Resources Contact Information Session Volunteer Community Resources Kids Waiting For Adoption Care Giver Portal Care Giver  Portal (Extended Reach) Care Giver Portal Tutorials Family Gallery FAQs Foster FAQs Kinship FAQs Adoption FAQs Donate English Back-To-School About Folder: Services Back Foster Care Kinship Care Adoption Folder: Training Back Annual Training New Family Training New Family Training Resources Contact Information Session Volunteer Community Resources Kids Waiting For Adoption Folder: Care Giver Portal Back Care Giver  Portal (Extended Reach) Care Giver Portal Tutorials Family Gallery Folder: FAQs Back Foster FAQs Kinship FAQs Adoption FAQs Donate English Back Back-To-School We take pride in delivering exceptional customer service. We Would Love To Connect With You… If you have any questions, please don't hesitate to contact us through the contact form. You can also reach us by email or phone from 9 a.m. to 5 p.m. CST, Monday through Friday. Click on one of the forms below and we will get back to you promptly . Foster Care Foster Care Inquiry Form What services are you interested in? Foster to adopt Foster (only) Respite (only) Caregiver 1 Name * First Name Last Name Caregiver 1 DOB MM DD YYYY Caregiver 1 Phone * (###) ### #### Caregiver 1 Email * Caregiver 2 Name First Name Last Name Caregiver 2 DOB MM DD YYYY Caregiver 2 Phone (###) ### #### Caregiver 2 Email Address Address 1 Address 2 City State/Province Zip/Postal Code Country Number of beds available for foster children? * Gender preference to foster: * boy(s) girl(s) Any gender Age preference to foster: * 0-6 7-12 13-18 Any age How did you hear about us? * Parent / Friend Referral DFPS Community / Church Group Instagram Facebook X (Formally Twitter) LinkedIn YouTube Other Thank you for reaching out to Safe Haven with your foster care inquiry! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . kinship care Kinship Care Inquiry Form What services are you interested in? Kinship-Foster to Adopt Kinship Straight to Adopt Kinship to Permanent Legal Conservatorship (PMC) Caregiver 1 Name * First Name Last Name Caregiver 1 DOB MM DD YYYY Caregiver 1 Phone * (###) ### #### Caregiver 1 Email * Caregiver 2 Name First Name Last Name Caregiver 2 DOB MM DD YYYY Caregiver 2 Phone (###) ### #### Caregiver 2 Email Address Address 1 Address 2 City State/Province Zip/Postal Code Country How did you hear about us? * Parent / Friend Referral DFPS Community / Church Group Instagram Facebook X (Formally Twitter) LinkedIn YouTube Other Name of child's kinship worker: First Name Last Name Phone of Child's kinship worker: (###) ### #### Name of caregiver(s) DFPS worker: First Name Last Name Phone of caregiver(s) DFPS worker (###) ### #### List all children placed in your care by DFPS: Child 1 First Name Last Name Child 1 DOB MM DD YYYY Child 2 First Name Last Name Child 2 DOB MM DD YYYY Child 3 First Name Last Name Child 3 DOB MM DD YYYY Child 4 First Name Last Name Child 4 DOB MM DD YYYY Child 5 First Name Last Name Child 5 DOB MM DD YYYY Child 6 First Name Last Name Child 6 DOB MM DD YYYY Thank you for reaching out to Safe Haven with your kinship care inquiry! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . Adoption Adoption Inquiry Form What services are you interested in? Foster to adopt Straight Adopt Caregiver 1 Name * First Name Last Name Caregiver 1 DOB MM DD YYYY Caregiver 1 Phone * (###) ### #### Caregiver 1 Email * Caregiver 2 Name First Name Last Name Caregiver 2 DOB MM DD YYYY Caregiver 2 Phone (###) ### #### Caregiver 2 Email Address Address 1 Address 2 City State/Province Zip/Postal Code Country Number of beds available for adoption/foster children? * Gender preference to adopt: * boy(s) girl(s) Any gender Age preference to adopt: * 0-6 7-12 13-18 Any age How did you hear about us? * Parent / Friend Referral DFPS Community / Church Group Instagram Facebook X (Formally Twitter) LinkedIn YouTube Other Thank you for reaching out to Safe Haven with your adoption inquiry! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . General Info General Information Name * First Name Last Name Email * Phone (###) ### #### Subject * Message * Thank you for reaching out to Safe Haven! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . Email info@safehavencommunityservices.org Phone (713) 988-7233 (SAFE) Address 8100 Washington Ave. Suite 167 Houston, TX 77007 Sign Up For Our Newsletter Family Focused Treatment Association Partner Affiliates Texas Department of Family and Protective Services Child Welfare League of America Greater Houston Permanency Collaborative Safe Haven Community Services Safe Haven Community Services is a licensed and funded 501(c)(3) nonprofit child-placing agency under the Texas Department of Family and Protective Services EIN: 74-3025434 Additional Services Safe Haven Youth Ranch Selim Behavioral Health Contact Us 713.988.7233 (SAFE) Office Location 8100 Washington Ave, Suite 167 Houston, TX 77007 Site Home About Volunteer Family Gallery Sign Up For Our Newsletter Services Foster Care Adoption Kinship Care Training Annual Training New Family Training Donate CELEBRATING 20 YEARS OF SERVICE!"
    },
    {
      "url": "https://miami.kidsoutandabout.com/content/surfside-community-center",
      "text": "Surfside Community Center | Kids Out and About Miami Home Change Region FOR ORGANIZATIONS Secondary menu Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout Miami's online guide to everything for kids, teens, & families! Menu FREE Free Events Today Free Events This Weekend Free Events Next Weekend Free Places to Take Your Kids Today's Events LOCAL EVENTS Master Guide to Fall Fun Free Events This Weekend All Events This Weekend Free Events Next Weekend All Events Next Weekend This Week's Events Activities by Age Activities for Babies & Toddlers Activities for Preschoolers Activities for kids in Early Elementary School Activities for 'tweens Activities for Teens Activities for the Whole Family LISTS Annual Memberships and Season Passes Birthdays CSAs - Community-Supported Agriculture in Miami Fun on the Farm Indoor Play Centers Libraries Museums Preschools & Day Care Private Schools Arts Concerts Music Organizations Performances & Movies Local Theater Dance Organizations Dance Performances Museums Exhibits Visual Arts Organizations Outside Fun Nature Centers & Zoos Amusement Parks Hikes Mini Golf Pumpkin Picking Active Fun Get Active: Sports & Fitness Local Gyms & Rec Centers Sports Education Sports Teams Special Needs Articles & Reviews Food Ideas Parenting Hacks Local Reviews Vacation Reviews Product Reviews Book, Music, & Games Reviews Event Reviews Camps Fall Break Camps Summer Camps 2025: Master Guide Summer Camps by Subject General Day Camps Overnight Camps Music Theater Dance Sports/Fitness STEM, Language, and Culture Nature Visual Arts Cooking & Crafts Preschool Special Needs Religious Week by Week 2025 Camp Calendar May Camps June Camps July Camps August Camps Virtual Summer Camps LEARN Local Classes Sports Exercise & Health Gymnastics Martial Arts Horeseback Riding Performing Arts Dance Visual Arts Hands-on (Arts & Crafts & Cooking) Special Needs Academic (Science, Tech, Writing,  History, Test prep, etc) Preschool Homeschool Sign Language Religious Pregnancy Virtual/Online Classes Preschools & Day Care Private Schoools Tutoring Smart Stuff Exhibits - current & upcoming Museums Story times at libraries & bookstores Organizations focused on STEM or Culture Homeschool Groups & Programs Fall Master Guide to Fall Fun Master Guide to Fall Fun Fun on the Farm Halloween Fun Fall Festivals Pumpkin Patches Corn Mazes Miami's Master Guide to Holiday Fun 101 Holiday Happenings around Miami Master Guide to Holiday Fun Christmas Tree Farms Subscriptions Boxes: Gifts That Keep on Giving Where to visit Santa FREE Holiday Events Christmas Activities Chanukah Kwanzaa Lightbulb Day New Year's Eve Activities 101 Ideas for Holiday Family Fun 101 Ideas for Holiday Family Fun Master Guide to Winter Fun Master Guide to Winter Fun Ice Skating Hiking Zoos and Nature Centers Indoor Play Centers Master Guide to Summer Fun VIRTUAL Upcoming online events Virtual/Online Learning Resources & Classes Virtual/Online Summer Camps 24/7 virtual experiences MIAMI FAVES Top 20 Places to Take Kids Around Miami Blog of publisher's weekly column: Notes from Deb 101 Family Day Trips WEEKLY EMAIL Sign up for our fabulous FREE weekly e-newsletter Advertise in Our Weekly E-newsletter Search form Search Secondary menu Master Guide to Fall Fun 101 Family Day Trips Surfside Community Center Address: 9293 Harding Ave Miami , FL , 33154 Phone: 305-861-4863 25° 52' 52.8492\" N , 80° 7' 21.7452\" W See map: Google Maps https://www.townofsurfsidefl.gov/departments-services/parks-and-recreation/commu... smccready@townofsurfsidefl.gov Contact name: Surfside Community Center Business/organization type: Recreation/Community Center/Gym What our organization offers: Summer camps Recreation / Games Physical fitness opportunities Subjects / Categories: Special Needs Hands-on Exercise & Health Healthful Living Basketball Sports Swimming Gymnastics Preschool The multi-purpose ocean-front Community Center for the Parks and Recreation Department was built with amenities to include a recreational pool with lap lanes, plunge pool and slide, children’s activity pool, and Jacuzzi. Click For More Information Web Service Pinterest Share on Facebook Tweet Widget Featured in Miami Celebrating local experiences across North America To provide parents with all of the information they need to help them and their kids get \"out and about\" to fantastic opportunities for fun, education, and cultural enrichment in our area. To celebrate and share information on the many splendid artistic, cultural and recreational activities available to residents of cities across the US and Canada. How to post - organization listing (it's free!) Create an organization User ID / account Log in - organizations Create a parent bulletin board User ID COVID-19 Policies Editorial submissions Advertising Contact Us Request for takedown of images About Us Contact Us Advertising locally on KOAA Privacy Policy Terms of Service © Copyright 2018 EntertainmentCalendar.com. All rights reserved. Terms of Service Privacy Policy Contact Us FREE Free Events Today Free Events This Weekend Free Events Next Weekend Free Places to Take Your Kids Today's Events LOCAL EVENTS Master Guide to Fall Fun Free Events This Weekend All Events This Weekend Free Events Next Weekend All Events Next Weekend This Week's Events Activities by Age Activities for Babies & Toddlers Activities for Preschoolers Activities for kids in Early Elementary School Activities for 'tweens Activities for Teens Activities for the Whole Family LISTS Annual Memberships and Season Passes Birthdays CSAs - Community-Supported Agriculture in Miami Fun on the Farm Indoor Play Centers Libraries Museums Preschools & Day Care Private Schools Arts Concerts Music Organizations Performances & Movies Local Theater Dance Organizations Dance Performances Museums Exhibits Visual Arts Organizations Outside Fun Nature Centers & Zoos Amusement Parks Hikes Mini Golf Pumpkin Picking Active Fun Get Active: Sports & Fitness Local Gyms & Rec Centers Sports Education Sports Teams Special Needs Articles & Reviews Food Ideas Parenting Hacks Local Reviews Vacation Reviews Product Reviews Book, Music, & Games Reviews Event Reviews Camps Fall Break Camps Summer Camps 2025: Master Guide Summer Camps by Subject General Day Camps Overnight Camps Music Theater Dance Sports/Fitness STEM, Language, and Culture Nature Visual Arts Cooking & Crafts Preschool Special Needs Religious Week by Week 2025 Camp Calendar May Camps June Camps July Camps August Camps Virtual Summer Camps LEARN Local Classes Sports Exercise & Health Gymnastics Martial Arts Horeseback Riding Performing Arts Dance Visual Arts Hands-on (Arts & Crafts & Cooking) Special Needs Academic (Science, Tech, Writing,  History, Test prep, etc) Preschool Homeschool Sign Language Religious Pregnancy Virtual/Online Classes Preschools & Day Care Private Schoools Tutoring Smart Stuff Exhibits - current & upcoming Museums Story times at libraries & bookstores Organizations focused on STEM or Culture Homeschool Groups & Programs Fall Master Guide to Fall Fun Master Guide to Fall Fun Fun on the Farm Halloween Fun Fall Festivals Pumpkin Patches Corn Mazes Miami's Master Guide to Holiday Fun 101 Holiday Happenings around Miami Master Guide to Holiday Fun Christmas Tree Farms Subscriptions Boxes: Gifts That Keep on Giving Where to visit Santa FREE Holiday Events Christmas Activities Chanukah Kwanzaa Lightbulb Day New Year's Eve Activities 101 Ideas for Holiday Family Fun 101 Ideas for Holiday Family Fun Master Guide to Winter Fun Master Guide to Winter Fun Ice Skating Hiking Zoos and Nature Centers Indoor Play Centers Master Guide to Summer Fun VIRTUAL Upcoming online events Virtual/Online Learning Resources & Classes Virtual/Online Summer Camps 24/7 virtual experiences MIAMI FAVES Top 20 Places to Take Kids Around Miami Blog of publisher's weekly column: Notes from Deb 101 Family Day Trips WEEKLY EMAIL Sign up for our fabulous FREE weekly e-newsletter Advertise in Our Weekly E-newsletter Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout"
    },
    {
      "url": "https://www.melvillela.com/contact",
      "text": "Town of Melville | (337) 623-4226 | Melville, LA (337) 623-4226 Town of Melville Home Administration Resources Community Events Contact Us Contact Us Learn More About Us! Louisiana’s Small Town with Big Fishing! The Town of Melville is the Louisiana town that is known for its catfish fishing as well as its small-town charm. We’re a community of just under 2,000 people who love our town and are proud of living here. If you are interested in learning more about Melville, LA, please send us an inquiry using the contact form below. Don’t miss our Community Events page! That’s where you’ll find listings for all the fun happenings that take place in Melville every year. Thanks for visiting our website—we hope you’ll drop by to see us in person! To report a gas-related issue call the Town Hall of Melville Monday - Friday 8:30 AM – 4:00 PM at (337) 623-4226. After Hours call the Melville Police Department at (337) 623-5777 or call 911.The LA One-Call Center phone number is 811. Customers should report gas leaks or other gas related information to Town of Melville. Town of Melville Melville, LA (337) 623-4226 Town of Melville, LA Business Hours Mon - Fri 8:30 am - 4:00 pm Sat - Sun Closed Send Us a Message Send Us a Message Name*: Email*: Phone*: Message: Your message has been sent. Your message could not be sent. Use our contact form to reach out today! Get in touch with us! Learn More About Us! Town of Melville Melville, LA Mayor@melvillela.com (337) 623-4226 Town of Melville, LA Pay your dues online at Erstellt mit Share by:"
    }
  ]
}