{
  "fuentes": [
    {
      "url": "https://www.hilliardartscouncil.org/about-us/hilliard-arts-council-staff-board/",
      "email": "info@hilliardartscouncil.org"
    },
    {
      "url": "https://www.dispatch.com/story/news/local/2023/04/13/hilliard-preps-for-ambitious-110-million-recreation-center/70102992007/",
      "email": "dnarciso@dispatch.com"
    },
    {
      "url": "https://hilliardohio.gov/recreation-parks/",
      "email": "recandparks@hilliardohio.gov"
    }
  ],
  "mails": [
    "dnarciso@dispatch.com",
    "info@hilliardartscouncil.org",
    "recandparks@hilliardohio.gov"
  ],
  "nombre_sitio": "townofhilliard.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.hilliardartscouncil.org/about-us/hilliard-arts-council-staff-board/",
      "text": "Hilliard Arts Council Staff & Board | Hilliard, Ohio Skip to content Search for: Search Home Programs Menu Toggle Performing Arts Menu Toggle Theatre Auditions Short Film Festival Music Menu Toggle Concerts Adult & Youth Choirs Visual Arts Menu Toggle Art Gallery Education Menu Toggle Camps Scholarships Support Us Menu Toggle A Legacy in Lights: 50 Years of Hilliard Arts Council Hilliard Arts Council Membership Donate Sponsor Volunteer About Us Menu Toggle Mission History of the Organization Hilliard Civic & Cultural Arts Center Menu Toggle Facility Rentals Community Partners Contact Us Events Events Main Menu Menu Hilliard Arts Council Leadership We are currently looking to expand our leadership with additional positions on our Board of Trustees. Learn more here. Meet Our Leadership Team! Staff Robin Robin Brenneman, Artistic Director Casey Casey McCarty, Executive Director Officers Kurt Kurt Zielenbach, President emeritus Becky Becky Rehbeck , current Board President Amy Amy McLanahan, Board Secretary Ken Ken Hagy, Board Treasurer Cynthia Cynthia Vermillion, Vice President Matt Matt Garrido is a Board Trustee Linda Linda Sheppard is a Board Trustee Mark Mark Sholl is a Board Trustee DJ DJ Williams is a Board Trustee Search Quick Links Upcoming Events Theatre Auditions Concerts Art Gallery Scholarships Recent News Support for Hilliard Arts Council is Generously Provided By Quick Links Upcoming Events Supporting Membership Corporate Sponsorships What's Happening Theatre Summer Concerts Community Choirs Youth Summer Camps About Mission Hilliard Civic & Cultural Arts Center Facility Rentals Stay in Touch info@hilliardartscouncil.org Instagram Facebook LinkedIn Copyright © 2025 Terms & Conditions | Privacy Policy Design by Opanova Digital A Legacy in Lights: 50 Years of Hilliard Arts Council About Us Menu Toggle Hilliard Arts Council Staff & Board Art Gallery Auditions Blog Camps Choirs Classes Community Partners Concerts Contact Us Donate Elementor #15311 Elementor #23075 Encore Events Facility Rentals Get Involved with Hilliard Art Council Greater Columbus Community Orchestra Hilliard Arts Council Membership Hilliard Civic & Cultural Arts Center Hilliard Community Band History of the Organization Home Our 2023 Theatrical Season Our Mission Pop Up Art Privacy Policy Scholarships Seeking Additional Leadership​ Short Film Festival Sponsor Summer Sponsorships Support Us Terms & Conditions Thank You Theatre Volunteer X"
    },
    {
      "url": "https://www.dispatch.com/story/news/local/2023/04/13/hilliard-preps-for-ambitious-110-million-recreation-center/70102992007/",
      "text": "Hilliard preps for ambitious $110 million Recreation Center News Sports Entertainment Business Opinion Advertise Obituaries eNewspaper Legals LOCAL Hilliard preps for ambitious $110 million Recreation and Wellness Center Hilliard community/rec center financed with bonds and income tax Dean Narciso The Columbus Dispatch Hilliard's ground-breaking Friday morning on an ambitious recreation campus that will replace its aging community center not far away is being called one of the largest capital projects in Hilliard history. The 10 a.m. event will celebrate the future Hilliard Recreation and Wellness Center at the Hilliard Soccer Complex, just west of Municipal Park on Scioto Darby Road. It will include speakers, a \"kick of the soccer balls” and \"touch-a-truck\" event. Financed in part by a 2021 voter-approved 0.5% income tax increase and debt financing , the 105,000-square-foot complex will include a gymnasium, indoor running track, fitness and weight room, aerobic dance and spin studios, classrooms, a 240-person community events room, commercial kitchen, child watch area and outdoor patio. The aquatic facility will have a 25-meter lap pool, recreation activity pool, water slide, and spa. And in a nod to the area's large Muslin population, a room will offer an ablution station, used by some religions for washing hands, face, arms and feet before prayer. \"We wanted to be responsive to the needs of the community,\" Hilliard City Manager Michelle Crandall, told The Dispatch. A year ago, the city voted to authorize issuing bonds for the project not to exceed $95 million. The bond sales combined with tax revenue will be used to pay for the estimate $110 million complex that also includes several sports fields, some with artificial turf, on the facility's south side. And there have been concerns as recently as late last year about cost overruns . Read More: Budget rising for Hilliard's community recreation and wellness center “This is one of the largest and most influential capital projects in Hilliard’s history,” said Crandall. “When residents voted to support Issue 22 (to raise the income tax to 2.5%), it was with the promise that one of the major benefits to this community would be a recreation center and more athletic fields. Breaking ground on this development is the realization of that promise,” she said. Much like modern public libraries have become, the new facility will be a gathering space for the community. It will allow the city to expand its recreation programming and event space, said Ed Merritt, Hilliard's recreation and parks director. In partnership with The Ohio State University Wexner Medical Center, nearly 25,000 square feet of space at the facility will be dedicated to an integrated medical health and wellness center that will offer rehabilitation and physical therapy along with behavioral health and sports medicine. Operation concerns But one Hilliard city councilman isn't so sure that an OSU-connected center will benefit all residents. Councilman Frank (Les) Carrier said that residents whose insurance doesn't cover treatment or therapy might be left out. \"You could go there and not be covered because your insurance is OhioHealth,\" he said. Carrier also questions why an offer from the YMCA of Central Ohio to operate the pool, gym and main facility was rejected. \"What perplexed me was the raw amount of money it would save the city,\" he said. \"I don't know why you wouldn't do that.\" He also thinks the facility might \"cannibalize\" the existing Hilliard/Ray Patch Family YMCA at 4515 Cosgray Road. Crandall has said that the city prefers to have municipal control over its facility, even if it may cost more. Initial operating revenues including memberships and program fees will pay for about 80% of operating costs. Community and recreation centers typically don't make money. Subsidized by city funds, they are considered amenities for residents rather than a profit generator. dnarciso@dispatch.com @DeanNarciso Careers Staff Directory Accessibility Sitemap Legals Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Promote your Event Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Promote Your Event Subscribe Today Newsletters Facebook X Instagram eNewspaper Archives ThisWeek News Archives Jobs Real Estate Classifieds Shopping 10BEST Events LocaliQ Digital Marketing Solutions © 2025 www.dispatch.com. All rights reserved."
    },
    {
      "url": "https://hilliardohio.gov/recreation-parks/",
      "text": "Recreation and Parks | City of Hilliard | Real People, Real Possibilities Skip to content Facebook Youtube Instagram Linkedin Residents Residents Summer Events Fall Festival Annual Events Contact the City Destination Hilliard Electric Aggregation Food Waste Composting Program Jobs Leaf Collection Local Nonprofits Maps & GIS Newsletter Signup Recycling Report a Code Violation Resident Resources Service Requests Styrofoam Recycling Sustainability Taxes Trash Trees Videos Winter Weather Yard Waste Your Hilliard Government Government Boards & Commissions Capital Projects City Charter City Code City Council City Manager Comprehensive Plan Contact the City Departments Financial Data Newsroom Non Discrimination Permits & Applications Public Bids Public Meetings & Notices Public Records We exhibit a heart for service, dedication to excellence, and strength in teamwork. Recreation & Parks Recreation & Parks Summer Rec Camp Program Guide Pools & Passes Program Registration Community Garden DORA Ephemeral Wildflowers Rentals Hilliard Express Hilliard’s Parks Hilliard Trails Now Hiring Recreation & Wellness Center The Senior Center Sports Volunteer Search for Hilliard Recreation & Parks in your devices app store today! Police & Courts Police & Courts Crime Map File a Report Online Forms & Applications Join the HPD Team Mayor’s Court Pay Your Ticket Police Public Records Request Services & Programs Smart911 Traffic Crash Reports Traffic Enforcement Requests Transparency in Policing Victims Rights Our badge shows we protect and serve. Our approach shows we're part of the community. Business FAQ FAQ Business Communication Downtown Hilliard Emergency Alerts Engineering & Building Permits Holidays Human Resources Mayor’s Court Mosquitos Rec & Parks Roads Solicitation Taxes Trash Trees Utilities How can we assist you? Ask Us Rec & Parks Recreation & Parks From wooded areas to athletic facilities, Hilliard’s Recreation and Parks Department maintains over 25 developed parks that provide diverse recreational and leisure activities for the community. The department also organizes special events, maintains municipal pools and sponsors educational, fitness and volunteer activities for community members of all ages. Financial Assistance Program Hilliard Recreation and Parks believes everyone should have the chance to participate in enriching programs, regardless of financial circumstances. Our Financial Assistance Program helps qualifying Hilliard residents access select recreational opportunities—such as summer camps—at reduced rates. Assistance is based on household income and available funding. Interested in learning more or applying? Email us at recandparks@hilliardohio.gov for details. By providing a clean, safe and well-maintained environment with a friendly, professional and wholesome atmosphere, the Recreation and Parks Department takes pride in providing endless economic, social and health benefits to the Hilliard community. Accommodation Request The City of Hilliard promotes inclusion for all our programming, camps, special events, and service options. We ask you to contact a Recreation Supervisor to discuss accommodations prior to enrollment to provide for the best overall experience for you and/or your child. Should the need for an accommodation arise after the beginning of any program, please contact the Community Center at 614-876-5200 to be directed to the appropriate Recreation Supervisor. Contact 3800 Veterans Memorial Drive Hilliard, OH 43026 (614) 876-5200 Community Center Hours Monday-Thursday 8 a.m.-8 p.m. Friday-Saturday 8 a.m. – 5 p.m. Sunday Noon – 5 p.m. Senior Center Hours Monday – Friday 8 a.m. – 4 p.m. Payment The Recreation and Parks Department does not accept cash. Payments can be made using credit card or check. Classes & Camps Classes & Camps Click to learn more Disc Golf Disc Golf Click to learn more Facility Rentals Facility Rentals Click to learn more Hilliard Parks Hilliard Parks Click to learn more Master Parks Plan Master Parks Plan Click to learn more Pools & Passes Pools & Passes Click to learn more 55 Plus 55 Plus Click to learn more Sports Sports Click to learn more City Hall and Admin 3800 Municipal Way Hilliard, OH 43026 (614) 876-7361 Hilliard Mayor’s Court 5171 Northwest Parkway Hilliard, OH 43026 (614) 334-2348 Division of Police 5171 Northwest Parkway Hilliard, OH 43026 Police Assistance (614) 876-7321 Police Records and General Assistance (614) 876-2429 Norwich Township Fire 5181 Northwest Parkway Hilliard, OH 43026 (614) 876-7694 Hilliard Recreation & Parks 3800 Veterans Memorial Dr Hilliard, OH 43026 (614) 876-5200 LET'S CHAT! City of Hilliard Facebook Youtube Instagram Linkedin Hilliard Police Facebook Instagram Rec & Parks Facebook Instagram Hilliard Newsletter Email Submit Sitemap | Privacy & Usage Policy | Contact Us | Employee Portal © 2025 City of Hilliard. All rights reserved. Close Font Resize A- A+ Keyboard navigation Readable Font Contrast Choose color black white green blue red orange yellow navi Clear cookies Close Accessibility by WAH About Hilliard Accessing the Last Mile Aging in Place Committee Annual Events Annual Tree Lighting Available Properties Boards and Commissions Application Bridging The Digital Divide Building Standards Division Business Card Order Form Business Media Business Permitting Business Resources City Charter City Manager City of Hilliard – Home Collaborations for Technology Community Garden Community Resources Community Services and Programs Comprehensive Plan Contact the City Contact Us Demographics Designated Outdoor Refreshment Area (DORA) Disc Golf Discrimination Form Downtown Hilliard Downtown Hilliard Map Economic Development Economic Development – Downtown Hilliard Hilliard Economic Development Electric Aggregation Engineering Division Ephemeral Wildflowers in Hilliard Fall Festival Feral Cats Fiber To The Home File a Report Online Food Waste Composting Program Form example Forms and Applications Freedom Fest Freedom Fest Feedback HiFiO Hilliard City Lab Hilliard City Lab Funding Hilliard City Lab Infrastructure Hilliard City Lab Media Hilliard City Lab People Hilliard City Lab Projects Hilliard Community Action Network Hilliard Development Corporation Hilliard Express Hilliard Public Arts Commission Hilliard Summer Events Hilliard Trails Hilliard’s Parks History Important Documents Incentives & Programs Information Technology Join the HPD Team Leaf Collection Lifestyle Mapping Ohio’s Connectivity Mosquitos Neighborhood Crime Mapping Non Discrimination Non-Profit Grant Request Now Hiring: Seasonal and Part-Time Positions Operations Department Opportunity Hilliard Personnel Review Board Planning Division Police Transparency in Policing Police Public Records Request Program Guide Public Bids Public Records Recreation and Parks – WebTrac RecTrac User Guide Recycling Report A Code Violation Roundabouts SAFE Sidewalk Program Sanitary Backflow Program Search Senior Programs Senior Resources Smart Streets Smart911 Social Investment Sponsorship Stationary Order Form Stormwater Management Street Maintenance & Rehabilitation Program Styrofoam Recycling Summer Rec Camp Sustainability Taxes The Well – Hilliard Recreation and Wellness Center Traffic Calming Traffic Enforcement Requests Transportation & Mobility Division Transportation Planning Trees Vacation House Check Victims Rights Videos Volunteer WebTrac Login Winter Weather Yard Waste Your Hilliard Residents Resident Resources Hilliard 311 Thank you Newsletter Signup Trash Rec & Parks Rentals Master Parks Plan Pools & Passes The Senior Center Sports Government Newsroom Boards & Commissions Planning & Zoning Recreation and Parks Advisory Committee Records Commission Shade Tree Commission Environmental Sustainability Commission Keep Hilliard Beautiful Zoning Appeals Agendas & Minutes City Council Mayor’s Court Departments Community Development Finance Human Resources Law Q & A Emergency Alerts Library Norwich Township Schools Visit Hotels Old Hilliard News Privacy & Usage Policy Sitemap Hilliard is happening! Find out what’s going on with our weekly newsletter. Email Subscribe Click the ‘x’ to opt out."
    }
  ]
}