{
  "fuentes": [
    {
      "url": "https://www.tpcgrp.com/careers/our-people",
      "email": "communications@tpcgrp.com"
    },
    {
      "url": "https://www.tpcgrp.com/about/leadership",
      "email": "communications@tpcgrp.com"
    },
    {
      "url": "https://www.tpcgrp.com/about/board-of-directors",
      "email": "communications@tpcgrp.com"
    }
  ],
  "mails": [
    "communications@tpcgrp.com"
  ],
  "nombre_sitio": "tpc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.tpcgrp.com/careers/our-people",
      "text": "Our People | TPC Group TPC Group Outreach Community Investors Suppliers Contact About About TPC Group One TPC Awards & Recognition Board of Directors Leadership Compliance History Products Products & Technology Products CC4  Processing Butadiene Butene-1 Fuel Products Polyisobutylene Isobutylene Derivatives Product Stewardship Technology Technical Information Sustainability Sustainability Environmental Society Governance Safety & Security Careers Careers Working at TPC Group Our People All For One Foundation News News & Events News Community News Events About TPC Group One TPC Awards & Recognition Board of Directors Leadership Compliance History Products & Technology Products CC4  Processing Butadiene Butene-1 Fuel Products Polyisobutylene Isobutylene Derivatives Product Stewardship Technology Technical Information Environment & Safety Sustainability Sustainability Environmental Society Governance Safety & Security Careers Working at TPC Group Our People All For One Foundation News & Events News Community News Events Contact Thank you Community Community Advisory Panel Communications ONE Day - A Community Outreach Initiative Suppliers View Order Status View PO Change History Acknowledge a Purchase Order Create an Invoice Material PO Create an Invoice Services PO Submit a Price Change Change a Promise Date Submit a Quantity Change View Invoices and Payments How to Login iSupplier FAQs Investors Privacy Policy Terms of Use Datasheet Feed Energy Management Brownfield Expansion and Utilization of Idle Assets Reliability Centered Maintenance and Infrastructure Improvements Materiality Assessment And Sustainability Roadmap Our People We are committed to growing our people. TPC Group’s performance-based culture enables employees to achieve their ultimate potential and help the Company to achieve superior performance. TouchPoints, our performance management program, provides multiple opportunities during the year for employees to receive forward-looking feedback. Our Company’s employee development planning process occurs twice annually through robust dialogue between managers and employees. The focus of these conversations is on the employee’s short- and long-term career aspirations. Through this shared, collaborative process, employees have the opportunity to discuss their unique development needs in relation to their career goals and determine the best means by which to achieve those objectives. The Company supports on-going learning through Catalyst , TPC’s Learning Management System. It encompasses a multitude of resources that spark continuous development through e-Learning, reading, webinars and formal training. Become part of our team. Click here for current job openings. “At TPC Group development is defined as growth in someone’s knowledge, skills and personal effectiveness by providing learning facilities and avenues where these new ideas can be applied to increase someone’s capabilities in current and future roles.” Careers Join our team. Make a difference. Read More Working at TPC Group TPC Group’s commitment to a culture of trust encourages productivity, and helps the Company stay competitive in a dynamic industry. Read More All For One Foundation The TPC All for One Foundation is about more than taking care of our employees, it’s about our employees caring for each other. Read More Job Openings Our employees are challenged to thrive, encouraged to grow and empowered to prosper. Become part of our team. Click below for our current job openings. Available Positions Name * Company / Organization * State/Region * Reason for Inquiry * Please select Product Inquiry HR + Careers Corporate Giving Community Other Inquiry Community Meeting Fenceline information Operational Events Email * Message Top TPC Group About TPC Group Products & Technology Sustainability Careers News & Events Products CC4  Processing Butadiene Butene-1 Fuel Products Polyisobutylene Latest News TPC Group Awards Academic Scholarships to 12 High School Graduates TPC Group Annual Charity Golf Tournament Will Benefit 20 Charities in Celebration of 20 Years of Golf and Giving TPC Group Announces Senior Executive Retirement and Succession Plan TPC Group Completes Capital Program to Expand Crude C4 Processing Capacity to Meet Growing Feedstock Supply TPC Group Commitment to Sustainability Receives Prestigious Recognition and Valued Certification TPC Group Corporate Office 500 Dallas Street, Suite 2000 Houston, Texas, 77002 +1 (713) 627 7474 communications@tpcgrp.com PRIVACY CONTACT INVESTORS TERMS OF USE SUPPLIERS © TPC Group 2025. All rights reserved. Your browser does not support JavaScript!"
    },
    {
      "url": "https://www.tpcgrp.com/about/leadership",
      "text": "Leadership | TPC Group TPC Group Outreach Community Investors Suppliers Contact About About TPC Group One TPC Awards & Recognition Board of Directors Leadership Compliance History Products Products & Technology Products CC4  Processing Butadiene Butene-1 Fuel Products Polyisobutylene Isobutylene Derivatives Product Stewardship Technology Technical Information Sustainability Sustainability Environmental Society Governance Safety & Security Careers Careers Working at TPC Group Our People All For One Foundation News News & Events News Community News Events About TPC Group One TPC Awards & Recognition Board of Directors Leadership Compliance History Products & Technology Products CC4  Processing Butadiene Butene-1 Fuel Products Polyisobutylene Isobutylene Derivatives Product Stewardship Technology Technical Information Environment & Safety Sustainability Sustainability Environmental Society Governance Safety & Security Careers Working at TPC Group Our People All For One Foundation News & Events News Community News Events Contact Thank you Community Community Advisory Panel Communications ONE Day - A Community Outreach Initiative Suppliers View Order Status View PO Change History Acknowledge a Purchase Order Create an Invoice Material PO Create an Invoice Services PO Submit a Price Change Change a Promise Date Submit a Quantity Change View Invoices and Payments How to Login iSupplier FAQs Investors Privacy Policy Terms of Use Datasheet Feed Energy Management Brownfield Expansion and Utilization of Idle Assets Reliability Centered Maintenance and Infrastructure Improvements Materiality Assessment And Sustainability Roadmap Leadership Meet TPC Group’s Senior Leadership Team. Our executive leadership team leads all business and support functions. Together the team oversees all business operations and execution of corporate strategy. Leadership Edward J. Dineen President and Chief Executive Officer Find out more → Daniel Valenzuela Senior Vice President and Chief Financial Officer Find out more → Peggy Macatangay, Ph.D. Senior Vice President, Technology & Engineering Find out more → John Harvey Senior Vice President, Operations Find out more → Adrian Jacobsen Senior Vice President, Commercial Find out more → Scott Dutton Vice President, Human Resources Find out more → Patrick Hurt Vice President, General Counsel Find out more → Top TPC Group About TPC Group Products & Technology Sustainability Careers News & Events Products CC4  Processing Butadiene Butene-1 Fuel Products Polyisobutylene Latest News TPC Group Awards Academic Scholarships to 12 High School Graduates TPC Group Annual Charity Golf Tournament Will Benefit 20 Charities in Celebration of 20 Years of Golf and Giving TPC Group Announces Senior Executive Retirement and Succession Plan TPC Group Completes Capital Program to Expand Crude C4 Processing Capacity to Meet Growing Feedstock Supply TPC Group Commitment to Sustainability Receives Prestigious Recognition and Valued Certification TPC Group Corporate Office 500 Dallas Street, Suite 2000 Houston, Texas, 77002 +1 (713) 627 7474 communications@tpcgrp.com PRIVACY CONTACT INVESTORS TERMS OF USE SUPPLIERS © TPC Group 2025. All rights reserved. Your browser does not support JavaScript!"
    },
    {
      "url": "https://www.tpcgrp.com/about/board-of-directors",
      "text": "Board of Directors | TPC Group TPC Group Outreach Community Investors Suppliers Contact About About TPC Group One TPC Awards & Recognition Board of Directors Leadership Compliance History Products Products & Technology Products CC4  Processing Butadiene Butene-1 Fuel Products Polyisobutylene Isobutylene Derivatives Product Stewardship Technology Technical Information Sustainability Sustainability Environmental Society Governance Safety & Security Careers Careers Working at TPC Group Our People All For One Foundation News News & Events News Community News Events About TPC Group One TPC Awards & Recognition Board of Directors Leadership Compliance History Products & Technology Products CC4  Processing Butadiene Butene-1 Fuel Products Polyisobutylene Isobutylene Derivatives Product Stewardship Technology Technical Information Environment & Safety Sustainability Sustainability Environmental Society Governance Safety & Security Careers Working at TPC Group Our People All For One Foundation News & Events News Community News Events Contact Thank you Community Community Advisory Panel Communications ONE Day - A Community Outreach Initiative Suppliers View Order Status View PO Change History Acknowledge a Purchase Order Create an Invoice Material PO Create an Invoice Services PO Submit a Price Change Change a Promise Date Submit a Quantity Change View Invoices and Payments How to Login iSupplier FAQs Investors Privacy Policy Terms of Use Datasheet Feed Energy Management Brownfield Expansion and Utilization of Idle Assets Reliability Centered Maintenance and Infrastructure Improvements Materiality Assessment And Sustainability Roadmap Board of Directors Edward J. Dineen President and Chief Executive Officer Find out more → Chris DiSantis Director Find out more → Patrick J. Bartels Director Find out more → Brian Coffman Director Find out more → Sean Mulroy Director Find out more → Ellis Jones Director Find out more → Top TPC Group About TPC Group Products & Technology Sustainability Careers News & Events Products CC4  Processing Butadiene Butene-1 Fuel Products Polyisobutylene Latest News TPC Group Awards Academic Scholarships to 12 High School Graduates TPC Group Annual Charity Golf Tournament Will Benefit 20 Charities in Celebration of 20 Years of Golf and Giving TPC Group Announces Senior Executive Retirement and Succession Plan TPC Group Completes Capital Program to Expand Crude C4 Processing Capacity to Meet Growing Feedstock Supply TPC Group Commitment to Sustainability Receives Prestigious Recognition and Valued Certification TPC Group Corporate Office 500 Dallas Street, Suite 2000 Houston, Texas, 77002 +1 (713) 627 7474 communications@tpcgrp.com PRIVACY CONTACT INVESTORS TERMS OF USE SUPPLIERS © TPC Group 2025. All rights reserved. Your browser does not support JavaScript!"
    }
  ]
}