{
  "fuentes": [
    {
      "url": "https://www.trailerestates.com/contact-us",
      "email": "trailerestates@trailerestates.com"
    },
    {
      "url": "https://www.careersatremaxprofessionals.ca/contact-us/",
      "email": "leah@remaxprofessionals.ca"
    },
    {
      "url": "https://ca.linkedin.com/company/park-property-management-inc.",
      "email": "info@parkpropertyrentals.ca"
    },
    {
      "url": "https://www.bendparksandrec.org/about/contact-us/",
      "email": "jobs_icon@2x.png"
    },
    {
      "url": "https://www.bendparksandrec.org/about/contact-us/",
      "email": "playbook_icon_bprd@2x.png"
    },
    {
      "url": "https://www.bendparksandrec.org/about/contact-us/",
      "email": "info@bendparksandrec.org"
    },
    {
      "url": "https://www.bendparksandrec.org/about/contact-us/",
      "email": "parkservicesinfo@bendparksandrec.org"
    },
    {
      "url": "https://www.nationaltrailersource.com/staff",
      "email": "sales@nationaltrailersource.com"
    },
    {
      "url": "https://www.nachi.org/certified-inspectors/near/trailer-estate-park--rec--6814-canada-blvd--bradenton--fl-34207--usa?page=4",
      "email": "header-full-lg@2x-07de4780ef.png"
    },
    {
      "url": "https://www.nachi.org/certified-inspectors/near/trailer-estate-park--rec--6814-canada-blvd--bradenton--fl-34207--usa?page=4",
      "email": "header-mobile@2x-f4ef3b62b8.png"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "adam-rtt-choice@2x-188x300.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "adam-rtt-choice@2x-64x102.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "adam-rtt-choice@2x.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "briant_1@2x-188x300.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "briant_1@2x-64x102.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "briant_1@2x.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "ken@2x-188x300.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "ken@2x-64x102.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "ken@2x.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "anthony@2x-188x300.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "anthony@2x-64x102.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "anthony@2x.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "asciara@royaltrailersales.com"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "julie@2x-188x300.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "julie@2x-64x102.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "julie@2x.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "mike@2x-188x300.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "mike@2x-64x102.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "mike@2x.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "tommy@2x-188x300.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "tommy@2x-64x102.jpg"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "email": "tommy@2x.jpg"
    },
    {
      "url": "https://www.businessinsider.com/inside-americas-trailer-park-boom-flipping-real-estate-demand-2025-4",
      "email": "group-subscriptions@businessinsider.com"
    },
    {
      "url": "https://trailerparkgroup.com/contact/",
      "email": "bizdev@trailerparkgroup.com"
    },
    {
      "url": "https://trailerparkgroup.com/contact/",
      "email": "london@trailerparkgroup.com"
    },
    {
      "url": "https://www.cookpropertiesny.com/community/oakwood-estates",
      "email": "mmarcello@cookpropertiesny.com"
    }
  ],
  "mails": [
    "adam-rtt-choice@2x-188x300.jpg",
    "adam-rtt-choice@2x-64x102.jpg",
    "adam-rtt-choice@2x.jpg",
    "anthony@2x-188x300.jpg",
    "anthony@2x-64x102.jpg",
    "anthony@2x.jpg",
    "asciara@royaltrailersales.com",
    "bizdev@trailerparkgroup.com",
    "briant_1@2x-188x300.jpg",
    "briant_1@2x-64x102.jpg",
    "briant_1@2x.jpg",
    "group-subscriptions@businessinsider.com",
    "header-full-lg@2x-07de4780ef.png",
    "header-mobile@2x-f4ef3b62b8.png",
    "info@bendparksandrec.org",
    "info@parkpropertyrentals.ca",
    "jobs_icon@2x.png",
    "julie@2x-188x300.jpg",
    "julie@2x-64x102.jpg",
    "julie@2x.jpg",
    "ken@2x-188x300.jpg",
    "ken@2x-64x102.jpg",
    "ken@2x.jpg",
    "leah@remaxprofessionals.ca",
    "london@trailerparkgroup.com",
    "mike@2x-188x300.jpg",
    "mike@2x-64x102.jpg",
    "mike@2x.jpg",
    "mmarcello@cookpropertiesny.com",
    "parkservicesinfo@bendparksandrec.org",
    "playbook_icon_bprd@2x.png",
    "sales@nationaltrailersource.com",
    "tommy@2x-188x300.jpg",
    "tommy@2x-64x102.jpg",
    "tommy@2x.jpg",
    "trailerestates@trailerestates.com"
  ],
  "nombre_sitio": "trailerestates.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.trailerestates.com/contact-us",
      "text": "Contact Us - Trailer Estates Park & Recreation District Skip to main content Contact Us Search: Go! Toggle navigation Home About Us Information Package Board Members Administration Meetings, Agendas & Minutes Board Meetings Board Workshop Treasure Barn Committee Enforcement Committee Special Meetings Public Hearings Governance Charter Bylaws Deed Restrictions Rules and Regulations Policies and Procedures Transparency Public Records Contact Information Calendar & Activities Newsletter Calendar Activities List Amenities Current Events Map Rentals Marina Storage Lot Resources 2022 Special Assessment Agendas Financials Plat Book TE CERT Useful Links Map Public Safety Information Forms This item appears on Public Safety Information Resident Severe Weather & Disaster Preparedness Resouces The Treasure Barn District Office Staff District Maintenance Staff Financials Archive | Agendas & Minutes Useful Links 2022 Special Assessment Rentals Map Marina Activities List Activities Policies and Procedures About Us Calendars Notices Staff Updates Board Members Governance District Transparency Contact Us We look forward to hearing from you! Call us at: 941-756-7177 Our address is: 1903 69th Avenue West, Bradenton FL 34207 Fax: 941-755-2937 Or use the form below to send a message: Your name Your email Subject Message Attachment There was a problem saving your submission. Please try again later. Please wait while your submission is being saved... Submitting... Submit Thank you, your submission has been received. Custodian of Public Records Phone: 941-756-7177 Email Address: trailerestates@trailerestates.com Mailing Address: PO Box 6298\nBradenton, Florida 34281-6298 Fax Number: 941-755-2937 Read more » Office Hours Monday-Friday: 9:00-Noon & 1:00-4:00 unless otherwise posted Closed on holidays Useful Phone Numbers Read more » Copyright © 2025 Trailer Estates Park & Recreation District 1903 69th Avenue West, Bradenton FL 34207 Telephone (941) 756-7177 Privacy Policy District Transparency Website Accessibility Statement Powered by Streamline | Sign in × Search results Search: Go! Close"
    },
    {
      "url": "https://www.careersatremaxprofessionals.ca/contact-us/",
      "text": "Contact Us | Real Estate Careers | RE/MAX Professionals Skip to content Remax Professionals Inc., Brokerage Join The Team Still have questions? We have the answers. Whether you are curious about our team, services, or offices, we are here to help. East Mall Office 1 East Mall Crescent Toronto, ON M9B 6G8 Kingsway Office Suite 9 – 4242 Dundas Street West Toronto, ON M8X 1Y6 Our Phone Number: 416-567-3629 Our Email: leah@remaxprofessionals.ca Ask us your questions here and we will be in touch as soon as possible. Your Name * Your Email * Your Phone Number * How can we help? Facebook This field is for validation purposes and should be left unchanged. Send Δ 2025 Remax Professionals Inc., Brokerage | Contact Us | Privacy Policy | Made by Artifakt Digital"
    },
    {
      "url": "https://ca.linkedin.com/company/park-property-management-inc.",
      "text": "Park Property Management Inc. | LinkedIn Skip to main content LinkedIn Articles People Learning Jobs Games Sign in Join now Park Property Management Inc. Real Estate Toronto, Ontario 3,193 followers Experience the difference Park Property makes! Follow View all 155 employees Report this company About us EXPERIENCED\n\nFor more than 40 years, Park Property Management has been providing affordable, well-maintained rental accommodations offering both quality and value. We manage our properties with pride in the pursuit of long-term relationships with all of our residents.\n\nDYNAMIC\n\nOur company portfolio currently includes 8400 apartments and rental residences in 74 buildings located across the Greater Toronto Area, as well as in other major cities across Ontario, including Cambridge, Kitchener, Waterloo, Stratford, Tillsonburg, and Guelph.\n\nRESIDENT-ORIENTED\n\nWhether you are single, just starting to build your family or an empty nester, you deserve a comfortable environment in which to realize your dreams. And since Park Property is synonymous with a fulfilling lifestyle, you can rest assured that we will make every effort in our power to ensure that you are always fully satisfied in that regard.\n\nQUALITY-CONSCIOUS\n\nOur buildings are conveniently located close to your work, school, and favorite pursuits. They include indoor and outdoor amenities that enhance your quality of life. To better serve you, we have our dedicated property management and maintenance groups for whom we provide unparalleled service and training all your comfort in mind. Website https://www.parkproperty.ca/ External link for Park Property Management Inc. Industry Real Estate Company size 201-500 employees Headquarters Toronto, Ontario Type Privately Held Founded 1975 Locations Primary 100 Roehampton Ave Toronto, Ontario M4P 1R3, CA Get directions 16 Esna Park Dr Suite 200 Markham, Ontario L3R5X1, CA Get directions 53 Thorncliffe Park Dr Toronto, Ontario M4H 1L1, CA Get directions 221 Balliol St Toronto, Ontario M4S 1C8, CA Get directions 265 Balliol St Toronto, Ontario M4S, CA Get directions 66 Isabella St Toronto, Ontario M4Y 1N3, CA Get directions 20 Carlton St Toronto, Ontario M5B 2H5, CA Get directions 25 Wood St Toronto, Ontario M4Y 2P9, CA Get directions 100 Spadina Rd Toronto, Ontario M5R 2T7, CA Get directions 88 Spadina Rd Toronto, Ontario M5R 2S8, CA Get directions 90 Adelaide St E Toronto, Ontario M5C 2R4, CA Get directions 97 Walmer Rd Toronto, Ontario M5R 2X6, CA Get directions Show more locations Show fewer locations Employees at Park Property Management Inc. Todd Spencer Leader. Communicator. Problem Solver. Coach. Difference maker. Expert in multi-family real estate. Lutz Loegters Managing Director at Park Property Management Inc. Karen Langford Manager Industrial/Commercial Properties at Park Property Management Lydia Worku Looking For New Opportunities, Connect with Me. See all employees Updates Park Property Management Inc. 3,193 followers 1d Report this post Thinking about apartment living? 🏙️\n\nApartments offer more than just a place to live—they provide access to vibrant communities, modern amenities, and convenient urban locations. \n\nRenting with a trusted property manager makes all the difference. With Park Property, enjoy hassle-free maintenance, added security, and worry-free winters.\n\nBook a tour today and find your new home: https://lnkd.in/d9zNrhdc #ParkProperty #ParkPropertyLiving #TorontoApartments #ApartmentLivingPerks 25 Like Comment Share Park Property Management Inc. 3,193 followers 1w Report this post Nothing brings a community together like good food and great company. 🫂 \n\nThis week, we hosted a Resident Appreciation BBQ at 221 & 265 Balliol St., a chance to celebrate our residents, connect with neighbours, and say thank you for being such an important part of the Park Property community.\n\nWe’re so grateful to everyone who joined us and made the day one to remember. Here’s to many more moments like this! #ParkProperty #ParkPropertyLiving #TorontoLiving #TorontoApartments #TorontoRentals #ResidentBBQ +1 50 10 Comments Like Comment Share Park Property Management Inc. 3,193 followers 2w Report this post Thank you Theon for the kind words and for taking the time to share your experience! Hearing that our team helped make your transition smooth means the world to us. \n\nAt Park Property we are committed to more than just quality suites — we provide you with a personalized space where you can enjoy life and feel good about calling it home.\n\nVisit the link to learn more: https://lnkd.in/d9zNrhdc #ParkProperty #ParkPropertyLiving #TorontoApartments #TorontoRentals 23 Like Comment Share Park Property Management Inc. 3,193 followers 2w Report this post At the heart of London, Ontario, Park Property Management stands as your trusted partner in real estate. \n\nWith multiple buildings nestled in one vibrant neighbourhood, we offer more than rental residences—we create thriving communities that place residents just steps from green spaces, cultural attractions, and key institutions like Western University and Fanshawe College.\n\nDiscover the value of being at the centre of it all—book a tour today and see how our properties can align with your goals: https://lnkd.in/d9zNrhdc #ParkProperty #ParkPropertyLiving #LondonLiving #LondonApartments #LondonRentals 37 1 Comment Like Comment Share Park Property Management Inc. 3,193 followers 3w Report this post Step inside your future home! 🏡✨\n\nJoin us at Everworth's Open House and explore our spacious 1, 2, and 3-bedroom suites.\n\nWhether you’re searching for your perfect home or exploring your options, now is the time to experience what makes life here truly worth it.\n\n🗓️ Aug 23rd and 24th \n🕙 10 am – 4 pm \n📍3030 Pharmacy Ave., Leasing Office 121 \n\nCall us at 416-645-0244 or email us to book your appointment today! #EverworthLiving #3030PharmacyAve #TorontoApartments #ModernLiving #TorontoRentals #ParkProperty #Scarborough #EverworthOpenHouse 24 2 Comments Like Comment Share Park Property Management Inc. 3,193 followers 3w Report this post Planning your next move? 🏡\n\nJoining our waitlist early is a smart way to stay ahead of the curve. While details like pricing and floor plans become available closer to move-in, starting the process early ensures you won’t miss out. \n\nReady to learn more? Check out our FAQ here: https://lnkd.in/gFxima9F , or email us at info@parkpropertyrentals.ca for more details! #ParkProperty #ParkPropertyLiving #TorontoApartments #TorontoRentals #FAQ 17 2 Comments Like Comment Share Park Property Management Inc. 3,193 followers 1mo Report this post We’re proud to share the first look at the beautifully finished model suite at 3030 Pharmacy Ave.\n\nDesigned with modern living in mind, the suite features large windows that fill the space with natural light, an open and spacious layout, and sleek contemporary finishes throughout.\n\nInterested in seeing it for yourself? Book a tour today: https://lnkd.in/gkPdNgV6 #ParkProperty #ParkPropertyLiving #TorontoLiving #TorontoApartments #TorontoRentals 48 14 Comments Like Comment Share Park Property Management Inc. 3,193 followers 1mo Report this post We’re proud to mark 50 years of delivering quality rental housing and building communities across Ontario. 🏡✨\n\nSince 1975, Park Property has grown thoughtfully, evolving with the needs of our residents while staying true to our commitment to service, integrity, and lasting value. This milestone is a reflection of the trust placed in us by our residents, the dedication of our team, and the strength of our long-term vision.\n\nTo our partners, employees, and industry peers — thank you for being part of our journey. Here’s to the next 50 years of shaping communities that people are proud to call home. #ParkProperty #ParkPropertyLiving #TorontoLiving #TorontoApartments #TorontoRentals #50YearAnniversary 195 61 Comments Like Comment Share Park Property Management Inc. 3,193 followers 2mo Report this post At Park Property, we believe that being a good neighbour goes beyond our buildings. ❤️\n\nWe’re proud to give back to the communities we’re part of by supporting organizations that make a meaningful difference — including The Salvation Army in Canada , the Greater Toronto Apartment Association Charitable Foundation, United Way Centraide Canada and the North Scarborough Rotary Club.\n\nThese partnerships reflect our ongoing commitment to creating stronger, more connected communities for everyone. #ParkProperty #ParkPropertyLiving #TorontoLiving #TorontoApartments #TorontoRentals #GivingBack #PartnerOrganizations 40 6 Comments Like Comment Share Park Property Management Inc. 3,193 followers 2mo Report this post We’re super excited to announce that leasing at 3030 Pharmacy Ave. has been underway since the start of the year — and now, we’d love to invite you to our Open House! 🎉\n\nCome tour our stunning suites starting from $1,995 and see why this place is worth calling home. \n\n🗓️ Saturday, July 12th – Sunday, July 13th\n📍 3030 Pharmacy Ave, Suite 121\n🕐 10 am – 4 pm #ParkProperty #ParkPropertyLiving #3030PharmacyAve #TorontoLiving #TorontoApartments #TorontoRentals #Scarborough #OpenHouse 25 Like Comment Share Join now to see what you are missing Find people you know at Park Property Management Inc. Browse recommended jobs for you View all updates, news, and articles Join now Similar pages Sterling Karamar Property Management Real Estate Toronto, Ontario DEL PROPERTY MANAGEMENT INC. Business Consulting and Services Toronto, Ontario Rhapsody Property Management Services Real Estate Toronto, Ontario ICC Property Management Real Estate Markham, Ontario Crown Property Management Inc. Leasing Non-residential Real Estate Toronto, ON Hazelview Properties Real Estate Toronto, Ontario Greenwin Corp. Real Estate Toronto, ON Duka Property Management Inc. Business Consulting and Services Mississauga, Ontario Royal York Property Management Leasing Residential Real Estate Toronto, Ontario Melbourne Property Management Inc. Real Estate Toronto, Ontario Show more similar pages Show fewer similar pages Browse jobs Account Manager jobs 6,304 open jobs Rental Manager jobs 2,233 open jobs Account Executive jobs 3,738 open jobs Analyst jobs 36,938 open jobs Engineer jobs 24,068 open jobs Commercial Property Manager jobs 293 open jobs Leasing Administrator jobs 2,695 open jobs Scrum Master jobs 6,928 open jobs Real Estate Manager jobs 1,008 open jobs Director of Operations jobs 2,297 open jobs President jobs 4,664 open jobs Property Administrator jobs 3,036 open jobs Residence Manager jobs 304 open jobs Revenue Manager jobs 1,147 open jobs Assistant Controller jobs 3,347 open jobs Senior Property Accountant jobs 588 open jobs Finance Officer jobs 2,911 open jobs Financial Controller jobs 3,322 open jobs Controller jobs 4,082 open jobs Property Accountant jobs 2,727 open jobs Show more jobs like this Show fewer jobs like this More searches More searches Software Engineer jobs Finance Officer jobs Chief Executive Officer jobs Director jobs Director of Property Management jobs Estate Manager jobs Writer jobs Analyst jobs Technical Consultant jobs System Analyst jobs Full Stack Engineer jobs Developer jobs Engineer jobs Real Estate Developer jobs Corporate Controller jobs Strategy Analyst jobs Financial Controller jobs Marketing Designer jobs Controller jobs Business Development Specialist jobs Human Resources Specialist jobs Director of Leasing jobs Director of Operations jobs Marketing Director jobs Application Support Engineer jobs Compliance Lead jobs Marketing Coordinator jobs Energy Analyst jobs Instrumentation and Control Engineer jobs Vice President Information Technology jobs Business Analyst jobs President jobs Sales Director jobs Account Executive jobs Vice President jobs Director of Real Estate jobs Art Director jobs Marketing Specialist jobs Director of Development jobs Sales Manager jobs LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at Park Property Management Inc. Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://www.bendparksandrec.org/about/contact-us/",
      "text": "Contact Customer Service - Bend Parks and Recreation District Toggle navigation Playlist Calendar Board News Jobs Volunteer Register Toggle navigation Bend Parks and Rec Bend Park and Recreation District fitness & swim By Category By Location Fees & Passes Cardio – Fitness Clases de ejercicios en español Events & Workshops Fitness Centers Indoor Cycling Mind & Body Personal Training Pre-/Postnatal and Baby & Me Fitness Strength & Conditioning Therapeutic Fitness Water Fitness Swim Lap Swim / Masters Swim Recreation Swim Swim Lessons & Program Descriptions Fitness Passes Through Insurance Plans Virtual Fitness Classes Delays and Cancellations Report Juniper Swim and Fitness Center Class Schedules Larkspur Community Center Class Schedules Virtual Fitness Classes Hiring Kids Inc Join the BPRD Team . Now hiring for fall and beyond. Learn more and request your interview. Pass Types Discounts Swim and Fitness Social Activities for Adults Refunds & Privacy Fitness Passes through Insurance Hiring Kids Inc Join the BPRD Team . Now hiring for fall and beyond. Learn more and request your interview. parks & trails Park Directory Trail Directory Activities in Parks & Trails Rules & Guidelines Current Projects Park Locator Parks List A-Z Park Features & Activities Park Rules and Regulations Park Printable Maps Park Rentals Park Projects Alcohol Permits Business Use Hiring Kids Inc Join the BPRD Team . Now hiring for fall and beyond. Learn more and request your interview. Trail Locator Trail List A-Z Trail Features & Activities Trail Rules and Regulations Trail Printable Maps Trail Projects Hiring Kids Inc Join the BPRD Team . Now hiring for fall and beyond. Learn more and request your interview. Accessible Places Biking in Parks Disc Golf Dogs in Parks Dog Off-Leash Area Small Dog Area Fall In Bend Parks Fishing in Bend Parks Floating the River Geocaching in Parks Natural Play Areas Pickleball Drones & Remote Controlled Devices in Parks Skateboarding Slacklining in Parks Tennis Winter in Parks & Trails Park Rules and Regulations Business Use of a Park Dogs in Parks Metal Detectors Alcohol Permits Hiring Kids Inc Join the BPRD Team . Now hiring for fall and beyond. Learn more and request your interview. Planning and Development Park Projects Trail Projects Facility Projects activities Activities Childcare Sports - Youth Sports - Adult Therapeutic Recreation Events & More By Category (A-M) Arts, Crafts & Pottery Childcare Cooking & Baking DIY: Do It Yourself Fitness & Wellness Float the River Free Youth Programs Games Inclusive Programs Language & Learning Workshops Music By Category (N-Z) Nature & Outdoors No School Days Performing Arts & Dance Photography & Technology Science & Learning Sports & Leagues Summer Camps Therapeutic Recreation Trips & Tours Virtual Fitness Classes Young Children Kids Inc. Kids Inc. Resources Operation Recreation Preschool – Busy Buddies Summer Buddies Preschool Kids’ Corner The PAC at The Pavilion Youth Enrichment Teen Enrichment Summer Camp Payment Plan Categories Adaptive Sports Baseball & Softball Basketball Bicycles & BMX Football Golf Ice Sports Lacrosse Martial Arts Obstacles & Parkour Roller Sports Scootering & Skateboarding Soccer Sports Camps Swimming & Water Programs Tennis & Pickleball Tournaments Track & Field Volleyball Wrestling & Weight Training About Sports Coaching Resources Field Rentals & Tournaments Registration Deadlines Schedules and Standings Sports Officials Jobs Categories Adaptive Sports Basketball Cornhole Golf Ice Sports Kickball Martial Arts Roller Sports Rugby Softball Swimming & Water Programs Tennis & Pickleball Volleyball About Sports Coaching Resources Field Rentals & Tournaments Registration Deadlines Schedules and Standings Sports Officials Jobs Therapeutic Recreation Youth & Teen Programs Adult Programs Adaptive Sports Accessible Places for Play Community Recreation Survey Delays and Cancellations Report Facility Fee & Pass Information How To Register Program Cancellation Credit/Refund Policy and Privacy Policy Inclusion Play for Life Recreation Scholarship Program Summer Camp Payment Plan Community Events Movies in the Park Health Fair Fun on the Fly Kids’ Triathlon Roller Pride Winter Solstice Celebration July 4th Pet Parade facilities Recreation Centers Sports Centers Art Center Rentals & Permits Services Current Projects Juniper Swim & Fitness Bend Senior Center The Pavilion Larkspur Community Center Overview Features Fees Rules Schedules & Events Swimming Fitness Parties & Rentals Childcare Pool Cover Update Overview Features Fees Schedules & Events Parties & Rentals Classes & Activities Fitness Overview Features Fees Rules Schedules Ice Skating Ice Sports Roller Skating Roller Sports FAQs Summer Parties & Rentals Cafe Overview Fees Rules Schedules Swimming Fitness Facility Tours Parties & Rentals Cafe FAQ Bend Whitewater Park Big Sky Bike Park Sports Complexes Overview Rules & Safety Floating Surfing Kayaking Directions/Parking Current Conditions Whitewater Info Stewardship Share Your Experience FAQs Overview Features Rules Share Your Experience FAQs Big Sky Sports Complex Skyline Sports Complex Pine Nursery Sports Complex The Art Station Overview Features Schedules & Events Parties & Rentals Clay Multimedia Art Camps With Your Child About Rentals Find a Rental Shelter Rentals Rental Halls Public Events Sports Fields and Courts Business Use of Parks Alcohol Permits Film Permits District Office Lost and Found Park Services Planning and Development Park Projects Trail Projects Facility Projects about Connect with Us Current Projects District Information Employment Planning & Development Contact Information Staff List How To Register Program Cancellation Credit/Refund Policy and Privacy Policy Air Quality and Operations Delays and Cancellations Report Accessibility Advancing Diversity, Equity and Inclusion (DEI) Board of Directors & Meeting Info Board Meetings Lost and Found Recreation Scholarships Servicios en Español Planning and Development Employment Volunteer with BPRD Volunteer Application Volunteer Log-in Volunteer Coach Information Teen Volunteers Volunteering with Parks & Trails Public Health Advisory: COVID-19 Planning and Development Park Projects Trail Projects Facility Projects About Us Board of Directors Board Members Board Meetings District Map News Media, Photos & Public Records Requests Administrative Services Finance Department Purchasing & Contracts Sponsor & Advertiser Opportunities Commitment to Sustainability Public Notices Planning & Development Caring for Our Parks Canada Goose Management Fire Management Integrated Pest Management Park Stewardship Water Conservation History of BPRD Bend Park & Recreation Foundation Bench Dedications Donations Current Job Opportunities Internal Job Opportunities FAQs Seasonal Jobs Job Descriptions Key Positions Custodians Landscapers and Facility Maintenance Lifeguards Swim Instructors Youth Recreation Leaders Comprehensive Plan System Development Charges Development Standards Community Sponsored Projects River Access and Restoration Plan Capital Improvement Plan Bids & Requests for Proposals Naming Process Strategic Plan Land Use and Easements Search More results... Generic filters Search in content Search in excerpt Playlist Calendar Board News Jobs Volunteer Register fitness & swim by category Cardio – Fitness Clases de ejercicios en español Events & Workshops Fitness Centers Indoor Cycling Mind & Body Personal Training Pre-/Postnatal and Baby & Me Fitness Strength & Conditioning Therapeutic Fitness Water Fitness Swim Lap Swim / Masters Swim Recreation Swim Swim Lessons & Program Descriptions Fitness Passes Through Insurance Plans Virtual Fitness Classes Delays and Cancellations Report by location Juniper Swim and Fitness Center Class Schedules Larkspur Community Center Class Schedules Virtual Fitness Classes fees & passes Pass Types Discounts Swim and Fitness Social Activities for Adults Refunds & Privacy Fitness Passes through Insurance parks & trails park directory Park Locator Parks List A-Z Park Features & Activities Park Rules and Regulations Park Printable Maps Park Rentals Park Projects Alcohol Permits Business Use trail directory Trail Locator Trail List A-Z Trail Features & Activities Trail Rules and Regulations Trail Printable Maps Trail Projects activities in parks & trails Accessible Places Biking in Parks Disc Golf Dogs in Parks Dog Off-Leash Area Small Dog Area Fall In Bend Parks Fishing in Bend Parks Floating the River Geocaching in Parks Natural Play Areas Pickleball Drones & Remote Controlled Devices in Parks Skateboarding Slacklining in Parks Tennis Winter in Parks & Trails rules & guidelines Park Rules and Regulations Business Use of a Park Dogs in Parks Metal Detectors Alcohol Permits activities activities Arts, Crafts & Pottery Childcare Cooking & Baking DIY: Do It Yourself Fitness & Wellness Float the River Free Youth Programs Games Inclusive Programs Language & Learning Workshops Music Nature & Outdoors No School Days Performing Arts & Dance Photography & Technology Science & Learning Sports & Leagues Summer Camps Therapeutic Recreation Trips & Tours Virtual Fitness Classes Young Children childcare Kids Inc. Kids Inc. Resources Operation Recreation Preschool – Busy Buddies Summer Buddies Preschool Kids’ Corner The PAC at The Pavilion Youth Enrichment Teen Enrichment Summer Camp Payment Plan sports - youth Categories Adaptive Sports Baseball & Softball Basketball Bicycles & BMX Football Golf Ice Sports Lacrosse Martial Arts Obstacles & Parkour Roller Sports Scootering & Skateboarding Soccer Sports Camps Swimming & Water Programs Tennis & Pickleball Tournaments Track & Field Volleyball Wrestling & Weight Training About Sports Coaching Resources Field Rentals & Tournaments Registration Deadlines Schedules and Standings Sports Officials Jobs sports - adult Categories Adaptive Sports Basketball Cornhole Golf Ice Sports Kickball Martial Arts Roller Sports Rugby Softball Swimming & Water Programs Tennis & Pickleball Volleyball About Sports Coaching Resources Field Rentals & Tournaments Registration Deadlines Schedules and Standings Sports Officials Jobs therapeutic recreation Therapeutic Recreation Youth & Teen Programs Adult Programs Adaptive Sports Accessible Places for Play more Community Recreation Survey Delays and Cancellations Report Facility Fee & Pass Information How To Register Program Cancellation Credit/Refund Policy and Privacy Policy Inclusion Play for Life Recreation Scholarship Program Summer Camp Payment Plan Community Events Movies in the Park Health Fair Fun on the Fly Kids’ Triathlon Roller Pride Winter Solstice Celebration July 4th Pet Parade facilities recreation centers Juniper Swim & Fitness Overview Features Fees Rules Schedules & Events Swimming Fitness Parties & Rentals Childcare Pool Cover Update Bend Senior Center Overview Features Fees Schedules & Events Parties & Rentals Classes & Activities Fitness The Pavilion Overview Features Fees Rules Schedules Ice Skating Ice Sports Roller Skating Roller Sports FAQs Summer Parties & Rentals Cafe Larkspur Community Center Overview Fees Rules Schedules Swimming Fitness Facility Tours Parties & Rentals Cafe FAQ sports centers Bend Whitewater Park Overview Rules & Safety Floating Surfing Kayaking Directions/Parking Current Conditions Whitewater Info Stewardship Share Your Experience FAQs Big Sky Bike Park Overview Features Rules Share Your Experience FAQs Sports Complexes Big Sky Sports Complex Skyline Sports Complex Pine Nursery Sports Complex art center The Art Station Overview Features Schedules & Events Parties & Rentals Clay Multimedia Art Camps With Your Child rentals  & permits About Rentals Find a Rental Shelter Rentals Rental Halls Public Events Sports Fields and Courts Business Use of Parks Alcohol Permits Film Permits services District Office Lost and Found Park Services about connect with us Contact Information Staff List How To Register Program Cancellation Credit/Refund Policy and Privacy Policy Air Quality and Operations Delays and Cancellations Report Accessibility Advancing Diversity, Equity and Inclusion (DEI) Board of Directors & Meeting Info Board Meetings Lost and Found Recreation Scholarships Servicios en Español Planning and Development Employment Volunteer with BPRD Volunteer Application Volunteer Log-in Volunteer Coach Information Teen Volunteers Volunteering with Parks & Trails Public Health Advisory: COVID-19 current projects Planning and Development Park Projects Trail Projects Facility Projects district information About Us Board of Directors Board Members Board Meetings District Map News Media, Photos & Public Records Requests Administrative Services Finance Department Purchasing & Contracts Sponsor & Advertiser Opportunities Commitment to Sustainability Public Notices Planning & Development Caring for Our Parks Canada Goose Management Fire Management Integrated Pest Management Park Stewardship Water Conservation History of BPRD Bend Park & Recreation Foundation Bench Dedications Donations employment Current Job Opportunities Internal Job Opportunities FAQs Seasonal Jobs Job Descriptions Key Positions Custodians Landscapers and Facility Maintenance Lifeguards Swim Instructors Youth Recreation Leaders planning & development Comprehensive Plan System Development Charges Development Standards Community Sponsored Projects River Access and Restoration Plan Capital Improvement Plan Bids & Requests for Proposals Naming Process Strategic Plan Land Use and Easements home About Contact Information Contact Information highlights Playlist Register for an art class this fall! View Youth Arts & Crafts offerings View Teen/Adult Arts & Crafts offerings Event September 13 Hollinshead-Matson Homestead Museum Open House Saturday, September 13 10:00AM - 1:00PM The Hollinshead-Matson Homestead Museum offers visitors a look back to life in Central Oregon in the 1940’s. Join us for […] More September 14 Pavilion-Palooza Event Sunday, September 14 2:00PM - 4:00PM Pavilion-Palooza is back and even better – it’s FREE! Pavilion-Palooza is a fun-filled afternoon with roller skating, skatepark features, music […] More September 16 Lunch & Learn: Open New Doors with the Feldenkrais Method | Free Tuesday, September 16 12:00PM - 1:30PM Feed your body & mind as local experts share their knowledge about topics important to you. Bring your own brown […] More September 23 Lunch & Learn: The Art of Falling Safely | Free Tuesday, September 23 12:00PM - 1:30PM Feed your body & mind as local experts share their knowledge about topics important to you. Bring your own brown […] More September 30 Lunch & Learn: Maintaining Mental Health As We Age | Free Tuesday, September 30 12:00PM - 1:30PM Feed your body & mind as local experts share their knowledge about topics important to you. Bring your own brown […] More October 12 Homecoming Dance Sunday, October 12 2:00PM - 4:00PM Save the date: First annual Homecoming Dance is October 12 Dust off that letterman jacket and get out your dancing […] More October 18 Volunteer Project Day – Pollinator Planting at Alpenglow Park Saturday, October 18 9:00AM - 12:00PM Help with taking care of some of your favorite parks and trails! Join the BPRD natural resources and trails team […] More Playlist Fall registration now open. Learn more . BPRD invites applications for Naming Committee; deadline Aug. 29 The Bend Park and Recreation District is seeking community members to help name future park, facility and trail projects. Applications […] August 12, 2025 READ Contact: If you have any questions regarding Bend Park & Recreation District, contact Customer Service: Customer Service General Inquiries: (541) 389-7275 Email Customer Service × Use this contact form to send an Your name * Your email * Subject * Your message * Send Email Program Information & Registration, call: (541) 389-7275 Fitness/Swim Inquiries, call (541) 388-1133 Rentals & Reservations, call: (541) 706-6149 Click here for Lost & Found District Office District Office Administration, Recreation Services and Planning & Design 799 SW Columbia Street, Bend, OR 97702 More info Hours: Mon – Fri: 8:00 am – 5:00 pm Sat – Sun: Closed Tel: (541) 389-7275 District Office 799 Southwest Columbia Street, Bend, OR, United States Bend Senior Center Bend Senior Center 1600 SE Reed Market Road, Bend, OR 97702 Directions, Schedules, Special Events and Holidays Larkspur hours: Mon - Fri: 6:00 am - 8:00 pm Sat: 8:00 am - 6:00 pm Sun: 9:00 am – 4:00 pm Tel: (541) 388-1133 Bend Senior Center 1600 Southeast Reed Market Road, Bend, OR, United States Juniper Swim & Fitness Center Juniper Swim & Fitness Center 800 NE 6th St., Bend, OR 97701 Directions, Schedules, Special Events and Holidays Juniper Facility Hours: Mon - Thu: 5:30 am - 9:00 pm Fri: 5:30 am - 7:30 pm Sat: 8:00 am - 6:00 pm Sun: 8:00 am - 6:00 pm Tel: (541) 389-7665 Juniper Swim & Fitness Center 800 NE 6th St, Bend, OR, United States Larkspur Community Center Larkspur Community Center 1600 SE Reed Market Road, Bend, OR 97702 Directions, Schedules, Special Events and Holidays Hours: Larkspur hours: Mon - Fri: 6:00 am - 8:00 pm Sat: 8:00 am - 6:00 pm Sun: 9:00 am – 4:00 pm Tel: (541) 388-1133 Larkspur Community Center 1600 Southeast Reed Market Road, Bend, OR, United States Park Services Park Services 1675 SW Simpson Ave., Bend, OR 97702 Directions and Holidays Hours: Mon – Fri: 7:30 am – 4:00 pm Sat – Sun: Closed Tel: (541) 389-7275 Email Park Services Park Services 1675 SW Simpson Ave, Bend, OR, United States The Art Station The Art Station 313 SW Shevlin Hixon Dr. Bend, OR 97702 Directions, Schedules, Special Events and Holidays Hours: Open only for childcare programs. Customer Service phone hours are listed above. Tel: (541) 389-7275 The Art Station 313 Southwest Shevlin Hixon Drive, Bend, OR 97702, United States The Pavilion The Pavilion 1001 SW Bradbury Way, Bend, OR 97702 Directions, Schedules, Special Events and Holidays Pavilion hours: Mon - Fri: 6:00 am - 8:00 pm Sat: 8:00 am - 6:00 pm Sun: 1:00 - 6:00 pm Customer Service Phones available above. Tel: (541) 389-7588 The Pavilion 1001 Southwest Bradbury Drive, Bend, OR, United States Servicios en Español Servicios en Español Servicios en español: Comuníquese con: Kathya Avila Tel: (541) 706-1212 Pagina de Servicios en Español . Contact: Kathya Avila Tel: (541) 706-1212 Visit Latino Outreach page. Servicios en Español 800 NE 6th St, Bend, OR, United States Park Issues, Park Stewards and Lost & Found: To report a park maintenance issue, request Park Steward assistance or reach Lost & Found: Call 541-389-7275. If after hours on Monday – Friday, 4:00 p.m. – 7:30 a.m. or weekends), follow the prompt and “press 2” to reach the on-call operator. The on-call operator will direct information to appropriate staff. To report non-time sensitive issues , you can email Customer Service using the link below. Emails will be directed to appropriate staff for response during business hours. For emergencies (i.e., criminal activity, fire/medical/safety incidents) call 911. Customer Service General Inquiries: (541) 389-7275 Email Customer Service × Use this contact form to send an Your name * Your email * Subject * Your message * Send Email Staff by Department Administration Adam Kau Customer Service Supervisor (541) 508-4753 Email Adam Kau Anahi Kyniston Human Resources Specialist 541-706-6157 Email Anahi Kyniston Baylee Gregor HR Business Partner (541) 706-6132 Email Baylee Gregor BPRD Recruiting Anahi Kyniston: (541) 706-6157 Sabrina Pinkerton: (541) 706-6139 Email BPRD Recruiting Brian Anderson Financial Accountant (541) 706-6131 Email Brian Anderson Brian Hudspeth Director of Planning & Development (541) 706-6137 Email Brian Hudspeth Colleen McNally Marketing Manager (541) 706-6112 Email Colleen McNally Customer Service General Inquiries: (541) 389-7275 Email Customer Service Dave Arnold IT Manager (541) 706-6135 Email Dave Arnold David Madden Safety Coordinator (541) 706-6159 Email David Madden Eric Baird Finance Manager (541) 706-6140 Email Eric Baird Jase Newton Recreation Services Director (541) 706-6103 Email Jase Newton JoAnna Edwards Business Analyst (541) 706-6102 Email JoAnna Edwards John Batacan-Wilson Human Resources Specialist (541) 706-6142 Email John Batacan-Wilson Julie Brown Community Engagement Director (541) 706-6119 Email Julie Brown Kathleen Hinman Human Resources Director (541) 706-6111 Email Kathleen Hinman Kristin Toney Administrative Services Director (541) 706-6109 Email Kristin Toney Marcia Copple Financial Accountant (541) 706-6107 Email Marcia Copple Michael Egging Recreation Business Manager (541) 706-6138 Email Michael Egging Michelle Healy Executive Director (541) 706-6113 Email Michelle Healy Rentals and Reservations Rentals and Reservations (541) 706-6149 Email Rentals and Reservations Sabrina Pinkerton Human Resources Specialist (541) 706-6139 Email Sabrina Pinkerton Sasha Sulia Park Services Director (541) 706-6203 Email Sasha Sulia Sheila Reed Assistant to the Executive Director (541) 706-6151 Email Sheila Reed Teresa Burnett-Dumanch Accounting Specialist (541) 706-6153 Email Teresa Burnett-Dumanch Bend Senior Center Ben Lewellen Operations and Maintenance Supervisor Email Ben Lewellen Customer Service General Inquiries: (541) 389-7275 Email Customer Service Leigh Lehman Enrichment and Senior Social Supervisor (541) 706-6235 Email Leigh Lehman Paul Reinhardt Recreation Center Supervisor (541) 706-6232 Email Paul Reinhardt Rentals and Reservations Rentals and Reservations (541) 706-6149 Email Rentals and Reservations Sue Glenn Recreation Facilities Manager (541) 706-6180 Email Sue Glenn Board of Directors Cary Schneider Board Director, Bend Park & Recreation District Email Cary Schneider Deb Schoen Board Director, Bend Park & Recreation District Email Deb Schoen Donna Owens Board Vice-Chair, Bend Park & Recreation District Email Donna Owens Jodie Schiffman Board Chair, Bend Park & Recreation District Email Jodie Schiffman Nathan Hovekamp Board Director & Legislative Liason, Bend Park & Recreation District Email Nathan Hovekamp Community Engagement Andy Kropff Marketing Coordinator (541) 706-6150 Email Andy Kropff Colleen McNally Marketing Manager (541) 706-6112 Email Colleen McNally Joel Lee Park Stewardship Manager (541) 948-0691 Email Joel Lee Julie Brown Community Engagement Director (541) 706-6119 Email Julie Brown Kim Johnson Community Engagement Supervisor (541) 706-6127 Email Kim Johnson Juniper Swim and Fitness Center Alli Jorgensen Fitness Supervisor (541) 508-4747 Email Alli Jorgensen Ben Lewellen Operations and Maintenance Supervisor Email Ben Lewellen Carolyn Creedican Assistant Fitness Supervisor (541) 508-4750 Email Carolyn Creedican Cayla Gleaton Recreation Center Supervisor (541) 706-6184 Email Cayla Gleaton Customer Service General Inquiries: (541) 389-7275 Email Customer Service Heather Brenda Lifeguard Program Supervisor (541) 706-6181 Email Heather Brenda Kaye House Assistant Fitness Supervisor (541) 508-4748 Email Kaye House Leigh Anne Dennis Swim Program Supervisor 541-706-6183 Email Leigh Anne Dennis Leigh Lehman Childcare and Preschool Supervisor (541) 706-6235 Email Leigh Lehman Rentals and Reservations Rentals and Reservations (541) 706-6149 Email Rentals and Reservations Shannon Gilman Aquatics Supervisor 541-706-6148 Email Shannon Gilman Sue Glenn Recreation Facilities Manager (541) 706-6180 Email Sue Glenn Larkspur Community Center Alli Jorgensen Fitness Supervisor (541) 508-4747 Email Alli Jorgensen Ben Lewellen Operations and Maintenance Supervisor Email Ben Lewellen Carolyn Creedican Assistant Fitness Supervisor (541) 508-4750 Email Carolyn Creedican Customer Service General Inquiries: (541) 389-7275 Email Customer Service Heather Brenda Lifeguard Program Supervisor (541) 706-6181 Email Heather Brenda Kaye House Assistant Fitness Supervisor (541) 508-4748 Email Kaye House Leigh Anne Dennis Swim Program Supervisor 541-706-6183 Email Leigh Anne Dennis Leigh Lehman Enrichment and Senior Social Supervisor (541) 706-6235 Email Leigh Lehman Paul Reinhardt Recreation Center Supervisor (541) 706-6232 Email Paul Reinhardt Rentals and Reservations Rentals and Reservations (541) 706-6149 Email Rentals and Reservations Shannon Gilman Aquatics Supervisor 541-706-6148 Email Shannon Gilman Sue Glenn Recreation Facilities Manager (541) 706-6180 Email Sue Glenn Park Services Jason Monaghan Facilities Supervisor (541) 706-6214 Email Jason Monaghan Joel Lee Park Stewardship Manager (541) 948-0691 Email Joel Lee Mike Duarte Park Services Manager (541) 706-6205 Email Mike Duarte Park Services (541) 389-7275 Email Park Services Park Stewards (541) 706-6221 Email Park Stewards Rentals and Reservations Rentals and Reservations (541) 706-6149 Email Rentals and Reservations Roy Radcliff Fleet Manager (541) 706-6206 Email Roy Radcliff Sasha Sulia Park Services Director (541) 706-6203 Email Sasha Sulia Zara Hickman Natural Resources & Trails Manager 541-706-6202 Email Zara Hickman Planning & Development Brian Hudspeth Director of Planning & Development (541) 706-6137 Email Brian Hudspeth Bronwen Mastro Landscape Architect (541) 706-6152 Email Bronwen Mastro Henry Stroud Principal Planner (541) 706-6155 Email Henry Stroud Ian Isaacson Landscape Architect (541) 706-6154 Email Ian Isaacson Jason Powell Construction Manager (541) 706-6158 Email Jason Powell Kelsey Schwartz Planning and Property Specialist (541) 706-6106 Email Kelsey Schwartz Quinn Keever Park Planner 541-706-6146 Email Quinn Keever Rachel Colton Park Planner (541) 706-6192 Email Rachel Colton Sara Anselment Park Planner 541-706-6118 Email Sara Anselment Recreation Adam Kau Customer Service Supervisor (541) 508-4753 Email Adam Kau Anatasia Goldfarb Youth Enrichment Coordinator (541) 706-6187 Email Anatasia Goldfarb Aubree Pagani Youth Recreation Coordinator (541) 706-6129 Email Aubree Pagani Bailey Adams Sports Program Supervisor (541) 706-6126 Email Bailey Adams Becky Rexford Sports Program and Athletic Fields Manager (541) 706-6120 Email Becky Rexford Brian Hames Youth Enrichment/Art Station Supervisor (541) 706-6114 Email Brian Hames Camps & Youth Recreation 541-389-7275 Email Camps & Youth Recreation Catherine Ellis Recreation Program & Inclusion Manager (541) 706-6105 Email Catherine Ellis Customer Service General Inquiries: (541) 389-7275 Email Customer Service Daniela Ahmed Rental & Event Specialist 541-706-6217 Email Daniela Ahmed Elizabeth Longmire Youth Recreation Supervisor (541) 706-6144 Email Elizabeth Longmire Erika Pereda Rental and Event Specialist (541) 706-6108 Email Erika Pereda Jase Newton Recreation Services Director (541) 706-6103 Email Jase Newton Josh Motenko Sports Program Supervisor (541) 706-6124 Email Josh Motenko Kathya Avila Choquez Latino Community Specialist (541) 706-1212 Email Kathya Avila Choquez Katy Aceto Rental & Event Supervisor (541) 706-6125 Email Katy Aceto Kristen Stone Therapeutic Recreation/Inclusion Supervisor (541) 706-6115 Email Kristen Stone Kylie Johnson Therapeutic Recreation/Inclusion Coordinator (541) 706-6186 Email Kylie Johnson MacKenzie Torres Youth Recreation Supervisor (541) 706-6117 Email MacKenzie Torres Michael Egging Recreation Business Manager (541) 706-6138 Email Michael Egging Peter Darquea Sports Program Supervisor (541) 706-6136 Email Peter Darquea Rentals and Reservations Rentals and Reservations (541) 706-6149 Email Rentals and Reservations Shalee Hanks Youth Recreation Supervisor (541) 706-6195 Email Shalee Hanks Sports Information Sports Information (541) 693-1044 Email Sports Information Sue Glenn Recreation Facilities Manager (541) 706-6180 Email Sue Glenn The Art Station Brian Hames Youth Enrichment/Art Station Supervisor (541) 706-6114 Email Brian Hames Rentals and Reservations Rentals and Reservations (541) 706-6149 Email Rentals and Reservations The Pavilion Aly Roozee Pavilion Program Supervisor (541) 706-6116 Email Aly Roozee Clare Gordon Pavilion Manager (541) 706-6196 Email Clare Gordon Rentals and Reservations Rentals and Reservations (541) 706-6149 Email Rentals and Reservations × Send email to Your name * Your email * Subject * Your message * Send Email Bend Park and Recreation District Instagram Facebook Youtube District Office: (541) 389-7275 Juniper Swim & Fitness Center: (541) 389-7665 Larkspur Community Center: (541) 388-1133 Bend Senior Center: (541) 388-1133 The Pavilion: (541) 389-7588 Park Services: (541) 389-7275 Email Customer Support Play for Life logo × Send email to Your name * Your email * Subject * Your message * Send Email"
    },
    {
      "url": "https://www.nationaltrailersource.com/staff",
      "text": "Staff | National Trailer Source | Decatur Texas Skip to main content A National Trailer Source Company 866.769.7992 Locations Contact Us Careers News Open search collapse Search Go Toggle navigation Home All Inventory All Inventory New Inventory Used Inventory Monthly Specials Clearance Specials Coming Soon Pasture \"As Is\" Deals Available Inventory On-Order Inventory Freight Specials Get a Quote Sell or Trade Your Trailer Financing Apply for Financing Get a Quote Finance Calculator Extended Service Plan Parts & Service Parts Department Parts Request Service Packages Service Department Service Appointments Warranty FAQ Extended Service FAQ Insurance Claims Service Add-Ons About Us About Us NTS Pro Team The Patch Program The Referral Program NTS Blog NTS Event Calendar Event Partners All Star Team Happy Customers Customer Survey Meet Our Staff Subscribe to Newsletter NTS Gear nrsworld.com National Trailer Source 155 CR 4228 Decatur , TX 76234 US Phone: 940.393.7070 Email: sales@nationaltrailersource.com Fax : Meet Our Team The Owners Mike Henderson Owner/Partner Name Mike Henderson Title Owner/Partner Phone 940-393-7070 Bubba Paschal Owner/Partner Name Bubba Paschal Title Owner/Partner Phone 866-769-7992 David Isham Owner/Partner Name David Isham Title Owner/Partner Phone 940-304-8268 Decatur, TX Jayson Johnson COO Name Jayson Johnson Title COO Phone CONTACT Krista Wade Director of Inventory and Logistics Name Krista Wade Title Director of Inventory and Logistics Phone About Krista Krista is a well-established Veteran to NRS Trailers, having been with the company since 2010. Starting as a receptionist, Krista then moved into financing and later sales, where she was one of our leading sales professionals. Her skills and expertise took her to the top as she now manages our Decatur Location. Like many of our team members, Krista is not a stranger to the western world, having professionally trained horses and taught clinics over starting colts, horsemanship, and reining discipline. These days, you can find Krista chasing her son around to all different sporting events. Her Husband is the saddle/tack manager for NRS thus, NRS is a family affair. CONTACT Chance Heflin General Manager Name Chance Heflin Title General Manager Phone About Chance Chance started his journey with NRS Trailers in 2010, coming to us with an established sales career in the trailer industry.  He brings with him a great deal of trailer and truck knowledge and has worked his way up to our Senior Sales position.  Chance grew up in a rodeo family where he competes as a calf roper/team roper and still enjoys going to as many roping’s and rodeos as he can make.  Chance has a very outgoing personality and prides himself on trying to make the buying process a fun and unforgettable one! CONTACT Beau Bell National Sales Director Name Beau Bell Title National Sales Director Phone Bill Bargar Sales Professional Name Bill Bargar Title Sales Professional Phone About Bill Bill is another staple salesman at NTS. Like many of us, Bill grew up around horses - team roping in jr high and high school. He continued to rope in jackpots and smaller rodeso for a majority of his life and even today, trys to rope every chance he can. Bill's easy-going personality and expertise in the trailer world makes the trailer buying process a pain-free one for all customers! CONTACT Clint Martin Sales Professional Name Clint Martin Title Sales Professional Phone About Clint Clint is another team member who grew up in the rodeo and western world. A native of Oklahoma, he spent his younger years training horses, competing in team roping and steer wrestling from Jr Rodeo all the way through college. He attended Oklahoma State University where he received a bachelor's degree in Animal Science and Ag Business. He has since made his way to Texas and has made NTS his home. Clint continues to team rope on the side when he's not selling trailers with his charming personality and contagious smile. Clint is the man for all your trailer needs! CONTACT Maddy  Connolly Sales Professional Name Maddy Connolly Title Sales Professional Phone Brandon Henderson VP of Marketing Name Brandon Henderson Title VP of Marketing Phone About Brandon Brandon started in the trailer industry at Bonded Trailers in the late 90’s. In 2012 he joined our team here at NRS Trailers. With all the recent growth we’ve seen, there was a need to put more focus on acquisitions of used inventory and helping meet the logistical needs of our dealerships & customers - thankfully, Brandon was up for the challenge. He and his wife both grew up going to rodeos and competed in college. They have two great kids. When he isn’t at work he is busy spending time with his family hauling his daughter to rodeos and ropings, going to his son’s cross country & track meets, serving together at church and playing cowboy every chance he gets. Brandon's humorous personality keeps the workplace entertaining and on their feet at all times! CONTACT Jaime  Yandell Sales Manager Name Jaime Yandell Title Sales Manager Phone CONTACT Kalee Clark Unit Inventory Specialist Name Kalee Clark Title Unit Inventory Specialist Phone CONTACT Lauren Hellmann Finance & Insurance Director Name Lauren Hellmann Title Finance & Insurance Director Phone CONTACT Wade Bragg Finance & Insurance Specialist Name Wade Bragg Title Finance & Insurance Specialist Phone CONTACT Warren Burch Finance & Insurance Specialist Name Warren Burch Title Finance & Insurance Specialist Phone CONTACT Stephen Hooe National Service & Parts Director Name Stephen Hooe Title National Service & Parts Director Phone CONTACT Russell Kerby Service & Parts Manager Name Russell Kerby Title Service & Parts Manager Phone CONTACT Scott Williams Parts Advisor Name Scott Williams Title Parts Advisor Phone CONTACT Shawn  Cannon Service Advisor Name Shawn Cannon Title Service Advisor Phone Atkins, AR Brandon Oakley General Manager Name Brandon Oakley Title General Manager Phone About Brandon Brandon started out in the trailer industry in 1997 as a service tech. After finishing his Ag Business degree he moved into sales and then into a sales manager role. In 2007 he was promoted into the Store Manager role and has overseen the day to day operation through three different transitions. Brandon grew up in western OK on a cattle farm and has been around the horse and livestock business for over 35 years. When he is not in the office you can usually find him at the arena following his wife and grand daughter around at the local barrel race or sitting around a campfire playing guitar. CONTACT Kellye Oakley Sales Professional Name Kellye Oakley Title Sales Professional Phone CONTACT Jack Moll Parts Manager Name Jack Moll Title Parts Manager Phone About Jack With 12 years of customer service experience, seven of those in the trailer industry, Jack has learned to listen to his customers, understand their needs, and enjoys helping find the perfect trailer for them. Jack says he has had the opportunity to meet some of the nicest, hard-working, and interesting people in the world and that helping them makes coming to work a pleasure. Jack also enjoys supporting his four children in whatever activity they are involved in and if there is any time left over, a little fishing. CONTACT Fort Scott, KS Jason Arndt General Manager Name Jason Arndt Title General Manager Phone CONTACT Colleen Walls Office Coordinator Name Colleen Walls Title Office Coordinator Phone About Colleen Colleen has been around rodeo for most of her life - competing in her younger years and then becoming a member of the rodeo board, as well as a timer for MO-Kan youth association, These days she cheers on her son as he competes as a professional Bull Rider and her Daughter who is a Barrel Racer competing at the collegiate level. Colleen loves to trail ride in her spare time and thoroughly enjoys the outdoors. She has been in customer relations for 20+ years and loves what she does, making her an ideal Director of First Impressions at our Ft. Scott dealership! CONTACT Ocala, FL Kevin Scott General Manager Name Kevin Scott Title General Manager Phone CONTACT Darlene Livadas Office Coordinator Name Darlene Livadas Title Office Coordinator Phone CONTACT Jim  Nelson Sales Professional Name Jim Nelson Title Sales Professional Phone About Jim Jim is another Veteran of the trailer industry, having owned his own dealership - Nelson's Trailers - for 46 years, as well as Nelson's Western Store for 18 years. Jim has grown up in the western industry, rodeoing and shoeing horses for the greater part of his life. When it comes to trailer sales, Jim understands his customers because he's been in their shoes and knows what they're looking for in a trailer. CONTACT Sean Knowles Sales Professional Name Sean Knowles Title Sales Professional Phone CONTACT Oklahoma City, OK Drew Mueggenborg Sales Professional Name Drew Mueggenborg Title Sales Professional Phone Colby Perez Sales Professional Name Colby Perez Title Sales Professional Phone Pasadena, TX Greg  Oros General Manager Name Greg Oros Title General Manager Phone CONTACT Brandon Jones Service Manager Name Brandon Jones Title Service Manager Phone About Brandon Brandon started in the trailer industry with P&P trailers nearly a decade ago. NTS is one of the very few companies Brandon says he has seen that will go above and beyond to help their customers before and after the sale. He loves spending time with his wife and daughter, and spends his free time fishing. Come and let Brandon show you one of our amazing trailers and experience the customer service he believes makes NTS the place go for your next trailer purchase! CONTACT Sherry Hess Office Manager Name Sherry Hess Title Office Manager Phone CONTACT Rose City, TX Billy Jack Traylor General Manager Name Billy Jack Traylor Title General Manager Phone About Billy Jack Billy Jack came aboard with P&P in early 1998. He has helped grow the business to the multiple locations and great staff we have today. He has worked in all facets of the business is always willing to help in anyway he can. He loves to fish and hunt and goes every chance he gets when away from the office. \"We have the best staff in the industry and have a common goal to take care of the customer and to provide everything you need for a trailer in one stop shopping\" CONTACT Tracie Fregia Sales Professional Name Tracie Fregia Title Sales Professional Phone About Tracie Tracie is part of the sales team at NTS  in Rose City and has over 25 years of sales and customer service experience. She enjoys working with her fellow coworkers and helping customers find their perfect trailer, whether it’s for horses, utility or RV. One of the reasons she loves being part of the NTS team is the way the company treats every customer. “Even after the sale we are here for all the customers with any need they may have always here to help.” CONTACT Justin Waghorn Office Coordinator Name Justin Waghorn Title Office Coordinator Phone CONTACT Steven Thibodeaux Service Manager Name Steven Thibodeaux Title Service Manager Phone CONTACT Jennifer Broom Service Advisor Name Jennifer Broom Title Service Advisor Phone CONTACT Salado, TX Kevin Finch General Manager Name Kevin Finch Title General Manager Phone About Kevin Kevin has been helping people purchase horse trailers for over 20 years. What drives Kevin is the moment when a customer sees their new trailer for the first time and is all smiles. He enjoys working for NTS because Kevin proudly knows he's selling his customers the best brands on the market today. Kevin thoroughly enjoys spectating and selling trailers at roping events. In his free time, you'll find him hunting or fishing! CONTACT Cody Courtin Sales Professional Name Cody Courtin Title Sales Professional Phone About Cody Cody joined the NTS team after years of working in the hospitality and agriculture industry. Cody earned his degree from Texas Tech University in Viticulture and Enology. He is very passionate about helping customers find the perfect trailer to fit their needs. When he's not in the office, you can find Cody hunting and fishing with his wife. CONTACT Kayla  Spreen Office Coordinator Name Kayla Spreen Title Office Coordinator Phone CONTACT JR Carranco Service Manager Name JR Carranco Title Service Manager Phone CONTACT Mitch  Gasparaitis Service Advisor Name Mitch Gasparaitis Title Service Advisor Phone CONTACT Wickenburg, AZ Lana Finley Sales Coordinator Name Lana Finley Title Sales Coordinator Phone CONTACT Willis, TX Monty Owen General Manager Name Monty Owen Title General Manager Phone Natalie  Holt Sales Professional Name Natalie Holt Title Sales Professional Phone CONTACT Colby Artherholt Sales Professional Name Colby Artherholt Title Sales Professional Phone Emily Garmon Office Coordinator Name Emily Garmon Title Office Coordinator Phone All Star Team Abree Brock Name Abree Brock Phone Addilyn  McIntyre Name Addilyn McIntyre Phone Allie Calcote Name Allie Calcote Phone Bailey  Holmes Name Bailey Holmes Phone Blaine  Gray Name Blaine Gray Phone Branson Harter Name Branson Harter Phone Chloe King Name Chloe King Phone Drycen  Spire Name Drycen Spire Phone Griffin Coe Name Griffin Coe Phone Houston Harter Name Houston Harter Phone Jett Parker Name Jett Parker Phone Katie Cox Name Katie Cox Phone Kruz Cartwright Name Kruz Cartwright Phone Landon Shanholtzer Name Landon Shanholtzer Phone Laynie  Munden Name Laynie Munden Phone Michelle Hesnor Name Michelle Hesnor Phone RuthAnn Hutchison Name RuthAnn Hutchison Phone Skylan  Combs Name Skylan Combs Phone Skyler Florea Name Skyler Florea Phone Slate Allen Name Slate Allen Phone Tuf  Shanholtzer Name Tuf Shanholtzer Phone Pro Team Trevor  Brazile All Around Champion Name Trevor Brazile Title All Around Champion Phone Patrick  Smith Team Roper Name Patrick Smith Title Team Roper Phone Riley  Webb Tie-Down Roper Name Riley Webb Title Tie-Down Roper Phone Tuf  Cooper Tie-Down Roper Name Tuf Cooper Title Tie-Down Roper Phone Lari Dee Guy Breakaway Roper Name Lari Dee Guy Title Breakaway Roper Phone Josie  Conner Breakaway Roper Name Josie Conner Title Breakaway Roper Phone Bradi Good Breakaway Roper Name Bradi Good Title Breakaway Roper Phone Martha  Angelone Breakaway Roper Name Martha Angelone Title Breakaway Roper Phone Garrett  Yerigan Professional Rodeo and PBR Announcer Name Garrett Yerigan Title Professional Rodeo and PBR Announcer Phone CONTACT Zack  Jongbloed Tie-Down Roper Name Zack Jongbloed Title Tie-Down Roper Phone Jake Shelton Steer Wrestler Name Jake Shelton Title Steer Wrestler Phone John Douch Tie-Down Roper Name John Douch Title Tie-Down Roper Phone Riley Pruitt Tie-Down Roper Name Riley Pruitt Title Tie-Down Roper Phone Océane Veilleux Barrel Racer Name Océane Veilleux Title Barrel Racer Phone × × × × Join our mailing list Sign up for our email list to receive news and updates! National trailer source 866.769.7992 Contact Us National Trailer Source Like National Trailer Source on Facebook! (opens in new window) Follow National Trailer Source on Instagram! (opens in new window) Check out the National Trailer Source YouTube channel! (opens in new window) Follow P & P RV Sales on TikTok! (opens in new window) Inventory All Inventory Living Quarters Horse Trailers Livestock Trailers Cargo Trailer Utility Trailers Dump Trailers Flatbed Trailers Truck Beds As Is Inventory Finance Apply Online Payment Calculator Extended Service Value My Trade Services FREIGHT SPECIALS Schedule Service Order Parts Locations Decatur, TX (Corporate HQ) Rose City, TX Atkins, AR Fort Scott, KS Ocala, FL Oklahoma City, OK Pasadena, TX Salado, TX Willis, TX Wickenburg, AZ Policy Privacy Terms Accessibility Site Map"
    },
    {
      "url": "https://www.nachi.org/certified-inspectors/near/trailer-estate-park--rec--6814-canada-blvd--bradenton--fl-34207--usa?page=4",
      "text": "Certified Home Inspectors near Trailer Estate Park & Rec, 1908 Minnesota Ave, Bradenton, FL 34207, USA - InterNACHI® Certified Home Inspectors near Trailer Estate Park & Rec, 1908 Minnesota Ave, Bradenton, FL 34207, USA Showing page 1 of 8 total\n\t\t\tpages . Member Servicing Phone Distance Christopher Armstrong Hope Home Inspections, LLC Bradenton (941) 773-1144 < 5 mi. Kenneth Miller, CMI HI248 Manatee Home Inspection Services LLC Bradenton (941) 749-1152 < 5 mi. William Seth-Ward, CMI® Hope Home Inspections, LLC Sarasota (941) 773-1144 < 5 mi. Daniel Weems, HI 9959 Ameritech Home Inspections Bradenton (941) 518-0236 < 5 mi. Ronnie Griffin Recon Property Inspections Longboat Key (910) 330-7361 < 5 mi. Joseph Gibson Gulf View Inspections Longboat Key (941) 465-8638 < 5 mi. Frank Newgard, CMI® Good News Home Inspections LLC Longboat Key (941) 315-7075 < 5 mi. Josh Moss 82° West Home Inspections Longboat Key (941) 538-8558 < 5 mi. david ferriolo HomeSmart Inspections LLC Bradenton (941) 413-6600 < 10 mi. Matthew DeCanio Tech Systems Inspection Services LLC Bradenton (941) 720-7900 < 10 mi. Christopher Wosniak All In One Home Inspections, LLC Bradenton (941) 928-3418 < 10 mi. Eddie Sobrinho Alpha and Omega Property Management Group LLC Bradenton (954) 304-7476 < 10 mi. Nathan Standifer Homestead Property Inspections LLC Bradenton (941) 932-0035 < 10 mi. Vito Goffredo Hope Home Inspections, LLC Bradenton (941) 773-1144 < 10 mi. Jeremy Long Bradenton (405) 476-5786 < 10 mi. James Bartholomew Gulf Breeze Home Inspections Bradenton (309) 857-9321 < 10 mi. Ramzi Almassou Kingdom Home Inspectors LLC Bradenton (941) 600-9057 < 10 mi. Christopher Borovsky, CMI® N-Spect All Home Inspections Bradenton (941) 223-8095 < 10 mi. Michael Grant Grant's Professional Services, LLC Bradenton (727) 637-4180 < 10 mi. David E Scott, HI 10814 David's Home Inspections Inc. Bradenton (941) 743-8888 < 10 mi. Vito Bianca, CMI® Rock Solid Home Inspections Bradenton (727) 408-1088 < 10 mi. Bert Dooley, HI7814 Home Inspections Of Mid-Florida LLC Bradenton (813) 967-2987 < 10 mi. John Norman, CMI® 7713 Norman Inspections LLC Bradenton (941) 704-8727 < 10 mi. Philip Cable, CMI® AAAny & all inspections Bradenton (941) 525-6311 < 10 mi. Joaquin Diaz Pro Veteran Home Inspections Bradenton (941) 961-8002 < 10 mi. Blake Forsberg Bradenton (360) 271-8439 < 10 mi. Greg Suhre National Property Inspections (NPI) Bradenton (941) 254-1583 < 10 mi. Daniel Skidmore Bradenton (732) 425-4190 < 10 mi. Donald Shaw West Florida Inspections Bradenton (941) 981-9720 < 10 mi. Jeffrey Hammons Defender Home & Property Inspections Bradenton (941) 343-7204 < 10 mi. Jean-francois Baranski, CMI CONSTRUCTION INSPECTIONS & EDUCATION LLC Bradenton (863) 273-7723 < 10 mi. Damir Smajlovic BELLS Home Inspections LLC Bradenton (727) 287-7623 < 10 mi. Brian Hotopp N-spect, LLC Bradenton (941) 297-9193 < 10 mi. Kevin Young Integrity Inspections Bradenton (941) 549-2348 < 10 mi. Ryan Byrnes LaMaison Home Inspection Team Bradenton (941) 779-7170 < 10 mi. charles moore Collaborative Services of Florida LLc. Bradenton (941) 221-1567 < 10 mi. Mark Lee LeeWay Home Inspection Bradenton (813) 731-3505 < 10 mi. Scott Viehman 82° West Home Inspections Bradenton (941) 263-4699 < 10 mi. Dane Champlin, CMI® Sarasota Home Inspections Bradenton (941) 404-6310 < 10 mi. David Colvin, CMI HI 8665 Colvin Inspections Bradenton (833) 716-7373 < 10 mi. Matthew Thompson Bradenton (941) 773-5605 < 10 mi. Bob Chalmers, MBA, CPI A Snoop Inspection Bradenton (941) 685-9289 < 10 mi. Alan Bowman, HI9248 Bowman Building Assessment & Photography Bradenton (941) 600-8143 < 10 mi. Adam Sease Owens Property Inspections Sarasota (941) 323-8563 < 10 mi. Vincent Nemeth, CMI® Briton Inspection Services Lawrence, PA (412) 330-7760 < 10 mi. Glenn Stephens, CMI®, CRC1327314, CCC1329969, HI418 G. Stephens and Associates, Inc Sarasota (941) 914-1204 < 10 mi. David DuBosque Integrity Inspections and Consulting Sarasota (941) 650-4267 < 10 mi. Eddie Gerena Wind Mitigations Network LLC Sarasota (239) 351-5513 < 10 mi. Robert Seth-Ward Hope Home Inspections, LLC Sarasota (941) 773-1144 < 10 mi. Ryan Halpin Beacon Property Inspection Services LLC Sarasota (941) 529-8781 < 10 mi. Marco Carey SWFL Inspection Connection LLC Sarasota (941) 876-8606 < 10 mi. Keith Harris, CPI - HI16265, CCC1335321 KC Quality Inspections, LLC Sarasota (941) 979-7198 < 10 mi. Andrew Waters, CMI HI9039 AmeriSpec Sarasota < 10 mi. Shiraz Hassan, HI 4111 Sharp Home Inspections Sarasota (941) 727-7860 < 10 mi. Donatello Verardi, HI11906 Florida Building Inspection Group Sarasota (941) 413-1170 < 10 mi. Philip Pala New Beginnings Home Services LLC Sarasota (941) 993-6920 < 10 mi. Marco Garcia Ideal Home Inspection LLC Sarasota (828) 775-0012 < 10 mi. Todd Riley Sherlock Home Inspections Sarasota (239) 292-0756 < 10 mi. Scott England England's Home Inspection Services Sarasota (863) 835-0078 < 10 mi. janpaul alexandre 3 in 1 Environmental Sarasota (239) 404-9937 < 10 mi. Jesse Allen Sarasota (904) 800-9811 < 10 mi. David France Home-Plate Inspections Sarasota (863) 359-1702 < 10 mi. Josh Booze Gulf Coast Guardian LLC Sarasota (941) 889-8689 < 10 mi. Pierre Avila WIN Home Inspection Sarasota (331) 472-9476 < 10 mi. Michael Mota Paradise Inspections LLC Sarasota (941) 249-8120 < 10 mi. Jozef Friga Hestia Home Pro Inspections Sarasota (941) 473-6128 < 10 mi. Luis Maldonado, CMI® Tampa Property Inspections Sarasota (732) 207-0799 < 10 mi. Mark Holden Holden Home Inspection Services, LLC Sarasota (401) 864-1485 < 10 mi. David Pape Elite Inspections and Construction Sarasota (727) 317-9712 < 10 mi. Joshua Ellis AIRBORNE HOME INSPECTOR-RESTORATION Sarasota (813) 466-5950 < 10 mi. Trevor Douthett Gulf Coast Home Inspections Sarasota (941) 841-6910 < 10 mi. Todd Christopher, CMI® Mangrove Home Inspections Sarasota (941) 815-9056 < 10 mi. Brandon Mills Pinpoint Home Inspections LLC Sarasota (941) 780-7863 < 10 mi. David Gonzalez, HI8922 AcuSystem Home Inspections LLC Sarasota (813) 361-8302 < 10 mi. Issac Moncion Homebase Home Inspections Sarasota (813) 766-8549 < 10 mi. Riley Tucker Home Insights LLC Bradenton/Sarasota (813) 898-9336 < 10 mi. Ryan Wall Hello Home Inspections LLC Sarasota (813) 408-1262 < 10 mi. Joshua Larson, CMI® Home Inspections with Josh Of All Trades LLC Sarasota (636) 345-3371 < 10 mi. Ronald Wood Live Consulting Inspections Sarasota (941) 613-9973 < 10 mi. LUKASZ KITA Florida Property Inspections, Inc. Sarasota (941) 286-8595 < 10 mi. Scott Harper Sharp Inspection Services Sarasota (941) 376-0557 < 10 mi. Lib Astafan Harbor Inspection Services LLC Sarasots, (407) 920-8691 < 10 mi. Joshua C. Jordan Seaside Home Inspections LLC Palmetto (941) 374-0256 < 10 mi. Thomas Carpenter, FL #HI11454 CMI® Thin Blue Line Home Inspections Palmetto (941) 232-1671 < 10 mi. Jeffrey Leach JEL Home Inspections LLC. Palmetto (740) 395-7597 < 10 mi. Terry Gilbert, CMI® HI11639 AHS Home Inspection Port Charlotte, FL - FLORIDA (941) 777-2078 < 10 mi. Paul Stamm Florida Building Inspection Group Palmetto (813) 409-3249 < 10 mi. Clayton Owens, CMI   CGC 1516750   HI 533 Owens Property Inspections Sarasota (941) 993-0603 < 10 mi. Chuck Starrett, HI4662 Linesider Home Service, LLC., dba HouseMaster Home Inspections Sarasota (941) 378-1910 < 10 mi. Manuel Alonso, CMI® Real Shield Property Restoration Lakewood Ranch (786) 707-1711 < 10 mi. Sage Newgard, CMI® (Certified Master Inspector) Good News Home Inspections LLC Sarasota (941) 315-7075 < 10 mi. Rich Noto, Realtor - Home Inspector Lakewood Ranch (321) 804-3112 < 10 mi. Michael Guarino Jr Good to Go Inspections, LLC Lakewood Ranch (941) 299-4230 < 10 mi. Eric Hale Hale Home Inspections LLC Lakewood Ranch (941) 245-9024 < 10 mi. Dale Dinger Statewide Inspection Services Palmetto (941) 284-7167 < 10 mi. Joanna Furuglyas High Tide Home Inspections, LLC Palmetto (941) 779-4822 < 20 mi. Brett Shankle, HI8539 West Florida Home Inspection LLC Holmes Beach (941) 757-3696 < 20 mi. Seth Landry, HI8611 Banyan Home Inspection Services, LLC Sarasota (941) 447-0029 < 20 mi. Michael Blumin, Sr. / License #HI9715 5 Star Inspection Services, L.L.C. Palmetto (941) 417-9366 < 20 mi. Kapp McMullin, CMI®, HI11423 KMI Home Inspections, Inc. Sarasota (941) 350-2927 < 20 mi. « Previous Next » 1 2 3 4 5 6 7 8 Start Over / Browse All Find a Certified Home Inspector Need a home inspector? Enter the address you need inspected\n\t\t\t\tbelow to find certified home inspectors nearby. Search Search by name All InterNACHI® members listed on this site are InterNACHI\n\t\tCertified Professional Inspectors® and meet/abide by\n\t\tInterNACHI®’s strict standards. All InterNACHI® CPIs: Must pass the InterNACHI® Online Inspector Exam Must meet pre-certification training requirements Must abide by the InterNACHI® standards of practice Must abide by the InterNACHI® code of ethics Must meet InterNACHI®’s continuing education policy,\n\t\t\tincluding 24 hours of education each year Please note that some regions have licensing requirements that\n\tare separate from InterNACHI® certification. Check with your\n\tregional authority for details. Member Marketing Forum Find an Inspector Take Our Exam Certification & Licensing Become a CPI Standards of Practice Additional Certifications Education Online Courses House of Horrors® Videos & Webinars Exam Prep Resources Buy-Back Guarantee Move-In Certified® E&O Insurance Business Development InterNACHI® 1750 30th St., Ste. 301 Boulder, CO 80301 Contact Us Copyright © 2006-2025 InterNACHI® InterNACHI® is a registered trade­mark of the Inter­national Association of Certified Home Inspectors Terms of Use Close Menu Get Started Start with InterNACHI® Membership It all starts with InterNACHI®. Access nearly all our benefits with\n\t\t\tAll-Access Membership and work towards certification at\n\t\tyour own pace (at no additional cost). Licensing & Certification InterNACHI® can help you get licensed in your state or province,\n\t\tand provides certification to help you stand out from the crowd. Training & Education InterNACHI® offers over 1,000 hours of free online education for members. Free Online Exam Test & improve yourself. Become a Home Inspector 15 steps to become successful Get Insured Exclusive discounts & enhanced coverage. House of Horrors The world's #1 training facility. Free Design Services Get your logo & more for free . Membership Benefits Everything you need, in one place. Find a Certified Home Inspector Grow Your Business Grow Your Business with InterNACHI® InterNACHI® membership is so much more than training and certification .\n\t\tMembers get access to world-class resources to grow their business to the next level. “We’ll Buy Your Home” Guarantee Stand out from the crowd by offering the home inspection\n\t\t\tindustry’s strongest guarantee . Home Maintenance Book Quadruple your inspection business and reduce your liability with the\n\t\t“Now That You’ve Had a Home Inspection” book. Multi-Inspector Firms Take your company to the next level. BizVelop Free business development guidance. Chapters Engage with your local community. Logo & Marketing Design Build your brand and stand out. Webinars & Videos Live monthly educational broadcasts. More… About InterNACHI Standards & Policies News & Announcements Frequently Asked Questions InterNACHI Forum Calendar of Events Contact Us InterNACHI® School & College Certificate Program House of Horrors™ Inspector Outlet Find a Certified Home Inspector Search NACHI.ORG…"
    },
    {
      "url": "https://royaltrailersales.com/leadership-team/",
      "text": "Leadership Team | Royal Truck & Utility Trailer Skip to content (313) 524-2529 Contact Us Careers Home Trailer Sales Trailer Inventory Types Dry Vans Dump Trailers Reefer Trailers Lowboy Trailers Flatbed Trailers Tag-Along Trailers Manufacturers Utility MAC MAC LTT Talbert Titan Wilson Pitts Gincor Equipment Sales Equipment Inventory Manufacturers Custom Upfitting Reefervan Insulation Kits Parts Service General Equipment Repair Wheel Polishing Graphics Custom Upfitting Resources The Haul Report How-To Locations About Us Our Company Our History Leadership Team Careers News Events Home Trailer Sales Trailer Inventory Types Dry Vans Dump Trailers Reefer Trailers Lowboy Trailers Flatbed Trailers Tag-Along Trailers Manufacturers Utility MAC MAC LTT Talbert Titan Wilson Pitts Gincor Equipment Sales Equipment Inventory Manufacturers Custom Upfitting Reefervan Insulation Kits Parts Service General Equipment Repair Wheel Polishing Graphics Custom Upfitting Resources The Haul Report How-To Locations About Us Our Company Our History Leadership Team Careers News Events (313) 524-2529 Contact Us Careers Home Trailer Sales Trailer Inventory Types Dry Vans Dump Trailers Reefer Trailers Lowboy Trailers Flatbed Trailers Tag-Along Trailers Manufacturers Utility MAC MAC LTT Talbert Titan Wilson Pitts Gincor Equipment Sales Equipment Inventory Manufacturers Custom Upfitting Reefervan Insulation Kits Parts Service General Equipment Repair Wheel Polishing Graphics Custom Upfitting Resources The Haul Report How-To Locations About Us Our Company Our History Leadership Team Careers News Events Leadership Team Ken Bumgardner Chief Executive Officer Read Bio Adam Pigeon President/Chief Operating Officer Read Bio Julie Igielski Chief Financial Officer Read Bio Anthony Sciara Chief Legal Officer Read Bio Mike Morrison VP of Aftermarket Sales & Operations Abbie Sack VP of Trailer Sales Brian Trombley Director of Corporate Projects & IT Tommy Westfall Director of Procurement Myra Yu Director of Human Resources About Our Company View A Look Into OurPast Learn More Join Our Team Apply Ken Bumgardner Chief Executive Officer Read Bio Ken Bumgardner Chief Executive Officer Read Bio Ken Bumgardner Chief Executive Officer Read Bio Ken Bumgardner Chief Executive Officer Read Bio Ken Bumgardner Chief Executive Officer Read Bio Lorem ipsum dolor sit amet, consectetur adipiscing elit. Ut elit tellus, luctus nec ullamcorper mattis, pulvinar dapibus leo. Royal Truck & Utility Trailer Headquarters 311 E. Cady St. Northville, MI 48167 P. (313) 524-2529 (313) 524-2529 Facebook-f Instagram Linkedin-in Youtube Twitter © 2024 Royal Truck & Trailer. All Rights Reserved. Terms & Conditions Contact Us Careers Disclaimer Privacy Terms & Conditions Contact Us Careers Disclaimer Privacy adroll_adv_id = \"HMCEL2CQFJBMBHTV6KRLT3\";\nadroll_pix_id = \"24FPK64I45BFRMMXFXBEMW\";\nadroll_version = \"2.0\";\n\tadroll_current_page = \"other\";\n\tadroll_currency = \"USD\";\n\tadroll_language = \"en_US\"; Ken Bumgardner Chief Executive Officer Linkedin-in Ken Bumgardner is the CEO of Royal Truck & Utility Trailer. Ken is an extremely hardworking individual with interpersonal and problem-solving skills. He graduated from Eastern Michigan University with a degree in Business Management in 2001. Ken has been with the company since he was 12 years old, he was always helping out at the shop to spend time with his dad before joining the team full time in 2001. Before becoming our current CEO, he has held various positions working his way up in the company, such as: cleaner, parts runner, parts counter, parts manager, trailer salesman, office manager, vice president, and president. Ken wanted to join the family business because of his very close relationship with his family, and he loved working with and spending time with his dad. On a daily basis, he is in charge of merger and acquisitions and overseeing our C-level executives. In addition to these responsibilities, Ken also makes sure everyone at Royal is happy in their roles; he thoroughly enjoys working with all of the members of our team. Something he is very proud of is the acquisition of East Michigan Trailer Sales in 2017 because of how it has impacted the dynamic of Royal. He is on the Board of The National Trailer Association and formerly was on the Board of The Michigan Trucking Association. Under Ken’s leadership, we have accomplished great new highs and cannot wait to see what else we can accomplish in the future. Adam Pigeon President/Chief Operating Officer Linkedin-in Adam Pigeon is the President/Chief Operating Officer here at Royal Truck & Utility Trailer. Adam joined the team in 2009 after graduating from Eastern Michigan University with a Bachelors of Science in 2008. He first joined us as a Parts Counter Representative and advanced to Parts Purchasing Manager. Adam was promoted to President/COO in January of 2015 and under his leadership we have seen such tremendous growth. Adam is tasked with overseeing all of our day to day operations between all four facilities and works closely with Corporate Officers, Department VPs, and Directors to implement the company’s strategic plan. When asked about his favorite part about being a part of Royal Truck & Utility Trailer, he shared that he loves the people he works with every day. Something Adam takes pride in is all of the company growth that he has helped achieve over his time at Royal. With over 10 years experience, he has become knowledgeable about the industry and strengthened his skills in operations management, leadership, team building, and contract negotiation. Adam has served on multiple industry advisory and councils and boards. Adam is such an asset to our company and we are so proud of everything he has accomplished during his time with us at Royal Truck & Utility Trailer. Julie Igielski Chief Financial Officer Linkedin-in Julie Igielski is the Chief Financial Officer at Royal Truck & Utility Trailer. Julie attended Michigan State University and earned her Bachelor’s in Merchandise Management in 2004 before attending Eastern Michigan University to get a Master’s degree in Accounting. After graduating with her MSA, she received her Certified Public Accountant license. Prior to joining the Royal team in 2013, Julie held various accounting positions at both publicly and privately owned companies. Since deciding to continue on in the family business nearly 8 years ago, she has helped us accomplish so much. Julie is in charge of all of our finances, creates all of our financial statements, works closely with our CEO and COO when making executive decisions, and works with the bank when acquiring new properties and companies. She is most proud of her CPA license and all of the growth and success she has helped Royal achieve. The thing she loves most about her job is being able to work with her family and her co-workers who have become her family over the years. We are so happy that Julie decided to join the team, we are so appreciative of all she does for us every day. Anthony Sciara Chief Legal Officer Phone-alt Envelope Linkedin-in Anthony Sciara is our Chief Legal Officer, Corporate Secretary, and a Member of our Board of Directors. He has been a licensed attorney for nearly 15 years. Anthony earned his Bachelor’s Degree from Eastern Michigan University in 2002 and his Juris Doctor from the University of Illinois (Chicago) Law School in 2006. Anthony represented the company for eight years as outside counsel before formally joining the team in October of 2019. Anthony handles and/or supervises all legal and compliance matters for the company, including executive strategy, corporate transactions, and dispute resolution. In addition to his responsibilities with the company, Anthony serves as a member of the Board of Directors for the Northville Educational Foundation, participates in the Association of Corporate Counsel, and was previously an Adjunct Professor of Lawyering Skills at the University of Illinois (Chicago) Law School. Anthony is most proud that his position allows him the opportunity to solve problems for us in creative ways, which minimizes risk and maximizes success. The thing Anthony loves most about being part of Royal Truck & Utility Trailer is the sincere and uncommon passion that ownership, leadership, and other employees share for the success of the company. Ken Bumgardner Chief Executive Officer Linkedin-in Ken Bumgardner is the CEO of Royal Truck & Utility Trailer. Ken is an extremely hardworking individual with interpersonal and problem-solving skills. He graduated from Eastern Michigan University with a degree in Business Management in 2001. Ken has been with the company since he was 12 years old, he was always helping out at the shop to spend time with his dad before joining the team full time in 2001. Before becoming our current CEO, he has held various positions working his way up in the company, such as: cleaner, parts runner, parts counter, parts manager, trailer salesman, office manager, vice president, and president. Ken wanted to join the family business because of his very close relationship with his family, and he loved working with and spending time with his dad. On a daily basis, he is in charge of merger and acquisitions and overseeing our C-level executives. In addition to these responsibilities, Ken also makes sure everyone at Royal is happy in their roles; he thoroughly enjoys working with all of the members of our team. Something he is very proud of is the acquisition of East Michigan Trailer Sales in 2017 because of how it has impacted the dynamic of Royal. He is on the Board of The National Trailer Association and formerly was on the Board of The Michigan Trucking Association. Under Ken’s leadership, we have accomplished great new highs and cannot wait to see what else we can accomplish in the future."
    },
    {
      "url": "https://www.businessinsider.com/inside-americas-trailer-park-boom-flipping-real-estate-demand-2025-4",
      "text": "Inside America's Trailer Park Boom: the Big, New Real Estate Trend - Business Insider Business Insider Subscribe Newsletters Search Business Strategy Economy Finance Retail Advertising Careers Media Real Estate Small Business The Better Work Project Personal Finance Tech Science AI Enterprise Transportation Startups Innovation Markets Stocks Indices Commodities Crypto Currencies ETFs Lifestyle Entertainment Culture Travel Food Health Parenting Politics Military & Defense Law Education Reviews Tech Streaming Tickets Home Kitchen Style Beauty Gifts Deals Video Big Business Food Wars So Expensive Still Standing Boot Camp Subscribe My account Log in Newsletters US edition Deutschland & Österreich España Japan Netherlands Polska Get the app Matt Chase for Business Insider Discourse Real Estate Trailer park treasure Americans are buying up mobile homes — and flipping them for big profits Matt Chase for Business Insider By Amanda Abrams 2025-04-23T08:11:02Z Share Facebook Email X LinkedIn Reddit Bluesky WhatsApp Copy link lighning bolt icon An icon in the shape of a lightning bolt. Impact Link Save Saved Read in app Add us on This story is available exclusively to Business Insider\n              subscribers. Become an Insider and start reading now. Have an account? Log in . Byron Sellers had wanted to get into real estate investing for years, but the deals he came across were always prohibitively expensive. One day in 2017, he was listening to a real estate podcast while driving for Lyft when he heard about something different: flipping mobile homes . \"I was like, 'Wow, she's saying it just takes $3,000 or $5,000 to start?'\" Sellers remembers. His passengers wanted him to switch to music, so he texted the podcast to his wife, Sharnice, asking her to give it a listen. \"When I came home, she was excited. It was like: 'Hey, you want to do it? I want to do it. Let's do it.'\" The Sellerses did some research, took out a $10,000 high-interest consumer loan, and began poring over Google Maps to locate trailer parks near Chicago, where they were renting an apartment . Then they hit the road. After checking out more than 40 units for sale, they spotted the right deal. The manager of a mobile home park 90 minutes outside the city had some units he was trying to unload. \"Make me an offer,\" he said. They suggested $4,300 for the two they were interested in. He bit. Byron and Sharnice were now the proud owners of two mobile homes, their first real estate investment . One of the units was move-in ready; the other needed work. With help from Sharnice's father, the couple put in new flooring, refurbished the bathroom , replaced the appliances, and painted the interior. Then the Sellerses sold both units, netting $10,000 for the turnkey mobile home and $9,500 for the one they flipped. All told, they'd gone from finding to buying to flipping to selling in under 60 days. This is mobile home investing, an unsexy, little-known sector that happens to be recession-proof , meeting a nearly bottomless demand, and earning some of the best returns in the housing industry. Its low price of entry is allowing an entirely new crop of entrepreneur — many of them Black, as the Sellerses are, or coming from very modest backgrounds. (A 2021 survey by the National Association of Real Estate Investment Managers found that 73 percent of industry workers are white males.) With housing costs rising across America, many mobile home flippers are finding the opportunities so plentiful that they're now training other wannabe real estate moguls in the practice, earning a significant chunk of their income from mentorships and tutorials that help more people like them enter the field. While they don't get a lot of attention, mobile homes — \"manufactured housing\" per marketing and policy wonks, or \"trailers\" in other circles — are the country's biggest source of unsubsidized low-income housing, providing shelter to 21 million Americans. As the nation's housing crisis grows, they're becoming increasingly attractive to people who can't afford a traditional site-built home. Between 2014 and 2024, the number of new manufactured homes shipped across the country increased by over 60%, according to census data. \"Demand is through the roof, supply is barely catching up, rents are accelerating, and occupancy is as high as it's ever been,\" a report from the industry publication Multi-Housing News noted in December. \"They are the lowest cost of homeownership in nearly every market in America.\" They're cheap in part because the selling price rarely includes land; most buyers pay only for the structure. They're also factory-built, benefiting from economies of scale. And unlike stick-built houses, mobile homes are classified as personal property, like cars, which results in lower property taxes and home insurance costs. Historically, they've also depreciated like cars . But that's changing in today's housing market. A few months ago, LendingTree reported that between 2018 and 2023 the average sales price of new mobile homes went up by almost 60%, to $124,000 from $78,000. And the Urban Institute found that while there's more volatility in the manufactured housing market and location matters, the homes generally appreciate much like site-built properties, at about 5% a year. Mobile homes have historically depreciated like cars. But that's changing in today's market. About 30% of mobile home residents live in parks where they may own the home but lease the land underneath it. In those cases, park managers are motivated to fill vacant units so they can continue to collect rent on the lot. Investors use that to their advantage. They might spend hours in the communities, cultivating relationships with managers and looking for homes that are available for purchase. Like more traditional real estate investors , they call it \"driving for dollars.\" \"We basically drive through these parks and if they look abandoned, we take note,\" says Mersadez Joseph, an EMT in Columbia, South Carolina, who flips mobile homes on the side with her husband, Devon. \"Then we follow up with the manager. We kind of pitch it to them to let them know, 'Hey, we can make you all some money and get you a tenant in there, if you allow us to fix it up.'\" Over the past four years, the Josephs have done about 20 deals and have earned about $250,000. They look to sell every home for double what they put into it. Other investors spend time in rural areas, spying out vacant mobile homes on private property. The houses are often considered so worthless that many landowners will sell them for a song. \"They'll say, 'Hey, I got a mobile home and I want to get rid of it,'\" says Michael Wiley, an investor in Dothan, Alabama. \"Sometimes they might put a decent little price on it, but most of the time they just want to get rid of it.\" Wiley acquired one for a dollar; for another, a double-wide, he paid $1,000 and then sold it for $30,000. Wiley worked in a factory and did graphic design before getting into mobile homes. \"We hit six figures in that first year.\" Related stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know The work does require a lot of elbow grease. Some units just need a good cleaning and a fresh coat of paint; others have rotted subflooring, old insulation, and broken windows that all need replacing. After that, the investor will have to market and sell them on Facebook Marketplace or Craigslist, either outright to a buyer or wholesaler, or through seller financing. Investors say the downsides of the mobile homes business aren't much different from those of other real estate fields: homes that turn out to be in worse condition than the buyers had thought, difficult tenants, unscrupulous contractors. The sector's high returns are often characterized by desperation. Facing a lost spouse or job or some other hardship, sellers are often willing to dispose of a home cheaply because they need the quick cash. Buyers are hungry for something, anything, they can afford. They aren't looking to build equity; they're seeking shelter, at a time when both conventional homeownership and rentals have soared out of reach for many. Mobile homes exist in an alternate reality, one where a home purchase can be completed in a day without the help of attorneys or appraisers, where the cost of a used unit floats depending on its actual value to the buyer and seller. \"If you put a message on Facebook Marketplace saying 'I have a home to sell on payments,' you'd be overwhelmed,\" says John Fedro, an investor in Austin. He's been in the field since 2002 and now owns several mobile home parks. Like the other mom-and-pop investors interviewed for this story, he sees himself as providing an important and helpful service. The demand is so great, Fedro says, that people will happily buy retrofitted homes built before 1976, the year the Department of Housing and Urban Development began regulating mobile homes. The earlier homes were more shoddily built, with cheaper plumbing and electrical systems, but many are still around. Not everyone views the work through the lens of service. In the past few years, private equity firms have discovered how lucrative mobile home parks can be. \"In 2020-21, institutional investors accounted for 23 percent of all manufactured home purchases, up from 13 percent in 2017-19,\" the Private Equity Stakeholder Project wrote in a recent report. Mobile home parks have a 22% annual compounded return, the highest in the real estate field, the report said, and firms like Blackstone are spending millions to acquire communities around the country. Many subsequently raise the rent on the parks' mobile home lots, and residents, who usually can't afford to move the units, are stuck. Small-scale investors say they're watching the phenomenon as rents climb, but so far, it's not affecting their business. The Instagram video starts with a drone shot that descends from above and lingers on a couple in matching black T-shirts who are standing in a mobile home park. \"Allow us to reintroduce ourselves. We are Byron and Sharnice Sellers, founders of Mobile Home Elite Investors,\" read the captions, accompanied by Jay-Z's \"Public Service Announcement.\" \"We currently have five mobile home parks. Follow us for mobile home and mobile home park investing.\" Byron and Sharnice have done very well since that aha moment in 2017. Sharnice left her job with a Chicago gas company, Byron stopped driving for Lyft, and they began investing all their time in finding and selling mobile homes. First they flipped them, then they dived into seller financing , and then they started buying parks. Last year, the couple moved to Florida, in part because the mobile home market there is so strong. Pretty early, Byron realized they could make money teaching others how to do it, too. \"It kind of just took off,\" he said. Related stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know It's not a brand-new idea. For over a dozen years, Mobile Home University has been offering trainings to aspiring investors that currently start at $550. But it's focused on teaching people how to buy entire parks — and then raise the rent on tenants . Fedro for years has also been offering trainings and tutorials in buying and selling individual homes; right now, a one-on-one mentorship throughout the client's first three deals is almost $3,000. But the Sellerses were some of the first mobile home investors of color to begin showing others how to get into the field. Now there are many, including Mersadez, who posts TikTok videos under the moniker Mobile Home Bae; Wiley's Flippin' Mobile Homes; and Mobile Home Gurl. Each has a slightly different model, but they often include a mix of free social media content covering some basics, paid online courses outlining the details of how to find and sell homes, and one-on-one mentoring to respond to specific questions. Byron and Sharnice — who are now earning more from the trainings than from their actual investments — estimate they've taught more than 17,000 would-be investors. Virtually all of them have been Black. \"I feel like it gives them the confidence to say, 'Hey, if they can do it and be this successful, I know I can do it too,'\" says Sharnice. Real estate investing requires an aggressive drive and a hustle, and not every student has thrived. But some have. Jenisha and DaVon Nelson took the Sellerses' online course in 2020 and began implementing their lessons shortly afterward. Jenisha, a nurse, grew up in a mobile home and was intrigued by the concept. \"It was as simple as taking doughnuts to a park manager to introduce ourselves, get our faces out there,\" she says. But their business didn't really take off until they moved from Arizona to Spartanburg, South Carolina, where Jenisha is from. Since then, they've done about 13 deals, and they wear T-shirts sporting their logo wherever they go, as a conversation starter. \"It's a way of life now,\" says Jenisha. This current moment might not last, however. Many housing advocates have begun eyeing mobile homes as a solution to the country's housing shortage — after some key protections are enacted, that is. Arica Young, who leads the Innovations in Manufactured Homes Network at the Lincoln Institute of Land Policy, says her organization is focused on \"addressing issues in the sector, including quality, efficiency, tenant security, finance, and land use.\" Local zoning laws, for example, explicitly ban manufactured housing in communities all over the country — even though many modern units are indistinguishable from traditional homes. And the classic image of a mobile home smashed to bits by a tornado isn't wrong; older homes or those that aren't securely fastened to the ground are vulnerable to extreme weather. More protections would most likely mean higher prices, though, and could eventually lead to these investors being priced out of the market. For now, however, they're aiming to connecti buyers with what's becoming, in the US, a scarce resource . As Byron Sellers puts it, \"Where else in America are you going to find a move-in-ready house for less than $30,000 to $50,000?\" Amanda Abrams is a freelance journalist living in Durham, North Carolina. Business Insider's Discourse stories provide perspectives on the day's most pressing issues, informed by analysis, reporting, and expertise. Discourse Real Estate Housing More Related stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know More from Real Estate Most popular Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know HOME Subscribe This story is available exclusively to Business Insider\n      subscribers. Become an Insider and start reading now. Have an account? Log in . Legal & Privacy Terms of Service Terms of Sale Privacy Policy Accessibility Code of Ethics Policy Reprints & Permissions Disclaimer Advertising Policies Conflict of Interest Policy Commerce Policy Coupons Privacy Policy Coupons Terms Company About Us Careers Advertise With Us Contact Us News Tips Company News Awards Masthead Other Sitemap Stock quotes by finanzen.net International Editions AT DE ES JP NL PL Copyright © 2025 Insider Inc. All rights reserved.\n    Registration on or use of this site constitutes acceptance of our Terms of Service and Privacy Policy . Jump to Main content Search Account"
    },
    {
      "url": "https://trailerparkgroup.com/contact/",
      "text": "Contact - Trailer Park Group Skip to main content Contact Us Contact Us We’d love to hear from you. Name * Email * Regarding * Regarding General Enquiry New Business Press Request Careers Message * Inquiries Tel. +1-310-845-3000 US: bizdev@trailerparkgroup.com UK: london@trailerparkgroup.com Locations Hollywood 6922 Hollywood Blvd. 10th Floor Hollywood, CA 90028 USA Get Directions London Third Floor Threeways House 40-44 Clipstone Street London W1W 5DW UK Get Directions Mumbai Morya House, A-506 New Link Rd., Andheri West Mumbai, Maharashtra 400053 India Get Directions How can we help grow your audience? We’d love to hear from you and learn more about your needs. Contact Us About Work Careers Categories Film & TV/Streaming Gaming Sports Music Brands Capabilities Trailers & Promos Design & Motion Social & Digital Strategy & Insights Influencer Marketing & Partnerships Gameplay Trailer Production AR, VR & Experience Live Action Companies Trailer Park Art Machine Mirada Dark Burn Creative Mutiny MXW White Turtle Studios News Awards News Inside TPG Trailer Park Group 6922 Hollywood Blvd. Hollywood, CA 90028 USA Threeways House 40-44 Clipstone Street London W1W 5DW UK Morya House, A-506 New Link Rd., Andheri West Mumbai, Maharashtra 400053 India © 2025 Trailer Park Group. All rights reserved. Terms & Conditions | Privacy Policy Wicked | Universal About Work Categories Capabilities Companies News Careers Contact Back to Main Menu Categories Film & TV/Streaming Gaming Sports Music Brands Capabilities Trailers & Promos Design & Motion Social & Digital Strategy & Insights Influencer Marketing & Partnerships Gameplay Trailer Production AR, VR & Experience Live Action Companies Trailer Park Art Machine Mirada Dark Burn Creative Mutiny MXW White Turtle Studios"
    },
    {
      "url": "https://www.cookpropertiesny.com/community/oakwood-estates",
      "text": "Oadkwood Estates Mobile Home Park | Williamson, NY Skip to content Resources Resident Portal Pay Rent Self Storage (585) 434-3032 Our Communities Find Your Home Resources About Cook Opportunities Resident Portal Make a Payment Contact Us Apply Now Oakwood Estates 6023 Ridge Road; Williamson, NY 14589 Overview Located on the border of Williamson and Sodus between Route 104 and Ridge Road, Oakwood Estates is a large community consisting of 118 homes. New Homes Available Pre-Owned Homes Available Rentals Available School District Sodus Community Sales Agent Mike Marcello Call or text: (585) 710-9080 Found your community? Get in touch using the form below. \" * \" indicates required fields Name * Email * Phone * Message This field is hidden when viewing the form Community This field is hidden when viewing the form Community URL This field is hidden when viewing the form Agent Email Consent * I agree. By submitting your information, you agree to our Privacy Policy and to allow Highland Holdings LLC (dba Cook Properties) to communicate with you including via text message. You can opt-out at any time. Standard message and data rates may apply. CAPTCHA Facebook This field is for validation purposes and should be left unchanged. Discover Oakwood Estates Mobile Home Park Unlock the potential of affordable living in the beautiful Finger Lakes Region! Oakwood Estates’ mobile home park offers a collection of homes for rent in Williamson NY that cater to diverse lifestyles and preferences. Located in the heart of Wayne County, these meticulously maintained properties provide residents with a unique blend of comfort, community, and strategic accessibility. Our community emphasizes affordability and quality of life, creating a welcoming environment that you’ll feel comfortable calling home. Living in the Finger Lakes It’s important to acknowledge the wide-ranging appeal of the Finger Lakes region when considering Williamson, NY. Known for its picturesque landscapes, this area features over 11 stunning glacial lakes, lush forests, and gently rolling hills, making it a haven for outdoor enthusiasts all year long. With over 150 wineries, this region is home to one of the most robust wine regions in the United States.  The Finger Lakes is also home to charming small towns like Ithaca, Geneva, and Skaneateles, where a strong sense of community thrives alongside excellent schools, family-friendly amenities, and a rich cultural scene. In addition to its natural and cultural appeal, the Finger Lakes offers an affordable lifestyle with reasonable housing costs and a slower pace of life. Its blend of rural charm and proximity to larger cities like Rochester and Syracuse means you can easily access urban amenities without sacrificing the tranquility of country living. For anyone seeking a high quality of life in a beautiful setting, the Finger Lakes region is an exceptional choice, offering both a welcoming environment and countless opportunities for recreation and relaxation. Why Choose A Cook Mobile Home Community Manufactured homes provide an excellent option for those seeking a cost-effective and comfortable alternative to traditional apartments. With more space, greater privacy, and the freedom to personalize your home, you’ll enjoy a lifestyle that feels truly your own—while building equity in the process. At Cook Properties, we understand the importance of a home that balances convenience, affordability, and a welcoming community. Choosing a mobile home in Williamson, NY , means experiencing the Cook Properties promise: high-quality living spaces designed to enhance your daily life and foster meaningful connections within our communities. Headquarters 90 Air Park Drive Suite 400 Rochester, NY 14624 Contact Us Pay Rent Our Communities What They Are Why They're Better How It Works Find Your Home Browse Communities Purchase a Home Community Application About Cook Who We Are Join Our Team Opportunities Resources Articles Resident Portal © 2025 Cook Properties. All Rights Reserved | Terms of Service | Privacy Policy | Website by"
    }
  ]
}