{
  "fuentes": [
    {
      "url": "https://www.thebutterflycommunitycafe.com/contact",
      "email": "info@thebutterflycommunitycafe.com"
    },
    {
      "url": "https://wwaspsurvivors.com/wwasp-programs/tranquility-bay/",
      "email": "alejandrog1985@live.com"
    },
    {
      "url": "https://wwaspsurvivors.com/wwasp-programs/tranquility-bay/",
      "email": "aubries@yahoo.com"
    },
    {
      "url": "https://wwaspsurvivors.com/wwasp-programs/tranquility-bay/",
      "email": "bkcheeno@sbcglobal.net"
    },
    {
      "url": "https://wwaspsurvivors.com/wwasp-programs/tranquility-bay/",
      "email": "boriquamama177@yahoo.com"
    },
    {
      "url": "https://wwaspsurvivors.com/wwasp-programs/tranquility-bay/",
      "email": "crassrelax@yahoo.com"
    },
    {
      "url": "https://wwaspsurvivors.com/wwasp-programs/tranquility-bay/",
      "email": "jbhudson82@yahoo.com"
    },
    {
      "url": "https://wwaspsurvivors.com/wwasp-programs/tranquility-bay/",
      "email": "ian0810@live.com"
    },
    {
      "url": "https://wwaspsurvivors.com/wwasp-programs/tranquility-bay/",
      "email": "luis.leal@uol.com.br"
    },
    {
      "url": "https://wwaspsurvivors.com/wwasp-programs/tranquility-bay/",
      "email": "lykap1mp@yahoo.com"
    },
    {
      "url": "https://wwaspsurvivors.com/wwasp-programs/tranquility-bay/",
      "email": "melissadunne83@yahoo.com"
    },
    {
      "url": "https://wwaspsurvivors.com/wwasp-programs/tranquility-bay/",
      "email": "mrcostac@aol.com"
    },
    {
      "url": "https://wwaspsurvivors.com/wwasp-programs/tranquility-bay/",
      "email": "onemadlove12@outlook.com"
    },
    {
      "url": "https://wwaspsurvivors.com/wwasp-programs/tranquility-bay/",
      "email": "zac_buckner85@yahoo.com"
    },
    {
      "url": "https://butterflybooks.co.uk/about-us",
      "email": "info@butterflybooks.co.uk"
    },
    {
      "url": "https://thebutterfly.ca/pages/contact-us",
      "email": "strippedlogo-01_215x@2x.png"
    },
    {
      "url": "https://www.butterflyfurniture.co.uk/contact/",
      "email": "andrew@butterflyfurniture.co.uk"
    },
    {
      "url": "https://thebutterflyprojectnow.org/who-we-are/",
      "email": "info@thebutterflyprojectnow.org"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    }
  ],
  "mails": [
    "alejandrog1985@live.com",
    "andrew@butterflyfurniture.co.uk",
    "aubries@yahoo.com",
    "bkcheeno@sbcglobal.net",
    "boriquamama177@yahoo.com",
    "crassrelax@yahoo.com",
    "ian0810@live.com",
    "info@butterflybooks.co.uk",
    "info@thebutterflycommunitycafe.com",
    "info@thebutterflyprojectnow.org",
    "jbhudson82@yahoo.com",
    "luis.leal@uol.com.br",
    "lykap1mp@yahoo.com",
    "melissadunne83@yahoo.com",
    "mrcostac@aol.com",
    "onemadlove12@outlook.com",
    "sales@finewineliquors.com",
    "strippedlogo-01_215x@2x.png",
    "zac_buckner85@yahoo.com"
  ],
  "nombre_sitio": "tranquilitybay.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.thebutterflycommunitycafe.com/contact",
      "text": "Contact | The Butterfly Cafe top of page Home About Us Our Mission Get Involved Funders Events Contact More Use tab to navigate through the menu items. Donate Contact us Leave your details here and we'll get back to you... First Name Last Name Email Write a message Submit Thanks for submitting! The Butterfly Community Cafe C.I.C We are a Community Interest Company operating on a not-for-profit basis. All monies are reinvested into training more young people. Email : info@thebutterflycommunitycafe.com Phone : 07979018705 Registered Company: 13524646 © 2023 by The Butterfly Community Cafe. bottom of page"
    },
    {
      "url": "https://wwaspsurvivors.com/wwasp-programs/tranquility-bay/",
      "text": "Tranquility Bay - WWASP Survivors Home About WWASP Survivors WWASP Survivors Breaking Code Silence Legislative Policies Facebook Merchandise Donate Report Abuse About WWASP WWASP History WWASP Programs WWASP Program Structure WWASP Seminars WWASP Owners & Staff WWASP Photos Survivor Testimony Survivor Testimony Submit Testimony Research Troubled Teen Industry What is a WWASP Program? Red Flags Restraint and Seclusion GAO Reports Podcasts Blog Select Page Tranquility Bay Tranquility Bay Tranquility Bay opened in 1997 as a co-ed facility in Saint Elizabeth Parish, Jamaica. Widely viewed as one of the harsher WWASP schools, it was run by Jay Kay,  the son of the WWASP President Ken Kay. Jay Kay has admitted to pepper-spraying students to restrain them. Tuition at Tranquility Bay ranged from $25,000 to $40,000 a year. Tranquility Bay closed in 2009. Staff Jay Kay Jay Kay got his start in WWASP working for his father as a security guard at Brightway Adolescent Hospital. Before WWASP he ran a gas station convenience store after dropping out of college. Jay Kay was eventually given the job as Director at Tranquility Bay, where he served until the facility closed in January 2009. He has admitted to pepper spraying students repeatedly. Randall Hinton Randall Hinton was something of a jack-of-all-trades for WWASP. He first staed working for WWASP as a tech at Brightway in 1992. After two years at Brightway he moved to the Cross Creek in 1995, working there for one year. He then served as Assitant Director for Spring Creek in 1996, then took a job in the same role for Tranquility Bayi 1997. After Tranquility Bay, in 1998 he again served as Assistant Director, this time for Carolina Springs, working under Narvin Litchfield. In 2001 Litchfield gave him the job as Director at Academy at Dundee Ranch. Hinton also appears to have spent 3 years working for Teen Help, the marketing arm of WWASP.  In 2002, Hinton left WWASP to work in another school, but came back in 2006 in order to serve as Director of Royal Peak/Royal Gorge Academy in Colorado.  Ginton was arrested on chrages of child abuse by authorities in 2007 and the school was shut down in 2008. Hinton was convicted in 2007 of one count each of third-degree assault and false imprisonment. He served 25 days in jail and one year of probation. Hinton appears to have left WWASP. Survivor Testimony Gallery [nggallery id=7] 286 Comments doug Ammundsen on May 20, 2012 at 12:31 am i will catach a life sentsnce if i ever see jay kay and most of the staff Reply BillBoyles on May 21, 2012 at 1:42 pm I understand the feeling, doug. However, for legal reasons I must make clear that wwaspsurvivors.com nor its owners and administrators do not condone violence or iegal acts of any kind. Reply T f@cking J on January 1, 2019 at 9:10 am burn Trane at the stake! BURN HIM ALIVE Happy f’ing New Year Reply K.I. on June 28, 2022 at 1:52 am I was sent to Tranquility bay when I was a teen, I was beaten, forced to lay in my own feces while laying face down on a tile floor etc. Now I’m 40 and suffer from PTSD and nightmares if I don’t take my meds..so glad they shut down and can’t hurt any one else Reply J A on September 18, 2022 at 6:29 am There needs to be a lawsuit. There was no reason for this to happen to any child, let alone an American with supposed effing rights Where Tf was the American embassy there? Why did they now step in? These cowards need to be held accountable Reply Steven on September 23, 2023 at 1:39 am I’ll never forget the giant sores on my face and terrible foot rot that was left untreated so long I thought I might lose my feet. Forced to teach ourselves school because the stupid Jamaican “teachers” had no idea how to teach algebra. I wish I could remember the name of the kid that spent like 9 months in “worksheet” mostly because he was sarcastic. Reply Renee on March 23, 2024 at 9:19 pm Steven, Was his name Blake? Reply Ss on September 7, 2024 at 11:54 pm My good friend is a Tranquility Bay survivor. When he was 20 he got a life sentence without parole. That place screwed him up as a teen and led him down a worse path than he had before he was sent there. Thankfully today, although in prison for life, he is a new man. A good man. Reply Ben B. on May 19, 2025 at 11:59 pm I started out at academy at ivy ridge in New York and after 10 months of fighting pulling fire alarms and laying on my face in op they shipped me to tranquility Bay I was there for 2 weeks when the riot happened I fled on foot through the Jamaican jungle barefoot got caught and laid in my face for another 9 months until I finally got pulled and I still struggle to this day with PTSD and my life is a complete mess but I’m a stronger person without a doubt Reply Brent on April 11, 2025 at 2:51 am Most of my fellow survivors are deceased by now- Karma works on all things. I’ll cherish the day Justice is carried out by God or Man. Reply Matthew galeoto on April 4, 2023 at 4:33 pm My father was the one who who’s investigation led to the closure of this hell-hole. That’s when the US military raided it and rescued all of us. Reply KC Sherman on March 13, 2025 at 1:03 am Would anyone be willing to share their stories? I have a friend who went through something awful and with enough stories…this tragedy can be brought to light Reply Zac Cox on March 11, 2024 at 5:03 am Yo it’s time to rise!! I was there for three years I know people that were there for 5-8 years. I came up with the symbols use to communicate to pu the riot together Reply Blair Lynn on April 1, 2024 at 7:02 pm I will never forget watching Valerie heron jump to her death off the third floor to her death.  And we were told to never talk about it or we were threatened with OP. Lying on our face and stomach for 24 hours plus.  Then they put the bars up shortly thereafter.  I had huge lice in my hair for.months before they put kerosene in my hair to kill them. Smh. Reply Nate Brooks on July 2, 2024 at 10:34 pm Hey guys seeing that people are still posting to this. I’d love to chop it up with some former tb students. My name is nate brooks was in tb from April 01 to July 02. Call me text me come visit. I just wanna catch up. 347 777 7869 Reply Cory on March 29, 2024 at 3:54 pm Ti the guy that said the supervisors don’t condone this lmao to hell they don’t all off these places are exactly the same lol the same company you speak of run all of it lol Reply Joshua ventura on October 3, 2020 at 2:02 pm How do file a lawsuit Reply Em on October 13, 2021 at 7:04 pm Is it too late to sure them for what they did to me ? Reply Kehaulani McCullough on March 5, 2022 at 6:14 pm I was sent to Tranquility bay at 15. Although I’m grateful for the knowledge of accountability they were abusive. I was abused multiple times. Left side of my face bruised for 2 weeks from staff who grinded every joint into the concrete. This place should be burnt to the ground. Jay Kay definitely deserves his energy back. Nasty nasty nasty things happened here haunted me for years: parents …think…what would I like to happen to me if I’m experiencing these same situations as child. This place was AWFUL many abusive people and situations; Reply R.P on June 24, 2022 at 4:43 am I’m actually glad to see that someone did something about this plane and got them shut down. I still remember the having bones grinded into the ground and still have scars on my knuckles from it to. Reply Mac on March 15, 2024 at 4:25 am Hey I’m here for anyone who needs someone I didn’t go there but I did go through a lot of the same and I still feel alone now so anyone who wants to talk hit me (463)////867-4399 Reply Zac Buckner on June 9, 2012 at 1:14 pm I look back on the twenty three months and thirteen days I was there very often. I find the Americans involved to be more sinister. After serving some time in the military (Airborne) I still Find some of the punishments very harsh. It has been 8 years since I spoke to anyone from there. I hope that everyone else who went there is doing well! zac_buckner85@yahoo.com Reply J.B. Niday on November 8, 2018 at 4:56 am Zac, it’s J.B. Lets get in touch. It has been a long time. Reply Ricky Nguyen on March 20, 2019 at 11:52 am 00-02 Was president on the Male side during the end of my stay. ” fake it till you make it.” JB Niday, it’s me Ricky. If any of you want to talk I’ll gladly listen. Email is reachtdk@gmail.com Reply Justin Reid on May 11, 2022 at 8:48 pm I was there a year i would hope to see any of the staff again fuck tranquility bay Reply Cameron Maloney on July 1, 2019 at 5:46 am J.B. how are you doing. it feels like a lifetime ago we were in unity, but I remember it like it was yesterday. Reply Bradley on May 21, 2023 at 3:26 pm I was there in 1998. Dignity family. I remember some of the kids there with me. Scott, Corey, Joey, Rosa, Evan, a kid we called TEX. Mr. Peasy was our family father. I used my 3 month phone call to tell my family what was really going on. Got in deep shit for it after but they came about a month later at the very end of the day (it was night out) and got me. We were sitting in the circle out front where the entry gate was and a car pulled up and it was my family there to get me. My room was on the back side of the building facing the volley ball court the staff would use after hours. I was at the all boys facility. I’d really just like to re connect with anyone who was there with me. Jbhudson82@yahoo.com Reply Jon lyons on October 16, 2022 at 2:52 pm Hey zack it’s jon lyons how you doin. For those people who have never heard of these places they were hell on earth I was beaten and abused many times over the 4.5 years I was at tranquility bay and it has caused me a lot of pain that I am just now in the last couple years picking up the pieces of drug addiction and hate because of this place. I am now doing well but it defiantly messed me up more then it helped Reply Paul Solomon on March 24, 2024 at 6:33 pm is anyone here from the 2008 graduating class? Reply Jason on March 28, 2024 at 4:54 pm Yo Paul Solomon it’s Jason from triumph. Been wondering what happen to you. Crazy how they put the program on NETFLIX. Reply Daniel Leatherman on January 23, 2018 at 10:25 pm Yeah tranquility bay was horrible.  One of the staff  precured cocaine for me on a regular basis.  It’s tough when the staff aren’t paid well and living in ghettos which I assume is common in Jamaica Reply Ben on December 27, 2018 at 1:51 am Doug don’t forget the spades Reply scott on November 26, 2019 at 9:18 pm Randall! WOW I was his first student in a new school in Puerto Rico after the riot in TB ( that was awesome)  Randall held me against my will- tortured and starved me for 4 months until I turned 18 and walked out.  This man should be in prison for much longer 25 days. I was just 1 of many kids he abused.  his end will be according to his works.  2nd Corinthians 11:14-15 And no wonder, for Satan himself masquerades as an angel of light, It is not surprising, then, if his servants also masquerade as servants of righteousness. Their end will be what their actions deserve. – This man truly enjoyed inflicting pain on defenseless kids, watching them suffer and starve the whole while laughing and mocking. I am now 33 and have learned that people act this way because their hearts are far from christ and god. hence the vs above.  Blessings to all of you whom have suffered at the hands of WWASP if any of you want to contact me please reply i can supply contact info. Reply Brad rosberil on August 14, 2020 at 2:21 am I was in tranquility bay in late 98 until 2000 and IAM now 37 yrs old and it seems to have created a lifetime of drug addiction and still seems to be main cause of me and my family not having any kind of relatio ship. AA to me is also a brainwashing program, IAM just curious what you thought of it and how you dealt with it afterwards, Reply John Bender on September 17, 2020 at 4:36 am I was there in the excellence family in 1999, anyone who was there around that time  hit me up. Would like to hear how people are doing. Reply Bo Watson on January 25, 2024 at 2:58 am John Bender…This is Bo Watson…I was also at TB in 1999…I got there in February, 1999 and I turned 18 in May, 1999 and signed my ass outta that shit show…That place was Hell on Earth…I was in the Progress Family with Mr. Melvin…I remember you and your last name…I played against you in basketball and in a basketball tournament they allowed us to play against other families Reply Mr Kyle Beckstrom on November 7, 2021 at 3:25 am Kyle Beckstrom I was in Tranquility Bay age 17 til 18. I was in the dignity family. I am now 38 I strongly disagree with everything that ever took place in this facility there was nothing positive it was abusive in every thinkable way our parents were lied to there were no teachers there was no education it was a scam we were missed treated we were starved. I forgive the people who harmed me I am sure the universe in time will teach them of their wrongdoing. Reply Jan on March 8, 2024 at 5:28 am My beautiful smart niece, Janna was a poor victim. 2004 I miss her so much, she would have been 35, Reply Matt on September 21, 2024 at 4:48 pm I escaped from cross creek in Utah and was then escorted by two men who zip tied my hands and legs and drove me to LAX and flew me to Jamaica. The very first thing I remember was the blood splatter in the courtyard from the girl that I later learned who committed suicide. I was in unity family. Quinis (sp?) baker—the gay guy the other staff fucked with—was our main family “leader” I was there in 03 when 1 member from each family, I was unity’s rep, made a plan to start a riot and escape. When we heard over the radio that the families on the other side of the compound were fucking shit up, several of us broke off the metal poles that held the top bunks up…and we waged war. Me and another guy tried tried breaking into the med building for drugs but staff were chasing us so we ran for the ocean. We eventually got out of the water and saw a bunch of shadows running along the beach. You could see the fires growing. There were 11 other kids, making us 13 in all…and off we took into the Jamaican countryside. Our “plan”…a desperate, stupid 15 year olds plan…was to hide until we were 18 or try to figure out how to get to Cuba and then Miami…again..we were 12-15 years old so. We lasted about 2 hours by jumping fences, chased by dogs, chased by regular Jamaican civilians who are compensated for catching us. I was the last of the 13 to be caught. When we arrived back a full platoon of Jamaican police, with automatic weapons were there. All the girls were looking out from their “dorm”. What followed still haunts me to this day as a 36 year old man…we were all layed on our faces (typical OP shit), but the staff was more angry than I had ever seen. Earlier in the riot a 12 year old boy had smashed a staffs radio. That staff member came up and kicked him in the face and then BROKE a broomstick over his body…a12 year old. I was laying right next to him and just prayed to god I wouldn’t be next. The next 2 weeks I was in solitary confinement—you are all familiar with the laying on your face..being given only beans, no silverware and you had to break the styrofoam in a way to make a scoop to eat..and then back on your face…for 2 weeks…alone..all day. One day I was told to get up and go grab my shoes which I thought was weird because of the “run risk”. So I went to that shed and got my shoes. Sat in a room for 6 hours wondering but not letting myself hope that maybe, impossibly, I was going home. My mom eventually showed up…and we left. I will never be the same after this place. In fact I came back MUCH worse than when I went in. I started doing coke and heroin and my life was in shambles for a long time. I later did 2 combat tours in Iraq and honestly I would spend the rest of my life in Iraq to avoid ever going back to TB Reply Riva Ramakrishnan Menon on September 7, 2020 at 4:07 pm hai anyone from tb from the year 2005 here? i was from success family .. Reply Theodore helm on March 19, 2024 at 4:55 pm Who remembers washing laundry in a bucket with powered soap and showering outside. Mr Wilson would spray you with the hose. You would soap up. He would spare you off with the hose you would dry off. Walk way back to the buildings sweating the whole way because we were not allowed to shower in the rooms teddyhelm1982@gmail.com Reply Audrey L. on August 17, 2022 at 6:23 pm My niece  was head 9ver heels in love with 1 of the young men that took off during the hurricane.  I’ll just put his first name out there. Chris.  I know this thread is old but Christopher  just passed away a little over 2 Mos ago and when I accidentally ran into this,  I had to comment, just to keep his memory alive.  He was an amazing young man and unfortunately,  at the age of 29, felt that life couldn’t be lived without him and took her own life.  I’ve never seen a couple love each other more.  They’d try to get rid of each other,  and couldn’t.  Tranquility Bay was an abusive unqualified rip off that never should’ve been in business.  Chris and the other boy brought that out in the open.  Rest in paradise Chris and Summer. I love and miss you both.  143 baby girl Reply Matthew galeoto on December 22, 2022 at 12:44 am Please excuse if I have posted this before…I am a combat veteran and have a traumatic brain injury which effects my memory. I was in tranquility bay. It was horrific. I would rather step into gunfire than be back there. It was horrific. I was starved, beaten and stripped naked before being pepper sprayed. Was forced to stand in sewage to dig a channel to the ocean because of flooding. It was do to my father investing where I was that led to it’s shutdown. I witnessed the torture of children who just cried and begged for it to stop. It’s saying something that my nightmares are of that place considering what I have experienced in war.  I know that this has led to many suicides and a number of other issues for so many. I just hope that the survivors can find peace or bits of joy in life. Reply Andrew on November 4, 2024 at 7:32 pm I was at TB in 2003 and was a major part of the riot the led to my leaving the school. Not sure how to get involved in the lawsuits but anyone who was there in 2003 knows the horrors. My names Andrew 206-817-9721 Reply Beau Rhodes on March 5, 2024 at 12:31 pm What a time of life Reply Beau Rhodes on March 5, 2024 at 12:47 pm Where do Tranquility bay students go to reconnect Reply Theodore helm on March 19, 2024 at 4:58 pm I remember a kid named Jon brewer from California I think was really good at drawing and mark Klepper and we had a kid that was from Jamaica he ran away I think to his uncles in Jamaica Reply Chad Costa on July 14, 2024 at 8:59 am If this was in 1998 I think the Kids name was Justin that ran Away. He was from Oakland CA but had Family there. Had us all on the Floor and Quiet for like 2 Days after he took off. Never came back. Reply Cameron Cook on March 13, 2024 at 7:14 am Id give anything to get 5 minutes in the ring with Jay Kay I’m a man now not a boy and you’ll find out real quick Reply Peter on January 17, 2025 at 3:36 pm For those interested I found jay kay ! He works at vista real estate in southern Utah – 435-632-5491 Reply Mike on July 10, 2012 at 1:35 am My sister went there for 2 years. I remember visiting the compound. They turned me away for wearing a sleeveless shirt. I’m glad to hear people speaking out and that it has been shut down. Reply Cecily Pate on November 1, 2015 at 9:23 pm What is your sisters name is it Shea Jennings? Reply Kristin on September 30, 2016 at 4:28 am I was there in 1998. I escaped with another girl over the fence. We ran barefoot for miles until we were surrounded by some men on bikes. They figured out where we were from and helped hide us and use the phone. Our parents were able to come get a days later and took us home. We were so lucky! If anyone knows who tre other girl is, I would love to see how she is. Reply Kate on June 8, 2019 at 7:52 am I was there in 1998 when 2 girls who hadn’t been there very long ran off and never came back. We were told by staff that you two were hitchiking and got picked up by some men who told you they would take you to the airport but instead they kidnapped you, raped you and held you for ransom until your parents paid them and they dumped you at the airport Wow. It’s nice to know that didn’t happen to you girls. Just goes to show the extent of the abusive, fear based mind fucking they used to control us Reply csullivan on June 28, 2019 at 7:16 pm i was there Reply Lauren Dzikowski on May 21, 2020 at 4:27 pm Hi, I remember Chrissy Clayton. She was great while I knew her. We both went to school in Palos Verdes, CA. And then we both wound up in Jamaica. Now, she’s married with a husband and kids. Doing better than could be expected. I grew up knowing that story about her and went to Jamaica afterwards. And low and behold her dad had an insurance company directly beneath my esthetician shop in Torrance, CA in 2006. Crazy?! Lauren Dzikowski Integrity Family 2001 Reply Casey on December 8, 2017 at 3:47 am I knew Shae very well. Was in OP with her and in here family. Where is she?! Reply Emily on March 15, 2018 at 7:59 pm Omg what ever happened to Shea Jennings …and Krystal……something Reply lynndie horton on January 8, 2019 at 12:38 am I remember Shae if she was at tranquility bay and usually in trouble and laying on the ground on a towel. Reply Jamie Yachbes on February 21, 2019 at 9:22 pm Krystal Dickey, I think you mean. She was always in OP with me, Shea, and Tamara Green. Reply Bryan on February 6, 2013 at 5:25 am I was there for 6 months, my mother pulled me out, where as my father wanted me to say through graduation… I was lucky… Since then I’ve been a changed man. But only because fun and gets stolen at this place. For better or worst you grow up real quick here and when I went to University at a State School I was the oddest freshman you’d ever meet. Today as a working professional I can’t help but feel my childhood got robbed as it even affects me today as I do my everyday things. Reply Anonymous on February 9, 2019 at 12:41 pm I totally understand the childhood part. I have had a rough time being able to adjust with crowds. I never tried drugs before I was sent to one of these schools. For some reason when I was trying to fit in after I got back home it was like I had to drink and do drugs to fit in. Honestly really tears me up to think about it. Reply April Haynes on August 17, 2019 at 2:30 am I was there in 2005 and I was in the foundation family I was there for 14 months and all of those months I fought to stay alive overly drugged at 89 pounds was constantly restrained for reason that were unfair for crossing my leggswhen I was sitting. Reply Riva Menon on September 7, 2020 at 4:01 pm hai .. i was there in 2005 too.. by any chance does anyone know what happened to mrs brumsfield.? n ms bowmen? pls watsapp me at +60164185814 if you were there 2005 Reply Ashley Griffin on April 5, 2013 at 3:47 pm I didn’t get beat but I seen it 2005 and my mother figured out what kind of people they were and actually had to lie to them and me just to get me out and refused my plane ticket b4 the hurricane ivan came Reply Lana on January 30, 2014 at 3:39 pm Ashley I was there in the program with you. Do you remember me. Reply Katie Daughetee on June 16, 2014 at 3:31 pm I was there when both of y’all were there I remember y’all. Do either of you remember me? Reply Mario Santana on March 17, 2024 at 12:32 am Any one there from Honor Family? Reply Shane on July 12, 2018 at 10:51 pm My first day there is when the girl killed herself. I was there for one year. Horrible place Reply Lynndie Horton on January 8, 2019 at 12:36 am I left the day before the girl killed herself. She was in my family. So sad Reply James R McDaniel on January 28, 2020 at 12:02 am I was their in 2000 and 2001. Was on staff watch for over 13 months of that time. My right shoulder was almost torn off for 9 hours 1 night because I refused to hit the floor again because of the blisters on both sides of my face. I stood up, they surrounded me and took me down. I am 33 and have had shoulder issues all my life. I was 130 yards away when the girl swan dived to her death because of the cruelty of these people. No escape. No contact with parents. They held my mail for the entire 13 months that I was in staff watch. My mother never received it. They also held her mail from me. We wrote each other often yet neither of us ever received the correspondence that was held like a game by these evil sick people. I was made to lay down for 6 days without moving even to a hallway to sleep during the light outages. I pissed myself and shat myself the entire time because Mr Gregg and Mr Tony for no reason would allow me to leave staff watch during the outage. I can go on and on about tranquility Bay. I cant believe I found this page. Glad I did. Reply Chris pratt herman on May 11, 2020 at 12:26 am Hey man i was down there at that time. If you were in excellence family we might have gotten our passports together. Got my plane tic back to Boston 19 yrs ago last wk. Reply Riva Ramakrishnan Menon on September 7, 2020 at 4:02 pm Lana Ogburn is tht u? Reply Aubrie sutton on April 29, 2015 at 4:01 pm Omg Ashley I been looking for you do you have fb!!? I hope your ok!!! Reply Fiona Parchment on December 29, 2016 at 6:31 am My sister Margarita Simon use to work there. Reply Alexandra Ginnow on November 12, 2013 at 9:57 pm Mr. Kay stood by and watched a staff member snap my arm and break it  the day before i was kicked out of the program. This program was in no way helpful , you don’t take troubled teens from sometimes broken homes and abuse them. When  i had to share in these so called groups i was told i was a liar and that theirs no way my life was what it was in the good ole USA . The staff members hated us for being Americans with more material things then they will have in a life time. They would have a psychologist from another country come in and give all kinds of drugs for schizophrenia when i know i wasn’t schizophrenic. I was force fed meds by a nurse and staff members many times. I knew that i had to get out , the case workers would inform families that the letters written home were all lies that none of the things we were telling are parents were true. I never spoke to my parents through the 9 months i was there until the day i found out i was being kicked out.  I begged my “therapist” who was a southern California native to help me that the abuse was unbearable mentally and physically. Nothing… no help.  Jay Kays piece of crap father .. yes this is a business for profit.  You made a profit off of a abusing and punishing children in a inhumane fashion. Now not many children have gotten kicked out of Tranquility Bay so i must have done some pretty bad stuff… if you call talking and fixing your hair without permission really bad then yes i was horrible. Those were the reasons i was put in OP . Once there is when the anger and loneliness really set in. I rebelled against staff. Male staff too , i decided the only way  out would be to start a riot. Other girls were being molested and physically abused.. you would go to sleep listening to screams in the night and i couldn’t sit there and let them hurt me or anyone else anymore. Someone gave staff a heads up about what was going on and they had extra staff the night of the riot.I tried to jump over the wall but was pulled down by my shirt and was restrained in the rocks where the laundry was done in buckets. Mrs. Grahm a female staff member rubbed  my face in the rocks making it bleed . The staff members were abusive and had no training .. i could have died a few times from strangulation from the positions they would hold you in cutting off the airways. I still have nightmares. Luckily there are a lot of us who went through these programs so we all share a bond a truth that no one can really understand unless they have been there. I was put in the school and they made the classroom isolation for me and a couple of my sisters. When they realized i was the ring leader they separated us .  into different classrooms. Out of all the girls i was the only kicked out. I left tranquility bay looking like a dalmatian covered in bruises and with a dislocated arm. Because my parents didn’t know what happened in that place they sent me to another program but unrelated to wwasp. I am so happy that place is shutdown. No child should endure it. Reply Anonymous Attorney on March 27, 2014 at 11:43 pm I am an attorney here in New York litigating a case in which parents sent their then 16-year-old child to Tranquility Bay. Other family members and community leaders undertook efforts to convince the parents to withdraw that child from Tranquility Bay. Now, some years latter, the parents are suing these individuals — alleging that they were defamed as child abusers, etc. As a former Tranquility Bay student, will you be willing to help those who aided a child to get out of Tranquility Bay by coming to court and testify about the conditions and treatment of Tranquility Bay? Additionally, I am looking for people from New York. Do you live, or know anyone from New York, who attended Tranquillity Bay? Please respond to me. Thanks. Reply matt on April 5, 2014 at 7:14 am Former tranquility bay resident. I’ll testify for you. Matthew.aventura@gmail.com Reply Brian Brunson on May 2, 2014 at 10:55 pm I Live in California and I was in Tranquility Bay and Casa by the sea.. I am looking for a lawyer! Please contact me. Brian Brunson 209-304-9114 Reply Justin James on July 12, 2014 at 10:30 pm My name is Justin James and I was also at Casa By The Sea and Tranquility Bay. CBTS I was in Honor family from February of 2002 until September of the same year. Then was sent to Jamaica until the september of 2003. I’m now 28 years old, been married for 5 years and have a 3 year old son. To this day I am haunted by these two places. Please find me on Facebook if you were at these places during the time period I was. Reply Cecily Pate on November 1, 2015 at 9:28 pm Hey I was in both school around the same time. Reply Tim O on March 25, 2017 at 4:20 pm I was in the same family around the same time period. It’s definitely still hard to talk about isn’t it? Reply Katie on September 14, 2019 at 9:05 am Brian and Justin, did you know Andrew Craighead? He was my best friend since child hood. I hate for you to read in my comment but, he took his life June 23,2011. I would love to connect with other victims of casa by the sea and Tranquility bay. I’m just trying to understand why. If not I understand. Thanks for reading. Me email is Kaitlin.scott88@gmail.com Reply ZACHARY SOLT on June 14, 2014 at 9:52 pm 480-737-4775 CELL I JUST SAW THIS SIGHT.  I KNOW YOU SHOULD CALL ZACHARY SOLT HE CAN REALLY HELP YOU………..HE WAS THERE FOR A LONG TIME. SAW A LOT AND ENDURED A LOT.  SO SAD………SCREWED UP 4 LIFE Reply Nick on May 27, 2018 at 3:10 pm Alex olivari, another kid there with me who was the son of a raiders football linebacker can testify to some extreme isolation and starvation that happened. Thefts, drugs, you name it,  end it probably happened . Never wanted to kill myself since.  Still have a hatred for these people  That I know only hurts me, but there is no forgiveness.  Hammurabi‘s code,  karma, and God all have judgment days. <————(#still pissed,  should not have looked at this). Reply Matthew galeoto on December 21, 2022 at 9:50 pm Please excuse me if I have already posted. I have short term memory loss do to a traumatic brain injury that I got prior to my stay in hell. I was 16 when I was released from juvenile hall to go to a “special school in Paradise”…or so I though. My father actually took me to Jamaica. My situation was a little different since my father was an FBI agent. A big show was put on to make the place look like they had advertised. As soon as he left things changed. I was stripped naked and hosed down with ice cold water then covered in lye. With burning skin and swallen eyes I had to get dressed. The days of hell followed. I was starved and sprayed with pepper so many times I lost count. And the reason for this is I couldn’t remember things to my TBI. I remember waking up one night cover in sewage. Instead of being allowed to shower I was forced into a fowl river and expected to dig a stream out to the ocean. Which we did…the hell we would have faced would have been far worse. So we did it. This actually was one of the better days. It wasn’t many days later when the Jamaican military showed up and we were forced into dump trucks and moved to the other side of the island where the hell continued. Months later things changed. One day while outside I was called into the office. To my surprise my father and step father were holding Jay Kay against the wall by his neck. And these are two men nobody wanted to face. Like I said my father was cop and step father a big guy and black belt in judo. I was rushed out and packed my stuff. And quickly we left. I wasn’t able to speak for months do to my PTSD. But that was the incident that forced the government to step in and shut those bastards down. But my hell didn’t end I was unable to communicate or be around anyone. I burst into tears all the time and struggled being around people. Was afraid to sleep, eat or use the bathroom. It wasn’t long after this 911 happened I jumped into service and joined the Army because I wanted to serve and hoped I would experience the hell of war and it would help me put this all being me. The truth is…it never left me. I’ve seen my brothers and sister killed in service. I’ve seen men blow themselves up standing in the middle of large groups of people. But the memories of Jamaica are the ones that haunt me. I shut down all the time because I struggle to talk out of fear of punishment. It will never leave me. I would gladly jump out of a plane into a combat zone before experiencing that hell again. I hope other people have been able to get past there tragedy. It’s a struggle. Reply Chad Costa on July 14, 2024 at 8:55 am Horrible Place. Was there in 1998. Dignity Family. Chad Costa. Reply Melissa on June 19, 2014 at 9:52 pm I attended Tranquility Bay and I am a New York resident. I can be contacted at melissadunne83@yahoo.com Reply Cathie on June 25, 2014 at 10:28 pm I was in tranquility bay and I’ll testify too! I live in nj! Cathielopes@gmail.com Reply Jarrett ainsworth on July 7, 2014 at 4:39 am I’m Jarrett and I was there from 1998 to 1999 and I live in texas and was wanting to know if there was a law suit on this deal also..9033056997 if anyone knows please contact me Reply Jarrett ainsworth on July 8, 2014 at 12:36 am My name is Jarrett and I went to tranquility bay and went thru some bad things and would like to be a part of a law suit against wwasp if there is still one on going or going to..I can be reached at 1-903-305-6997 Reply Pete on March 28, 2016 at 3:18 pm I was there 1998-2000. I thought that if I ever told anyone about tranquility bay and what happened there no one would believe me. Now I see others have brought some of those things to light. That’s just “the tip of the iceberg”. I’d testify in court if I could. Fucking Jk and his father too. Reply Jimmy on September 6, 2016 at 10:55 pm I was there too from 2003 to 2005. It was a horrible experience that I still can’t forget.I will help Reply Fake it ’tillyou Make It on March 12, 2022 at 2:00 pm I was there for almost a year in 97. The things we had to say and do have haunted me. Reply Alexandra Ginnow on October 31, 2017 at 1:43 pm Hi , I am sure you saw my testimony listed above and I was just curious if there are any more court proceedings on this matter? Thanks Alex Reply Lit on March 10, 2024 at 9:12 am I’ve lived in Jamaica my entire life and I’ve NEVER heard of this until it was mentioned in a Netflix documentary. I’m shocked and disturbed that this happened for so long and there isn’t even anything mentioned in the local news. Reply Nick smith on May 27, 2018 at 3:00 pm I went there in 2001-2003 ish. About a year. Then I was sent to the place in Montana. I saw that mess as a kid and still have problems accepting what happened at those shit holes. Reply Kerri on June 20, 2019 at 5:04 pm My fiance, Ryan went there at that same time frame!.. I was with him also at the time that the jamaicans came and ripped him out of his bed in the middle of the night to ship him off.  I didnt see him for two years.  The stories he tells me are terrible, and it has changed him so much.. even this many years later.  I bet you knew him. Reply Angela on July 12, 2018 at 11:43 pm To the attorney from New York, Hi could you please send me your phone number to my email my boyfriend went there during this time and I would like to discuss it with you. Thank you. Reply Andrew on November 4, 2024 at 7:36 pm I testify I was there in 2003 Reply Michele Mangum on March 11, 2017 at 8:40 pm I really could use some help. Im sad to say I sent my daughter to this God awful program.At the time it came highly recommended the home office was in S.L.C.UT. The brochures, testimonials everything seemed on the up and up. After her admission I was told how she would write letters saying how awful it was as a form of manipulation. Little did I know the abuse was true! It’s been 17 years. After I learned the truth i apologized profusely I’m heart sick about this. The memories haunt her. I want my relationship with my daughter but, she cannot forgive me. I beat myself up knowing what went on there. Any advice would be great. Michele Mangum Mangum.m2010@gmail.com Reply April Haynes on January 4, 2018 at 7:35 am What year were you there? Reply Nicole on November 20, 2020 at 4:30 pm I was there when I was 16 now I’m 36, from CT Place still haunts me. Any lawsuits going on because I feel like my family deserves back all the money they wasted on this place ! Nicole.fournaris@gmail.com Reply Johnyfirepr on November 14, 2013 at 1:24 pm I Was in 2001 in jamaica Tranquility bay They abuses in all of us o saw the girl jump i the y Fuck my arm bad people i am a survivor Reply Travis Nicoletti on November 22, 2013 at 10:28 pm I was there when she jumped too and for the hurricane.. I spent 5 years in prison as an adult and it wasn’t as bad as this place Reply Jerome gladney on September 4, 2014 at 3:57 pm Jerome gladney here from the dignity family Hit me up 9402068322 Reply James Patrick Weber on October 17, 2014 at 10:35 pm There are so many more instances of abuse and neglect, and it’s difficult to write them all here. We were not fed correctly. We were consistently covered in insects, insect bites and there were several untreated outbreaks of scabies. Ligaments were torn in my knee and I was forced to drag it around every day. Spiders bit my face while sleeping. The walls were covered in blood splatters from the hoards of Mosquitos we constantly were killing. I was sexually harassed by Mr. Grant after shut-down hours many times. Ms. Davis was an unethical, vindictive and abusive woman that many children and their parents filed lawsuits and complaints about. She recently contacted my father to beg for money. It seems she has fallen off her high horse. The daily screams from Colby and several others we heard still haunt me. Many times those screams came from me. They would not stop twisting my limbs and pressing my face into the floor until I screamed. They dislocated and broke the arms of several children there while I was there. The conditions were in a constant state of filth, only to be attended to just before the weekend parents came to visit. Our letters were screened and never sent if they contained unsavory truths so that the facade could be upkept by the deceitful facilitators. I could keep on going and going… Reply Ali White on March 28, 2017 at 11:43 am My name is Ali White. When you say Colby, are you referring to my brother? Reply Jason carter on September 10, 2020 at 5:28 am Hey JAMES I hope all is well with you I was in the dignity family around the time you were there. Jason Carter Reply James Patrick Weber on October 17, 2014 at 10:13 pm I am James Patrick Weber and was there from October 2000 till December 2001. I was in the excellence group. I was there when the girl jumped. I was tortured physically and emotionally every day and was demoralized for being homosexual. I was sent home because my siblings died in an auto accident. I am almost 30 years old now and still have nightmares to this day and suffer from PTSD. I was forced to accept the specific teaching that who I am was ‘sick and wrong’ and was brainwashed using prisoner of war tactics and threats that I could change the core of my being. I spent a month lying on my face on a concrete floor initially until I would verbally admit I was sick. I was physically beaten periodically through this time and force fed. I was held down and water was poured over my nose and mouth until I complied. I wake from night terrors still believing I am trapped there. My parents sent me there because I was depressed over not being accepted for being different. I had never exhibited and violent or criminal behavior.  My parents were convinced it was the right place to put me because I would stay in bed, afraid to go to school.  When the girl jumped to her death I planned to do the same. Eventually the fear and programming had me convinced I deserved to be there and undertake the tortures I endured. I acquired ‘level 5’ (one level away from ‘graduation’- a feat most never come even close to acquiring) the day I was sent home to my brother’s and sister’s funeral. The shock of losing the only people in the world that truly loved me for who I am held a major role in unsettling the brainwashing. I am proud of who I am and persue happiness every day, yet I still am in counseling and am unable to achieve career and relationship goals my high IQ and deep empathy should allow . I am severely damaged from this heinous and criminal organization. Reply J.B. on November 8, 2018 at 5:22 am I hear you, I was there the same time, Progress and Unity Family. These things stick with us forever. Reply Ben Greenberg on December 27, 2018 at 1:41 am Hey J.B. This is Ben from Honor.  Get in touch with me man (786)863 5299 Reply Joshua ventura on October 3, 2020 at 4:51 am I was in excellence family with ms.smalls saw the girl swan dive in the courtyard Reply William Flubacher on April 10, 2022 at 6:12 am I think it was 2005 I turned 18 and got out of TB, spent over a year there and about 2 in AIR(,upst8 NY) before that, 15 to 18… both were terrible experiences and even after about 15 years of herion addiction plus a little meth and don’t forget the coke too o yea booze and Xanax and 3 prison priors madd county time,years on the streets of various US cities (mostly SF) i can’t/wouldn’t put my shit on anyone but me, my terrible choices , anger ND negative attitude but I can say that I have seen a lot of fucked up shit and been through some shit but not too much comes close enough to compare to the misery, maternal betrayal and the  very thorough abuse; mental ,physical, even sexual AIR and TB gave me the oporrunity to experience and witness. IS THERE OR IS THERE STILL A TORT CLAIM, CLASS ACTION, OR ANY KIND OF LAWSUIT TO FILE AGAINST THESE SICK  CHILD ABUSERS??? LET ME KNOW PLEASE @ Billyflu415@gmail.com Billy 2003-05 (abouts) Honor Family 1 Reply Michele Mangum on March 11, 2017 at 8:41 pm I’m so sorry you had to live through this. Reply Tim O on March 25, 2017 at 4:22 pm I remember when that girl jumped too!  That’s when the riots happened for two days. Anyone else remember that? Reply Emily on March 15, 2018 at 8:03 pm Are u talked ng in 2003/4 I don’t remember someone jumping (do remember a rumor) ..but I remember a riot! All the guys like broke all the windows and we went on freeze ..by some miracle my letter got out to my mom that they were barely feeding us and she came and got me ….she would let me not there forever Reply Ben Greenberg on December 27, 2018 at 1:45 am Tim, hit me up man.  This is your buddy Ben.  I’d love to talk to you dude (786)863-5299 Reply Kyle on December 13, 2013 at 1:19 am I was in dignity family. I knew Mike Pink. My heart feels sick as I believe Mike was psychologically ruined by the staff at tranquility Bay. I was there for 9 months . Back in 2000 … I hope that Mrs Elta, Mr. Mathews, & Mr. Melvin all know that they ruined lives. I am 30 years old now. I am still trying to forget. Reply charles lee valentine on December 16, 2013 at 2:35 am my name is charles lee valentine i was at tb for a total of 28 mo i spent 18 of those mo in op, i later went on to do operations for the military, i am currently in an inpatient program for severe trauma and i want to know what happened to pink i was in diginity family i was there when that girl jumped i can still here the wet crack of her body i used to be restained all the time i recall colby baird yelling at the top of his lungs every other day and the kids that were mollested i want to know more about what happend. i just discovered this website today…. Reply Matthew Marino on April 29, 2014 at 6:38 pm Hey Lee, I would ask if you remember me, but im sure you do. For anyone reading this, i attended TB in the dignity family with Lee. I cant blame TB for my choices, so let me start by taking ‘accountability’ for this: when i arrived to TB things were not as were described to parents. Many of the things listed above i experienced and witnessed. I was so desperate to leave, i was willing to do anything, which included attempting to secure legal charges which could get me back to american jail, which was much better than TB. I was placed in OP with Lee and many others one day. I had aquired a razor blade and one day while we were all ‘laying on our faces’ i got up, sat on lees back and started to cut his back up with the razorblade. 3 days later i passed our accountability seminar and was back in general population. Lee, i just want you to know im sorry bro, i had nothing personal against you and im deeply saddened by my actions and hope u can accept my apology. Youll be in my prayers brother, as well as everyone else abused at TB. God be with you guys, please contact me if u were in the dignity family. Take care Reply Josh Riddle on June 22, 2015 at 5:52 am I was in Dignity family. 98-99. Was at tb1 until they opened tb3. 8644513534. Reply Lance MacTavish on November 11, 2017 at 4:42 am I was at TB3 IN 98 I was in the progress family does anyone remember Mr Michael and the name of the lady who ran the facility at that time Reply Chad Costa on July 14, 2024 at 9:08 am Hey Lance. I believe it was Ms. Davis. I remember the Move to TB3 as well. And how we had to Clean up that Shit hole. Lol n smh. I hope all is well. Reply Lance MacTavish on November 11, 2017 at 6:06 am I was in the move to TB3 then put in the progress family I was there for 10 months and made it to level 6 because I was good at restraining kids Reply Chad Costa on July 14, 2024 at 9:06 am Hey Josh. Chad Costa. I was there in Dignity With you. I hope all is well. Email me mrcostac@aol.com . Reply Jarrett ainsworth on July 7, 2014 at 4:50 am This is Jarrett ainsworth and I was there from 1998 1999 and It was all kinds of messed up..if you know of any kinds of law suits or anything I can be reached at 9033056997. Reply Jerome on September 4, 2014 at 2:43 pm Hey lee this ” Jerome ” for dignity family wow we got in a lot of shit . Yet you were grate at football as they call it . Hey hit me up asap and any one that was there With us . Jerome gladney is my facbook page Reply James Patrick Weber on October 18, 2014 at 4:25 am Hey Jerome this is James ‘Patrick’ Weber, we spent a lot of time in OP together and you were always a good guy. I hope you’re doing well. Reply Daniel on April 1, 2024 at 4:03 pm Hey James this Is Daniel, we were in excellence. My mom pulled me in November 2001, I think you were level 3 at that time. I spent a lot of time time on level one, study hall, and op. We were roomates for a while at the end of the hall on the left until I went to op. Hope your doing well. Reply sean on June 25, 2014 at 10:42 pm hey kyle my name isw sean andf i was down there with you and my heart goes out to you and i wish you a safe and comforting life or whats become of it Reply shaquan daley on January 15, 2014 at 12:27 pm i was in tTB  in 2003 2004 in success family i was very popular during my year i got kicked out i was one that got the riot started on the first floor with jacob fulton .. me and couple my friends ran away tried to make it to my aunt house in jamaica.. lol but we got caught on the way … looking for ryan mann jon diaz anybody from success  hated that place but since i was half jamaica i got aloof pass sometimes i still got restrained was in isolation for  5 months lol  hted that place just love passing notes to keep me sane ….. we won sunday that year too lol kicked couple people ass in there cause idk man couple people was crazy but all and all miss the friends I’ve made wish i could’ve visit the compound  glad that shit is closed  it was hell just tried to survive and i DID Reply nathan fried on March 4, 2014 at 7:44 am I remember you I saw you punch bryan from triumph in the face on the rec field lol good times do you remember Patrick mcfield Reply Nick Schneider on May 10, 2015 at 12:37 am Hey Nate, I remember you. You were in my family. Do you still practice Judaism? I remember Patrick. He almost got convicted of murder in the caymans. I just got done serving in the Army for 5 years. Deployed on the front lines of Iraq as a machine gunner. Now Im in a veterans program for my mental health but it was the best thing I did so far. Hit me up 920 246 7053. noetic257@gmail.com . Reply stephen balcar on January 20, 2016 at 4:26 pm hey nick wernt you in renniasanse family? Reply shaquan on December 2, 2015 at 2:16 pm Lol yea time flies lol we need a movie about this man Reply Laura rosten on July 4, 2019 at 7:50 am I was there 2002 in Mexico’s casa by the sea and got sent to Jamaica 2003-2005 i was always in op i was there for the riot. That place traumatized alot of people… kids… but we survived… But if anyone was there when i was contact me please…. 971-295-1022 and if you still need help with testimonies let me know…  i rememberwbe when that girl jumped too… so messed up. Reply Kristian Tudor on June 20, 2022 at 7:40 pm Valerie jumped in August of 2001 and if you got there in 03 you couldn’t have possibly remembered it. Do you mean you remember hearing about it? Integrity family Jan 2001-June 2002 Reply Kevin Kroselj on March 8, 2024 at 5:22 am I was there tranquility bay from 2000-2001 Kevin Kroselj from New York I was in the success family  .. place was fucked up Reply CZ on December 2, 2024 at 5:53 am I am related to Ryan Mann and he isn’t doing well because of this program. Would be nice to have someone talk to him who knew him. Reply Robert Gardner on February 4, 2014 at 10:03 pm The best day was the day i got to leave that place. That place was so disturbing. I was there in Jamaica when they had a girl jump off the top of the building. They did not want to take responsiblility for it. They claimed that since she was not there for 24 hours they were not responsible for her. They claimed she was still on drugs. I left that place when I was 18 years old. I just turned 30 on January 16 2014. I still have bad dreams and feelings about that place. I am so glad that place is closed and no one else has to be tourted and hurt. Reply Anonymous Attorney on March 27, 2014 at 11:47 pm I am an attorney here in New York litigating a case in which parents sent their then 16-year-old child to Tranquility Bay. Other family members and community leaders undertook efforts to convince the parents to withdraw that child from Tranquility Bay. Now, some years latter, the parents are suing these individuals — alleging that they were defamed as child abusers, etc. As a former Tranquility Bay student, will you be willing to help those who aided a child to get out of Tranquility Bay by coming to court and testify about the conditions and treatment of Tranquility Bay? Additionally, I am looking for people from New York. Do you live, or know anyone from New York, who attended Tranquillity Bay? Sincerely, Reply Joey Smallegan on May 13, 2014 at 5:26 am I have some legal questions about the school! I was there for a year around 2002! I still have nightmares about the school to this day.. If anyone has sued TB please call me! God bless the people that went through that shit hole.. 239-273-0402 Reply Ian Edmanda on May 23, 2014 at 4:39 am I spent 9 months In that hell and won’t even go into detail just how bad that place was. I spent the vast majority of my time being restrained, laying flat on face for days on end and writing essays up to 25,000 words for being a liar in group sessions. Multiple occasions I witnessed staff abuse kids and one even had his teeth knocked out. I won’t even mention the girl who jumped off the building and killed herself. The place was torture on every level. If need any questions answered email me at ian0810@live.com Reply Gregory blinkoff on October 23, 2014 at 12:46 am Hey I was there I was twelve at the time in 2001 if u have any questions I can help feel free to call or text 320 4917488 I live in mn but at the time I was in westchester ny I’m greg Reply stephen balcar on January 20, 2016 at 4:34 pm spent 2 years of unending hell there i have a couple legal questions about that place but i dont know if its too late to do anything though if you can hit me up my number is 4433861560 would be much appreciated Reply Jimmy on September 6, 2016 at 11:05 pm My name is jimmy and I was there fro. 2003 to 2005. I was abuse in many ways while I was there and seen and heard things that I will never forget. I didn’t have any toe nails for over 4 months due to the restraints. If I can help in any way please let me know. Bkcheeno@sbcglobal.net Reply Kevin Kroselj on March 8, 2024 at 5:50 am Kevin Kroselj I was at tranquility bay 2001 in success family . If anyone remembers me or want to talk 917-975-9758 Reply Save ferris on October 1, 2014 at 2:50 pm Do u remember someone named Sean? He was there also when that happened. Please contact saveferris3154@gmail.com Reply R Paige on February 24, 2014 at 7:20 am I started off in Dignity in 2000. I remember Mr Matthews and Mr Melvin. They did ruin lives. I too remember Colby Baird screaming almost every day and night. I think the supervisor me Bailey actually got off on restraining poor Colby. Then he moved on to Colin Johnston. I got switched to the success family after about 6 months. They gave us mr. Myrie and mr Tony and mrs Clarke. Whatever happened to christian devaux, Ian collazo? I hated this little punk named Oliver bucolo.  I ran away one night while on level 3 But came back the same night because I realized I didn’t have food or water. I was there when the girl jumped. I was there when they fed us pig tail soup. I still have nightmares of that horrible place. They didn’t feed us right. Unsanitary unhealthy conditions. Anyone remember the Russian kid Anton? What a trip! I remember I always wanted to do the nurse. 🙂 I hope to see jay Kay one day. I am going to search for him so I can restrain him and make him eat 2 pieces of bread per day. Anyone out there hit me up (nine-five-one)-383-9797 I’m 27 now and got sent there when I was 13 Reply Jason Chavez on October 5, 2014 at 3:13 pm @ R Paige… I Don’t know if you remember me but as soon as you see the name you will. Well I happen to have ian,christian,chris poole, oliver, maurice wimbush, and many more that was in the Success Family from i think i was there 2000 to the end of 2001 because I remember we were triping out on the 9/11 because none of the staff would tell us what was going on! I remember that poor girl that jumped from that building as we were standing in line to get ready to go to lunch I think it was, and when we did get inside to go eat everybody just looked at each other in shock. No body in my family did not even touch the food. R.I.P. to that poor girl and her family. I remember when you told me you were going to try to take off, but i honestly didn’t think you were that seriously. well Robbie Paige I hope that you get to see this message soon and pray that your doing good. Hit me up in time im in Killa Cali (213)271-7306. Hope to hear from you soon.   P.S. Oliver Bucolo is a Fire Fighter now so be careful lmao Reply nathan fried on March 4, 2014 at 7:50 am looking for some people im Nathan fried from triumph family I was 18 when I arrived in 2003 and 21 when I left in 06, so im looking for )sorry if I miss spell some names or don’t remember the whole name) garry refer, Patrick mc field, john lyons, spencer aka bird man, rob aka pirate rob, thanks Reply Nick Schneider on May 10, 2015 at 8:45 pm Hey Nate, you stabbed me with a pen and freaked out. Hit me up noetic257@gmail.com Reply Luis Felipe Leal on March 29, 2014 at 11:25 am I was there in 98 for 6 months , i was in honor family .I can relate to what everyone is saying. I was 16 years old at the time and i am turning 32 in two days , i will  never forget the birthday i spent in TB , the worse day of  my life. I am from Brazil but i was living in Miami at the time , i came back to Brazil right after i left TB so in never spoke to anyone again. I was lucky because my parents dont speak english so i could talk on the phone (after 3 months when i reached levei 3) on portuguese and the staff did not understand what i was saying. It is very good to know that the place got shut down. If anyone remembers me my email is luis.leal@uol.com.br . Reply Joel Taylor on October 12, 2017 at 8:00 am Yea I remember you Luis, how have you been? Reply sean on June 25, 2014 at 10:46 pm i am a surviver of the hell hole i was there for as yr and nine months and cause of the treatment that i got there i was just released from prison after doing 10 yrs of a 25 yr sentence so i know everyones pain and i am here to say tha i am here for you all Reply Preston on September 10, 2015 at 12:57 pm U from Texas Sean ? Reply Jonathan on October 1, 2019 at 11:47 pm If that’s the same Sean aka shadow from Tx and Preston from Pasadena I hope yal are doing better off nowadays. If yal remember me I was in Dignity and yal helped me transition into dealing with everything there along with Rich and Kevin. I appreciate yal to this day. Reply Jessica on July 18, 2014 at 4:30 am My brother Noah was there around 2002. He passed away 6 years ago. He overdosed. He never talked about anything that happened there. I was just hoping to maybe find someone who knew him. Would love to hear about what his experience may have been like there. Would also love to hear any stories about him anyone may have. Reply Dean on April 25, 2019 at 5:49 pm What family was he in ? Reply Dean on April 25, 2019 at 5:50 pm if he was in Renaissance i know him Reply Jessica on July 18, 2014 at 4:33 am My brother Noah was there around 2001-2002. He passed away 6 years ago yesterday. He overdosed. He never would speak of anything that happened while he was there. I would love to hear from anyone who knew him. Would love to know what his experience there may have been like. I also always love to hear stories about him from those who knew him. Reply Nick Schneider on May 10, 2015 at 12:46 am I remember Noah. He was a really good person. Sorry for your loss. It was like a prison camp that POW’s would be at. Maybe a little better but a lot of abuse by staff and gangs. The first day I went their I begged the staff to let me leave. I remember reality set in after a month. I just realized that I was stuck their. At night, there would be screaming or crying from people in their. Staff hit this one guy with a radio right in front of me. Cracked his head and he had to get stitches. Somebody used weights in a pillow case to beat somebody up while they were reading their bible. It was a shit hole. Living conditions. Pretty much everything sucked about that place except you could get high school credits Reply Andrew Spaeth on May 31, 2017 at 4:43 pm Jess, your brother was Noah Silva? Sorry for your loss. I knew him well. Reply Patrick LeClair on August 22, 2014 at 9:40 am It was a time of fear… A true pit of your stomach can this be real fear and uncertainty. At first it was more of a questioning of reality. One of those few moments in your life when you truly question your fundamental existence and experience on this planet. When you truly and repeatedly ask yourself…. “Is this real? Am I real? Can what I am seeing, feeling, hearing and smelling be true? Certainly not!” And than almost as fast as those emotions race through your mind the warm almost incapacitating metaphysical feeling of this new reality begin to set in. It can only be explained as something akin to the feeling a person might perhaps get when they find out that the most important person in the world to them has passed away. Suddenly you are not asking if it is real but HOW!?? How can this be real!?You die a little bit on the inside… Not so much because you have reserved to your fate’s but more because it is the natural human response to try to mentally negotiate with themselves out of an experience or emotion that they cannot possibly handle in the fullest and truest form all at once.Suddenly inside your mind you are clawing at the walls of your reality and attempting to find a psychological escape from this proverbial compactor that is rapidly closing in to crush your will and everything that provides your mind naturally with the ability to cope, adjust and navigate the many things in the real world for which you must deal with an methodically solidify yourself against on a daily basis. As it sets in… Truly sets in that there is no way out… It is only by sheer will to physical and mental survival that you now suddenly find yourself on a mental,physical and emotional form of “life support” which renders you a crude form of a vegetable to existence outside of the walls of your new reality.It is than that the night falls…. As the sky grows an ominous shade of orange the sense of being in hell and a literally darker reality of your existence begins to set in. Slowly but fluidly… Almost as if this sky has done it tens of billions of times before the dark shades of orange fade to purples and dark blue… And than, just as quick as your reality changed that day it is dark… There is nothing but the sound of the winds as they brush against the palm trees beating them against the metal awning that is now taunting your already terrified mind. You look to the other 3 souls which you now share your existence with only to find that they themselves through pure virtue of repetition are fast asleep seemingly un aware of the tempest of emotions,fear and torment now rapping your mind. After all, they themselves are here….. Aren’t they? Or are they part of a reality that is not a reality at all? You lay there for a while, watching the stars through the window vents and waving palm fronds… You look at a particularly bright gleaming star wondering how there is a world beyond the walls of your new reality. Are the peoples of your previous life still real?Are they sleeping well? Or are they sitting up looking to the sky for some form of confidence in a new reality as well?Than after 10 minutes of what seemed like a eternity of thought,you hear the first screams and shrieks… Sounds you have only heard previously in movies that involve spies, espionage and torture..Except, there is no television for great distances… It echo’s through the halls.You become tense.. You try to ignore it but at the same time how can you? How can you ignore the whale of humanity occurring not more than 50 feet from you?Another soul experiences your pain perhaps… It leaves a weird sense of comfort resting with you… And morbidly you are now curious… You cannot help but wonder… What did this person do? What is it that caused this for them?As the screams get louder, the sobs, the pleading for mercy and the struggles intensify down the hall way your interest begins to wain as exhaustion in the truest form begins to set in and you weep a little. In secret facing the wooden wall which is your new night time companion… Finally, the grips of reality begin to fade to darkness and you are asleep. If only for a moment, your reality will let you rest……. To be continued…… Patrick LeClair, TB March 2000 – December 2002, Honor/Renaissance Family 817.987.3514 Reply Jamie Yachbes on December 29, 2016 at 5:37 am Shit… I remember you, actually. You staffed my first couple of seminars. It’s so strange to look back and hear how the people who appeared so integrated were just as aware of how fucked it all was. Reply Chris fillman on December 26, 2019 at 3:37 am Man your writing hit me so strong I cried.i had thise same feelings and experiences with the palm trees and stars.you are very very talented brother keep it up. Reply Crystal Alford on July 31, 2024 at 8:00 pm Hey my name is Crystal Alford Alive Family TB 97-98 I was wondering if anyone has there diploma still? If so please contact me 7608477685 I also have info on a legal team to contact if anyone is looking Reply Michelle Morales on September 23, 2014 at 9:14 pm Hi, My name is Michelle, and I was placed in Tranquility Bay 1999-2000. I was in the Integrity family. I was sent to this program by my sister and her now ex husband. I was the only kid there at that time that was sent by her sister instead of parents. I can never forgive my sister for sending me away, I still have nightmares about it that I never talk about. I have a binder of all letters, drawings, cards, and etc that I ever wrote while I was in that program. My sister kept everything and gave it to me when I got out of there. I told her how I was mistreated in there, but no one believed me. I really want to sue, but im afraid my chance might be over already. Im 32 now, and I have some survivors on my Facebook, and they are the only ones knowing what we have went through that I could speak with and understand me. I live in California, and I want to know if there is anyone that knows of a great lawyer or lawsuit I could be added to. Life just hasn’t been the same since TB. I actually learned more about drugs while in TB, and did them for the first time after the program. A part of me is really lost, and depressed. Reply Michelle Morales on September 23, 2014 at 9:15 pm Please email me if you guys know anything about a lawyer or an active lawsuit. Boriquamama177@yahoo.com Reply Keith on September 25, 2014 at 6:45 am or google tranquinity bay lawsuit Reply Keith on October 5, 2014 at 8:05 am The first post was meant to include a website but its all on google. Reply Gracie on March 7, 2024 at 2:48 am My name is Gracie I was in tranquility bay from 2015-2016 Reply Jack on October 5, 2014 at 8:40 am Bill, thank you for all of your inspiration. Started a BOYCOTT WWASP Tranquility Bay fb page. Could you help spread awareness in hopes of a successful global boycott? If  you could let me know any way I COULD HELP YOUR CAUSE PLEASE EMAIL ME AT CRASSRELAX@YAHOO.COM . Reply nick.m on October 17, 2014 at 5:03 am Nick m. Success 2004 Reply shawn williams on November 27, 2014 at 2:02 am My name is Shawn Williams I was in honour family in tb from 2002-2005, I’ve been through and witnessed all the above and even tho I try not to think about  that hell whole It still comes I still have flash backs and dreams about that place. I believe that place has done way more damage than good to everybody there Reply Jimmy on September 6, 2016 at 11:08 pm Hey nick I was in unity family while you where there Reply Taya on October 30, 2014 at 2:47 pm A friend of mine is dating a young man by the name of Jerome that attended Tranquility Bay. Jerome is trying to get a copy of his transcript so that he can enroll in college, but, of course, is having difficulty because the facility was closed several years ago. Can anyone tell me how or if it’s possible to get a copy of a transcript? I had never heard of this place before this morning, but after googling it I am horrified by what I’ve been reading, particularly on this website. My heart goes out to everyone that experienced this horror. Reply Jerrod Fine on January 31, 2015 at 11:16 pm Unfortunately WWASP closed due to exposure.. they may be operating under different names. I know people who have been in the facility since its closure.. I’m also leading a group back.. If I can be of any help you may find me on Facebook. Reply Melissa on November 4, 2014 at 6:28 pm Hello. I am from Jamaica…from Saint Elizabeth. I came to the states very young and went back for high school and boarded in Mandeville at Victor Dixon High (formerly West Indies College High School) with plenty other foreign children, many who were sent there for disciplinary reasons but never did we come across any sort of abuse. The biggest punishment might have been boredom, depending on the family you boarded with. I’ve never heard of this school before and Im asking family and they haven’t either. How did your parents find this torture camp that so many locals don’t even know of?? I am so sorry for all you guys have endured and I hope you find justice. I’ve never been to this place and I dont think I’ll be able to sleep tonight thinking this was happening in my country 🙁 Reply Jamie Yachbes on December 29, 2016 at 5:41 am Probably because it was primarily marketed to Americans. While I was there, it was almost entirely US citizens, although I do remember a girl from Trinidad. Reply Jamie Yachbes on December 29, 2016 at 5:48 am Is it just me, or do any of you not really discuss this with people because it’s so far outside traditional experience that nobody would really get it? My closest friend spent years in prison, and he’s one of the few I’ve really told much to…and he tells me that it’s so much worse than anything he went through in the US prison system. Challenger family, ’01-04 or ’05. Hard to keep track. Went from TB to Spring Creek in Montana. Aged out… Proud to say, I could not be made a convert or a pretender. I understand why so many did, though. Reply Michael Miller on February 2, 2015 at 7:31 pm I was here in 1997 – 1998 Love family # 215. This place fucked me up permanently & still have nightmares & ptsd from the things I’ve personally experienced & witnessed. Is there any course of legal action I can take against the staff (fathers & mother / supposed therapist counselor) & the owners? mark klepper from Utah is in front of me & nick? in back of me.. Reply TJ on July 27, 2016 at 7:36 pm Love family…colon m, Eric m? I remember y’all mark take care. Reply Lance MacTavish on November 11, 2017 at 6:18 am I was in there with u bro I remember big Nick from Atlanta Reply TJ on February 18, 2018 at 10:05 pm Lance! Excellence family baby! Reply Theodore helm on March 19, 2024 at 5:22 pm Mark Klepper was behind me Reply Nathan Brooks on October 9, 2015 at 7:01 am I was there from April 01 to July 02 progress family and honor. I’ve never seen anyone from there in America.  It would be nice to talk to one of you guys. Reply Alex on November 3, 2015 at 5:53 am I saw your post. I was in there in 2000. My parents sent me to that place. I would really like someone to talk to about what happened to me and why I was sent there in the first place. It was one of the most traumatic things Ive ever experienced… Im almost 30 years old and im still not right from that experience. These people are child abusers who got paid to break down children. Is there any worse kind of coward than a parent who signs theyre childs life away to them? How ironic is that… Parents who have the backbone of a jellyfish sending kids off for “tough love.” If you cant raise your child in the first place accept that you have created the problem and work to fix it. No amount of money you pay a program will make your child the way you want them to be. You cant pay back in dollars what you lack in character, love and support for your kid Reply shaquan on December 2, 2015 at 2:20 pm Shout out to my success family 2002 2003 man to e fly hate that place but made a family there love is love RIP TO EVERYBODY WHO DIDNT MAKE. IT THST WE KNEW 2015. Reply Justin norteman on December 26, 2015 at 6:52 am What shit hole ruined my life.. In no way shape or form perpared me for society. I was in dignity in 2007 when we had the riot. Was there for 5 months no passport no contact with parents all for running away from a wwasp program in the states. They called my parents when I ran from csa and said your sons not fit for the school and requires further disciplinary actions. I graduated high school from tranquility bay 4 months before my 18th birthday parents never found that out and I had to stay till my 18th birthday and was released 2 days after. Any one from my family feel free to email would like to see how others are doing as I am not doing so well. Best wishes to all wwasp survivors. Reply preston on February 16, 2016 at 8:24 pm I was in honor family 2007 when the riots happened they put me in OP for 90 days before they started shipping kids to Mississippi Reply Justin Norteman on January 17, 2018 at 11:20 am Ha i was at that place to back in 2002 when it was bethel boys academy and had no affiliation with wwasp that place was no better Reply Robert \"MAX\" Golden on December 27, 2015 at 2:20 am Wow I can’t believe this support group exists. Please I don’t know how to get involved but I was in Tranquility Bay 12 years ago and still suffering from my stay there. Please email me onemadlove12@outlook.com … Or call me 561-800-8869. Please I need to get involved Reply Sean Adams on December 28, 2015 at 6:34 am I just seen this about time this bitch close down… I was there for two years & a half my name was well known I been thru to must hell shot worst then jail I had to fake it till I make it…… But one thing I will say if I catch any of them it’s a done deal y’all know me Sean Adams… I was apart of the riot 3 in command I didn’t know much but my mind so fuck up because of this I’m so happy because this bitch close about time for me to call lawyer   From 2002 to 2004 y’all know me… Fuck this place felt we wasn’t in America we should take everything but one thing is we all made it out there alive to the people they die and they cover it up rip moment of silent when I finally got to the upper level and could walk around on my own I seen more things I pray to god I made it out alive I did I cry to my parent I was only 12yrs old when I went in my parent ain’t believe the thing I went thru the pain the hurt stuff a kid should never deal wth hurt to this day I got so much hate in me… So much hate……. But God don’t like ugly Reply TJ Konrady on January 8, 2016 at 4:39 am I saw all three TBay camps. Each one as evil as the next. Progress family first, then I finished in Excellence. Hospitalized twice. Restrained so many fuckin times I stopped counting when they squeezed the puke out of me. Left on level one. 18 months. 98-99. Kids going toe to toe with grown men. I met brave souls there. A lot of chumps. Too many pussies. Sure your first month sucked. Some just didn’t get it. They were brainwashed. Maybe I should have bought into it, right? However, I was definitely not working the ‘program’. RIP Evan Ebel Excellence family member. Another life cut short from the scars of this fuckery. People profited off us. And our lives are riddled with PTSD and anxiety. Nightmares? Huh, how bout a dream…see you in hell Jay Kay and Randall Hinton. Reply Lance MacTavish on November 11, 2017 at 6:22 am RIP LIL EVAN he was only 12 years old when he was there Reply TJ on February 18, 2018 at 10:10 pm Lance I wish you the best brother. Reply Francis Tran on April 24, 2018 at 9:25 pm I remember you konrady…you were on your face all stay.you were not cooperating…fuck em…. Reply TJ on July 12, 2018 at 3:17 pm Francis Tran. Damn i remember you were one hell of a volleyball player! You always kept it real with everybody! Wish you the very best brother. Reply Andrew on November 5, 2024 at 4:39 pm Andrew Tisdale TB 2003-2004 Only good thing about that place was the riot we had!! Shout out to those who did their thing!! Patrick mcfield, mikhail Philips, Edwin belizaire just to name a few Reply stephen on January 19, 2016 at 4:12 pm lost 2 years of my life there hell spent my first 6 months there in OP, the staff sure loved ta gang up on anyone that was even the slightest outa line and if any of the staff had a problem with you they had no trouble making every day a living hell. but i will say there were a couple of the staff that did have a heart and was there to actually try ta help but they were rare in the staffing. they said they were gonna stop me from fighting one way of another, so what did they do called code red and had about 8 staff member come pile on me hold me down and take my right hand putting it against the corner where the wall meets the floor and just just kept hitting it with one of those old motorola walkies they had till my hand actually broke in half, all the while taking my other arm and my legs and feet grinding them against the floor hell there where times they would grind your arms legs and feet against the concrete outside. this was something that was done quite on a regular basis there, not just to me but to many many others that were kept there aswell. i know one thing though if i ever see certain members of that staff from there they gonna be done Reply stephen on January 19, 2016 at 7:51 pm is there anyone else here from the renaissance family? Reply sean knauer on February 11, 2016 at 11:04 pm Im trying to find out how to get my transcripts for graduating high school at tranquility bay. Im trying to get a job that requires it. If anyone can help thanks… Reply Mike Risch on March 7, 2016 at 1:56 am I was in honour family from 1999-2001. Happy to see these people have been exposed. The worst 14 months of my life. Spent a lot of time in the sweat box writing essays. Anyone else out there? Reply Pete on March 29, 2016 at 11:16 pm I remember the “essay writing’. Its crazy finding this site after so long. Remember me? Pete Wise… Was there from 98 to 2000. Reply Tj on July 14, 2016 at 3:18 am whats up Pete? Tj konrady from excellence 97-99. This place really screwed me bro. Did not see the outcome coming at all. Two trips too prison later…take care man Reply Lindsay on November 19, 2019 at 11:36 am Anyone know scott burke and his brother? He is mybchilds father and he talks ab itvalot but i am starting to understand his behavior. Reply TJ on July 27, 2016 at 3:39 pm Yo Pete! Excellence family…where’s everybody at? Reply Joe on November 9, 2020 at 1:39 am If there is  a hell🤬jay k and his fat daddy have a reservation.amen can’t believe they are walking around free but that seems to be the ongoing trend. Reply Joe on November 9, 2020 at 1:42 am Manson family! Stay strong and sane survivors . Reply Tim O on March 25, 2017 at 4:51 pm Hey there. I was in The honor family with Mr. Melvin and the other one. Spent two years there. I believe 99-01 then went back to Spring Creek where I had come from originally. Spent nearly four years in the program. Had no idea there was this group until today. Reply Jaclyn on June 14, 2016 at 2:22 pm I was at tranquility bay for 18 months. It all feels like a horrible nightmare now. I still don’t believe what I endured and saw really happened to me. I suffer from ptsd and depression because of it. My relationship with my parents suffers because of it. I finally got to come back to America after reaching level 5 and I cried and begged until my parents would take me home. The saddest thing my mother cried when I asked permission to open the refrigerator. I was a robot. That place was pure hell! Reply Angela Jones on July 30, 2016 at 12:47 am I went here in 2005 for 3 months until i turned 18 in those 3 months i went through so much i can only Imagine what people went through that were there for many months or even years I’m looking for a girl by the name is Christine i think her name was Christine gomez i believe her name was Ms i have no idea what family we were in i think my mind doesn’t want to remember that damn place.. I remember when i wouldn’t move fast enough coming down the stairs from school it was pouring rain and the staff lady told me to hurry up and pushed me and i fell down all those stairs flat on my back and they wouldn’t take me to the doctor for like a whole week.. Them jerks said to put some Bengay on it and it would be fine.. That food was so bad i wouldn’t wish this place on my worst enemy’s. Reply Tyler Morton on September 3, 2016 at 4:29 pm I was in tb in 2005-2006 spent most of my time in op never made it past level 1 I remember being in op and there was this homie that used to cover himself in his own shit! Does anyone remember him? I remember dumplings for breakfast on Sunday’s and once in a while we would get those beef patties. None the less I got out a lot worse then I went in. Ended up spending lots of time in juvenile hall jail and prison. Tranquility bay pretty much prepared me for a long hard life at the school of hardknocks. Thanks tranquility bay! Reply Jonathan on October 2, 2019 at 12:10 am I remember him, a young Hispanic kid that didn’t even speak too much english right. I was with Dignity from Dec 2005 until I turned 18 Sept 2006 and then pushed out a few weeks after my 18th birthday. Reply stephanie barton on November 29, 2016 at 12:04 am I’m from the Foundation family. Was moved from Integrity family. I was at TB from 2003-2005 Reply April Haynes on January 4, 2018 at 1:05 pm I was in that family 2005 to 2006 Reply Deanna Kreusel on August 22, 2018 at 7:32 pm I was in foundation I believe, from 03 to 04. I have been trying to reconnect with people from these “programs”. The place was hell but the girls were the closest people i had to family. Reply Crash on March 5, 2024 at 11:28 pm I was in Knowledge in 97 to 98. How can I find anyone else who was there at this time? Reply Lisa Drake on June 5, 2020 at 1:48 pm I was also in foundation family. I hope all of you girls are doing well. I will never forget your faces. Reply Ari Weisen on January 6, 2017 at 6:07 pm HONOUR FAMILY ARI LOOKING FOR MATT BRAZIL< CHRIS MARTINI< CHRIS PHILLMAN, CURTIS, MR. RICHARDS, MR SERF, POWELL, MR SPENCE, MR. MELLO, That kid who got restrained all the Time STEVE FORSAGEE, COLBY, etc Email me. Dignity, and Honour, Alejandrog1985@live.com Mrs Myers its me ARI 2000, 2001, 1999 Reply Tim O on March 25, 2017 at 4:53 pm I remember you Ari!  We were in the same family for all those years. How’ve you been? Reply Ali White on March 28, 2017 at 11:46 am Colby is my brother. If you’re referring to Colby White Reply Nick Sanchez on December 10, 2017 at 8:20 am Yo man was there I’m nick Sanchez what a mess can’t believe it did not shut down till 2009 wow hope all is good Reply Michael keenan on December 29, 2017 at 5:39 pm I remember you. It’s been so long I need to figure out all the dates and whatnot. I remember Colby would get restrained every night and we couldn’t sleep because of all the screaming Reply MATT on January 12, 2018 at 5:34 pm Matt Brazil here.  can find me on FB under that name.  Pic is me with a long beard Reply Erika F on August 7, 2017 at 10:27 pm Integrity family 2002 – 2004…There aren’t many from the girls side on here, but I’d love to connect with anyone wanting to “share”. No feedback, I promise 🙂 erikafixler@hotmail.com Reply Alex Lee on August 8, 2017 at 8:07 am Hey, Alex Lee here from success family 2002, 2003 ?? I see some of you fam up there in the comments, shaquan… nick…who else?! Hit me up at: alexandersklee@gmail.com Reply Andrew Tisdale on November 4, 2024 at 7:57 pm I was there 2003 for the riot… got it cracking with the homie Edwin Belezaire… Reply Trevor stephens on September 6, 2017 at 1:31 am Trevor stephens Ya looking back at it shit crazy you gotta play the game to get out. Talk about being instatutionalized I didn’t fit in anywhere after this . So scared of the world Reply Joel Taylor on October 12, 2017 at 7:51 am Trevor Stephens I remember you. Matt Brazil too. Actuay several of you. Sept 98-Nov 99 Reply Maxime k on October 17, 2017 at 10:29 am Hi I am from the uk I was one of the only British people to be in tranquility bay. I am in London and seeking help to try and deal with what happened there. People in the uk don’t understand places like this and I can’t seem to face and deal with it all. I was there for 18 months and everything that happened still effects me everyday can anyone recommend a online support group or something? Any help would be great. Thank you Reply Maxime k on October 17, 2017 at 10:36 am Also I would like some advise on taking out a lawsuit against them, is that possible to do that from the uk or even this far on in the future? Reply Bill Boyles on October 22, 2017 at 3:04 am we have an eponymous facebook group: https://www.facebook.com/groups/wwaspsurvivors/ Reply April Haynes on January 4, 2018 at 1:06 pm I remember u lol Reply Nick Sanchez on December 10, 2017 at 8:16 am Hi I’m nick I’m 31 now dam that place tranquility bay I went there for a year when I was 12 to 13 yes it messes you up bad Reply Nick Sanchez on December 10, 2017 at 8:24 am To all in these programs still and to all that been to one like my self tranquility bay was the one I went to I feel for ya I’m out here if anyone wanna talk about it Reply Bill Boyles on December 10, 2017 at 10:03 pm Nick Sanchez, we have a Facebook group: WWASP Survivors on Facebook! Reply April Haynes on January 4, 2018 at 1:16 pm Hi my name is April Haynes i was in the foundation family in 2005 and 2006 i never worked the program and i was involved in many riots there and i still suffer from this i was there threw the hurricane and the riot leading to many being restrained in the court yard in the rock and so so much more i had my hands smashed in windows ect looking for anyone who remembers me or any support Reply Bill Boyles on January 5, 2018 at 5:57 am April please feel free to join our facebook group: https://www.facebook.com/groups/wwaspsurvivors/ Reply Emily on March 15, 2018 at 8:14 pm Are u talked ng in 2003/4 I don’t remember someone jumping (do remember a rumor) ..but I remember a riot! All the guys like broke all the windows and we went on freeze ..by some miracle my letter got out to my mom that they were barely feeding us and she came and got me ….she would let me not there forever Reply Yuki on May 27, 2018 at 3:50 pm I know someone that was in the program for about 7 years. His mom sent him there and still to this day she thinks she did the right thing for him. His name is Gabriel and he suffers very much. Is there any groups for him to reach out and talk about the abuse he went through? Reply Sudo on June 9, 2018 at 11:44 pm Hello Yuki, Have him search for the WWASP Survivors group on Facebook. We’re happy to support him as a community Reply Shane on July 12, 2018 at 10:57 pm My first day there is when the girl killed herself. I was there for 9 months. I was in the success family until they broke us up for planning an escape. Hit me up at 8174228705 Reply Emily on November 26, 2018 at 6:55 am Hi, I’m doing an assignment on human experiences for english and i would really appreciated if someone could contact me before the 5th of december and tell me their experiences in Tranquility bay. Just reading many of the comments i feel disgusted that many of you had to experience such a inhumane thing. My email is emily.sattrukalsinghe1@gmail.com Reply Chris fillman on February 22, 2019 at 3:09 am I was there for two years spent by my parents because I had emotional issues from abuse as a child.so they sent me somewhere where I had to endure more inhumane punishments and abuse.it mentally damaged me being sent there and I am still suffering from it all these years later.it was a horrible place and when I tried to tell my parents about what went on thier they dont believe me.i hope everyone who was sent thier is safe and enjoying a healthy life now. Reply Katie on September 14, 2019 at 8:56 am When were you there if you don’t might me asking? Did you know Andrew Craighead? Reply Chris fillman on December 26, 2019 at 3:46 am I was there I think from 1999 to 2001.i dont remember names much.if I saw him I’d know.sorry I cant help you.i hope your well. Reply Shea jennings on May 20, 2019 at 10:22 pm I was also in the foundation family  how is every one Reply Lisa Grafton on June 5, 2020 at 1:50 pm Sweet Shea! I am doing well. I hope you are doing good. You will always be remembered by me! Reply Joe on November 9, 2020 at 1:30 am I was in a program in the 8os I know the lasting anguish and need for impossible justice. My programs were all shut down. I had heard a rumour about one in jamaica . But my god. We should like totally toss some salads. Good luck to you all. Reply Katie Scott on September 14, 2019 at 8:52 am Anyone still check this board? My best and closest friend was at tranquility bay from (roughly) 2005-2007. His name was Andrew Craighead or Drew. He killed himself June of 2011 and I’m100% sure it’s bc of the abuse he endured at tranquility bay. If you feel comfortable sharing your story, I would be honored. I just want to know what pushed him to that point. He was my everything and I miss him every single second. Thank you. Reply Joshua on October 3, 2020 at 5:35 am Hi im joshua ventura I was there the same time Reply Joe Gerstel on March 10, 2024 at 12:41 am Hi Katie. My name is Joe (Gupps) Gerstel. I was in TB with Drew. My number is 862-262-5028 I have pictures Im happy to share with you. Reply Christopher Alexander on November 4, 2019 at 7:28 am I was in progress family around 2000/2001. I still have ptsd from the experience. Never was a hardcore drug user before the program, my parents sent me for “behavioral issues” which really is linked to my mental health diagnosis…. but instead of dealing with it, they wrote me off to a program to deal with me… I struggled with severe drug and alcohol addiction after the program and have never fully recovered socially . My anxiety is so bad I can barely be in public alone. The things I experienced here, my parents don’t even want to hear… they always just say “we made mistakes too”…. yeah, well I’m the one paying for them. Unbelievable that parents are willing to just give up like that and expect things to be better afterwards. I don’t know if I will ever have a real relationship with my mom, I just fake it so that we can be civil. My depression is so severe I better suicidal thoughts and thoughts of self harm on the daily basis. I am 35 years old now and still scarred from my time there when I was a teenager Reply Chris fillman on December 26, 2019 at 3:50 am Hey man I went through the same thing.got addicted to meth crack heroin fuck anything for a long time after that.only sober for a year now.im not trying to turn you into a buddhist.bit meditation has been the only thing that helps me.in fact I had an experience so strong I was forever altered by it.bit in a positive way.anyway I understand man it sucks really bad.hope that you do well. Reply Chris fillman on December 26, 2019 at 3:50 am Hey man I went through the same thing.got addicted to meth crack heroin fuck anything for a long time after that.only sober for a year now.im not trying to turn you into a buddhist.bit meditation has been the only thing that helps me.in fact I had an experience so strong I was forever altered by it.bit in a positive way.anyway I understand man it sucks really bad.hope that you do well. Reply Brian P. on May 17, 2020 at 8:50 am Shout out to everyone who survived. I was there back in 2000. I was there for almost 10 months. I was in OP within the first few days of being there. Nightmares still haunt me to this day, even though I never speak out about them, since no one seems to understand. I started out in the Progress family, but after a month, I went to the newly created Renaissance family. I remember Mr.Spence, Mr.Powell, Mrs. Eubanks, Mr.McKnight, etc. Anyone out there, you can find me on FB. Any of you that remember me, my last name is Pinder, and as such, is what everyone called me down there. Reply Bryan T. on September 2, 2020 at 10:21 am I remember you Pinder, I was also Bryan the asian Bryan in the Renaissance Family. I was sad to learn that Lechter killed himself a few years back. I really hope you’re doing well. Reply Divana L. on September 29, 2020 at 8:59 am I speak from my youngest sister Francesca Araya, she was at TB around 2001 2002 spending 18 months there and was a brilliant kit that my mother and my imbecile sister sent her to that school when she was 14 years old. Eventually, my beautiful baby sister died from an OD before turning 30 years old and I believe she never got over the trauma from that place. I only hope that God’s justice comes to all of those that took part as staff from this institution from hell, and I pray for all of those other victims that were also very affected by this school. Reply Cory on March 12, 2024 at 1:17 pm Cory H here “Cdub”. was there from 03-04 age 13-15. Seeing if anyone out there remember me? I went here and was transferred to Liahona Program in Utah until I was 17 where the abuse was just as bad. Question? Is it just me, or does everyone else refuse to lay face down now because of this place? After laying facedown for hours and days traumatized me as a 13 year old at the time. Reply Linda Truat on November 19, 2020 at 1:26 am So sad that someone would do this. You are a bad man Jay Kay! Rot! My adopted son, Aaryav was sent here in 1999 and he is ruined! W Reply #180 Dave Halverson on February 20, 2021 at 12:09 am It’s been 22 years and 2 days to the day that they woke me up at 4am at TB3, to fly me out of Jamaica –>Miami–>Denver–>St. George, Utah, where I continued at Red Rock in a deserted log cabin with a big black bison head above the fireplace. TB 1 beginning on July 2nd, 1998. Magic family. Mrs. Blair was our Mother, Mr. Tony was our Father. 10 months. Today, I had my first session with a therapist. I’m a paramedic with a metropolitan fire dept. I took an EMT class the year I got out of TB. I’ll be 40 in April, I’ve been married going on 18 years, been with my wife for 20 altogether; she met me 4 years after all the trauma. I’ve read stories here for a couple of years, never contributing, but annually drawn back to this page…Never wanting any more than that. Because I’m fine now, right. I’ll always be tethered to this anchor. Reply Laura Rosten on July 26, 2021 at 3:53 pm I was there 2002 i was in mexico at casa by the sea then i sent to jamaica 2003-2005 it was a trip rereading this knowing that people are really well knowing im not alone… i remember the riot, hurricane ivan, and remember the girl killing herself…. i remember all that stuff… anyways hope everyone is doing well… Reply Anonymous on August 20, 2021 at 12:20 am I was sent to Tranquility Bay when I was 16 and left there, in solitary isolation for most of my time there, until I left a few days after turning 18. I wanted to be let out on my 18th birthday, as I thought it was my right, but they kept me in solitary (O.P.) for a few more days…I have recurring flashbacks and nightmares of my time at TB. I’ve tried everything to block them out. I’m in recovery now from a heroin and crack addiction. I OD’d plenty of times and have wanted to end it all so badly for so long, but something kept me alive and I don’t know what it was. But I’m just a shell of a person walking around. I can’t hold a job or have relationships with people, I barely leave my house. I recently applied for SSI because I can’t work, but I don’t qualify because in order to qualify, you have to have worked for 2 out of the past 5 years (since I’m 34 years old). So me and my 2 kids are living with my elderly parents who are struggling financially themselves. They forked over $40,000 to T.B. to be returned a traumatized, shell of a person who couldn’t function in society any more. And to think, I got sent to TB for getting pregnant before I was married (my parents are super religious). I cry almost nightly for the girl I used to be. I just can’t believe no one is doing anything about this or seeking compensation! It’s taken me years to even write this down on this forum, but I’ve been talking to my therapist about it for years. I won’t go into detail about what happened to me there but if anyone knows of a team of lawyers who are handling a class action against WWASP (I believe they recently opened back up the statute of limitations), please let me know. Thanks! Reply Mike Martin on June 4, 2022 at 12:23 pm Honor Family 2006 -2007 what’s up! What doesn’t kill us makes us stronger. I arrived March 2006 and left May 2007. Hit me up if you know me. mikemartin966@gmail.com Reply Abigail Hilton on June 20, 2022 at 10:59 am I would never wish TB on anyone, except for Katie Mac. I would mind her getting a life sentence to Dr. Chappuis’s conversion therapy sessions. Reply Berkeley Bate on July 12, 2022 at 1:18 am Just finding this website.  My name is Berkeley Bate. I was in the first group of kids at the school in 1997, I was #4.  Left in 1998 and was in the first group of kids to open Casa by the Sea for my transition period.  Would love to hear from people if you’re out there. bgbate@gmail.com Reply Timothy Kirby on September 4, 2022 at 2:43 pm I was there from 99 to 2000 I believe I was in the progress family with Mr Grant and Mr White and Mr Bailey. I believe my teacher was Miss Mackenzie at a place is horrible if you remember having to hand wash your clothes in a bucket over sewage for dryer clothes over where the sewage the push up but I’ve become stronger and I’m still here . Reply Timothy Kirby on September 4, 2022 at 2:45 pm There was this one kid that took off in a Jon boat after escaping and he eventually drifted back. Other than Opie and laying on your face for 16 hours a day. I’m sleeping out in the hallways on a mat where the bugs were eating your face. Or having the right 5000 word essays on God knows what the f*** you can make up within 2 hours Reply Matthew galeoto on December 15, 2022 at 11:20 pm I was sixteen years old and had a lot of difficulties in life…drug addiction, problems in school and arrests. I had a loving family that thought they found the answer. I was in juvenile hall when I was released to go to this “special” school that my parents found. I never could of imagined the hell I was in-store for. I along with my father took off to Jamaica. I arrived and everything seemed great, little did I know that this was front put on by staff so my father wouldn’t realize what kind of place he was leaving me at. And I’m sure they put in extra effort knowing my father was an FBI agent. Things changed very fast once my father left. We were put in a small hot room every day to listen to books on tape, and testing after each one. This was the only bearable part. Because depending on which staff was working we were either left in a tiny hot room listening to books on tape and testing after each one or sent outside in bare feet in a thorning, dusty and hard field and had to do all sorts of crazy physical drills. And given no sort of consideration that I just had suffered a heart attack from an overdose. And those we the good days. The bad ones were when we were sitting in a room and sprayed with what they called “heat dog” which was actually OC spray. I know this now because I am a vet and had to be trained with it. There were days without food. And nights without sleep. The good days were when guys went home, but they actually died at the hands of staff and covered up. My story is different from many others.  My father uncovered a lot of the lies when things weren’t adding up, thank God he was able to do to the fact he was a federal agent. Out of nowhere one day while we were outside staff came running out to get me and as I came into the office the director, Jay Kay, was pinned to the wall by my father and step father. This was the day I prayed for every night and never thought would come. I was saved, but felt guilty leaving the rest of the guys. In the weeks to come there was stories online and even on TV. I hope more we’re not killed or hurt. That place has haunted me my entire life. I have never experienced anything so horrific again. And that should mean something considering I am an Afghanistan War Army Veteran. I have seen the most horrific things in war but that was war. Nothing compares to the absolute fear I and the rest felt every day while living in Paradise. I hope this hasn’t resulted in a bunch of mental health issues and suicide but I am sure it has. Reply T. Konrady Jr on September 26, 2023 at 7:57 pm Hey Bill Boyles you there? Thank for leaving this up. I was OG Jamaica. 97-00 was just brutal man. I was there in the hey day. I see a few other OG’s. But Bill, any TRUE og KNOWS TB 1 was the WORST. Because of the things those poor females went through. Gosh. I have no existence at 42. Lost everything like 15 times. I often wonder what all these people’s lives would be like, had we never endured one of the darkest programs ever. Reply Theodore helm on March 19, 2024 at 4:35 pm I arrived in tb on November 15,1997. It was In the desert. Mrs black. Mr Wilson. I was transferred to tb2 I think. The one on the beach with the rocks. That was the one the girls were at Reply Gracie E. on March 7, 2024 at 2:52 am Hey my name is Gracie from Santa Cruz Ca. Looking for people I was close with. I was at Tranquility Bay from 2015-2016. If anyone remembers me hit me up. princessgraceofmalibu@gmail.com Reply Brandon on March 7, 2024 at 7:45 pm I was wondering if anybody knew my cousin Stephanie Boller she was in Tranquility Bay and before that in Costa Rica I had a feeling something happened to her there she wasn’t the same when she came back, she kept diaries that her mom took. She was there between 2000 and 2004 about. I really would like to know what happened their Reply Heather on June 14, 2024 at 3:21 pm Does anyone remember heather gillespie? She has spoken about this place multiple times. Reply Chad Costa on July 14, 2024 at 9:47 am Hey Lance. I believe it was Ms. Davis. I remember the Move to TB3 as well. And how we had to Clean up that Shit hole. Lol n smh. I hope all is well. Reply Jessica on September 13, 2024 at 8:55 pm I never knew a Randal Hinton. I was in Tranquility Bay from 1998-2000.  Our program manager was a black guy, ex football coach, Mr. Lovett, but he messed around with Erin Riley and got fired. Then it was Mr.Bailey and Mr. Collins. Mr. Collins also couldn’t keep his hands to himself either. Bailey was just an asshole. Reply Elisabeth DiVito on August 25, 2025 at 10:14 pm Does anyone remember my brother Daniel DiVito…? He was there in 2000. Thank you. Reply Elisabeth DiVito on August 25, 2025 at 10:17 pm Does anyone remember my brother Daniel DiVito…? He was at Tranquility Bay in 2000. My e-mail is divitorn@hotmail.com . Thank you. Reply Trackbacks/Pingbacks Youth Foundation Closes Amid Scandals, Lawsuits | WWASP Survivors - […] Tranquility Bay […] Youth Foundation Success Academy CLOSED | WWASP Survivors - […] Tranquility Bay […] Submit a Comment Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Search Search for: About WWASP Survivors WWASP Survivors is run by a dedicated group of concerned alumni of WWASP-affiliated programs. Our mission is threefold : Raise awareness of the true nature of WWASP Programs, to advocate for those still being held in “Troubled Teen” programs, and to provide validation and support to survivors of WWASP programs. NEW MERCH ON SALE! WWASP Survivors TeePublic Facebook Twitter Google Instagram RSS Copyright © 2012-2021 WWASPSurvivors.com - ALL RIGHTS RESERVED."
    },
    {
      "url": "https://butterflybooks.co.uk/about-us",
      "text": "About Us - Butterfly Books Skip to content Home Shop Activities For Teachers For Kids Author Visits About Us Our Mission Meet The Team Media Blog Contact Us Home Shop Activities For Teachers For Kids Author Visits About Us Our Mission Meet The Team Media Blog Contact Us £ 0.00 0 Cart The Butterfly Effect By making small changes in a generations’ understanding, we can make waves of change in the future. Discover our mission and how we’re working to change tomorrow. Our mission Who We Are Butterfly Books publish career themed children’s picture books and was founded by brother and sister duo Kerrine Bryan and Jason Bryan. As a chartered electrical engineer, Kerrine remembers the misconceptions and lack of knowledge about engineering as a profession when she was at school. Kerrine and Jason came together to challenge that lack of knowledge, and the stigma of gender bias in a new and exciting way. Butterfly Books write and sell books that address gender bias in professions. What We Do We work with professionals across a range of industries, then simplify big concepts into short, rhyming and colourful childrens’ books. As a Social Enterprise, the majority of our profits are then reinvested into our social mission to support our cause and help it grow, allowing us to produce new books to challenge gender bias in all areas of work. We work to Educate, Inspire and Entertain and we’re working to improve the lives and diversity of generations to come. Who We Do It Butterfly Books have been operating since 2015, and in that time we’ve written multiple books exploring a variety of job roles. Operating from the West Midlands, we’re working to change the next generation. It’s important that children realise their potential – regardless of what gender they are or what background they come from – and that the opportunity is there for the taking if they apply themselves, work hard and want it enough. The world is their oyster. We envision through education, inspiration and entertainment, we can change future generations and destroy gender bias in workplaces. No child should ever be told they cannot be what they want to be. Browse our books below, and read our stories – challenge tomorrow with us. Browse books Sign up to our newsletter Don’t miss a thing from Butterfly Books. If you want to stay in the loop with future offers, events and happenings, as well as be the first to receive content from our team, fill in this brief form. We’re delighted to share our amazing future toward a brighter and better tomorrow with you, and we can’t wait for you to see what we have in store. Subscribe Address: 2 Bridle Grove West Bromwich West Midlands B71 3SF United Kingdom Contact eMail: info@butterflybooks.co.uk Author School Visits Birmingham London New York Top Books Engineer Nurse Firefighter Privacy Policy Shipping Information Refunds and Returns Legal Notice Site Map Competitions Privacy Policy Shipping Information Refunds and Returns Legal Notice Site Map Competitions Twitter Instagram Facebook-f © 2024 All Rights Reserved Butterfly Books | Marketing by DWWorld.co.uk Website By Prophecy Marketing ✕"
    },
    {
      "url": "https://thebutterfly.ca/pages/contact-us",
      "text": "contact us\n– Butterfly Boutique Skip to content Just added to your cart Qty: View cart ( ) Continue shopping Submit Close search Free shipping across Canada on orders $100+! Offering curbside pick ups. Home Shop Online Clothing & Accessories Clothing Jewelry, Purses & Accessories Special Occasion Sale's On! Gifts, Games & Decor Cards Candles, Home & Decor Gifts, Games & Gift Books Lotions & Beauty Potions Babies & Kids Gift Cards Special Occasion Shop Brick & Mortar About Us Search Log in Cart 0 items Home Shop Online Shop Online Menu Shop Online Clothing & Accessories Clothing & Accessories Menu Clothing & Accessories Clothing Jewelry, Purses & Accessories Special Occasion Sale's On! Gifts, Games & Decor Gifts, Games & Decor Menu Gifts, Games & Decor Cards Candles, Home & Decor Gifts, Games & Gift Books Lotions & Beauty Potions Babies & Kids Gift Cards Special Occasion Shop Brick & Mortar About Us contact us Customer Service p: 780 382 2060 For questions or comments about our products and services, get in touch! Name Email * Phone Number Message Quick links Contact Us Search Shipping & Returns Shop Online Store Locations & Hours Subscribe to get the latest on exclusive deals, sales and events! Subscribe Brick & Mortar Store Hours Monday - Friday: 10AM - 5:30PM Saturday: 10AM - 5:30PM Sunday & Holidays: Closed​​​ Payment methods Apple Pay Mastercard Shop Pay Visa Facebook Instagram Payment methods Apple Pay Mastercard Shop Pay Visa © 2025, Butterfly Boutique Use left/right arrows to navigate the slideshow or swipe left/right if using a mobile device Choosing a selection results in a full page refresh. Press the space key then arrow keys to make a selection."
    },
    {
      "url": "https://www.butterflyfurniture.co.uk/contact/",
      "text": "Contact - Butterfly Furniture Skip to content Handcrafted in the UK Bespoke Furniture Lifetime Guarantee Payment Options 01423 330580 andrew@butterflyfurniture.co.uk Facebook-f Twitter Instagram Youtube Linkedin-in Pinterest Tripadvisor Home About Services Bespoke Kitchens Bespoke Furniture Bespoke Bedroom Furniture Personalised Gifts Gallery Blog Contact Home About Services Bespoke Kitchens Bespoke Furniture Bespoke Bedroom Furniture Personalised Gifts Gallery Blog Contact Contact Us We’d love to hear from you! Please use the form to send us any questions or comments you may have, or reach us by phone or email. Why Choose Butterfly Furniture? Butterfly Furniture has a diverse customer base and produces a wide range of work; from bespoke pieces of free-standing furniture, through fitted units for kitchens, bedrooms and living spaces, to high-end joinery work such as staircases and doors. Other services offered include design and technical drawing, supply of appliances as required for areas such as kitchens, provision of upholstery materials and sourcing of upholstery work where necessary. andrew@butterflyfurniture.co.uk 01423 330580 Address Butterfly Furniture, Tancred, Boroughbridge Rd, York, YO26 8BA Facebook-f Twitter Instagram Youtube Linkedin-in Pinterest Tripadvisor GET A PERSONALISED QUOTE Name Telephone Email Message Send Bespoke Furniture Bespoke Furniture is our passion, from hand crafted dining room furniture to unique cabinets and wardrobes. Please browse our Bespoke Furniture Gallery. Learn More Bedroom Furniture We offer a joinery service in North Yorkshire, West Yorkshire and further afield if required. Please take a moment to browse our Joinery Gallery. Learn More Kitchen Furniture We hand craft kitchens to best utilise your space, after listening to your requirements. Please take a moment to browse our Kitchen Gallery. Learn More Personalised Gifts If you’re looking for a unique and individual gift, perhaps for a wedding, christening or just something special for a loved one, then we have the answer! Learn More Client Testimonials Andrew and Ben are both very skilled craftsmen and very easy and friendly to work with. They worked with us to design a complete wall unit with cupboards and shelves and then installed it for us. Their communication was excellent - always responding quickly and getting in touch when they said they would. The quality of the unit is excellent and we are highly delighted with the finished product. The inset butterfly carving is also a lovely touch. We would be very happy to recommend them to others. PJ Keenan Andrew and Ben did an amazing job fitting me a corner bar and boot room. Exceptional service, and the finished product is just perfect… worth every penny! I would recommend them to anyone! Thanks guys! Sally Robinson Andrew and Ben made two beautiful, large lighted bookcases with glass shelving and two matching lamp cabinets. They did an excellent job of sympathetically matching these new pieces to an existing cabinet, and delivered the pieces on time and on budget. Their prices were reasonable, the craftsmanship was superb, they were professional, prompt, and a pleasure to work with throughout the design, construction, and installation. I recommend them without reservation. Maggie Gamberton Latest Posts Choose The Right Fitted Wardrobe For You Depending on your home and room, you will choose a particular type of fitted wardrobe; the main things that you need to consider when choosing the right fitted wardrobe for Read Article » Bespoke and Made To Measure: What’s The Difference? If you have ever looked into getting a new kitchen, you will have probably heard the terms “bespoke” and “made to measure”, and to the untrained eye, they can seem Read Article » Maximise Storage Space With Discreet Cabinets Depending on the location you live and what kind of property that you own, the amount of kitchen space that you have access to can vary significantly. Well lucky for Read Article » Butterfly Furniture was founded in 1983 by Andrew Conning, following on from a long, traditional apprenticeship and training in the “North Yorkshire furniture tradition”. Follow us on social media Facebook-f Instagram Linkedin Twitter Our Services Home About Gallery Blog Contact Home About Gallery Blog Contact Useful Info Bespoke Bedroom Furniture Bespoke Furniture Bespoke Kitchens Personalised Gifts Bespoke Bedroom Furniture Bespoke Furniture Bespoke Kitchens Personalised Gifts Contact Us Butterfly Furniture, Tancred, Boroughbridge Rd, York, YO26 8BA Privacy Policy Cookie Policy Sitemap Copyright © 2023. All Rights Reserved. Website by Outrank Are you looking for a new website? Contact Outrank Today Search Engine Optimisation Web Design Social Media E-commerce Website designed by Outrank"
    },
    {
      "url": "https://thebutterflyprojectnow.org/who-we-are/",
      "text": "Our History - The Butterfly Project Search for: Menu Contact Us Order Butterfly programming Donate Search Home About Us Our History Our Mission Our Team Our Community Volunteer With Us Our Programs Overview of Programming School Programming Community Programming Programming Guidelines Installations FAQs Resources The Importance of Holocaust Education Educational Resources Survivor Stories Film Press & Media Blog Donate Give a Donation Sponsor a Butterfly Tribute Wall of Remembrance and Hope Our History The Butterfly Project is a call to action through education, the arts and memorial making. We teach social justice through lessons of the Holocaust, educating participants about the dangers of hatred and bigotry to cultivate empathy and social responsibility. By painting ceramic butterflies, which are displayed as symbols of resilience and hope, participants remember the 1.5 million children killed during the Holocaust. In this work, The Butterfly Project honors our commitment to the Survivors to Never Forget. A Program For Everyone Many different organizations can take part in the project, including public and private schools, museums, faith communities, local organizations, service clubs, and community groups. One-of-a-Kind Lessons The Butterfly Project stands out as a Holocaust Education program combining age- appropriate, historical testimony and storytelling with the arts, emphasizing the values of kindness, resilience, courage and gratitude. Our History The Butterfly Project (TBP) was co-founded in 2006 at San Diego Jewish Academy by educator Jan Landau and artist Cheryl Rattner Price as a new approach to teaching the Holocaust that is hands-on, hopeful and profound, collectively memorializing the 1.5 million children murdered during the Holocaust and honoring the Survivors. Our Inspiration TBP draws our inspiration from the poem The Last Butterfly , a poem written by Pavel Friedmann while he was in a prisoner in Terezin, a concentration camp in the former Czechoslovakia. Our work is designed to bring Holocaust education to life in a meaningful and personal manner. Our Programming Through age-appropriate curriculum, oral history, and the arts, each participant paints a butterfly and joins other communities in creating and collectively displaying 1.5 million ceramic butterflies worldwide, one for every child killed in the Holocaust. Our programming explores the Holocaust’s complex history and emphasizes the power of hope, the dangers of bullying, bigotry and discrimination, the necessity of cultivating empathy, the profound impact of upstanders for justice and the importance of gratitude. Butterfly kits, paired with biography cards of children who were killed in the Holocaust, help participants to feel both a part of history and a part of creating a more peaceful future.  Over 200 communities worldwide have joined in our mission. And this is only the beginning. 2006 – Co-Founders educator Jan Landau & artist Cheryl Rattner Price launch The Butterfly Project (TBP ) at San Diego Jewish Academy, (SDJA) TBP was originally called Zikaron V’Tikvah, Hebrew for Remembrance and Hope . 2007 – Local Holocaust Survivors create first butterfly mural at SDJA . Outreach begins to communities and schools across the country and beyond. 2008- Classroom kits are assembled by our volunteers. First large scale butterfly mural made at SDJA. 2009- The Butterfly Project (TBP) presents at school conferences in Boston and Houston, increasing outreach. Levine JCC in Charlotte, NC, our longest collaborating partner, begins program. 2010- TBP events at Museum of Tolerance , Steps to Tolerance Program and Family Days. 2011- TBP presents at Anti-Defamation League (ADL) conference in San Diego. 2012- The Butterfly Project begins making a documentary film and our Founders go to Poland and Israel to spread our mission around the world! More than 3600 butterflies painted on the border of Germany and Poland. 2014  Ela Weissberger, Terezin Survivor becomes a significant part of the film. Filmmaker Joe Fab ( Paper Clips ) mentors Co-Founder Cheryl Rattner Price and eventually becomes co-producer. 2015 – The Butterfly Project travels to Prague and Terezin with Ela to finish our documentary, now named, NOT The Last Butterfly . TBP spreads its wings to Mexico, Uruguay, Argentina, Peru and Guatemala. 2016 – The Butterfly Project’s film, NOT The Last Butterfly , premiers at The Museum of Tolerance in Los Angeles. TBP begins teacher training workshops in California with Facing History and Ourselves . 2017 – NOT The Last Butterfly becomes an award winning documentary film; showings in Florida, Kansas, Minnesota, Kansas, Virginia, Pennsylvania, New York, New Jersey, Indiana, Arizona, Texas, N. Carolina, Atlanta, Hong Kong & Latvia. The Butterfly Project passes 200,000 butterflies painted for the 1.5 million children killed in the Holocaust. 2018 – Cottbus, Germany joins The Butterfly Project and spreads to more than 30 schools. Events on college campuses include University of Virginia, Charlottesville, Chapman University, Orange CA, University of San Diego, CA. 2019- TBP returns to Israel to present at JCC Global , Beit Terezin and Beit Hatfutsot, Tel Aviv University. 2020 – TBP expands its reach, leveraging new technology amidst a pandemic, partnering with more participants across the US, including entire school districts. 2021- Large scale mural dedicated at Merage JCC , Irvine CA right in middle of pandemic. Biography card research dramatically expands our database to pair with butterflies. Today – You and your students join The Butterfly Project ! Our Community of Holocaust Survivors Holocaust Survivor Hanna Marx with students from San Diego Jewish Academy Our community of Holocaust Survivors offer an invaluable learning experience that when they speak virtually or in-person to a group of students or community members. It is an irreplaceable experience that conveys important lessons in a way that nothing else can… The necessity of perseverance and resilience The power of hope The dangers of bullying, bigotry, prejudice and discrimination The profound impact of upstanders for justice The importance of gratitude Who We Are go Our Programs go Give go The Butterfly Project, a 501c3 organization. 4950 Murphy Canyon Rd., San Diego, CA 92123 The Butterfly Project is an equal opportunity employer. Applicants and employees shall not be discriminated against based on religion, race, color, national origin, ethnicity, age, gender, physical or mental disability, sexual orientation, gender identity, marital or family status, or any other basis prohibited by law. (619) 790-7691 info@thebutterflyprojectnow.org About Us Our History Our Team TBP Community Contact Us Privacy Policy Programs School Programming Community Programming Installations Programming Guidelines FAQs Resources Film Get Involved News & Events Annual Reports Order Butterfly Programming Donate @2025 The Butterfly Project. All Rights Reserved. Nonprofit marketing agency Elevation Web social social social"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    }
  ]
}