{
  "fuentes": [
    {
      "url": "https://historiccoastculture.com/business/treylor-park-st-augustine/",
      "email": "x@2x.png"
    },
    {
      "url": "https://historiccoastculture.com/business/treylor-park-st-augustine/",
      "email": "sjcc@historiccoastculture.com"
    },
    {
      "url": "https://www.treylorpark.com/our-team/",
      "email": "chris.browning@treylorpark.com"
    },
    {
      "url": "https://www.treylorpark.com/our-team/",
      "email": "joleen.culpepper@treylorpark.com"
    },
    {
      "url": "https://www.treylorpark.com/our-team/",
      "email": "kadie.weed@treylorpark.com"
    },
    {
      "url": "https://www.treylorpark.com/our-team/",
      "email": "matt.warren@treylorpark.com"
    },
    {
      "url": "https://www.treylorpark.com/our-team/",
      "email": "rick.kunzi@treylorpark.com"
    },
    {
      "url": "https://www.treylorpark.com/our-team/",
      "email": "sterling.usher@treylorpark.com"
    },
    {
      "url": "https://www.treylorpark.com/our-team/",
      "email": "trey.wilder@treylorpark.com"
    },
    {
      "url": "https://www.treylorpark.com/",
      "email": "coolmerch@4x-300x204.webp"
    },
    {
      "url": "https://www.treylorpark.com/",
      "email": "coolmerch@4x-768x523.webp"
    },
    {
      "url": "https://www.treylorpark.com/",
      "email": "coolmerch@4x-900x612.webp"
    },
    {
      "url": "https://www.treylorpark.com/",
      "email": "coolmerch@4x.webp"
    }
  ],
  "mails": [
    "chris.browning@treylorpark.com",
    "coolmerch@4x-300x204.webp",
    "coolmerch@4x-768x523.webp",
    "coolmerch@4x-900x612.webp",
    "coolmerch@4x.webp",
    "joleen.culpepper@treylorpark.com",
    "kadie.weed@treylorpark.com",
    "matt.warren@treylorpark.com",
    "rick.kunzi@treylorpark.com",
    "sjcc@historiccoastculture.com",
    "sterling.usher@treylorpark.com",
    "trey.wilder@treylorpark.com",
    "x@2x.png"
  ],
  "nombre_sitio": "treylorpark.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://historiccoastculture.com/business/treylor-park-st-augustine/",
      "text": "Treylor Park - St. Augustine - HistoricCoastCulture.com Treylor Park - St. Augustine - HistoricCoastCulture.com English English French German Italian Spanish SUBSCRIBE SUBMIT AN EVENT LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. MENU Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Select Category Drinks Places To Stay Restaurants Select Location Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach SEARCH Home Drinks ; Restaurants Treylor Park - St. Augustine Facebook Twitter Linkedin Treylor Park - St. Augustine Drinks ; Restaurants Email / Website / Instagram / LinkedIn / Pinterest / Primary address: 61 Spanish St., St. Augustine, FL 32084 (904) 342-7104 Welcome to Treylor Park St. Augustine — your go-to local hangout for bold bites, good vibes, and unforgettable moments. From brunch to live music, 80s movie playlists to “Treylor-chic” art, we mix funky fun with feel-good food all day long. Dig into favorites like our PB&J Chicken Wings, Chicken & Pancake Tacos, Miyagi Beef and Shrimp N’ Grits Tacos, Chicken Biscuits, Cheesesteak Egg Rolls, and mouthwatering pizzas. Pair it with a craft cocktail and settle in — whether you’re here ... view more » Welcome to Treylor Park St. Augustine — your go-to local hangout for bold bites, good vibes, and unforgettable moments. From brunch to live music, 80s movie playlists to “Treylor-chic” art, we mix funky fun with feel-good food all day long. Dig into favorites like our PB&J Chicken Wings, Chicken & Pancake Tacos, Miyagi Beef and Shrimp N’ Grits Tacos, Chicken Biscuits, Cheesesteak Egg Rolls, and mouthwatering pizzas. Pair it with a craft cocktail and settle in — whether you’re here for brunch, dinner, or a celebration, there’s something for everyone. View less HOURS: Monday - Friday: 11AM - 11PM Saturday & Sunday: 10AM - 11PM LOCATION Address : 61 Spanish St., St. Augustine, FL 32084 Full map and directions Nearby Events Ancient City Poets at Sing Out Loud Presented by Ancient City Poets at Spinster Abbott's Sep 13, 2025 Facebook Twitter Linkedin Spill the Tea: Fresh-Brewed Comedy Presented by Third Space Improv at Third Space Improv Sep 13, 2025 Accessibility Info Facebook Twitter Linkedin TICKETS / REGISTRATION Lenny Foster: The Magnolia Season Presented by Lightner Museum and Lenny Foster's Gallery One Forty Four at Lightner Museum Jun 6 - Sep 14, 2025 Accessibility Info Facebook Twitter Linkedin Comedy Smackdown Presented by Third Space Improv at Third Space Improv Sep 19, 2025 Accessibility Info Facebook Twitter Linkedin TICKETS / REGISTRATION St. Augustine Book Festival Presented by Ximenez-Fatio House Museum at Ximenez-Fatio House Museum Sep 20, 2025 Facebook Twitter Linkedin SHOW MORE PHOTOS Fish and Chips Fish and Chips Grilled Apple Pie w/ Fried Chicken Sandwich FIND LOCAL BUSINESSES Search by Keyword Select Category Drinks Places To Stay Restaurants Select Location Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach SEARCH RESET DIRECTORIES Artist Profiles Restaurants Drinks Places To Stay Organizations Venues RESOURCES Spotlight Media Marketing Toolkit Most Viewed Events Stories SUBMIT A LISTING Event Organization Artist Profile ABOUT US Contact Us About Us Support the Arts ST. JOHNS CULTURAL COUNCIL HistoricCoastCulture.com is a one-stop source for information about all the performances, venues, exhibitions, and community events that are happening year-round. CONTACT US 184 San Marco Ave, St. Augustine FL 32084 904-808-7330 sjcc@historiccoastculture.com © 2025 - St. Johns Cultural Council . All Rights Reserved. { Powered by ARTSOPOLIS } Processing... Thank you! Your subscription has been confirmed. You'll hear from us soon. GET THE LATEST FROM HISTORIC COAST CULTURE Stay connected with weekly updates on arts, culture, history, and heritage events in St. Augustine, Ponte Vedra, and the Beaches. Name ErrorHere Email * City * Zip/Postal Code * Interests * Visual Arts Performing Arts Literary Arts Festivals Living History Many Cultures Culinary Historic Coast INSIDER"
    },
    {
      "url": "https://www.treylorpark.com/our-team/",
      "text": "Our Team – Treylor Park – Award-Winning Brunch, Dinner & Cocktails Skip to content Go to sitemap View accessibility statement About Our Story Our Team News & Press Locations Treylor Park Savannah Treylor Park Nocatee Treylor Park St. Augustine Hitch – Savannah Double Wide Diner – Savannah Pizza Party – Savannah Beach Party – Tybee Island On The Menu Happenings Catering Shop TP Merch Contact Us About Our Story Our Team News & Press Locations Treylor Park Savannah Treylor Park Nocatee Treylor Park St. Augustine Hitch – Savannah Double Wide Diner – Savannah Pizza Party – Savannah Beach Party – Tybee Island On The Menu Happenings Catering Shop TP Merch Contact Us Our Team Led by restaurateurs and co-founders Trey Wilder and Rick Kunzi, our Treylor Park team is passionate, dedicated, and hard-working. We’re also a lot of fun. Working with us means quality results, incredible experiences, and having a great time along the way. Trey Wilder FOUNDER E | trey.wilder@treylorpark.com Rick Kunzi FOUNDER E | rick.kunzi@treylorpark.com Sterling Usher DIRECTOR OF OPERATIONS E | sterling.usher@treylorpark.com Chris Browning REGIONAL MANAGER - FLORIDA E | chris.browning@treylorpark.com Joleen Culpepper MANAGER - FLORIDA E | joleen.culpepper@treylorpark.com Kadie Weed MANAGER - GEORGIA E | kadie.weed@treylorpark.com Matt Warren MANAGER - GEORGIA E | matt.warren@treylorpark.com Quick Links Gift Cards Catering & Private Events News & Press Work With Us Gift Cards Catering & Private Events News & Press Work With Us Get the latest updates on Treylor Park Email (Required) Name This field is for validation purposes and should be left unchanged. Δ Facebook Instagram Linkedin Copyright © 2025, All Rights Reserved. Powered by Connect . Privacy Policy & Terms of Use Accessibility Statement Sitemap Privacy Policy & Terms of Use Accessibility Statement Sitemap Park it on the couch treylor park delivers Craving the good stuff? Click below to order Uber Eats from Pizza Party or Nocatee, and let the flavor roll up to your door. Order TP Nocatee Order Pizza Party"
    },
    {
      "url": "https://www.treylorpark.com/",
      "text": "Treylor Park Restaurants – Award-Winning Brunch, Dinner & Cocktails Skip to content Go to sitemap View accessibility statement About Our Story Our Team News & Press Locations Treylor Park Savannah Treylor Park Nocatee Treylor Park St. Augustine Hitch – Savannah Double Wide Diner – Savannah Pizza Party – Savannah Beach Party – Tybee Island On The Menu Happenings Catering Shop TP Merch Contact Us About Our Story Our Team News & Press Locations Treylor Park Savannah Treylor Park Nocatee Treylor Park St. Augustine Hitch – Savannah Double Wide Diner – Savannah Pizza Party – Savannah Beach Party – Tybee Island On The Menu Happenings Catering Shop TP Merch Contact Us Saving You a Seat, 365 Days a Year Find a Location You Look Hungry for Something Different Explore Our Menu Dining off the beaten path Funky twists on classic favorites, nostalgic 80s playlists, and quirky retro decor. You could say our style is Southern with swagger, but we just call it fun. Leave the ordinary behind and step into a Treylor Park restaurant. Our Story Shop Our Get Your Swag On Let’s Get This Party Started Every Wednesday  at Treylor Park St. Augustine Bingo Night at TP St. Augustine View Event Friday, August 22, 2025 Fourth Annual  TP  Open View Event Every Tuesday  at Pizza Party Trivia Night at Pizza Party View Event Every Thursday  at Treylor Park Nocatee Ladies Night at TP Nocatee View Event VIEW MORE EVENTS Sign up for our newsletter to get the latest on food, fun and events at your local Treylor Park restaurant. Sign Up for the TP Mix Tape You're Making Us Blush The flavor profiles here are incredible. They serve ordinary sounding fare but with a superlative twist. Unusual flavors bring new respect to classic dishes. Country fried steak and gravy on a biscuit was stellar – they added just a little something different. The low country skillet was amazing. Portions were generous and there were no complaints from our party of 7. This place deserves to be packed out regularly. Randy D. on Google Visited Double Wide Diner The service was quick and the food is very fresh. We got a veggie pizza and all of the toppings looked to be hand cut. Nothing frozen. I would have to say this is one of the best pizzas I’ve eaten anywhere. 2 people almost got through a large. I will definitely be back the next time I’m in town. B P on Google Visited Pizza Party Literally blown away. Service was a 10 and it wasn’t very busy. Had the chicken and waffles and it was amazing. Waffle was sweet and buttery. Chicken was crisp and warm. They had this pecan syrup which was super sweet but delicious. Tbh the waffles didn’t even need it. I felt like the Mac and cheese was mid but it didn’t take anything away from the great meal. 9.5/10 Husain A. on Google Visited Hitch This was a great late night find for us! ….The Treylor Park was open with a couple of locations nearby, so we headed in. We ordered the Treylor park nachos and the pancake taco with fresh strawberry salsa and the combinations of ingredients were tasty and amazing! ….And our server was also awesome! We were looking for a quick bite, but ended up finding a real gem. Highly recommend! Marilyn S. on Yelp Visited Hitch Best of the Treylor Park establishments as far as menu goes. Appetizers are far better than any other pizza joint! Karston B. on Yelp Visited Pizza Party *These reviews are from actual customers and reflect their individual experiences. No compensation was provided for these or any other testimonials. Tag Us on Social Catch every play on the big screen this weekend and enjoy our gameday specials. Good food, cold drinks, and all the action. Bring your crew! *Only at Pizza Party 6 3 Open Your newest hyper fixation meal? The Smash Burger: two smashed butcher blend patties, caramelized onions, melty cheddar, and TP’s special sauce on a brioche bun. 16 1 Open Slice, slice, baby! It`s National Cheese Pizza Day. Drop how many slices you can eat in the comments and dare a friend to beat you! 13 1 Open Touchdown for your taste buds! Win a $25 Treylor Park gift card and make game day even better. Predict the Superbowl winner in the comments and tag a friend to enter. *Winner chosen on 9/10 11 10 Open This month is packed with fun!🍻🍔 Catch every big moment with great food, drinks, and your crew at any Treylor Park location. 8 2 Open If you enjoy the long weekend a little too much, we`ve got the cure. Come grab brunch at your nearest Treylor Park spot, or even order it to-go. *all items pictured are not available at all locations, but you can get brunch and cure for what ails you at all locations 17 3 Open Grab Treylor Park to-go, park it on the couch, and eat like no one’s watching—because they’re not. #togo #ordertogo #takeout #HomeIsWhereYouParkIt #TreylorPark #cocktails #appetizers #shareables #foodie #restaurant #delicious #cocktailsanddreams #happyhour #drinklocal #eatlocal 11 1 Open Wear your appetite. Rep the flavor. Grab your favorite Treylor Park item today in our bio! 8 1 Open Thank you, Marlee! We`re thrilled to hear you enjoyed your experience with us, from the food to the service. We truly appreciate your kind words and recommendation. 8 2 Open Girl dinner, but make it Treylor Park. 🥗 our Caesar Salad is giving main character energy. 19 1 Open Our Nocatee location is far from your usual neighborhood spot. We have creative dishes, a great outdoor space, and something different in every bite. Have you hit this location yet!? 19 2 Open Crispy, golden, and absolutely not your average fish & chips. Pub vibes. Treylor Park twist. 16 3 Open Quick Links Gift Cards Catering & Private Events News & Press Work With Us Gift Cards Catering & Private Events News & Press Work With Us Get the latest updates on Treylor Park Email (Required) Comments This field is for validation purposes and should be left unchanged. Δ Facebook Instagram Linkedin Copyright © 2025, All Rights Reserved. Powered by Connect . Privacy Policy & Terms of Use Accessibility Statement Sitemap Privacy Policy & Terms of Use Accessibility Statement Sitemap Park it on the couch treylor park delivers Craving the good stuff? Click below to order Uber Eats from Pizza Party or Nocatee, and let the flavor roll up to your door. Order TP Nocatee Order Pizza Party"
    }
  ]
}