{
  "fuentes": [
    {
      "url": "https://tripodlink.lv/",
      "email": "info@tripodlink.lv"
    },
    {
      "url": "https://elpintocopacking.com/pages/about-us",
      "email": "copack@elpinto.com"
    },
    {
      "url": "https://elpintocopacking.com/pages/about-us",
      "email": "copack@elpinto.com"
    },
    {
      "url": "https://elpintocopacking.com/pages/about-us",
      "email": "info@elpinto.com"
    },
    {
      "url": "https://7clounge.com/find-us/",
      "email": "7c@fop5.org"
    },
    {
      "url": "https://www.groominglounges.com/contactus.html",
      "email": "lva@groominglounge.com"
    },
    {
      "url": "https://www.groominglounges.com/contactus.html",
      "email": "edia@groominglounge.com"
    },
    {
      "url": "https://www.groominglounges.com/contactus.html",
      "email": "info@groominglounge.com"
    },
    {
      "url": "https://www.groominglounges.com/contactus.html",
      "email": "info@groominglounge.comphone"
    },
    {
      "url": "https://www.lov3htx.com/contact",
      "email": "info@lov3htx.com"
    },
    {
      "url": "https://reviews.birdeye.com/pintos-lounge-146854842521152",
      "email": "profiles@birdeye.com"
    },
    {
      "url": "https://pintowines.ie/about/",
      "email": "info@pintowines.ie"
    },
    {
      "url": "https://www.tripodpartners.com/contact-us/",
      "email": "asset-1@4x-1-1280x195.png"
    },
    {
      "url": "https://www.tripodpartners.com/contact-us/",
      "email": "asset-1@4x-1-480x73.png"
    },
    {
      "url": "https://www.tripodpartners.com/contact-us/",
      "email": "asset-1@4x-1-980x149.png"
    },
    {
      "url": "https://www.tripodpartners.com/contact-us/",
      "email": "asset-1@4x-1.png"
    },
    {
      "url": "https://www.tripodpartners.com/contact-us/",
      "email": "asset-3@3x.png"
    },
    {
      "url": "https://www.tripodpartners.com/contact-us/",
      "email": "info@tripodpartners.co.uk"
    }
  ],
  "mails": [
    "7c@fop5.org",
    "asset-1@4x-1-1280x195.png",
    "asset-1@4x-1-480x73.png",
    "asset-1@4x-1-980x149.png",
    "asset-1@4x-1.png",
    "asset-3@3x.png",
    "copack@elpinto.com",
    "edia@groominglounge.com",
    "info@elpinto.com",
    "info@groominglounge.com",
    "info@groominglounge.comphone",
    "info@lov3htx.com",
    "info@pintowines.ie",
    "info@tripodlink.lv",
    "info@tripodpartners.co.uk",
    "lva@groominglounge.com",
    "profiles@birdeye.com"
  ],
  "nombre_sitio": "tripod.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://tripodlink.lv/",
      "text": "Staff search and selection | Tripodlink.lv For employers Recruitment Services Business Development Recruitment Financial and Management Recruitment Engineering Recruitment IT Recruitment Executive Search Assessment Assessment for managers Assessment for specialists Team assessment Personality tests Cognitive ability tests Special tests Organisational Surveys Surveys Workplace Wellbeing Survey 360-degree Feedback Organizational Growth Solutions Training and workshops Outplacement Support – Respectful Guidance Through Change Coaching for Leaders and Teams – Support for Growth, Clarity, and Action For candidates Job opportunities News and Events About us About Tripod Link Team Social responsibility Contacts lv LT EE lv LT EE Coaching for Leaders and Teams – Support for Growth, Clarity, and Action Organizational Growth Solutions Outplacement Support – Respectful Guidance Through Change Tailored Trainings and Workshops Team assessment Teams workshop Training and workshops Tripod Test Certification Training Workshops and Seminars for Leaders and Teams For candidates For test takers Job opportunities For employers Recruitment Services Financial and Management Recruitment Business Development Recruitment IT Recruitment Engineering Recruitment Executive Search Organisational Surveys Team building workshop for your team Surveys Workplace Wellbeing Survey 360-degree Feedback Assessment Assessment for managers Assessment for specialists Cognitive ability tests Personality tests Special tests About us Team Areas of expertise About Tripod Link Social responsibility News and Events Contacts Cookies are used Privacy policy Homepage Your browser does not support this type of video. A partner for your growth Helping you grow is our main goal and passion. Tripod Link’s team of human resource management experts will help you attract and select the strongest talents in the market and adapt the best methods and HR solutions for sustainable growth. For employers Employee search and selection. Employee and candidate assessment. For candidates All our job postings in one place. For employers Employee search and selection. Employee and candidate assessment. For candidates All our job postings in one place. Services For employers Recruitment Services In case you want to strengthen your team for change or growth get in touch with us. We will help you find, evaluate, and hire the strongest talents in the market. We pay special attention to the formulation of your employer value proposition (EVP) and apply only reliable methods that are backed by research and data. For employers Assessment If you want to assess your own candidates or current employees for promotion or other reasons, we will select the most appropriate tools depending on your needs. The psychometric tools we use are standardized for Latvia. For employers Organisational Surveys Many of our clients are already using the help of our HR consultants in implementing performance review systems, shaping employer brand, creating employee recruitment process, or improving other parts of employee journey. Feel free to ask for advice – the first evaluation (audit) of your current situation is free of charge. For candidates Job Listings Our clients are TOP employers. Here you will find information on all of our current vacancies by the industry: IT, Finance, Sales, Marketing, Engineering and other. If your dream job post is not there, feel free to write to us at info@tripodlink.lv or subscribe to our newsletter to be the first to receive the latest job offers. We base the sustainability of our partnership on professionalism Why choose us? One team covering the best practice in the pan-Baltic market: We are the first HR solutions firm, uniting the best of the Baltic States employment market. Our team covers the full scope of recruitment, organizational research, consultancy and assessment services. We are your one-stop-shop for needed HR solutions no matter in which market – Lithuania, Latvia or Estonia – you need help. Our united teams have proven long-standing experience in the market: 13+ years in Lithuania and 25+ years in Estonia, which use only scientifically validated methodologies in our work, tailored for each client. For you, it means guaranteed accumulated expertise, knowledge about the local market pulse and best HR practices while reaching your goals. Proven track record for your business success We are experts in recruitment and HR, but also specialize in different industries and job functions. We have technology, IT, finance and management, and business development recruitment teams. Every year we successfully perform over 600 of the most complex searches, more than 100 coaching customers and 30 000 tests a year in the Baltics market. It‘s not all about the quantity. Quality is our main goal. We have a 95 % success rate of recruited candidates remaining successfully working in the companies. Exclusive attention to your image and growth We pay a lot of attention to efficiency and risk management and deliver all our services on the time. The experience we create for candidates has a direct impact on how candidates perceive you as an employer. We guarantee that we will use all our accumulated experience and reputation to strengthen your image in the market. More about us Contact Us +371 279 98 661 info@tripodlink.lv Dzirnavu iela 67, Rīga, LV-1011 About Us About Tripod Link Team Social responsibility Useful links For employers For candidates Privacy policy Cookies are used © 2025 TRIPOD, SIA Created by Interested in new career opportunities? Subscribe to our newsletter and be the first to know about the latest job offers. Finance and administration Sales and Marketing Technologies IT I agree with privacy policy Subscribe Facebook LinkedIn Twitter Ask Us Cookies This website uses cookies to improve the quality of the service and by continuing to browse you agree to the privacy policy . I accept"
    },
    {
      "url": "https://elpintocopacking.com/pages/about-us",
      "text": "About Us\n – El Pinto Co-Packing Skip to content Home About Us Shop Shop All Products Gift Packs SALSA SCORPION CHILE SAUCES HOT SAUCE DRINK MIXERS Certifications Services Contact Us Careers Fiesta Salsa Limited Edition Log in Facebook Instagram Home About Us Shop All Products Gift Packs SALSA SCORPION CHILE SAUCES HOT SAUCE DRINK MIXERS Certifications Services Contact Us Careers Fiesta Salsa Limited Edition Search Log in Cart Item added to your cart View cart Check out Continue shopping ABOUT EL PINTO CO-PACKING EL PINTO HISTORY, FAMILY AND THE “SALSA TWINS” Jack and Connie Thomas built El Pinto Restaurant in 1962. Their dream was to serve the recipes of Connie’s mother Josephina Chavez-Griggs. They decided to name the restaurant El Pinto meaning “the spot”. It started as a one room restaurant with just a handful of tables and a small kitchen. They built their home nearby so they could raise their family and be close to their business. Family has always been the heart and soul of El Pinto. The Thomas’ six children all helped in the restaurant while they were growing up. It became a destination restaurant where families traveled for miles to enjoy the delicious food and the beautiful north valley of Albuquerque. “The Salsa Twins”, Jim and John Thomas, purchased the restaurant and expanded with more patios and a spectacular indoor garden room containing many live plants and a waterfall. The restaurant now seats over 1,200 guests in our five pet friendly patios, five indoor dining rooms, and cantina. On any given weekend there may be a wedding, corporate team building event, a movie that is filming, and friends and family enjoying a dinner out under the cottonwoods. The patios are enclosed during the winter months so guests can still enjoy the patio and sit near a warm fire. El Pinto is one of the largest restaurants in the Southwest and is located on the original Route 66 and adjacent to the historic Rio Grande River. The salsas and sauces served in the restaurant were so popular that customers asked to take them home. The Twins worked day and night to perfect the process of bottling the restaurant products, beginning with a 35-gallon kettle in the kitchen. Today, El Pinto uses 120 tons of chiles a year, can make over 12,000 cases a day and has the capacity to make 20 million jars a year in their 35,000 square foot manufacturing and storage facility. The quality of El Pinto products begins with the chile. To Jim and John, quality is of the utmost importance. Similar to a fine wine, chile needs to be grown and nurtured in the right environment to embody the best flavor of the chile. In keeping with Josephina’s recipes all chiles used in the El Pinto products are grown exclusively in the famous Hatch Valley of New Mexico. We partner with only the finest growers and work with them to select the best produce for our products. \n\nThe authentic flavor and hand-picked ingredients used in El Pinto Salsa makes the product versatile for both snacking and cooking. El Pinto’s Salsa and Green Chile Sauce can be used to spice up everyday dishes such as Green Chile Meatloaf and Green Chile Chicken Stew.\n\nEl Pinto products are now available nationwide in stores including Wal-Mart, Kroger, and Albertson’s. El Pinto Foods Our own salsa, at first, was created and filled in our small kitchen. We now have our product in some of the largest retail stores like Walmart &  Krogers. Through the years of experience we’ve figure out how to maintain product integrity and consistency. We’ve been through both the ups & down of the food co-packing process. Our experience, a 45,000 sq. foot facility with automation, and a team of knowledgable staff is what we offer all our co-packing clients. We look forward in helping you navigate through the co-packing process and helping your product get the attention, quality, and consistency it deserves. Let's get started REQUEST INFORMATION Our manufacturing process starts with our R&D team, which will evaluate your existing recipe for production on our processing and packaging equipment. Name * Phone Number EMAIL * COMPANY ADDRESS How Many recipes Select 1 2-5 5-10 10+ Avg. Number Ingredients Per Recipe Select Less than 5 5 More than 5 Are any ingredients allergens Select Yes No Unsure process Select COLD FILL and HOLD HOT FILL and HOLD STEAM JACKETED KETTLE HIGH TEMPERATURE SHORT TIMES PRESERVATIVES OTHER Message * Submit Facebook Instagram Company Home About Us Shop Certifications Services Contact Us Careers Fiesta Salsa Limited Edition Contact Information Copacking Office Number: (505) 898-1771 Extension 1134 Email: Copack@elpinto.com Order Questions Phone: (505) 503-2900 Email: info@elpinto.com Operation Hours Monday - Friday: 8:00AM - 5:00PM 10500 4th St NW, Albuquerque, NM 87114 © 2025, El Pinto Co-Packing Refund policy Privacy policy Terms of service Choosing a selection results in a full page refresh. Opens in a new window."
    },
    {
      "url": "https://7clounge.com/find-us/",
      "text": "CONTACT US - 7C Lounge Skip to content Skip to content ABOUT ABOUT 7C JOIN OUR TEAM OUR MENUS LUNCH & DINNER BREAKFAST BRUNCH DESSERT KIDS MENU EAGLES GAME TIME MENU SEAFOOD NIGHT TACO TUESDAY PRIME RIB NIGHT SPECIALS EVENTS BOOK A PARTY BLOG COP SHOP ABOUT ABOUT 7C JOIN OUR TEAM OUR MENUS LUNCH & DINNER BREAKFAST BRUNCH DESSERT KIDS MENU EAGLES GAME TIME MENU SEAFOOD NIGHT TACO TUESDAY PRIME RIB NIGHT SPECIALS EVENTS BOOK A PARTY BLOG COP SHOP Get In Touch We’d love to hear from you! Whether you’re interested in booking a private event, learning more about our exclusive offerings, or have any questions, feel free to reach out. Our team is here to ensure you have the best experience possible. Contact us using the form below, and we’ll get back to you as soon as possible. Call Us (215) 629-3600 Contact us 11630 Caroline Road Philadelphia, PA 19154 Hours of Operation Mon - Sun: 7 AM to 3 AM Address 11630 Caroline Road Philadelphia, PA 19154 We Are open 7 Days a Week 7am-3am Kitchen Hours SUN to WED closes at 10pm THURS to SAT closes at 11pm Contact Us 215-629-3607 7c@fop5.org stay connected Facebook Instagram ©2025 –  7C Lounge All Rights Reserved. Made with ❤ by ʻOhana Digital Welcome Don't miss the discount Email Subscribe We never spam you. You can unsubscribe whenever you want"
    },
    {
      "url": "https://www.groominglounges.com/contactus.html",
      "text": "Contact Grooming Lounge ð¢ GET 15% OFF GROOMING LOUNGE WITH CODE : GL15 0 0 Shaving Shaving Creams + Soaps Aftershave Balms + Splashes Shaving Irritation Relief Shaving Oils Shaving Best Sellers Skin Face Washes Face Scrubs Acne + Oily Skin Solutions Face Masks Face Pads + Wipes Facial Toners Skin Tools Skin Best Sellers Body Body Washes + Shower Gels Body Bars + Scrubs Body Wipes + Pads Body Moisturizers + Lotions Hand Washes + Lotions Body Best Sellers Hair Shampoos Conditioners Hair Styling Products Hair Brushes + Combs Hair Best Sellers Beards Brands Deals Barbershop+Spa Grooming Lounge Collection Visit us Account ð¢ GET 15% OFF GROOMING LOUNGE WITH CODE : GL15 Shaving Shaving Creams + Soaps Aftershave Balms + Splashes Shaving Irritation Relief Shaving Oils Shaving Best Sellers Skin Face Washes Face Scrubs Acne + Oily Skin Solutions Face Masks Face Pads + Wipes Facial Toners Skin Tools Skin Best Sellers Body Body Washes + Shower Gels Body Bars + Scrubs Body Wipes + Pads Body Moisturizers + Lotions Hand Washes + Lotions Body Best Sellers Hair Shampoos Conditioners Hair Styling Products Hair Brushes + Combs Hair Best Sellers Beards Brands Deals Barbershop+Spa Grooming Lounge Collection 0 Shaving Creams + Soaps Aftershave Balms + Splashes Shaving Irritation Relief Shaving Oils Shaving Best Sellers Face Washes Face Scrubs Acne + Oily Skin Solutions Face Masks Face Pads + Wipes Facial Toners Skin Tools Skin Best Sellers Body Washes + Shower Gels Body Bars + Scrubs Body Wipes + Pads Body Moisturizers + Lotions Hand Washes + Lotions Body Best Sellers Shampoos Conditioners Hair Styling Products Hair Brushes + Combs Hair Best Sellers 0 $50.00 away from free shipping $0.00 Subtotal Cart 100% Money-Back Guarantee Your Cart Tax (calculated in checkout) - Shipping (calculated in checkout) FREE Your Cart is Empty shop now SHAVING CREAMS + AFTERSHAVES Shaving Creams + Soaps Aftershave Balms + Splashes Shaving Irritation Relief Shaving Oils Shaving Best Sellers RAZORS, BRUSHES + TOOLS Safety Razors Straight Razors Razor Blades Shaving Brushes Shaving Accessories SHAVING SETS + GIFTS Shaving Kits Build-Your-Own Shaving Kit Shaving SHAVING CREAMS + AFTERSHAVES Shaving Creams + Soaps Aftershave Balms + Splashes Shaving Irritation Relief Shaving Oils Shaving Best Sellers RAZORS, BRUSHES + TOOLS Safety Razors Straight Razors Razor Blades Shaving Brushes Shaving Accessories SHAVING SETS + GIFTS Shaving Kits Build-Your-Own Shaving Kit CLEANSERS, SCRUBS + MASKS Face Washes Face Scrubs Acne + Oily Skin Solutions Face Masks Face Pads + Wipes Facial Toners Skin Tools Skin Best Sellers ANTI-AGING + MOISTURIZERS Face Moisturizers Eye Creams, Balms + Gels Anti-Aging Solutions Sun Screens + SPF Products Lip Balms + Mouth Products Best-Of Skincare Kits Skin CLEANSERS, SCRUBS + MASKS Face Washes Face Scrubs Acne + Oily Skin Solutions Face Masks Face Pads + Wipes Facial Toners Skin Tools Skin Best Sellers ANTI-AGING + MOISTURIZERS Face Moisturizers Eye Creams, Balms + Gels Anti-Aging Solutions Sun Screens + SPF Products Lip Balms + Mouth Products Best-Of Skincare Kits BODY WASHES, BARS + LOTIONS Body Washes + Shower Gels Body Bars + Scrubs Body Wipes + Pads Body Moisturizers + Lotions Hand Washes + Lotions Body Best Sellers DEODORANTS, POWDERS + FRAGRANCES Deodorants + Anti-Perspirants Body Powders Colognes + Fragrances BODY HAIR + NAIL TOOLS Body Hair Trimmers + Tools Nail Clippers, Nail Tools + Sets Tweezers Body BODY WASHES, BARS + LOTIONS Body Washes + Shower Gels Body Bars + Scrubs Body Wipes + Pads Body Moisturizers + Lotions Hand Washes + Lotions Body Best Sellers DEODORANTS, POWDERS + FRAGRANCES Deodorants + Anti-Perspirants Body Powders Colognes + Fragrances BODY HAIR + NAIL TOOLS Body Hair Trimmers + Tools Nail Clippers, Nail Tools + Sets Tweezers SHAMPOOS, CONDITIONERS + STYLING AIDS Shampoos Conditioners Hair Styling Products Hair Brushes + Combs Hair Best Sellers HAIR LOSS, DANDRUFF + HEAD SHAVING Hair Loss + Thinning Products Dandruff Treatments Head Shaving Products Hair SHAMPOOS, CONDITIONERS + STYLING AIDS Shampoos Conditioners Hair Styling Products Hair Brushes + Combs Hair Best Sellers HAIR LOSS, DANDRUFF + HEAD SHAVING Hair Loss + Thinning Products Dandruff Treatments Head Shaving Products BEARD WASHES, BALMS + OILS Beard Washes + Balms Beard Oils Beard Best Sellers BEARD TOOLS + KITS Beards Trimmers + Brushes Build-Your-Own Beard Kit Value-Added Beard Sets Beards BEARD WASHES, BALMS + OILS Beard Washes + Balms Beard Oils Beard Best Sellers BEARD TOOLS + KITS Beards Trimmers + Brushes Build-Your-Own Beard Kit Value-Added Beard Sets Grooming Lounge Products Shaving + Beard Care Body Care Shampoos, Conditioners + Styling Aids Skin Care Grooming Lounge Fragrances Grooming Lounge Products [hide] Kits + Gift Sets Pick 4 For Just $76 Our Best Sellers Pick Any Four For $76 Built in our Barbershops, not a Boardroom. All Grooming Lounge brand products are developed, tested and used daily in our luxury barbershops and spas. We guarantee you'll love 'em or your money back. Grooming Lounge Collection Grooming Lounge Products Shaving + Beard Care Body Care Shampoos, Conditioners + Styling Aids Skin Care Grooming Lounge Fragrances Grooming Lounge Products Kits + Gift Sets Pick 4 For Just $76 Our Best Sellers Pick Any Four For $76 Grooming lounge collection Brands A-Z MOST-POPULAR BRANDS Malin + Goetz Jack Black Anthony Urth NEWER BRANDS Dr. Squatch The Grey Patrick's Jaxon Lane Oars + Alps LUXURY BRANDS Acqua Di Parma Kiehl's Lab Series Murdock of London Truefitt & Hill NICELY PRICED BRANDS Proraso Billy Jealousy Duke Cannon 18.21 Man Made OUR BARBERS' FAVORITE BRANDS Grooming Lounge DS Laboratories Merkur Malin + Goetz Brands MOST-POPULAR BRANDS Malin + Goetz Jack Black Anthony Urth NEWER BRANDS Dr. Squatch The Grey Patrick's Jaxon Lane Oars + Alps LUXURY BRANDS Acqua Di Parma Kiehl's Lab Series Murdock of London Truefitt & Hill NICELY PRICED BRANDS Proraso Billy Jealousy Duke Cannon 18.21 Man Made OUR BARBERS' FAVORITE BRANDS Grooming Lounge DS Laboratories Merkur Malin + Goetz OFFERS & MORE Handsome Award Winners Best Sellers New Products Rewards Gift Cards Sale Items Deals+ OFFERS & MORE Handsome Award Winners Best Sellers New Products Rewards Gift Cards Sale Items DMV BARBERSHOP + SPA Location + Contact See Our Services Meet Our Professionals Schedule Online Buy Gift Cards Give Us A Call 703.288.0355 Barbershop + Spa DMV BARBERSHOP + SPA Location + Contact See Our Services Meet Our Professionals Schedule Online Buy Gift Cards Add description, images, menus and links to your mega menu A column with no settings can be used as a spacer Link to your collections, sales and even external links Add up to five columns Get In Touch Just reach out to the appropriate department with questions, comments or compliments. We're always happy to communicate with the people who keep us in business. Website Customer Service Email: [email protected] Phone: 866.456.8643 Hours: Mon-Fri 9 to 5 ET Tysons Corner, VA Store Email: [email protected] Phone: 703.288.0355 Tysons Galleria 1732 U International Drive McLean, VA 22102 LEARN MORE > Press and Media Inquiries Email: [email protected] Wholesale Inquiries Email: [email protected] Phone: 800.365.8522 Send Us A Note! Name This field is required. Email This field is required. Message Send Sign Up & Get 15% Right Now PROGRAMS Expert Advice Subscribe + Save Rewards Special Discounts Affiliate ABOUT US Our Story Barbershop + Spa Careers Blog HELP Contact Us/Customer Care FAQs Fast Shipping Policy Generous Return Policy Schedule A Barbershop + Spa Reservation Sign Up & Get 15% Right Now © 2023 Grooming Lounge . PRIVACY POLICY"
    },
    {
      "url": "https://www.lov3htx.com/contact",
      "text": "Contact LOV3 Houston - Get in Touch with Our Premier Lounge LOV3 HOUSTON Menu Weekly Signatures Private Events Gallery Learn About LOV3 Frequently Asked Questions Reservations Reservations Get in touch We at LOV3 Houston are always eager to hear from you. Whether you have feedback, need support, or have general inquiries, our team is here to assist. While we encourage event bookings through our dedicated events page, this contact form is your direct line to our staff for all other queries. Get in Touch Immediately For immediate assistance or specific inquiries, please use the contact details below. Our team is available to ensure your experience with us is seamless and enjoyable. General Inquiries For feedback, support requests, or general questions, please use the form below. We strive to respond promptly and appropriately to each inquiry. For event bookings, kindly visit our Events page for a more tailored experience. First Name Last Name Phone Email Message Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. FAQ GENERAL INFORMATION What are the club's operating hours? Our operating hours vary by night and event. Please check our website or contact us for the most up-to-date information on our hours of operation. Is there parking available at the club? Yes, we offer valet parking for our guests. There are also nearby parking lots available. Is there a smoking area available? Â Yes, we have designated smoking areas within the club. Can I bring my own bottle to the club? No, outside bottles and beverages are not allowed. All bottles must be purchased through our bottle service. Can I leave and re-enter the club? Re-entry policies vary depending on the event and club policies. Please check with the staff upon arrival for specific re-entry information. How can I join the guest list for an event? You can join the guest list for specific events by signing up on our website or by contacting our reservations team. RESERVATION ESSENTIALS How do I make a reservation? We recommend booking online through our website www.LOV3Htx.com or by contacting our reservations team via phone (346) 833-6892 What time should I arrive for my reservation? It's recommended to arrive at least 15 minutes before your reservation time to ensure a smooth entry. How does seating duration limits work? Seating duration for reservations are set during booking to accommodate peak periods. While we try to extend seat times, when possible, we may need to relocate parties during busy times. However, guests are not required to leave the venue if their seating time ends. They are welcome to stay and enjoy other areas of the venue. Can I extend my table reservation? Extensions may be possible depending on availability. Please speak with your hostess to arrange this. RESERVATION SERVICE & REQUIREMENTS What is included with my bottle service reservation? Bottle service includes a reserved table for the evening, a selection of bottles, mixers, a dedicated server, and VIP entry. Wristbands are provided and limited to the number of guests the table accommodates. Additional wristbands are available for purchase. â Do you offer shisha with bottle service? Shisha is available upon request. Please confirm its availability when making your reservation. How does the minimum spend work? Â The minimum spend refers to the amount you are required to spend on bottles and mixers during your reservation. For example, if the minimum spend is $1,000, this amount must be allocated to bottles and mixers only. Food, hookah, and other beverages do not count toward the minimum spend requirement. Is gratuity included in the bottle service? Yes, gratuity and taxes are typically included in the cost of the bottle service. What happens if I don't meet the minimum spend? If the minimum spend is not met, the remaining balance will be charged as a fee. Are there any additional fees I should be aware of? The minimum spend covers your bottles and services, but additional purchases and gratuity may apply. All applicable taxes and service charges will be included in your final bill. What forms of payment are accepted? We accept all major credit cards and cash payments. Do you offer any discounts for early bookings or special promotions? Occasionally, we offer special promotions and discounts for early bookings. Check our website or contact our reservations team for current offers. â RESERVATION ADD ONS Can I pre-order specific bottles? Yes, pre-ordering is available and recommended to ensure your preferred selection is in stock. â Can I customize my bottle selection? Yes, you can choose from a variety of bottles available on our menu. Custom packages and upgrades can also be arranged in advance during booking. Can I request a specific table location in the club? Table locations are subject to availability. While we will do our best to accommodate your preferences, specific table assignments cannot be guaranteed. Do you offer any special packages for birthdays or celebrations? Yes, we offer customizable packages for special occasions. Guests can select birthday upgrades online to access birthday party specials. Contact our reservations team for more details. What if I have a special request or need for my booking? We strive to accommodate all special requests. Please inform our reservations team of any specific needs or preferences when making your booking. Can I modify my reservation after it has been made? Yes, you can modify your reservation up to 48 hours in advance using the booking link provided in your confirmation email. For any changes made less than 48 hours before your reservation, please call or text our reservations team directly to discuss your options. â Can I order additional bottles during the night? Yes, you can order additional bottles and mixers throughout the night. VIPÂ BOOKING DETAILS Are there any additional perks with VIP reservations? VIP reservations include expedited entry, a dedicated service team and a secure area monitored by security staff. Is there a waitlist if VIP tables are fully booked? Yes, we do maintain a waitlist. If your preferred table is not available, we will notify you if there is a cancellation or if a table becomes available. Is a deposit required for booking a VIP table? Â Yes, a deposit is required to secure dinner reservations for parties of 7 or more. This deposit will be applied to your final check. For late-night reservations, a section fee is required; however, section fees are not applied toward bottle service minimums. Please note that deposits and section fees are non-refundable, non-transferable, and cannot be used for a future reservation if you need to cancel. What is the spend minimum required for a VIPÂ Table Booking? The minimum spend varies depending on the night, event, and table location. It typically ranges from $500 to $2,000. Is there a limit to the number of guests per VIP table? Each table has a maximum guest limit. Larger groups may need to book multiple tables. If parties exceed maximum limits, seating may not be available for all guests. Are there any age restrictions for VIP table bookings? We are a 21+ environment. All guests must be at least 21 years to enter at all times. What is the dress code for VIP areas? The dress code is fashionable and upscale. What is the cancellation policy for VIP table bookings? For Dinner & Brunch reservations, we kindly request that cancellations be made at least 24 hours in advance. Cancellations made less than 24 hours prior to your reservation, or no-shows, will incur a non-refundable cancellation fee of $25 per person. For Large Party reservations during dinner or brunch hours, cancellations must also be made at least 24 hours in advance. Please note that deposits are non-refundable, non-transferable, and cannot be applied to a future reservation. For Late-Night reservations, cancellations must be made at least 24 hours in advance. The section fee is non-refundable, non-transferable, and cannot be used for future bookings. â What is the policy for no-shows? If you do not show up for your reservation, you will be charged a $25 per person non-refundable cancellation fee. For both large party and late-night reservations, no-shows will result in the forfeiture of the deposit or section fee. PRIVATE EVENTS Can I make a reservation for a large party or corporate event? Yes, LOV3 Houston can accommodate large parties and corporate events. Please contact our event planning team for more details and to make arrangements. LOV3 HOUSTON LOV3 HOURS OF OPERATION â MON: CLOSED TUE - THU:Â 6PM - 12AM FRI - SAT: 6PM - 2AM SUNDAY: 12PM - 8PM RESERVED FOR GUESTS AGED 21+ STREET PARKING & VALET PARKING AVAILABLE LOV3 HOUSTON Menu Reservations Events &Â VIP Live Entertainment Contact Us About Reservations Get in touch We at LOV3 Houston are always eager to hear from you. Whether you have feedback, need support, or have general inquiries, our team is here to assist. While we encourage event bookings through our dedicated events page, this contact form is your direct line to our staff for all other queries. Contact Us We at LOV3 Houston are always eager to hear from you. Whether you have feedback, need support, or have general inquiries, our team is here to assist. While we encourage event bookings through our dedicated events page, this contact form is your direct line to our staff for all other queries. Get in Touch Immediately For immediate assistance or specific inquiries, please use the contact details below. Our team is available to ensure your experience with us is seamless and enjoyable. General Inquiries For feedback, support requests, or general questions, please use the form below. We strive to respond promptly and appropriately to each inquiry. For event bookings, kindly visit our Events page for a more tailored experience. First Name Last Name Phone Email Message Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. LOV3 HOUSTON LOV3 HOURS OF OPERATION â MON: CLOSED TUE - THU:Â 6PM - 12AM FRI - SAT: 6PM - 2AM SUNDAY: 12PM - 8PM RESERVED FOR GUESTS AGED 21+ STREET PARKING & VALET PARKING AVAILABLE"
    },
    {
      "url": "https://reviews.birdeye.com/pintos-lounge-146854842521152",
      "text": "Pinto's Lounge - 919 Reviews - Sports Bars in Titusville, FL - Birdeye Write a review For businesses Titusville, FL Restaurants Sports Bars Pinto's Lounge Claim this profile This profile has not been claimed by the business owner or representative. Claim this business to update business information, get appointment requests, engage visitors with web chat, and more! Pinto's Lounge Share business profile 4.4 919 reviews Sports Bars Titusville, FL Write a review About this business Restaurants Sports Bars Pinto's Lounge is a privately held company in Titusville, FL. Categorized under Cocktail Lounges. Our records show it was established in 2001. Location details Suggest edits 7555 US-1, Titusville, FL, 32780, United States Get directions Weekday Schedule Status Mon 9:00 a.m. to 6:00 p.m. Tue 9:00 a.m. to 6:00 p.m. Wed 9:00 a.m. to 6:00 p.m. Thu 9:00 a.m. to 6:00 p.m. Fri 9:00 a.m. to 6:00 p.m. Sat Closed Sun Closed 4.4 919 reviews Write a review Select a rating Facebook (259) Google (660) Birdeye (0) David Leighty on Facebook Recommended 4 years ago Kristy is one of the best day time bartenders 😁 have ever seen. Kate Orton Charbonneau on Facebook Recommended 4 years ago First time ... great venue for talent. Alex Martinez on Facebook Recommended 4 years ago Such a blast!! Rock n roll all the way!!! Bernadette Dunn Fitzpatrick on Facebook Recommended 4 years ago Great please to sign and play pool with friends Bj Rice on Facebook Recommended 5 years ago Great place great music great drinks Business response: Thank you B.J. Marc Giullari on Facebook Recommended 5 years ago Awesome people awesome food. Servers bartender warm and cordial. My kind of place. Highly recommend it. Tifftoocute Candi on Facebook Recommended 5 years ago this place is amazing!!! great atmosphere BEAUTIFUL bartenders!! nowhere better!!! Kim Padgett on Facebook Recommended 5 years ago First time here great little place everyone is friendly Amy the bartender Rocks good food and beautiful patio out back you should definitely check it out Eric Turner on Facebook Recommended 5 years ago Always a great, friendly crowd! A regular stop on our all day rides! 1 2 3 4 5 6 7 8 9 10 Frequently asked questions about Pinto's Lounge How is Pinto's Lounge rated? Pinto's Lounge has a 4.4 star rating with 919 reviews. When is Pinto's Lounge open? Pinto's Lounge is open now. It will close at 6:00 p.m. Browse nearby Healthcare Automotive Real estate Wellness Home services Consumer services Dental Legal Finance Contractors Retail Need help? Contact us. Speak with a specialist to learn how you can grow with Birdeye. We are reachable at profiles@birdeye.com Is this your business? Update business information, get appointment requests, engage visitors with web chat, and more! Claim this profile Business information Suggest edits 7555 US-1, Titusville, FL, 32780, United States Call us https://nanacat40.tripod.com/ Google Facebook Popular Restaurants resources Blog Strategies to do digital marketing for restaurants If you are looking for amazing techniques to market your restaurants only then this is your go-to blog. Read everything about digital marketing for restaurants. 15 min read Blog 6 tips for restaurant reputation management Online reputation of your business brings you more revenue. Learn about how to grow your reputation in this blog 15 min read Blog Review Sites for Restaurants, Bars, and Food Trucks Learn about these review sites for Restaurants and food industry 15 min read Popular in Titusville, FL Restaurants Fast Food Coffee & Tea Pizza Sandwiches American Bars Chicken Shop Ice Cream & Frozen Yogurt Bakeries More to explore Bars in Titusville, FL Birdeye for businesses Attract Listings Reviews Referrals Pages Google Seller Ratings Convert Webchat Social Appointments Mass Texting Payments Delight Messaging Surveys Insights Benchmarking Ticketing Platform BirdAI Analytics Integrations Google Partnership Birdeye Mobile App Solutions Small Business Enterprise Objectives Google for local business Review Management Review Generation Online Reputation Management Customer Messaging Referral Marketing Website Chat Google Reviews Google My Business Facebook Reviews Business Listings Management Customer Experience Social Media Management Industries Automotive Dental Financial Services Healthcare Home Services Legal Property Management Public Storage Real Estate Retail Wellness Learn more Company About Us Leadership Team Watch Demo Book a time Resources Blog Press Product Updates Careers Success Stories Birdeye Reviews Birdeye Results Legal Resources Contact Us Services Managed Services Professional Services Support and Tools Google Reviews Calculator AI Review Response Generator Google Review Link Generator Scan Your Business Find a Business For Developers Birdeye Support Refer a Business Customer Advocacy Program CONTACT SUPPORT Terms & Conditions Privacy Policy Security GDPR HIPAA CCPA Generative AI Policy © 2025 Birdeye Inc"
    },
    {
      "url": "https://pintowines.ie/about/",
      "text": "About Us - Pinto Wines Skip to content Instagram X Facebook All wines should be delivered within 3 working days. Call us if not or if it is urgent Search for: Home About Us Shop Countries Argentina Australia Austria Chile England France Georgia Germany Greece Hungary Italy Lebanon New Zealand Others countries Poland Portugal Slovakia South Africa Spain USA Regions Type Sparkles Dessert Wines Rosé Red Wine White Wine Organic Non-Alcohollic Grape Variety Our Suggestions Mixed Cases Pick of the week Gourmet Chocolate/Almonds Fish Conserves Olive Oil / Olives Sausages/Salami Wine Box Wine Events Wine Tastings Weddings & Events Gift Card Phisical Gift Voucher Virtual Gift Voucher Contact Us Wishlist My account Home About Us Shop Countries Argentina Australia Austria Chile England France Georgia Germany Greece Hungary Italy Lebanon New Zealand Others countries Poland Portugal Slovakia South Africa Spain USA Regions Type Sparkles Dessert Wines Rosé Red Wine White Wine Organic Non-Alcohollic Grape Variety Our Suggestions Mixed Cases Pick of the week Gourmet Chocolate/Almonds Fish Conserves Olive Oil / Olives Sausages/Salami Wine Box Wine Events Wine Tastings Weddings & Events Gift Card Phisical Gift Voucher Virtual Gift Voucher Contact Us Wishlist My account Search for: About Us james_f99n87c5 2023-11-03T14:40:54+00:00 Who We Are and What We're About Pinto Wines aims to bring a European, old world feel to Drumcondra Village. Customers will be able to browse for a quality bottle of wine, at a competitive price from a wide selection of regions and grapes not found in your average supermarket or off license. This shop came about when the owner Roger moved to Drumcondra with his family and set about searching for the closest wine shop, only to find that Drumcondra village was lacking on this front. With his many years' experience working in hospitality and restaurants and his passion for wine, he took the plunge and decided to heroically close the gap in that market and here we are! Every bottle of wine that is on offer will have been painstakingly selected and reviewed to ensure that you only buy quality wines at whatever your price range might be. This range and selection will be reflected in our online store. Pinto Wines aims to provide the personal touch, with the proprietor Roger Da Silva available to provide in house guidance, adapting to the customers budget and tastes. We will cater to everyone from the wine lovers and experts to the unacquainted and curious. Follow us Sale! View Cart Add to basket Details Dr Bruno Herdade Rocim Baga , Bairrada , Portugal , Red Wine , Sales , Vegan € 32.00 Original price was: €32.00. € 30.00 Current price is: €30.00. View Cart Add to basket Details MOB Lote 3 Red Alfrocheiro , Dão , Jaen , Organic , Portugal , Red Wine , Sales , Touriga Nacional , Value For Money , Vegan € 20.00 Sale! View Cart Add to basket Details Susumaniello “I Pastini” Verso Sud Biodynamic , Italy , Organic , Puglia , Red Wine , Sales , Susumaniello , Vegan € 25.00 Original price was: €25.00. € 23.00 Current price is: €23.00. Follow Us 155 Lower Drumcondra Road, Drumcondra,D09 PF85 Dublin Phone: 01 444 56 83 Email: info@pintowines.ie Opening Hours Monday: 12-21 Tuesday: 12-21 Wednesday: 12-21:30 Thursday: 12-22:00 Friday: 12-22:00 Saturday: 12-22:00 Sunday: 12-21 Our Wines Red Wine White Wine Sparkles Dessert Wines Rosé By Country By Region By Grape Other Links About Us Cart Contact Us Home Page Our Gourmet Terms & Conditions Privacy Statement Our blog / Media / Facts and Team Visits Our blog / Media / Facts and Team Visits Select Category Blog Fact and team visits Media ©Copyright Pinto Wines | All Rights Reserved | Powered by Pinto wines | IT support: Mario Catarrunas Instagram X Facebook Page load link error: Content is protected !! Go to Top"
    },
    {
      "url": "https://www.tripodpartners.com/contact-us/",
      "text": "Contact Us | Tripod Partners  Jobs  Send CV  Register  Contact Us Job Search Candidates Clients Career Advice Send CV Refer a Friend Recruitment Services Temporary Permanent Assessment Solutions Fill a Vacancy Allied Health Jobs Social Work Jobs Nursing Jobs Adults Achieving Best Evidence Adolescents Adoption Adult Safeguarding Aged Care Asylum Best Interest Assessments Care Plans Care Proceedings Children's Child Protection Child Protection Chair Children In Need LAC Reviews Chair Learning Disabilities Looked After Children MASH Mental Health Older Persons Referral & Assessment View All Social Work Jobs CV Tips Interview Advice Allied Healthcare Articles Social Work Articles Nursing Articles Biomedical Science Neurology Occupational Therapy Orthopaedics Oncology Pharmacy Physiotherapy Psychology Radiography Radiotherapy Rehabilitation Speech & Language Therapy Sonography View All Allied Health Jobs Clinical Psychologist Clinical Lead Counter Terrorism Cleared Intensive Care Unit Midwifery Midwifery - Labour Midwifery - Neo Natal Midwifery - Post Natal Operating Department Practitioner Primary Care Prison Cleared Psychological Assessment Substance Misuse IDTS Surgical First Assistant Surgical Ward Theatre Wards View All Nursing Jobs Adults & Children's Allied Healthcare Recruitment Services We’ve been specialising within the public and private healthcare sector for more than a decade, sourcing top-tier talent and providing our clients with continuous support throughout the recruitment process. Our Expertise Recruitment Process Outsourcing Managed Service Provider Specialist Assessment Solutions International Recruitment Public Sector Private Sector Locum Permanent Allied Healthcare Social Work Nursing Social Work Jobs View All Social Work Jobs Adults ABE (Achieving Best Evidence) Adolescents Adoption Adult Safeguarding Aged Care Asylum Best Interest Assessor Care Plans Care Proceedings Children’s Child Protection Child Protection Conference Chair Children In Need LAC (Look After Children) Reviews Chair Learning Disabilities Looked After Children MASH (Multi Agency Safeguarding Hub) Mental Health Older Persons Referral and Assessment Allied Health Jobs All Allied Health Jobs Biomedical Science Neurology Occupational Therapy Oncology Orthopaedics Pharmacy Physiotherapy Psychology Radiography Radiotherapy Rehabilitation Speech & Language Therapy Sonography Nursing Jobs View All Nursing Jobs Clinical Lead Clinical Psychology CTC (Counter Terrorism Cleared) ITU (Intensive care unit) Midwifery Midwifery – Labour Midwifery – Post Natal Primary Care Prison Cleared Psychological Assessment Substance Misuse/IDTS Surgical First Assistant Surgical Ward Theatre Practitioner/ODP Wards Prisons Jobs Clients Recruitment Services Permanent Hire Temporary Hire Assessment Solutions – Allied Healthcare – Adults and Children’s Refer a Friend Send CV Contact Us Home » Contact Us Candidates Make your move. Register with us, share your CV, and discover exclusive roles that align with your ambitions. Search for Jobs Submit your CV Register with Us Clients Unlock access to top-tier professionals. Collaborate with our expert consultants to build the high-performing team your business needs. Request a Call Back Submit a Vacancy Candidates Job Search Send CV Refer a Friend Career Advice Contact Us Social Work Jobs Achieving Best Evidence Adolescents Adoption Adult Safeguarding Aged Care Asylum Best Interest Assessments Care Plans Care Proceedings Children's Children In Need Child Protection Chair LAC Reviews Chair Learning Disabilities Looked After Children Multi Agency Safeguarding Hubs (MASH) Mental Health Older Persons Referral & Assessment Allied Health Jobs Biomedical Science Neurology Occupational Therapy Orthopaedics Oncology Pharmacy Physiotherapy Psychologist Radiography Radiotherapy Rehabilitation Speech & Language Therapy Sonography Nursing Jobs Clinical Psychologist Clinical Lead Counter Terrorism Cleared Intensive Care Unit Midwifery Midwifery - Labour Midwifery - Neo Natal Midwifery - Post Natal Operating Department Practitioner Primary Care Prison Cleared Psychological Assessment Substance Misuse IDTS Surgical First Assistant Surgical Ward Theatre / Scrub Clients Request Callback Fill a Vacancy Temporary Recruitment Permanent Recruitment Children's & Adults Assessments Allied Healthcare Assessments Legal | Privacy Policy | Terms & Conditions | Cookie Policy | Modern Slavery Policy | Modern Slavery Statement © 2025 Tripod Partners | Registered in England and Wales (No. Number 8230012) | VAT No. 145000955"
    }
  ]
}