{
  "fuentes": [
    {
      "url": "https://www.stpetepartnership.org/meet-the-spdp-team",
      "email": "shaun@stpetepartnership.org"
    },
    {
      "url": "https://www.stpetepartnership.org/meet-the-spdp-team",
      "email": "eric@stpetepartnership.org"
    },
    {
      "url": "https://www.stpetepartnership.org/meet-the-spdp-team",
      "email": "jason@stpetepartnership.org"
    },
    {
      "url": "https://www.stpetepartnership.org/meet-the-spdp-team",
      "email": "nicole@stpetepartnership.org"
    },
    {
      "url": "https://www.stpetepartnership.org/about/staff",
      "email": "shaun@stpetepartnership.org"
    },
    {
      "url": "https://www.stpetepartnership.org/about/staff",
      "email": "eric@stpetepartnership.org"
    },
    {
      "url": "https://www.stpetepartnership.org/about/staff",
      "email": "jason@stpetepartnership.org"
    },
    {
      "url": "https://www.stpetepartnership.org/about/staff",
      "email": "nicole@stpetepartnership.org"
    }
  ],
  "mails": [
    "eric@stpetepartnership.org",
    "jason@stpetepartnership.org",
    "nicole@stpetepartnership.org",
    "shaun@stpetepartnership.org"
  ],
  "nombre_sitio": "trolleypub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.stpetepartnership.org/meet-the-spdp-team",
      "text": "Our Team | St. Pete Downtown Partnership By clicking “Accept All Cookies” , you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. View our Privacy Policy for more information. Preferences Deny Accept Privacy Preference Center When you visit websites, they may store or retrieve data in your browser. This storage is often necessary for the basic functionality of the website. The storage may be used for marketing, analytics, and personalization of the site, such as storing your preferences. Privacy is important to us, so you have the option of disabling certain types of storage that may not be necessary for the basic functioning of the website. Blocking categories may impact your experience on the website. Reject all cookies Allow all cookies Manage Consent Preferences by Category Essential Always Active These items are required to enable basic website functionality. Marketing Essential These items are used to deliver advertising that is more relevant to you and your interests. They may also be used to limit the number of times you see an advertisement and measure the effectiveness of advertising campaigns. Advertising networks usually place them with the website operator’s permission. Personalization Essential These items allow the website to remember choices you make (such as your user name, language, or the region you are in) and provide enhanced, more personal features. For example, a website may provide you with local weather reports or traffic news by storing data about your current location. Analytics Essential These items help the website operator understand how its website performs, how visitors interact with the site, and whether there may be technical issues. This storage type usually doesn’t collect information that identifies a visitor. Confirm my preferences and close About Projects News Events Membership Resources Contact Join The Partnership Team staff board members Left to Right: Jason Mathis, CEO • Wendy Giffin, Chair • Mack Feldman, Vice Chair Our Staff JASON MATHIS CEO Jason Mathis is the CEO of the St. Petersburg Downtown Partnership, a private, nonprofit organization dedicated to thoughtful growth and urban redevelopment. The Partnership focuses on big-picture issues and works to form a shared vision for St. Pete’s future – inspired by global thought leadership, national best practices, and local sensibilities. Jason Mathis is the CEO of the St. Petersburg Downtown Partnership, a private, nonprofit organization dedicated to thoughtful growth and urban redevelopment. The Partnership focuses on big-picture issues and works to form a shared vision for St. Pete’s future – inspired by global thought leadership, national best practices, and local sensibilities. Key priorities include enhanced walkability, urban management, resiliency, housing for all income levels and a balanced approach to economically sustainable development. Jason has a long history in nonprofit management and urban development. His professional experience spans three decades in coalition building, public policy, and advocacy. Jason has a strong record of advancing high-profile issues in complex public settings and he excels as uniting diverse stakeholders around a common vision. In addition to his work with the Partnership, Jason also serves in board leadership positions at the St. Petersburg Innovation District and St. Petersburg Arts Alliance. Jason was part of the 2019 cohort for the Bloomberg Harvard City Leadership Initiative and currently serves as a member of the Community Benefits Advisory Committee for the City of St. Petersburg. Jason was an inaugural Emerging Leaders Fellow with the International Downtown Association and currently serves on the national Urban Land Institute’s Public Private Partnership Product Council. He also founded Florida’s Downtowns, a coalition of business improvement districts, downtown development authorities, and other organizations and entities focused on the management and enhancement of downtowns and other urban districts throughout Florida. Jason received the Haynes Hero Award from the Pinellas County Urban League in 2023 and the University of South Florida’s Distinguished Citizen Award in 2024. Tampa Bay Business Journal listed Jason in their 2025 Power Rankings as one of the 100 most influential leaders in Tampa Bay. From 2008 until August 2018, Jason served as the executive director of the Salt Lake City’s Downtown Alliance and executive vice president of the Salt Lake Chamber, where he directed the city’s urban management efforts. He has also worked in media relations and marketing efforts for health care organizations and in the travel, ski, and convention industries. ‍ ‍ READ MORE READ Less jason@stpetepartnership.org 727.220.6920 download headshot SHAUN DRINKARD VICE PRESIDENT Shaun Drinkard, LPM, is the Vice President of the St. Petersburg Downtown Partnership, where he leads the planning, implementation, and operation of the St. Petersburg Downtown Improvement District. In this role, he oversees stakeholder engagement, capital improvements, and programming for key public spaces such as Williams Park and Central Avenue. His work supports the organization’s broader mission to enhance economic vitality and elevate the downtown experience for residents, businesses, and visitors. Shaun Drinkard, LPM, is the Vice President of the St. Petersburg Downtown Partnership, where he leads the planning, implementation, and operation of the St. Petersburg Downtown Improvement District. In this role, he oversees stakeholder engagement, capital improvements, and programming for key public spaces such as Williams Park and Central Avenue. His work supports the organization’s broader mission to enhance economic vitality and elevate the downtown experience for residents, businesses, and visitors. Drinkard brings nearly 20 years of experience in urban place management, most recently serving as Senior Vice President of Public Programming and Operations at the Tampa Downtown Partnership. There, he played a pivotal role in shaping Tampa’s nationally recognized Special Services District, leading efforts that included the clean and safe programs, signature public space programs, and the development of the organizations first in-house transit operations. He also founded the organization’s Homeless Liaison program, recognized as a model of compassionate urban management. Previously, Shaun served as Director of Placemaking and as Executive Director of the Friends of the Riverwalk from 2013 to 2017. Earlier in his career, he worked as a landscape designer with WilsonMiller/Stantec’s Urban Design Studio on projects including the Channel District Strategic Action Plan and award-winning public spaces in Tampa and St. Petersburg. He holds a Bachelor of Landscape Architecture from Louisiana State University and was selected for the International Downtown Association’s (IDA) prestigious Emerging Leaders Fellowship Program in 2017. He is a certified Leader in Place Management and currently serves on the IDA Board of Directors. Shaun has remained active in the local arts and community, previously serving as Chair of the Gasparilla Festival of the Arts. A longtime resident of St. Petersburg, Shaun enjoys all St. Pete has to offer with his wife Carolyn, a high school math teacher, and their twin boys. ‍ READ MORE READ Less Shaun@StPetePartnership.org (813) 382-6978 download headshot ERIC CARLSON TRANSPORTATION DIRECTOR Since 1995, Eric has been the Transportation Director for the St. Petersburg Downtown Partnership. He is the administrator for the Looper downtown trolley, overseeing their fixed route service, shuttles to major events, and private charters for special occasions. He’s helped grow Trolley use 99% from last year. Since 1995, Eric has been the Transportation Director for the St. Petersburg Downtown Partnership. He is the administrator for the Looper downtown trolley, overseeing their fixed route service, shuttles to major events, and private charters for special occasions. He’s helped grow Trolley use 99% from last year. He began his transportation career in 1993 as the Director of Marketing for Bay Area Commuter Services in Tampa. This newly formed non-profit was designed to assist commuters with alternatives to driving to work alone. As a member of the Association for Commuter Transportation (ACT) since 1993, Eric has served as the co-chair of several regional and national conferences,  served two terms as the ACT SouthEast Chapter Treasurer, and one term as the ACT National Treasurer. READ MORE READ Less eric@stpetepartnership.org 727.821.5166 download headshot NICOLE ROBERTS DIRECTOR OF COMMUNITY ENGAGEMENTS While attending the University of South Florida St. Petersburg to receive their Bachelor of Science in Marketing with a minor in Psychology, Nicole Roberts fell in love with Downtown St. Petersburg. After graduating, they joined the St. Petersburg Downtown Partnership to help our downtown grow while maintaining the same vibe that made them fall in love with this place to begin with. While attending the University of South Florida St. Petersburg to receive their Bachelor of Science in Marketing with a minor in Psychology, Nicole Roberts fell in love with Downtown St. Petersburg. After graduating, they joined the St. Petersburg Downtown Partnership to help our downtown grow while maintaining the same vibe that made them fall in love with this place to begin with. Their main focus is on the Car-Free St. Pete initiative, a movement to encourage locals to use all the amazing alternative transportation options available in Downtown St. Pete. Nicole served as the lead organizer in 2021 of the first Halloween on Central, a now annual event where Central Avenue is closed to cars to allow the community to enjoy the heart of our city from a different perspective. They are a member of the Leadership St. Pete® Class of 2021, completing one of the oldest leadership programs in America, designed to develop community leaders through an intensive six-month experience. In 2022, they joined the APA Sun Coast Board as the Communications Officer. READ MORE READ Less nicole@stpetepartnership.org 321.482.0314 download headshot Our Board Members EXECUTIVE COMMITTEE WENDY GIFFIN Chair Cushman & Wakefield MACK FELDMAN Vice-Chair Feldman Equities BARCLAY HARLESS Immediate Past Chair Valley Bank MARCUS BROOKS Foundation for a Healthy St. Pete BEN DIAMOND The Diamond Law Firm, P.A. CODY LECLAIR Echelon TRACY MAETER JP Morgan MATTHEW WALKER Bandes Construction BOARD MEMBERS KELLEN CARTER Ark Invest IRV COHEN Innovations Capital WILL CONROY Backstreets Capital BILL EDWARDS The Edwards Group NIKKI GASKIN-CAPEHART Pinellas County Urban League BOB GLASER Smith & Associates KEVIN GLENN The NRP Group CHRISTIAN HARDIGREE University of South Florida, St. Petersburg DR. ALEX HARRIS ACT JEFF HEARN Raymond James KENNETH W. HERETICK Vector Commercial Real Estate Services ROB KAPUSTA Battaglia, Ross, Dicus & McQuaid HELEN LEVINE Corcoran Partners CHUCK PRATHER The Birchwood TODD RADOSEVICH Orlando Health MELISSA RUTLAND The Rutland Group ALEX SCHAPIRA Hines MELISSA SEIXAS Duke Energy DAWN SHIRREFFS Environmental Defense Fund JOHN STADLER Stadler Development JESSE TURTLE St. Petersburg College Foundation LISA WANNEMACHER Wannemacher Jensen JARRETT WOLFE SmartChoice DENISE YOUNG Turner Construction BOB ZORN Red Apple Group EX-OFFICIO DAVID BRETT Urban Cottages, Inc. JAMES CORBETT City of St. Petersburg DR. CYNTHIA JOHNSON Pinellas County Tell me more about spdp Join our newsletter to stay up to date on events and news. Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. By subscribing you agree with our Privacy Policy and provide consent to receive updates from our company. About SPDP Membership The Partnership Team Resources Projects Downtown Guide News Affordable Housing Events Contact Follow Us Twitter icon Facebook icon Instagram icon LinkedIn icon Copyright 2025 St. Petersburg Downtown Partnership. All rights reserved. Privacy Policy Terms and Conditions"
    },
    {
      "url": "https://www.stpetepartnership.org/about/staff",
      "text": "Our Team | St. Pete Downtown Partnership By clicking “Accept All Cookies” , you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and assist in our marketing efforts. View our Privacy Policy for more information. Preferences Deny Accept Privacy Preference Center When you visit websites, they may store or retrieve data in your browser. This storage is often necessary for the basic functionality of the website. The storage may be used for marketing, analytics, and personalization of the site, such as storing your preferences. Privacy is important to us, so you have the option of disabling certain types of storage that may not be necessary for the basic functioning of the website. Blocking categories may impact your experience on the website. Reject all cookies Allow all cookies Manage Consent Preferences by Category Essential Always Active These items are required to enable basic website functionality. Marketing Essential These items are used to deliver advertising that is more relevant to you and your interests. They may also be used to limit the number of times you see an advertisement and measure the effectiveness of advertising campaigns. Advertising networks usually place them with the website operator’s permission. Personalization Essential These items allow the website to remember choices you make (such as your user name, language, or the region you are in) and provide enhanced, more personal features. For example, a website may provide you with local weather reports or traffic news by storing data about your current location. Analytics Essential These items help the website operator understand how its website performs, how visitors interact with the site, and whether there may be technical issues. This storage type usually doesn’t collect information that identifies a visitor. Confirm my preferences and close About Projects News Events Membership Resources Contact Join The Partnership Team staff board members Left to Right: Jason Mathis, CEO • Wendy Giffin, Chair • Mack Feldman, Vice Chair Our Staff JASON MATHIS CEO Jason Mathis is the CEO of the St. Petersburg Downtown Partnership, a private, nonprofit organization dedicated to thoughtful growth and urban redevelopment. The Partnership focuses on big-picture issues and works to form a shared vision for St. Pete’s future – inspired by global thought leadership, national best practices, and local sensibilities. Jason Mathis is the CEO of the St. Petersburg Downtown Partnership, a private, nonprofit organization dedicated to thoughtful growth and urban redevelopment. The Partnership focuses on big-picture issues and works to form a shared vision for St. Pete’s future – inspired by global thought leadership, national best practices, and local sensibilities. Key priorities include enhanced walkability, urban management, resiliency, housing for all income levels and a balanced approach to economically sustainable development. Jason has a long history in nonprofit management and urban development. His professional experience spans three decades in coalition building, public policy, and advocacy. Jason has a strong record of advancing high-profile issues in complex public settings and he excels as uniting diverse stakeholders around a common vision. In addition to his work with the Partnership, Jason also serves in board leadership positions at the St. Petersburg Innovation District and St. Petersburg Arts Alliance. Jason was part of the 2019 cohort for the Bloomberg Harvard City Leadership Initiative and currently serves as a member of the Community Benefits Advisory Committee for the City of St. Petersburg. Jason was an inaugural Emerging Leaders Fellow with the International Downtown Association and currently serves on the national Urban Land Institute’s Public Private Partnership Product Council. He also founded Florida’s Downtowns, a coalition of business improvement districts, downtown development authorities, and other organizations and entities focused on the management and enhancement of downtowns and other urban districts throughout Florida. Jason received the Haynes Hero Award from the Pinellas County Urban League in 2023 and the University of South Florida’s Distinguished Citizen Award in 2024. Tampa Bay Business Journal listed Jason in their 2025 Power Rankings as one of the 100 most influential leaders in Tampa Bay. From 2008 until August 2018, Jason served as the executive director of the Salt Lake City’s Downtown Alliance and executive vice president of the Salt Lake Chamber, where he directed the city’s urban management efforts. He has also worked in media relations and marketing efforts for health care organizations and in the travel, ski, and convention industries. ‍ ‍ READ MORE READ Less jason@stpetepartnership.org 727.220.6920 download headshot SHAUN DRINKARD VICE PRESIDENT Shaun Drinkard, LPM, is the Vice President of the St. Petersburg Downtown Partnership, where he leads the planning, implementation, and operation of the St. Petersburg Downtown Improvement District. In this role, he oversees stakeholder engagement, capital improvements, and programming for key public spaces such as Williams Park and Central Avenue. His work supports the organization’s broader mission to enhance economic vitality and elevate the downtown experience for residents, businesses, and visitors. Shaun Drinkard, LPM, is the Vice President of the St. Petersburg Downtown Partnership, where he leads the planning, implementation, and operation of the St. Petersburg Downtown Improvement District. In this role, he oversees stakeholder engagement, capital improvements, and programming for key public spaces such as Williams Park and Central Avenue. His work supports the organization’s broader mission to enhance economic vitality and elevate the downtown experience for residents, businesses, and visitors. Drinkard brings nearly 20 years of experience in urban place management, most recently serving as Senior Vice President of Public Programming and Operations at the Tampa Downtown Partnership. There, he played a pivotal role in shaping Tampa’s nationally recognized Special Services District, leading efforts that included the clean and safe programs, signature public space programs, and the development of the organizations first in-house transit operations. He also founded the organization’s Homeless Liaison program, recognized as a model of compassionate urban management. Previously, Shaun served as Director of Placemaking and as Executive Director of the Friends of the Riverwalk from 2013 to 2017. Earlier in his career, he worked as a landscape designer with WilsonMiller/Stantec’s Urban Design Studio on projects including the Channel District Strategic Action Plan and award-winning public spaces in Tampa and St. Petersburg. He holds a Bachelor of Landscape Architecture from Louisiana State University and was selected for the International Downtown Association’s (IDA) prestigious Emerging Leaders Fellowship Program in 2017. He is a certified Leader in Place Management and currently serves on the IDA Board of Directors. Shaun has remained active in the local arts and community, previously serving as Chair of the Gasparilla Festival of the Arts. A longtime resident of St. Petersburg, Shaun enjoys all St. Pete has to offer with his wife Carolyn, a high school math teacher, and their twin boys. ‍ READ MORE READ Less Shaun@StPetePartnership.org (813) 382-6978 download headshot ERIC CARLSON TRANSPORTATION DIRECTOR Since 1995, Eric has been the Transportation Director for the St. Petersburg Downtown Partnership. He is the administrator for the Looper downtown trolley, overseeing their fixed route service, shuttles to major events, and private charters for special occasions. He’s helped grow Trolley use 99% from last year. Since 1995, Eric has been the Transportation Director for the St. Petersburg Downtown Partnership. He is the administrator for the Looper downtown trolley, overseeing their fixed route service, shuttles to major events, and private charters for special occasions. He’s helped grow Trolley use 99% from last year. He began his transportation career in 1993 as the Director of Marketing for Bay Area Commuter Services in Tampa. This newly formed non-profit was designed to assist commuters with alternatives to driving to work alone. As a member of the Association for Commuter Transportation (ACT) since 1993, Eric has served as the co-chair of several regional and national conferences,  served two terms as the ACT SouthEast Chapter Treasurer, and one term as the ACT National Treasurer. READ MORE READ Less eric@stpetepartnership.org 727.821.5166 download headshot NICOLE ROBERTS DIRECTOR OF COMMUNITY ENGAGEMENTS While attending the University of South Florida St. Petersburg to receive their Bachelor of Science in Marketing with a minor in Psychology, Nicole Roberts fell in love with Downtown St. Petersburg. After graduating, they joined the St. Petersburg Downtown Partnership to help our downtown grow while maintaining the same vibe that made them fall in love with this place to begin with. While attending the University of South Florida St. Petersburg to receive their Bachelor of Science in Marketing with a minor in Psychology, Nicole Roberts fell in love with Downtown St. Petersburg. After graduating, they joined the St. Petersburg Downtown Partnership to help our downtown grow while maintaining the same vibe that made them fall in love with this place to begin with. Their main focus is on the Car-Free St. Pete initiative, a movement to encourage locals to use all the amazing alternative transportation options available in Downtown St. Pete. Nicole served as the lead organizer in 2021 of the first Halloween on Central, a now annual event where Central Avenue is closed to cars to allow the community to enjoy the heart of our city from a different perspective. They are a member of the Leadership St. Pete® Class of 2021, completing one of the oldest leadership programs in America, designed to develop community leaders through an intensive six-month experience. In 2022, they joined the APA Sun Coast Board as the Communications Officer. READ MORE READ Less nicole@stpetepartnership.org 321.482.0314 download headshot Our Board Members EXECUTIVE COMMITTEE WENDY GIFFIN Chair Cushman & Wakefield MACK FELDMAN Vice-Chair Feldman Equities BARCLAY HARLESS Immediate Past Chair Valley Bank MARCUS BROOKS Foundation for a Healthy St. Pete BEN DIAMOND The Diamond Law Firm, P.A. CODY LECLAIR Echelon TRACY MAETER JP Morgan MATTHEW WALKER Bandes Construction BOARD MEMBERS KELLEN CARTER Ark Invest IRV COHEN Innovations Capital WILL CONROY Backstreets Capital BILL EDWARDS The Edwards Group NIKKI GASKIN-CAPEHART Pinellas County Urban League BOB GLASER Smith & Associates KEVIN GLENN The NRP Group CHRISTIAN HARDIGREE University of South Florida, St. Petersburg DR. ALEX HARRIS ACT JEFF HEARN Raymond James KENNETH W. HERETICK Vector Commercial Real Estate Services ROB KAPUSTA Battaglia, Ross, Dicus & McQuaid HELEN LEVINE Corcoran Partners CHUCK PRATHER The Birchwood TODD RADOSEVICH Orlando Health MELISSA RUTLAND The Rutland Group ALEX SCHAPIRA Hines MELISSA SEIXAS Duke Energy DAWN SHIRREFFS Environmental Defense Fund JOHN STADLER Stadler Development JESSE TURTLE St. Petersburg College Foundation LISA WANNEMACHER Wannemacher Jensen JARRETT WOLFE SmartChoice DENISE YOUNG Turner Construction BOB ZORN Red Apple Group EX-OFFICIO DAVID BRETT Urban Cottages, Inc. JAMES CORBETT City of St. Petersburg DR. CYNTHIA JOHNSON Pinellas County Tell me more about spdp Join our newsletter to stay up to date on events and news. Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. By subscribing you agree with our Privacy Policy and provide consent to receive updates from our company. About SPDP Membership The Partnership Team Resources Projects Downtown Guide News Affordable Housing Events Contact Follow Us Twitter icon Facebook icon Instagram icon LinkedIn icon Copyright 2025 St. Petersburg Downtown Partnership. All rights reserved. Privacy Policy Terms and Conditions"
    }
  ]
}