{
  "fuentes": [
    {
      "url": "https://tulumws.com/about-us/",
      "email": "restaurant@tulumws.com"
    },
    {
      "url": "https://tulumprime.com/",
      "email": "info@tulumprime.com"
    },
    {
      "url": "https://tulumhotelmiamor.com/restaurant-bar/",
      "email": "concierge.miamor@colibriboutiquehotels.com"
    },
    {
      "url": "https://tulumprime.com/event/wekendbrnch2ndsun/",
      "email": "info@tulumprime.com"
    },
    {
      "url": "https://palmillarestaurant.com/",
      "email": "reservations@palmillahb.com"
    },
    {
      "url": "https://palmillarestaurant.com/",
      "email": "nbreservations@palmillarestaurant.com"
    },
    {
      "url": "https://tulumprime.com/careers/",
      "email": "info@tulumprime.com"
    },
    {
      "url": "https://tulumprime.com/careers/",
      "email": "hr@tulumprime.com"
    },
    {
      "url": "https://tulumprime.com/custom-catering/",
      "email": "info@tulumprime.com"
    },
    {
      "url": "https://tulumprime.com/event/tulumdriftday2/",
      "email": "info@tulumprime.com"
    },
    {
      "url": "https://www.kateenla.com/",
      "email": "press@kateenla.com"
    },
    {
      "url": "https://www.kateenla.com/",
      "email": "reservations@kateenla.com"
    },
    {
      "url": "https://tulumprime.com/reviews/",
      "email": "info@tulumprime.com"
    },
    {
      "url": "https://tulumprime.com/private-events/",
      "email": "info@tulumprime.com"
    }
  ],
  "mails": [
    "concierge.miamor@colibriboutiquehotels.com",
    "hr@tulumprime.com",
    "info@tulumprime.com",
    "nbreservations@palmillarestaurant.com",
    "press@kateenla.com",
    "reservations@kateenla.com",
    "reservations@palmillahb.com",
    "restaurant@tulumws.com"
  ],
  "nombre_sitio": "tulumprime.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://tulumws.com/about-us/",
      "text": "About Us – Tulum Skip to content Home About Us Food Menu Lunch Menu Bar Menu Contact Us Home About Us Food Menu Lunch Menu Bar Menu Contact Us Order Now: +1 336.448.5486 Menu About Home About Modern Mexican restaurant in Winston Salem Tulum Bar & Grill is a center of countless authentic gastronomic experiences, a place full of flavors, aromas, elegance, tradition, and unique spaces designed for all occasions. We are a concept inspired by the beauty, the beaches, and the atmosphere of the wonderful beaches of Tulum in Mexico, where magical and unique stories take place, which can only happen in places as special as this one. Tulum Bar & Grill New experience in mexican cuisine Food For You Let yourself be carried away by the unique flavors of our menu, created by Mexicans and carefully thought out on the palate and the typical flavors of true Mexican cuisine. Quality Ingredients Taste Driven Best Receipts Special Cuisine El lugar de los sabores que hacen viajar a México Real Taste Of Mexico Restaurant 411 N Cherry St Winston-Salem, NC 27101 +1 336.448.5486 Authentic Mexican Cuisine The taste of food and the beauty of Tulum beach in one place Restaurant 411 N Cherry St Winston-Salem, NC 27101 +1 336.448.5486 Authentic Mexican Cuisine The taste of food and the beauty of Tulum beach in one place Jki-facebook-light Envelope Phone-alt Jki-instagram-1-light Yelp TULUM Bar & Grill Copyright © 2024 · All Rights Reserved By Decals Performance EN ES EN"
    },
    {
      "url": "https://tulumprime.com/",
      "text": "Tulum Prime Tequila Lounge & Restaurant | Coral Springs, FL Skip to content HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO Menu HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO BOOK A TABLE BOOK A TABLE HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO Menu HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO RESERVATIONS The Prime Experience EVENTS Introducing Tulum Prime , The Prime Experience , where luxury meets Latin influences culinary excellence. Our tequila lounge and restaurant blend opulence with authentic flavors, offering a sensory journey through the rich tapestry of Latin American cuisine. Immerse yourself in an ambience that captures the essence of Latin America’s vibrant culture, while savoring meticulously crafted dishes and extensive selection of premium tequilas. With our reserve collection of over 100 tequilas and mezcals, we can make over 5,700,000 possible margarita combinations. Welcome to a haven, where every detail reflects our commitment to delivering a luxurious, fun, and unforgettable dining experience. VIEW MENU Introducing Tulum Prime , The Prime Experience , where luxury meets Mexican culinary excellence. Our tequila lounge and restaurant blend opulence with authentic flavors, offering a sensory journey through the rich tapestry of Mexican cuisine. Immerse yourself in an ambience that captures the essence of Mexico’s vibrant culture, while savoring meticulously crafted dishes and extensive selection of premium tequilas. With our reserve collection of over 100 tequilas and mezcals, we can make over 5,700,000 possible tequila combinations. Welcome to a haven where every detail reflects our commitment to delivering a luxurious, fun, and unforgettable dining experience. VIEW MENU Introducing Tulum Prime , The Prime Experience , where luxury meets Mexican culinary excellence. Our tequila lounge and restaurant blend opulence with authentic flavors, offering a sensory journey through the rich tapestry of Mexican cuisine. Immerse yourself in an ambience that captures the essence of Mexico’s vibrant culture, while savoring meticulously crafted dishes and extensive selection of premium tequilas. With our reserve collection of over 100 tequilas and mezcals, we can make over 5,700,000 possible tequila combinations. Welcome to a haven where every detail reflects our commitment to delivering a luxurious, fun, and unforgettable dining experience. VIEW MENU EVENTS EVENTS Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOME EVENTS BOOKINGS PRIME REWARDS REVIEWS CONTACT US HOURS OF OPERATION Sunday 11am-10pm Kitchen closes: 9pm Monday closed Tuesday 3pm-12am Kitchen closes: 11pm Wednesday Closed Thursday 3pm-12am Kitchen closes: 11pm Friday 3pm-2am Kitchen closes: 12pm Saturday 11am-2am Kitchen closes: 12pm CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 (754) 225-5703 INFO@TULUMPRIME.COM Facebook Instagram Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOME EVENTS BOOKINGS PRIME REWARDS REVIEWS CONTACT US HOURS OF OPERATION MONDAY - THURSDAY 3:00PM – 12:00AM FRIDAY 3:00PM – 2:00AM SATURDAY 10:00AM – 2:00AM SUNDAY 10:00AM – 12:00AM CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 (754) 225-5723 INFO@TULUMPRIME.COM Facebook Instagram Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOURS OF OPERATION Sunday 11am-10pm Kitchen closes 9pm Monday closed Tuesday 3pm-12am Kitchen closes 11pm Wednesday Closed Thursday 3pm-12am Kitchen closes 11pm Friday 3pm-2am Kitchen closes 12pm Saturday 11am-2am Kitchen closes 12pm CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 754-225-5703 INFO@TULUMPRIME.COM Facebook Instagram HOME BOOKINGS CONTACT US EVENTS REVIEWS PRIME REWARDS Scroll to Top"
    },
    {
      "url": "https://tulumhotelmiamor.com/restaurant-bar/",
      "text": "Best Restaurants in Tulum Mexico Toggle navigation Book × Rooms Dining Restaurant Romantic Dinners Specials Packages Experiences Fun Times Romantic Experiences Special Ocasions Explore Tulum Sustainability Sustainability Turtle Season Info Jaguar Park Guidelines FAQs Fact Sheet Blog Careers Mi Amor Colibri Boutique Hotels La Zebra Mezzanine Yemaya Lula Contact Us Resevation & Cancellation Policy Privacy Policy Book DINING “Bold, contemporary flavors that capture the essence of a love affair with the timeless classics from Mexico’s coastal regions.” Highlighting Mexico’s abundance of seafood, featuring brunch eveary day and an intimate dinner menu for the evening to enjoy on the stunning Mi Amor foreshore, the perfect setting to gather, to share, and to laugh. A menu to excite the senses and surrender to your cravings. A playful salute to some of Mexico’s timeless classics, we creatively introduce a contemporary kitchen approach to surprise and delight with each bite. FLAVORS TO FALL IN LOVE WITH E xperiment and explore flavors together, find the taste that best suits your palates inside our cocktail list.  Or just have fun having your favorite drink, or two.  Try our exceptional Cocktail menu and fine selection of wines. If you want to learn to shake the classics with your feet fresh and playful inside the pool, ask about our Cocktail Class. * Please note that in order to preserve the romantic atmosphere, both our rooms and restaurant are for adults only. IMPORTANT: ACCESS TO A NATURAL AREA Mi Amor Hotel is nestled within a stunning natural area of Tulum, which requires an entry fee dedicated to the preservation of flora and fauna. Authorities have introduced new regulations. Combustion vehicles are not allowed; only electric vehicles such as cars, motorcycles, or scooters may enter. Mi Amor does not have parking, so we highly recommend arriving by transportation service or taxi. Within the area, transportation options are available to facilitate your mobility. The general access hours are from 8:00 am to 5:00 pm. A restaurant reservation is essential at all times to enter the natural area. Thank you for your understanding and cooperation. × TAKE A PEEK INSIDE OUR MENUS BREAKFAST BRUNCH DINNER DRINKS DESSERTS WINE ROMANTIC DINNER DRESS CODE Casual SERVICE HOURS Breakfast 7:30 am – 11:45 am Brunch 12:00 pm – 6:00 pm Dinner 6:00 – 10:00 pm Bar: 7:30 am – 10:30 pm SMOKING AREA In accordance with Mexican law, smoking is not permitted inside the park, including our restaurant or anywhere in the hotel. DISTINTIVO H Awarded by the Ministry of Tourism & Ministry of Health to restaurants that achieve excellence in food hygiene practices. SPECIALS BRUNCH EVERY DAY Brunch every day at Mi Amor. Discover a unique menu that goes beyond Insta-worthy dishes—a concept designed to create a bonding ritual and a meaningful social experience, reviving the art of sharing and gathering. DAY : EVERY DAY HOURS: 12:00 pm to 6:00 pm VIEW MENU 2X1 TU AMOR COCKTAILS Enjoy 2-for-1 on any of our sumptuous cocktails, every day from 5 to 7 PM.\nDon’t forget—our Tu Amor and Highball cocktails come with a box of bitters and spices, so you can create the perfect chemistry! DAY : EVERY DAY HOURS 5:00pm  to 7:00 pm VIEW COCKTAIL MENU BUBBLY MORNINGS & MIMOSA MOMENTS Start your weekend right at Mi Amor, where ocean views and laid-back vibes set the scene. Brighten your morning with the sparkle of a Mimosa—fresh, fruity, and oh-so-refreshing.\n\nBecause life’s better with bubbles. Join us for 2-for-1 Mimosas every Saturday and Sunday, and let the bubbles flow as you soak in the beauty of Tulum. DAY : SATURDAY & SUNDAY HOURS 9:00Am  to 3:00 pm BOOK A TABLE SUNSET SIPS & DOUBLE DELIGHTS Imagine the elegance of Mi Amor—breathtaking ocean views and the soft rhythm of Tulum’s breeze. Now, add the perfect finishing touch: a bright, bubbly Aperol Spritz—an ideal blend of zest and sophistication.\nJoin us and embrace golden hour with our 2-for-1 offer. Let the romance of Mi Amor elevate your sunset experience. DAY : EVERY DAY HOURS 5:00pm  to 7:00 pm BOOK A TABLE OTHER COLIBRI RESTAURANTS MEZZANINE HOTEL Tulum,Mexico LA ZEBRA HOTEL Tulum, Mexico LULA HOTEL Tulum, Mexico CONNECT WITH US RESERVATIONS (+52) 984-115-4728 USA (+1) 303-952-0595 Location Service Operated by Operadora Gran Hotel, SA de CV. RESTAURANT (+52) 984-188-4273 concierge.miamor @colibriboutiquehotels.com PROUD MEMBERS OF Colibri Boutique Hotels © 2025"
    },
    {
      "url": "https://tulumprime.com/event/wekendbrnch2ndsun/",
      "text": "Weekend Brunch Skip to content HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO Menu HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO BOOK A TABLE BOOK A TABLE HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO Menu HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO « All Events This event has passed. Weekend Brunch June 16, 2024 @ 11:00 am - 3:00 pm Free « Weekend Brunch Cars & Tacos » Tulum Prime Weekend Brunch Saturdays & Sundays 11:00 am – 3 :00 pm $40 Mimosa Flights $20 bottomless Bloody Mary’s $20 bottomless Mimosas With all new flavors to try Mango Strawberry Passion Fruit Peach Now offering NEW BRUNCH MENU for adults and kids One flavor for bottomless mimosa, Multiple flavors for flights Add to calendar Google Calendar iCalendar Outlook 365 Outlook Live Details Date: June 16, 2024 Time: 11:00 am - 3:00 pm Cost: Free Website: https://tulumprime.com/coral-springs/events/weekend-brunch/ Organizer Tulum Prime Phone 7542255723 View Organizer Website Venue Tulum Prime 650 Riverside DR Coral Springs , FL 33071 United States + Google Map Phone 7542255723 View Venue Website « Weekend Brunch Cars & Tacos » Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOME EVENTS BOOKINGS PRIME REWARDS REVIEWS CONTACT US HOURS OF OPERATION Sunday 11am-10pm Kitchen closes: 9pm Monday closed Tuesday 3pm-12am Kitchen closes: 11pm Wednesday Closed Thursday 3pm-12am Kitchen closes: 11pm Friday 3pm-2am Kitchen closes: 12pm Saturday 11am-2am Kitchen closes: 12pm CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 (754) 225-5703 INFO@TULUMPRIME.COM Facebook Instagram Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOME EVENTS BOOKINGS PRIME REWARDS REVIEWS CONTACT US HOURS OF OPERATION MONDAY - THURSDAY 3:00PM – 12:00AM FRIDAY 3:00PM – 2:00AM SATURDAY 10:00AM – 2:00AM SUNDAY 10:00AM – 12:00AM CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 (754) 225-5723 INFO@TULUMPRIME.COM Facebook Instagram Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOURS OF OPERATION Sunday 11am-10pm Kitchen closes 9pm Monday closed Tuesday 3pm-12am Kitchen closes 11pm Wednesday Closed Thursday 3pm-12am Kitchen closes 11pm Friday 3pm-2am Kitchen closes 12pm Saturday 11am-2am Kitchen closes 12pm CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 754-225-5703 INFO@TULUMPRIME.COM Facebook Instagram HOME BOOKINGS CONTACT US EVENTS REVIEWS PRIME REWARDS Scroll to Top"
    },
    {
      "url": "https://palmillarestaurant.com/",
      "text": "Palmilla Cocina y Tequila | Sonoran-Baja Cuisine in the OC PALMILLA HERMOSA BEACH 39 Pier Ave, Hermosa Beach, CA 90254 310-374-4440 FOLLOW US PALMILLA NEWPORT BEACH 3110 Newport Blvd, Palmilla Newport, CA 90254 949-220-1290 FOLLOW US Home Locations Hermosa Beach Newport Beach About Us Menus Food Menu Brunch Drinks Gallery Gift Cards Contact © Copyright 2025 Palmilla Cocina Y Tequila. All Right Reserved. Home Locations Hermosa Beach Newport Beach About Us Menus Food Menu Brunch Drinks Gallery Gift Cards Contact Welcome to Palmilla Cocina y Tequila Designed by award winning architect and designer, Gulla Jónsdóttir, Palmilla Newport Beach is a new, elevated Sonoran- and Baja-inspired culinary and social gathering hotspot on the Newport Beach Peninsula. Under the culinary direction of SoCal's Chef Ray Alvarez, Palmilla offers vibrant Mexican dishes made with premium ingredients, a dynamic bar program featuring the largest selection of tequilas and mezcals in Orange County, and a lively atmosphere that transports locals and visitors to the coasts of Cabo San Lucas. Palmilla Cocina Y Tequila features home-style Mexican cuisine featuring the freshest seafood and the finest cuts of beef, along with an amazing selection of premium tequilas, mezcals and globally inspired wines. Both Palmilla Hermosa Beach and Palmilla Newport Beach feature lovely outdoor patio areas, perfect for soaking up the sea breezes from the Pacific ocean just footsteps away. Palmilla’s sophisticated, yet inviting dining rooms showcase imported, custom-made furniture and decor that transports guests to Mexico’s luxurious coastal landscapes. When dining at Palmilla, you will feel as if you’ve been transported to an upscale boutique hotel in beautiful Cabo San Lucas, Mexico, which is where much of the inspiration of the design came from. Food Drinks Food Drinks Palmilla's Special Our Favoritos Pescado de la Dia pan seared fresh fish, choice of preparation - ranchera, veracruzana, pacifco or blackened, arroz de tomatillo, choice of side Taqueria Tacos Camarones Frito griddled queso, fresno aioli, avocado, cotija Sonoran Sunset premium mai tai made with wray & nephew jamaican white rum, bacardi reserve ocha, grand marnier cuvee louis alexander, golden falernum, myers’s dark rum float Guest Favorites PRIME FILETE MIGNON 8oz USDA certified prime center cut, chipotle crema, mushrooms, caramelized onion, enchilada de marsicos suiza Pepina Diablo cazadores blanco, organic agave nectar, fresh squeezed lime, muddled jalapeno and cucumber Photo Gallery View More in Gallery Palmilla Newport Beach 3110 Newport Blvd. Newport Beach CA 92663 House Line: 1-949-220-1290 Hours of Operation : Monday-Friday: 11am - 2am Saturday-Sunday 10am - 2am Reservations: Call 949-467-4203 or email nbreservations@palmillarestaurant.com Palmilla Hermosa Beach 39 Pier Ave. Hermosa Beach CA 90254 House Line: 1-310-374-4440 Hours of Operation : Mon – Wed: 11am – 11pm Thursday: 11am – 12am Friday: 11am – 1am Saturday: 10am – 1am Sunday: 10am – 11pm Reservations: Reservations@PalmillaHB.com © Copyright 2025 Palmilla Cocina Y Tequila. All Right Reserved. Developed by Exclusive Business Marketing Wordpress Social Share Plugin powered by Ultimatelysocial"
    },
    {
      "url": "https://tulumprime.com/careers/",
      "text": "We're hiring - Skip to content HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO Menu HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO BOOK A TABLE BOOK A TABLE HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO Menu HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO Tulum Mexican Cuisine is HIRING Tulum Mexican Cuisine is looking for rockstars to join their team! We have multiple positions available. Please fill out our form or send your resume to: hr@tulumprime.com Careers Name First Last Date of Birth (Required) MM slash DD slash YYYY Email Phone Address Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Desired Start Date MM slash DD slash YYYY Desired Position Manager Manager Assistant Bartender Chef Food Runner Hostess Line Cook Server What's Your Instagram Account What's Your TikTok Account What's Your Facebook Account Employment History Previous Employment #1 Duties From MM slash DD slash YYYY To MM slash DD slash YYYY Reason for Leaving Previous Employment #2 Duties: From MM slash DD slash YYYY To MM slash DD slash YYYY Reason for Leaving Previous Employment #3 Duties: From MM slash DD slash YYYY To MM slash DD slash YYYY Reason for Leaving Upload Your Resume Max. file size: 1 GB. Δ Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOME EVENTS BOOKINGS PRIME REWARDS REVIEWS CONTACT US HOURS OF OPERATION Sunday 11am-10pm Kitchen closes: 9pm Monday closed Tuesday 3pm-12am Kitchen closes: 11pm Wednesday Closed Thursday 3pm-12am Kitchen closes: 11pm Friday 3pm-2am Kitchen closes: 12pm Saturday 11am-2am Kitchen closes: 12pm CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 (754) 225-5703 INFO@TULUMPRIME.COM Facebook Instagram Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOME EVENTS BOOKINGS PRIME REWARDS REVIEWS CONTACT US HOURS OF OPERATION MONDAY - THURSDAY 3:00PM – 12:00AM FRIDAY 3:00PM – 2:00AM SATURDAY 10:00AM – 2:00AM SUNDAY 10:00AM – 12:00AM CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 (754) 225-5723 INFO@TULUMPRIME.COM Facebook Instagram Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOURS OF OPERATION Sunday 11am-10pm Kitchen closes 9pm Monday closed Tuesday 3pm-12am Kitchen closes 11pm Wednesday Closed Thursday 3pm-12am Kitchen closes 11pm Friday 3pm-2am Kitchen closes 12pm Saturday 11am-2am Kitchen closes 12pm CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 754-225-5703 INFO@TULUMPRIME.COM Facebook Instagram HOME BOOKINGS CONTACT US EVENTS REVIEWS PRIME REWARDS Scroll to Top"
    },
    {
      "url": "https://tulumprime.com/custom-catering/",
      "text": "Custom Catering - Skip to content HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO Menu HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO BOOK A TABLE BOOK A TABLE HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO Menu HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO PRIVATE CATERING AT TULUM PRIME A luxurious and cutting-edge take on catering, elevating the art of custom cuisine for exceptional events.  Our expertise focuses on tailored menus for any special occasion or a casual feast. Our team of experts will work closely with you to bring your vision to life, ensuring every detail is meticulously executed. Let us cater to your dreams and make your next event truly extraordinary. First Name Last Name Email Phone Number Event Date Event Type # of Guest Preferred Cuisine Submit Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOME EVENTS BOOKINGS PRIME REWARDS REVIEWS CONTACT US HOURS OF OPERATION Sunday 11am-10pm Kitchen closes: 9pm Monday closed Tuesday 3pm-12am Kitchen closes: 11pm Wednesday Closed Thursday 3pm-12am Kitchen closes: 11pm Friday 3pm-2am Kitchen closes: 12pm Saturday 11am-2am Kitchen closes: 12pm CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 (754) 225-5703 INFO@TULUMPRIME.COM Facebook Instagram Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOME EVENTS BOOKINGS PRIME REWARDS REVIEWS CONTACT US HOURS OF OPERATION MONDAY - THURSDAY 3:00PM – 12:00AM FRIDAY 3:00PM – 2:00AM SATURDAY 10:00AM – 2:00AM SUNDAY 10:00AM – 12:00AM CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 (754) 225-5723 INFO@TULUMPRIME.COM Facebook Instagram Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOURS OF OPERATION Sunday 11am-10pm Kitchen closes 9pm Monday closed Tuesday 3pm-12am Kitchen closes 11pm Wednesday Closed Thursday 3pm-12am Kitchen closes 11pm Friday 3pm-2am Kitchen closes 12pm Saturday 11am-2am Kitchen closes 12pm CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 754-225-5703 INFO@TULUMPRIME.COM Facebook Instagram HOME BOOKINGS CONTACT US EVENTS REVIEWS PRIME REWARDS Scroll to Top"
    },
    {
      "url": "https://tulumprime.com/event/tulumdriftday2/",
      "text": "Cars & Tacos Skip to content HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO Menu HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO BOOK A TABLE BOOK A TABLE HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO Menu HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO « All Events This event has passed. Cars & Tacos June 16, 2024 @ 2:00 pm - 5:00 pm Free « Weekend Brunch Cars & Tacos Sundays 2:00 PM – 5 :00 PM Special car show hosted by Tulum Prime perfect fun for the entire family Special reserved front parking 1/2 OFF House Wines $4 Beers $7 Margaritas $30 Beer Buckets Add to calendar Google Calendar iCalendar Outlook 365 Outlook Live Details Date: June 16, 2024 Time: 2:00 pm - 5:00 pm Cost: Free Website: https://tulumprime.com/coral-springs/events/cars-tacos/ Organizer Tulum Prime Phone 7542255723 View Organizer Website Venue Tulum Prime 650 Riverside DR Coral Springs , FL 33071 United States + Google Map Phone 7542255723 View Venue Website « Weekend Brunch Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOME EVENTS BOOKINGS PRIME REWARDS REVIEWS CONTACT US HOURS OF OPERATION Sunday 11am-10pm Kitchen closes: 9pm Monday closed Tuesday 3pm-12am Kitchen closes: 11pm Wednesday Closed Thursday 3pm-12am Kitchen closes: 11pm Friday 3pm-2am Kitchen closes: 12pm Saturday 11am-2am Kitchen closes: 12pm CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 (754) 225-5703 INFO@TULUMPRIME.COM Facebook Instagram Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOME EVENTS BOOKINGS PRIME REWARDS REVIEWS CONTACT US HOURS OF OPERATION MONDAY - THURSDAY 3:00PM – 12:00AM FRIDAY 3:00PM – 2:00AM SATURDAY 10:00AM – 2:00AM SUNDAY 10:00AM – 12:00AM CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 (754) 225-5723 INFO@TULUMPRIME.COM Facebook Instagram Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOURS OF OPERATION Sunday 11am-10pm Kitchen closes 9pm Monday closed Tuesday 3pm-12am Kitchen closes 11pm Wednesday Closed Thursday 3pm-12am Kitchen closes 11pm Friday 3pm-2am Kitchen closes 12pm Saturday 11am-2am Kitchen closes 12pm CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 754-225-5703 INFO@TULUMPRIME.COM Facebook Instagram HOME BOOKINGS CONTACT US EVENTS REVIEWS PRIME REWARDS Scroll to Top"
    },
    {
      "url": "https://www.kateenla.com/",
      "text": "Ka'teen Menus Private Events Reservations Reservations Menus Private Events Contact Explore the Flavors of the Yucatan Peninsula KAâTEEN is a fresh take on the ancient cuisine of the Yucatan Peninsula, brought to you by Chef Wes Avila. Chef Story Chef Wes Avila An icon of the Los Angeles food scene, Chef Wes Avila began his career with stints at L'Auberge, MarchÃ© and Le Comptoir.Â Â He is best known for the meteoric rise of Guerilla Tacos, which he started as an experimental street cart. The cart eventually became a roving food truck, and subsequently, an award-winning brick and mortar restaurant in Los Angelesâ Arts District. In fall 2020, Avila opened Angry Egret Dinette, a genre-bending ode to Los Angelesâ street food culture located in Chinatownâs Mandarin Plaza. Long revered for his distinct culinary perspective, Avila has received recognition from the Michelin Guide and the James Beard Foundation for his nuanced blend of regional California and Mexican cuisine. The Story KAâTEEN is an adventure to the lush jungles of the Yucatan Peninsula, nestled in the bustling heart of Hollywood. Created by Chef Wes Avila and Ten Five Hospitality, celebrated Los Angeles chef and founder of legendary taqueria Guerilla Tacos, the restaurant and Mezcal bar serves up discovery within every dish. The name Kaâteen means âafreshâ in Mayan, perfectly describing chef Avilaâs vibrant interpretation of the regionâs rich and diverse culinary traditions. Immersed in 5,000 square feet of Aztec-inspired tropical garden space, guests can expand their palettes and broaden their horizons through creative tequila cocktails, bold Latin-American flavors and DJ sets that recall the rhythm of the rainforests. Ancient culinary traditions, reinvented An artful take on ancient Yucatan culinary tradition, made with the freshest ingredients hand-picked from local purveyors and farmers. Menus Interior One Interior Two Interior Three Interior Four Interior Five Interior Six Interior Seven Private events Our 5,000 square foot tropical oasis is the perfect venue to host your private event. Inquire @kateen_la Press Where To Eat And Drink In Los Angeles This Summer The vibe is lush, the plates are shareable, and the crowd is textbook Hollywoodâhalf gorgeous people, half people with great taste trying to date gorgeous people. Read More The Best L.A. Restaurants for Outdoor Dining Backed by chef Wes Avila, KaâTeen brings a taste of Tulum to Hollywood with a Yucatan-forward menu and a 5,000-square-foot bohemian patio. Read More Food & Drink, What Angels Eat This Mexican restaurant brings a contemporary take to the ancient cuisine of the Yucatan Peninsula. Read More Hotel review: The Hollywood Volume is the perfect place for your first vacation in Los Angeles Walking through the jungle-like garden of the KaâTeen restaurant, you feel more like you are in Tulum than in Tinseltown. Read More 7 Motherâs Day Ideas in Los Angeles that Pair a Gift with an Experience Brunch at KAâTEEN begins with a Complimentary Mimosa to set the mood for relaxation on their gorgeous Tulum-centric outdoor patio. Read More 32 Of The Best Weekend Brunch Spots In LA Guerrilla Tacos chef-founder Wes Avila wanted his Hollywood restaurant, Ka'teen, to replicate the YucatÃ¡n Peninsula: That means a tropical, verdant patio, a thrumming soundtrack and bold flavors on the plate. Read More The Best Sit-Down Mexican Restaurants in LA Hollywood hotel dining tends to be hit or miss, but with a menu from renowned chef Wes Avila, Kaâteen makes for a worthy dinner destination. Read More The best restaurants in Hollywood For those who can snag a reservation, the beautifully designed space is perfect for a dressy girlsâ night, a stylish date night and, well, any night for the typical area crowd. Read More 10 Hot New Brunch Spots to Check Out in Los Angeles Heads will bop to special DJ sets on Saturdays while forks dig into flan brulee pancakes, breakfast quesadillas, and strawberry concha french toast. Read More Our 10 Favorite Los Angeles Tacos That Every LA Girl Must Try We love KAâTEEN, Hollywoodâs Yucatan-inspired restaurant led by Chef Wes Avila of Guerilla Tacos â Tacos Governador. Read More The best Mexican restaurants in L.A. Kaâteen channels sceney Tulum resorts with a reed tunnel entrance, a lush outdoor dining room and an expansive, Yucatan-inspired menu by Wes Avila, who also runs Chinatownâs Angry Egret Dinette. Read More The 20 Best Restaurants In Hollywood Chef Wes Avila brings the flavors of Mexico's YucatÃ¡n Peninsula to Hollywood with a vibrant menu focusing on fresh seafood and zingy sauces. Read More The Best Sit-Down Mexican Restaurants in LA Known chef Wes Avilaâs YucatÃ¡n-inspired restaurant in Hollywood offers a striking indoor-outdoor space. Read More Gamer Tiffany Herrera shares L.A.âs best 5 Latino-owned businesses Kaâteen is a gorgeous restaurant with exceptional food. Read More 16 Gorgeous Patios Around Los Angeles For Lovely Outdoor Dining Kaâteen is a vibrant Mexican restaurant that channels trendy Tulum vibes with its reed tunnel entrance and lush outdoor dining area. Read More 13 Hot New Brunch Spots to Check Out in Los Angeles Heads will bop to special DJ sets on Saturdays while forks dig into flan brulee pancakes, breakfast quesadillas, and strawberry concha french toast. Read More The \"Tulum-Inspired\" LA Restaurant Power Rankings If youâre looking to get dressed up and have an over-the-top night out in a setting that feels like a tropical members-only beach club, KaâTeen is the place to be in Hollywood. Read More 12 Hot New Brunch Spots to Check Out in Los Angeles Heads will bop to special DJ sets on Saturdays while forks dig into flan brulee pancakes, breakfast quesadillas, and strawberry concha french toast. Read More Where To Eat & Drink Outside From the thatched entrance and ethereal club music pumping through the speakers, thereâs a lot going on at KaâTeen. Read More The 18 Essential Sit-Down Mexican Restaurants in LA Celebrated chef Wes Avilaâs YucatÃ¡n-inspired restaurant in Hollywood offers one of the most striking indoor-outdoor spaces in Los Angeles. Read More 16 Destination-Worthy Hotel Restaurants in Los Angeles The ground floor of the Tommie in Hollywood has been transformed into a Yucatan jungle for Wes Avilaâs KaâTeen. Read More The best restaurants in Hollywood Kaâteen channels sceney Tulum resorts with a reed tunnel entrance, a lush outdoor dining room and an expansive, Yucatan-inspired menu by Wes Avila Read More February Food and Drink News Famed chef Wes Avila (founder of DTLA's Guerilla Tacos) is declaring Taco Tuesday an official holiday at his Hollywood hot spot KA'TEEN. Read More A Tulum Inspired Restaurant Situated On A Buzzy Block In Hollywood While most Angelenos know by now that most meals can be enjoyed outside, there are still plenty of destination-worthy scenic spots worth visiting for the views (as well as the food) ð´ Read More The 30 best restaurants for outdoor dining in L.A. Situated on a buzzy block in Hollywood, Kaâteen channels sceney Tulum resorts with a reed tunnel entrance, a lush outdoor dining room and an expansive, Yucatan-inspired menu by award-winning local chef Wes Avila. Read More Ring in 2024 with fabulous New Year's Eve and New Year's Day meals The last night of the year should end on a spectacular note. For me that means enjoying a particularly memorable meal. Read More 15 Best Mariscos Spots Around Los Angeles Wes Avilaâs KaâTeen is a piece of Tulum in Hollywood with its leafy outdoor seating and coastal Mexican cooking. Read More LAâs James Beard Award-Winning Izakaya Dresses Up as Netflixâs âMidnight Dinerâ on Halloween Hollywood restaurant KaâTeen will host chef James Beard-nominated chef Jermoe Grant for a collaboration dinner with chef Wes Avila Read More 26 New Culinary Menus, Events And More From L.A. Restaurants On Oct. 24, Kaâteen will host the second round of its guest chef series. Welcoming chef Jerome Grant, the James Beard-nominated chef will team with chef Wes Avila on a four-course meal that blends Yucatan-inspired cuisine and elevated barbecue. Read More Best Trendy Restaurants Los Angeles Los Angeles is home to numerous restaurant including some cool ones that you can visit with your family, and especially your special one. Read More The best Mexican restaurants in L.A. Kaâteen channels sceney Tulum resorts with a reed tunnel entrance, a lush outdoor dining room and an expansive, Yucatan-inspired menu by Wes Avila, who also runs Chinatownâs Angry Egret Dinette Read More Fun Things to Do in Los Angeles To kick off Latin Heritage Month, KAâTEEN, Hollywoodâs favorite Mexican coastal restaurant is celebrating Mexican Independence Day today. Read More 20 Best Los Angeles Restaurants For Outdoor Dining Ka'teen will transport you straight to the tropical setting of the Yucatan Peninsula, calling to mind Tulum but without the crowds. Read More Here's where to find strong tequila drinks, a festive environment, and, above all, delicious Latin food Here's where to find strong tequila drinks, a festive environment, and, above all, delicious Latin food Read More Michelin-Starred Valle Chef Roberto Alcocer Launches Culinary Series at KAâTEEN Chef Wes Avila, who found a fast following with his Guerrilla Tacos, is welcoming some of his famous friends to his coastal Mexican restaurant KAâTEEN each month for a new guest chef series â beginning with chef Roberto Alcocer, whose restaurant Valle in Oceanside just scored a Michelin star last month. Read More 23 Breathtaking Outdoor Patios for Al Fresco Dining in Los Angeles Delight in modern Mexican cuisine with a touch of heat to keep you cozy on breezy LA nights, while relishing well-shaken cocktails and savoring a delectable platter of perfectly roasted cochinita pibil. Read More The 10 hottest restaurants to dine at in LA right now KaâTeen serves a menu of flavours from the Mayan Riviera and YucatÃ¡n peninsula, with elements including plants, palm fronds, tostadas, ceviches and tacos. Read More Head to Ka'teen in Hollywood for Innovative Food and a Jungle Vibe Kaâteen, a lovely intimate restaurant housed in a tropical garden. Read More The best Mexican restaurants in L.A. For those who can snag a reservation, the beautifully designed space is perfect for a dressy girlsâ night, a stylish date night and, well, any night for the typical area crowd. Read More Hollywood turns 100. Here's why it's as fabulous as ever A chic restaurant inspired by Mexicoâs Yucatan peninsula. Read More Elite Traveler Awards Elite Traveler Awards Winner Read More The 20 Best Restaurants For Brunch In LA Transport yourself to the tropics of the YucatÃ¡n Peninsula when dining at Ka'teen. Read More All The New Springtime Food And Cocktail Offerings At Your Favorite L.A. Restaurants The coastal Mexican restaurant now serves weekend brunch. Continuing its YucatÃ¡n-inspired approach to the menu, brunch dishes include Huevos Rancheros with salsa cacera, avocado and queso oaxaca; Horchata French Toast with caramelized pineapple and hibiscus and Short Rib Enfrijolada with fried brussels sprouts, flowering herbs and salsa de puya. Read More Father's Day in L.A.: the best restaurants for every type of dad It's always a party at YucatÃ¡n-inspired KAâTEEN in Hollywood, where the vibe on the outdoor patio makes you feel like you're on vacation. Read More KA'TEEN launches weekend brunch KA'TEEN in Hollywood has become a hot spot for dinner and now it's launching a weekend brunch menu.\nExecutive chef and partner of KA'TEEN Wes Avila joined us live with a taste preview. Read More Dine Outside at LAâs Best Outdoor Restaurants Right Now Guerrilla Tacos founder Wes Avilaâs sexy new spot at the Tommie Hollywood hotel is set almost entirely outdoors and is ultra-heavy on the Tulum vibes, with leather-and-wood barrel chairs, dozens of rattan-covered lights hanging overhead, and lush greenery everywhere. Read More Take a Look at Los Angeles's Most Beautiful Restaurants Kaâteen spans some 5,000 square feet of fully outdoor dining space, reminiscent of the Riviera Maya region of Mexico, designed by Studio Collective and styled by Bernadette Blanc. Read More Duck Tamal with Chef Wes Avila In the kitchen at Kaâteen, Wes Avila draws on his heritage to put together a menu that reflects his California take on Yucatan cuisine. Read More The Best LA Restaurants For A Birthday Dinner If youâre looking to get dressed up and have a messy, over-the-top birthday in Hollywood, KaâTeen is where to be. Read More The Tulumification of LA, Modern Maximalism, and More Restaurant Design Trends to Know Right Now Restaurant design has shifted since the start of the pandemic, ushering in transportive spaces and a new era of decadence Read More Hollywood Is Finally Living Up to Its Glittery Reputation as a Place Stars Want to Hang Out Where to eat, drink and hang out in L.A.'s glamorous new old neighborhood. Read More The chefs taking spiciness to new extremes Wes Avila's potent Ã¡rbol chilies at new YucatÃ¡n-inspired restaurant Kaâteen in Los Angeles Read More LA's Best New Restaurants Chef Wes Avila, the man behind Guerilla Tacos, continues to delight with his latest restaurant inspired by the ancient flavors of the Yucatan Peninsula. Read More The Best Restaurants to Dine at in Los Angeles This Summer The Best Restaurants to Dine at in Los Angeles This Summer Read More DUJOUR Magazine May Issue Read More The Ultimate Hollywood Dining Guide Chef Wes Avila is an LA legend, Poseidon behind the wave of elevated and creative Chicano tacos that swept the city over the last decade. Read More The 15 best new restaurants in Los Angeles right now The 15 best new restaurants in Los Angeles right now Read More The Best LA Restaurants For A Birthday Dinner Looking to get dressed up and have a messy, over-the-top birthday in Hollywood, KaâTeen is where to be. Read More The 29 Most Exciting Restaurants in Los Angeles Right Now Chef Wes Avila is tackling the ancient flavors of the Yucatan peninsula and pairing them with market-sourced ingredients at this uniquely LA concept thatâs adjacent to the tommie Hollywood hotel. Read More Chef Wes Avilaâs new restaurant Kaâteen showcases his take on Yucatan cuisine Wesâ new restaurant Kaâteen showcases his take on Yucatan cuisine and features an oasis in the heart of Hollywood Read More 15 Hottest Restaurants in Los Angeles, February 2022 The lush ambience, thumping tunes, and attentive service make it a complete dining experience. Read More Wes Avila Wants You to See His Mexican Cooking At Kaâteen As Pure L.A. The Tulum vibes are strong in Ka'Teen's outdoor dining area. Read More New Neighborhood-Centric Hotels in Hollywood, Malibu and Downtown L.A. Reflect Their Unique Environments Chef Wes Avilaâs Tulum-themed restaurant KAâTEEN serves Yucatan-inspired dishes Read More Vinyl District, the Hottest Neighborhood in L.A. Right Now \"The vibe is like a party.\" Read More LA Legend Wes Avila Ups the Hollywood Ante With Lush New Mexican Dinner Spot. KA'TEEN Grand Opening Read More A new project from chef Wes Avila Wes Avila to open a new Mexican restaurant in Hollywood next month with a YucatÃ¡n Peninsula/Mayan Riviera theme, is scheduled to open next month in a 5,000-square-foot outdoor space in Hollywood. Read More Hollywoodâs New KA'TEEN Hollywoodâs New Kaâteen Captures the Essence of the Mexican Coast. Inside what might be the most gorgeous new LA restaurant in a while, and with food from star chef Wes Avila to boot. Read More Letâs connect Sign up to stay up to date with KAâTEEN. Thank you! Your email address has been added to the list. Oops! Something went wrong while submitting the form. 323.410.6360 reservations@kateenla.com press@kateEnla.com 6516 Selma Ave. Los Angeles, Ca 90028 TUE - THURS 6:00PM to 10:00pm FRI 6:00pm - CLOSE SAT 11:30am - 3pm 6PM - CLose Sun 11:30am - 3pm 5:30PM - 10:00pm MON Closed MENUS Private Events we support the designated driver program and offer complimentary non-alcoholic beverages to guests that are the designated drivers. Community hotline: 323.410.6042 spotify instagram Facebook TikTok Copyright © KAâTEEN Terms + Conditions privacy policy Accessibility"
    },
    {
      "url": "https://tulumprime.com/reviews/",
      "text": "Tulum Prime | 5-Star Reviews Skip to content HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO Menu HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO BOOK A TABLE BOOK A TABLE HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO Menu HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO READ OUR 5-STAR REVIEWS Alberto Noe Diana was very sweet and has a great personality. I appreciate her service and the food was good. She looks great with her pretty smile. God bless everyone over there Bryan Pérez Hernández 🌟🌟🌟🌟🌟\n\nStepping into Tulum Prime Tequila Lounge & Restaurant felt like stepping into a cherished memory. From the moment I walked through the door, I was enveloped in an atmosphere that whispered promises of an unforgettable evening.\n\nThe warmth of the dimly lit space, the subtle aroma of spices dancing in the air, and the soft murmur of laughter from fellow diners created an ambiance that instantly put me at ease. As I settled into my seat, I couldn't help but feel a sense of anticipation building within me – a feeling that this would be more than just a meal, but a culinary journey to remember.\n\nThe menu, a testament to the creativity and passion of the chefs, offered a tantalizing array of dishes that promised to delight the senses. Each bite was a revelation, a symphony of flavors that danced across my palate and left me craving more. From the zesty ceviche to the melt-in-your-mouth carne asada, every dish was a masterpiece in its own right.\n\nAnd then there was the tequila – oh, the tequila. As someone who considers themselves a bit of a connoisseur, I was blown away by the selection at Tulum Prime. From aged reposados to smoky mezcals, there was something for every palate. The bartender, a true aficionado, guided me through the options with a passion and knowledge that was infectious, ensuring that each sip was savored and appreciated.\n\nBut perhaps what left the greatest impression on me was the service. It wasn't just attentive – it was personal. From the moment I walked in, I felt like more than just a customer; I felt like a welcomed guest in someone's home. The staff, with their genuine smiles and genuine interest in ensuring my experience was nothing short of perfect, made me feel like I belonged.\n\nIn the end, my evening at Tulum Prime Tequila Lounge & Restaurant was more than just a meal – it was an experience that touched my heart and soul. It's rare to find a place that combines exceptional food, an inviting atmosphere, and genuine hospitality in such perfect harmony, but Tulum Prime does just that. It's a place I won't soon forget, and one I'll be returning to again and again. Sean Garcia Great place for dine in and enjoy the atmosphere, tasty food and great music, one of my favorites gibson louis Im a take out type of guy but the atmosphere at Tulum Prime gives you no choice but to dine in.\n\nThe waiters and waitresses were committed to great service and very friendly. There’s a live Dj with great music where every bite of the food makes you want to get up\nAnd dance 💃 🕺!!\n\nFrom the appetizers to the entrees the food was delicious 🤤, well serve  and the presentation makes you want to flick a pic for the gram.\n\nTheir drinks 🍹 was amazing (I had the Mille-Marcos) i had no choice to make this my every week type of vibe..\n\nI Highly recommend this place to anyone and everyone who wants to get out the house and catch a great vibe with friends and family, even if you come alone you’ll definitely meet some cool people here .. Marcos Rodrigues I definitely recommend coming!  Amazing food, Amazing atmosphere. Miami Dinner experience without having to drive to Miami. Kim Champagne I saw this place from Instagram and gave it a try. I sat at a table with my bestfriend and we ordered spicy margaritas for there ladies night discount. The bartender was so sweet !! Very prompt and fast with service. Food came out in a good time frame as well. I loved the beef nachos. For an entree we got the bowl that had different proteins called “tulum Molacajete” - the steak and fried cheese was to die for !! They give you a side of tortillas to make your own taco from. So good and I will be coming back. READ OUR LATEST 5-STAR REVIEWS Alberto Noe Diana was very sweet and has a great personality. I appreciate her service and the food was good. She looks great with her pretty smile. God bless everyone over there Bryan Pérez Hernández 🌟🌟🌟🌟🌟\n\nStepping into Tulum Prime Tequila Lounge & Restaurant felt like stepping into a cherished memory. From the moment I walked through the door, I was enveloped in an atmosphere that whispered promises of an unforgettable evening.\n\nThe warmth of the dimly lit space, the subtle aroma of spices dancing in the air, and the soft murmur of laughter from fellow diners created an ambiance that instantly put me at ease. As I settled into my seat, I couldn't help but feel a sense of anticipation building within me – a feeling that this would be more than just a meal, but a culinary journey to remember.\n\nThe menu, a testament to the creativity and passion of the chefs, offered a tantalizing array of dishes that promised to delight the senses. Each bite was a revelation, a symphony of flavors that danced across my palate and left me craving more. From the zesty ceviche to the melt-in-your-mouth carne asada, every dish was a masterpiece in its own right.\n\nAnd then there was the tequila – oh, the tequila. As someone who considers themselves a bit of a connoisseur, I was blown away by the selection at Tulum Prime. From aged reposados to smoky mezcals, there was something for every palate. The bartender, a true aficionado, guided me through the options with a passion and knowledge that was infectious, ensuring that each sip was savored and appreciated.\n\nBut perhaps what left the greatest impression on me was the service. It wasn't just attentive – it was personal. From the moment I walked in, I felt like more than just a customer; I felt like a welcomed guest in someone's home. The staff, with their genuine smiles and genuine interest in ensuring my experience was nothing short of perfect, made me feel like I belonged.\n\nIn the end, my evening at Tulum Prime Tequila Lounge & Restaurant was more than just a meal – it was an experience that touched my heart and soul. It's rare to find a place that combines exceptional food, an inviting atmosphere, and genuine hospitality in such perfect harmony, but Tulum Prime does just that. It's a place I won't soon forget, and one I'll be returning to again and again. Sean Garcia Great place for dine in and enjoy the atmosphere, tasty food and great music, one of my favorites gibson louis Im a take out type of guy but the atmosphere at Tulum Prime gives you no choice but to dine in.\n\nThe waiters and waitresses were committed to great service and very friendly. There’s a live Dj with great music where every bite of the food makes you want to get up\nAnd dance 💃 🕺!!\n\nFrom the appetizers to the entrees the food was delicious 🤤, well serve  and the presentation makes you want to flick a pic for the gram.\n\nTheir drinks 🍹 was amazing (I had the Mille-Marcos) i had no choice to make this my every week type of vibe..\n\nI Highly recommend this place to anyone and everyone who wants to get out the house and catch a great vibe with friends and family, even if you come alone you’ll definitely meet some cool people here .. Marcos Rodrigues I definitely recommend coming!  Amazing food, Amazing atmosphere. Miami Dinner experience without having to drive to Miami. Kim Champagne I saw this place from Instagram and gave it a try. I sat at a table with my bestfriend and we ordered spicy margaritas for there ladies night discount. The bartender was so sweet !! Very prompt and fast with service. Food came out in a good time frame as well. I loved the beef nachos. For an entree we got the bowl that had different proteins called “tulum Molacajete” - the steak and fried cheese was to die for !! They give you a side of tortillas to make your own taco from. So good and I will be coming back. SEE MORE REVIEWS Instagram INSTAGRAM Facebook FACEBOOK Star WRITE A REVIEW Instagram INSTAGRAM Facebook FACEBOOK Star WRITE A REVIEW Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOME EVENTS BOOKINGS PRIME REWARDS REVIEWS CONTACT US HOURS OF OPERATION Sunday 11am-10pm Kitchen closes: 9pm Monday closed Tuesday 3pm-12am Kitchen closes: 11pm Wednesday Closed Thursday 3pm-12am Kitchen closes: 11pm Friday 3pm-2am Kitchen closes: 12pm Saturday 11am-2am Kitchen closes: 12pm CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 (754) 225-5703 INFO@TULUMPRIME.COM Facebook Instagram Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOME EVENTS BOOKINGS PRIME REWARDS REVIEWS CONTACT US HOURS OF OPERATION MONDAY - THURSDAY 3:00PM – 12:00AM FRIDAY 3:00PM – 2:00AM SATURDAY 10:00AM – 2:00AM SUNDAY 10:00AM – 12:00AM CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 (754) 225-5723 INFO@TULUMPRIME.COM Facebook Instagram Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOURS OF OPERATION Sunday 11am-10pm Kitchen closes 9pm Monday closed Tuesday 3pm-12am Kitchen closes 11pm Wednesday Closed Thursday 3pm-12am Kitchen closes 11pm Friday 3pm-2am Kitchen closes 12pm Saturday 11am-2am Kitchen closes 12pm CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 754-225-5703 INFO@TULUMPRIME.COM Facebook Instagram HOME BOOKINGS CONTACT US EVENTS REVIEWS PRIME REWARDS Scroll to Top"
    },
    {
      "url": "https://tulumprime.com/private-events/",
      "text": "Private Events - Skip to content HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO Menu HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO BOOK A TABLE BOOK A TABLE HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO Menu HOME MENU FOOD MENU NEW BRUNCH MENU NEW KIDS BRUNCH MENU ORDER EVENTS PRIME REWARDS MY ACCOUNT SHOP CART CHECKOUT REVIEWS CATERING CATER YOUR NEXT EVENT CATERING MENU GRAB N GO PRIVATE EVENTS AT TULUM PRIME A premier private event space, an exquisite setting exceptional experiences and impeccable service, we invite you to consider our venue for your upcoming events. A luxurious and gorgeous event venue available for rent. Where we work hand in hand and create memorable experiences you won’t forget First Name Last Name Email Phone Number Event Date Event Type Additional Request Submit Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOME EVENTS BOOKINGS PRIME REWARDS REVIEWS CONTACT US HOURS OF OPERATION Sunday 11am-10pm Kitchen closes: 9pm Monday closed Tuesday 3pm-12am Kitchen closes: 11pm Wednesday Closed Thursday 3pm-12am Kitchen closes: 11pm Friday 3pm-2am Kitchen closes: 12pm Saturday 11am-2am Kitchen closes: 12pm CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 (754) 225-5703 INFO@TULUMPRIME.COM Facebook Instagram Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOME EVENTS BOOKINGS PRIME REWARDS REVIEWS CONTACT US HOURS OF OPERATION MONDAY - THURSDAY 3:00PM – 12:00AM FRIDAY 3:00PM – 2:00AM SATURDAY 10:00AM – 2:00AM SUNDAY 10:00AM – 12:00AM CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 (754) 225-5723 INFO@TULUMPRIME.COM Facebook Instagram Keep up with WEEKLY SPECIAL EVENTS SIGN UP NOW HOURS OF OPERATION Sunday 11am-10pm Kitchen closes 9pm Monday closed Tuesday 3pm-12am Kitchen closes 11pm Wednesday Closed Thursday 3pm-12am Kitchen closes 11pm Friday 3pm-2am Kitchen closes 12pm Saturday 11am-2am Kitchen closes 12pm CONTACT 650 RIVERSIDE DR. CORAL SPRINGS, FL 33071 754-225-5703 INFO@TULUMPRIME.COM Facebook Instagram HOME BOOKINGS CONTACT US EVENTS REVIEWS PRIME REWARDS Scroll to Top"
    }
  ]
}