{
  "fuentes": [
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://turkeycreek.org/coming-events",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://turkeycreek.org/coming-events",
      "email": "luciano@latinotype.com"
    },
    {
      "url": "https://turkeycreek.org/nature-tours",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://turkeycreek.org/nature-tours",
      "email": "luciano@latinotype.com"
    },
    {
      "url": "https://turkeycreek.org/",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://turkeycreek.org/",
      "email": "luciano@latinotype.com"
    },
    {
      "url": "https://scotland.sanctuary.co.uk/contact-us",
      "email": "myresearch@voluntas.co.uk"
    },
    {
      "url": "https://scotland.sanctuary.co.uk/contact-us",
      "email": "pr@sanctuary-housing.co.uk"
    },
    {
      "url": "https://turkeycreek.org/contact",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://turkeycreek.org/contact",
      "email": "luciano@latinotype.com"
    },
    {
      "url": "https://turkeycreek.org/volunteer-opportunities",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://turkeycreek.org/volunteer-opportunities",
      "email": "luciano@latinotype.com"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/palm-bay/birding-wildlife-viewing/turkey-creek-sanctuary/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://turkeycreek.org/kayak-tour",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://turkeycreek.org/kayak-tour",
      "email": "luciano@latinotype.com"
    },
    {
      "url": "https://turkeycreek.org/ola/services/nature-tours",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://turkeycreek.org/ola/services/nature-tours",
      "email": "luciano@latinotype.com"
    },
    {
      "url": "https://crittercreekfarmsanctuary.org/our-team/",
      "email": "katelyn@crittercreekfarmsanctuary.org"
    },
    {
      "url": "https://turkeycreeknp.com/",
      "email": "info@jeffcogreenways.org"
    },
    {
      "url": "https://www.turkeyclassicfurniture.com/contact/",
      "email": "info@asortie.com"
    },
    {
      "url": "https://www.turkeyclassicfurniture.com/contact/",
      "email": "info@turkeyclassicfurniture.com"
    },
    {
      "url": "https://turkeycreek.org/faq",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://turkeycreek.org/faq",
      "email": "luciano@latinotype.com"
    }
  ],
  "mails": [
    "chosen-sprite@2x.png",
    "filler@godaddy.com",
    "info@asortie.com",
    "info@communityaccessnaperville.org",
    "info@jeffcogreenways.org",
    "info@turkeyclassicfurniture.com",
    "katelyn@crittercreekfarmsanctuary.org",
    "luciano@latinotype.com",
    "myresearch@voluntas.co.uk",
    "pr@sanctuary-housing.co.uk"
  ],
  "nombre_sitio": "turkeycreek.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "text": "Our Team | CAN top of page Diego Reeb, Grants Manager Our day programs include service and fun with peers in our community. Join our Fall Fundraiser Donate Home About Us Our Team Photo Gallery Our Program Our Participants Our Schedule Consulting Services Let Us Help You CAN Store Join Our Team Internships Volunteer Careers Become a Friend of CAN Support CAN Donate Fundraising Events Recycle Your Old Crayons Let Us Help You Our Supporters 2024 CAN Sponsors Our Community Supporters More Use tab to navigate through the menu items. CAN Staff Members Hannah Klinnert, Executive Director Sarah VanStedum, Program Leader Brenda Hasler, Operations Director Dawn Callahan, Program Leader Jissell Cano, Program Assistant Gregory Zelasko, Program Assistant Vanessa Maduzia, Program Advisor Kimberly Nierman, Intern Supervisor & Program Leader Andrew Zelasko, Program Leader Christina Stauffer, Program Leader Delani Kosner, Program Assistant Joseph Kim, Program Assistant Gia Hanrahan, Intern Coordinator & Program Leader Diana Chrostowski, Community Relations Coordinator Amy Ranalli, Program Assistant CAN's Administrative Board of Directors: CAN's Advisory Board : Vivienne Venderley Jennifer Fairlamb Jeanette Edwards Sherry Healey Jama Wall Mark Brown Justin Elder Peggy Kulling Mary Muszynski Subscribe to Newsletter Recent Newsletter CAN's Annual Financial Report Like us on Facebook 25 E Benton Ave Naperville, IL  60540 Info@communityaccessnaperville.org 630-352-1928 Community Access Naperville is a 501c3 not-for-profit organization. Donations are tax-deductible to the full amount permitted by law. bottom of page"
    },
    {
      "url": "https://turkeycreek.org/coming-events",
      "text": "Coming Events - Turkey Creek Sanctuary Society QUESTIONS? Visit our FAQ page to find your answers! 321.676.6690 321.676.6690 Sign In Create Account Bookings Orders My Account Signed in as: filler@godaddy.com Bookings Orders My Account Sign out Signed in as: filler@godaddy.com Home The Nature Center Dog Policy Classes / Planks / Events Coming Events Nature Tours Donations and Store Biking at Turkey Creek Kayak Tour Volunteer Opportunities FAQ Contact Account Bookings Orders My Account Sign out Sign In Bookings Orders My Account Coming events at Turkey Creek Spring Art Show FREE Saturday, April 5 - 8:30 am to 2:30 pm Join us at the Tony Rosa Community Center, across the parking lot from the Sanctuary, for our Fall Art Show. We have 66 local vendors selling handcrafted items and our famous hot dog lunch featuring a hot dog, drink and chips. Turkey Creek Day FREE Saturday, April 19 - 8:30 am to 3 pm A FREE family fun day! Local craft vendors - Environmental Groups Children's storytime, with a special guest Games for the kids - Balloon Twister Scavenger hunt - Nature Tours Our famous hot dog lunch featuring a hot dog, drink and a bag of chips, will be on sale. Kids to Park Day FREE Saturday, May 17 - 9 to 10am Join us for a special kids hike in the Sanctuary. The hike will include a visit to \"tortoise town\" to talk about these amazing reptiles. Parents are asked to join their children for this tour. Park after Dark FREE SAVE THE DATE Saturday, November, 15 - 6 to 9:30 pm Our third annual event. Live music, vendors, food trucks and lots of fun. Copyright © 2023 Turkey Creek Sanctuary Society, Inc. - All Rights Reserved. Powered by Home The Nature Center Dog Policy Classes / Planks / Events Coming Events Nature Tours Donations and Store Biking at Turkey Creek Kayak Tour Volunteer Opportunities Contact Privacy Policy QUESTIONS?  Visit the FAQ page. Looking for answers to your questions? Look no further than our FAQ page!  Check it out now and get the answers you've been searching for. Go to FAQ page. This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://turkeycreek.org/nature-tours",
      "text": "Twice Monthly Nature Tours - Turkey Creek Sanctuary Society QUESTIONS? Visit our FAQ page to find your answers! 321.676.6690 321.676.6690 Sign In Create Account Bookings Orders My Account Signed in as: filler@godaddy.com Bookings Orders My Account Sign out Signed in as: filler@godaddy.com Home The Nature Center Dog Policy Classes / Planks / Events Coming Events Nature Tours Donations and Store Biking at Turkey Creek Kayak Tour Volunteer Opportunities FAQ Contact Account Bookings Orders My Account Sign out Sign In Bookings Orders My Account TWICE-MONTHLY NATURE TOUR TWICE-MONTHLY NATURE TOUR Monthly Nature Tours are FREE! Nature Tours are on the first and third Sundays of every month. The tour is approximately 1-1/2 hours, and we walk about 1 mile. These tours are for individuals and families. If your organization or group is interested in a tour, please contact the nature center at 321.676.6690 Tours are subject to cancellation due to weather. If the weather is bad, please call the nature center to confirm there will be a tour. If there is active lightening in the area the tour will be cancelled! Turkey Creek Sanctuary SIGN UP FOR A TOUR SIGN UP FOR A TOUR Name Email* This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Send Self-guided QR Code Tour Check out this video about our new self-guided tour! Copyright © 2023 Turkey Creek Sanctuary Society, Inc. - All Rights Reserved. Powered by Home The Nature Center Dog Policy Classes / Planks / Events Coming Events Nature Tours Donations and Store Biking at Turkey Creek Kayak Tour Volunteer Opportunities Contact Privacy Policy QUESTIONS?  Visit the FAQ page. Looking for answers to your questions? Look no further than our FAQ page!  Check it out now and get the answers you've been searching for. Go to FAQ page. This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://turkeycreek.org/",
      "text": "Turkey Creek Sanctuary - Turkey Creek Sanctuary Society QUESTIONS? Visit our FAQ page to find your answers! 321.676.6690 321.676.6690 Sign In Create Account Bookings Orders My Account Signed in as: filler@godaddy.com Bookings Orders My Account Sign out Signed in as: filler@godaddy.com Home The Nature Center Dog Policy Classes / Planks / Events Coming Events Nature Tours Donations and Store Biking at Turkey Creek Kayak Tour Volunteer Opportunities FAQ Contact Account Bookings Orders My Account Sign out Sign In Bookings Orders My Account Welcome to the Turkey Creek\nSanctuary Society Website! Welcome to the Turkey Creek\nSanctuary Society Website! Welcome to the Turkey Creek\nSanctuary Society Website! Welcome to the Turkey Creek\nSanctuary Society Website! Welcome to the Turkey Creek\nSanctuary Society Website! QUESTIONS? Visit the FAQ page for answers. Turkey Creek Sanctuary | Palm Bay, Florida TURKEY CREEK SANCTUARY PARK The park property was donated to the City of Palm Bay and the Florida Audubon Society in 1978 by the General Development Corporation i n partnership with Florida Communities Trust .  Later, in 2004, Brevard County's Environmentally Endangered Land Program added acreage to the Sanctuary. Now, the Sanctuary consists of 130 acres of undeveloped, native Florida land The Sanctuary stands on a small section of what was once an ancient Atlantic Ocean dune. This dune is part of a series of dunes formed by wind and wave action when the ocean extended across the state. Through the ages, life, death, and decay have gradually enriched the sand so that a forest stands where only sea oats could survive. Our Sanctuary is a refuge for native Florida plants like sand pines, scrub and turkey oaks, cactus, wire grass, scrub paw paw, large flower rosemary, and more. In addition to the plant life, the Sanctuary is also home to many species of native Florida wildlife, such as manatees, alligators, gopher tortoises, and bobcats. As a part of The Great Florida Birding and Wildlife Trail , many species of birds can be seen while walking through the Sanctuary. TURKEY CREEK SANCTUARY SOCIETY Efforts to preserve Turkey Creek Sanctuary began in 1981 with the formation of a citizen support group.  This group still exists today as the Turkey Creek Sanctuary Society, Inc., a registered 501(c)3 non-profit, and a proud Community Partner of the City of Palm Bay. OUR MISSION The sole purpose of the Turkey Creek Sanctuary Society is to raise funds to support the improvement and upkeep of  Turkey Creek Sanctuary and to educate the community on the vital importance and the many benefits of Florida wildlife and its natural environment. Stay in touch with our newsletter, \"The Creek\" Enter your email below to sign up for our quarterly newsletter. Email Subscribe In the end, our society will be defined not only by what we create, but by what we refuse to destroy. John Sawhill Copyright © 2023 Turkey Creek Sanctuary Society, Inc. - All Rights Reserved. Powered by Home The Nature Center Dog Policy Classes / Planks / Events Coming Events Nature Tours Donations and Store Biking at Turkey Creek Kayak Tour Volunteer Opportunities Contact Privacy Policy QUESTIONS?  Visit the FAQ page. Looking for answers to your questions? Look no further than our FAQ page!  Check it out now and get the answers you've been searching for. Go to FAQ page. This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://scotland.sanctuary.co.uk/contact-us",
      "text": "Contact us | Sanctuary Scotland Skip to main content Search Menu England Scotland About Sanctuary About Sanctuary Who we are Publications Media Sustainability Equality, diversity and inclusion Development and regeneration Keeping your information safe Suppliers Accreditations Corporate memberships Investors Join our team Join our team Careers Why work for us? About Us Current vacancies (new tab) News England Scotland Manage your home Information for residents Your home Back Your home Repair responsibilities for renters Repair responsibilities for homeowners Condensation, damp and mould Bed bugs in your home Safety in your home Improving your home Home insurance Your home and the environment Factored Owners Your tenancy Back Your tenancy Responsibilities Changes to your household Swapping your home Moving out Permissions Tenancy fraud Next of Kin Your payments Back Your payments Make a payment Help with making a payment Housing Benefit and Universal Credit Service charges Your Neighbourhood Back Your neighbourhood Bulky waste and fly tipping Household waste Abandoned or Empty properties Help and support Back Help and support Complaints Safeguarding Cost of living help Domestic Abuse Report a repair Discover your options to report a repair Find out more Find a home Find a home Rent a home Buy a home Mid-market rent Sheltered housing More housing and support Back Care homes Student accommodation Technology-enabled care Get involved Contact us Contact us Report a repair Make a payment Complaints Freedom of Information Media enquiries General enquiries Connect to a British Sign Language interpreter Customer Hub Open 24 hours a day, 7 days a week including public holidays for emergency repairs. Find out more Search Search the website Topic Corporate news Customer news Type Customer News Corporate News Customer Stories Staff Stories Sort by Newest First Oldest First Home Contact us On this page Toggle table of contents panel Need to talk to us? Our Customer Hub is open 24 hours a day, seven days a week, including public holidays for emergency repairs . For housing enquiries, we are open Monday to Friday, 8am to 5pm. Customer enquiries Contact us by telephone Call us on: 0808 168 3475​​​​​​​ Enquiry form: For any non-urgent general enquiries, please use our online enquiry form Repairs: To raise a repair, please complete our repairs enquiry webform Social media How can we help? If you have a question or concern, the most convenient way to tell us is by filling out our online form. Our online form enables us to receive your message and respond to you as quickly as possible. We value your feedback and suggestions and are committed to addressing any issues. Our team is always ready to help and provide you with any information you need. Online enquiry form Contact us in writing England: Sanctuary House, Chamber Court, Castle Street, Worcester, Worcestershire, WR1 3ZQ Scotland: Sanctuary Scotland, 7 Freeland Drive, Glasgow, G53 6PG Quick links to other useful information and webforms Image Repairs Learn about our repairs process and how to raise an issue. Image Rent and payments Find out more about the ways you can pay your rent. Image Antisocial behaviour Find out what is classed as antisocial behaviour and how to report it. Image Moving out Learn what you need to when you move out of your property. Alternative formats At Sanctuary, we are committed to making our services accessible to everyone. We offer a range of different formats for our communications, so you can access all the information you need in a way that suits you. Translation services We understand that visitors to our website may come from different backgrounds and speak different languages. If English is not your first language, or if you do not speak English, our translation services are here to assist you. Our translators are available 24/7 and can provide translations for over 60 languages. They can help with phone conversations and translate letters and documents. We want to ensure that everyone can easily read and understand the information on our website. To assist with this, we have provided guides on how to translate our website (and other websites) using different web browsers. Google Chrome Google Chrome offers a built-in translation feature that allows you to translate a webpage into your preferred language. Follow these simple steps to enable this feature: Open the Google Chrome browser. Visit the webpage you want to translate. Right-click on the webpage, then select \"Translate to [Language]\" from the context menu. For detailed instructions, visit Google's Support Page: How to Translate Webpages in Google Chrome. Microsoft Edge For those using the Microsoft Edge browser, translation can be as easy as a click of a button. Here's how to do it: Open the Microsoft Edge browser. Visit the webpage you want to translate. Click on the \"...\" (More) button in the top-right corner of the browser window. Select \"Translate to [Language]\" from the drop-down menu. For detailed instructions, visit Microsoft's Support Page: Use Microsoft Translator in Microsoft Edge Browser. Safari If you are using a Mac and your browser of choice is Safari, you can easily translate webpages into your desired language by following these steps: Open the Safari browser. Visit the webpage you want to translate. Click on the \"View\" menu in the top bar and select \"Translation\". For detailed instructions, you can visit Apple's Support Page: How to Translate Webpages in Safari. It is important to keep in mind that while these tools are very helpful, they may not always provide a perfect translation. They might miss some of the finer details and context, but they should still give you a good understanding of what's on our webpage. Helpline for people who are deaf or hard of hearing If you are deaf or hard of hearing, our Customer Hub offers the following services: Text relay service: 07800 006781 Connect to a British Sign Language interpreter Written communication If you would like to access our written communications in a different format, we offer a range of different formats to suit your needs and preferences. This includes: Braille Large print Audio versions of our communications (if you would prefer to listen rather than read) Electronic formats, such as accessible Word docx files, PDFs, and HTML, which can be customised to suit you. Helpful information Keeping your details secure Important information: We are aware that people sometimes contact residents without their consent by means of cold calling. While this is sadly not within our control we can assure you that we take data protection extremely seriously and would not disclose any information under any circumstances without your permission. The only information we would ask you for when contacting you would be your names, address, DOB and telephone number. In some cases, we may also ask for your National Insurance number. We would never ask for bank account details, passwords or other such sensitive information, nor would we ask you to pay a courier in cash or request remote access to your computer/mobile/tablet. Find out more about keeping your personal details secure . IFF Research – Phone and Email Surveys We have partnered with independent market researchers, IFF Research, to learn what you think about Sanctuary and our services. If you are a Sanctuary Housing or Supported Living resident, IFF Research may phone or email you to ask you what you think about us. If they contact you by email, the email will be from myresearch@voluntas.co.uk . The survey takes no more than 10 minutes, and all answers are completely confidential. We will only know you were surveyed if you give IFF Research permission to share your details with us. The full results of our surveys will be shared with the Regulator of Social Housing. This activity supports the new Tenant Satisfaction Measures introduced by the Regulator in April 2023. Please see our privacy statement for full details about how your personal data will be used. Call charges The 0800 number shown above is free. For the exact call and text charges from your mobile phone or landline for other numbers, please check with your provider. Feedback We welcome your comments about our services. If you have any feedback about Sanctuary, please complete our online feedback form. Sanctuary careers If you are interested in working for Sanctuary, please visit our Careers pages where information about careers and current vacancies within the organisation can be found. Please visit our Apprenticeships and Graduates pages for more information about each programme. Media enquiries and contacts If you are member of the media, visit our Press Office page for more information, or contact the Press Office by email: pr@sanctuary-housing.co.uk The Press Office does not have direct access to customer information and is unable to answer customer enquiries. It is also not able to answer questions about careers and vacancies. Social Media For information on how to get in touch with us on social media, please visit our Media page for a full list of our official social media accounts. To top I am a Sanctuary tenant Report, cancel or rearrange a repair Pay your rent Report antisocial behaviour Find information about your tenancy I need a place to live Homes to buy Swapping your home I am looking for support Adaptations to your home Assistive technology support Financial support Invest with Sanctuary Financial performance Corporate strategy I am looking for a job Current job vacancies Sanctuary House Chamber Court, Castle Street Worcester, Worcestershire WR1 3ZQ Privacy statements Terms of use Website Accessibility Cookie policy Sitemap Keeping your information safe Freedom Of Information Sanctuary Group Slavery and Human Trafficking Statement (PDF 223KB) Sanctuary Scotland Housing Association Limited is part of Sanctuary.  © Sanctuary. All Rights Reserved."
    },
    {
      "url": "https://turkeycreek.org/contact",
      "text": "Contact Us -  Turkey Creek Sanctuary Society QUESTIONS? Visit our FAQ page to find your answers! 321.676.6690 321.676.6690 Sign In Create Account Bookings Orders My Account Signed in as: filler@godaddy.com Bookings Orders My Account Sign out Signed in as: filler@godaddy.com Home The Nature Center Dog Policy Classes / Planks / Events Coming Events Nature Tours Donations and Store Biking at Turkey Creek Kayak Tour Volunteer Opportunities FAQ Contact Account Bookings Orders My Account Sign out Sign In Bookings Orders My Account Contact Us Please contact us with any questions. Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Turkey Creek Sanctuary Society 1518 Pt. Malabar Blvd. NE Palm Bay, Florida  32905 Phone: 321.676.6690 Email: turkeycreekfriends@gmail.com Connect With Us Copyright © 2023 Turkey Creek Sanctuary Society, Inc. - All Rights Reserved. Powered by Home The Nature Center Dog Policy Classes / Planks / Events Coming Events Nature Tours Donations and Store Biking at Turkey Creek Kayak Tour Volunteer Opportunities Contact Privacy Policy QUESTIONS?  Visit the FAQ page. Looking for answers to your questions? Look no further than our FAQ page!  Check it out now and get the answers you've been searching for. Go to FAQ page. This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://turkeycreek.org/volunteer-opportunities",
      "text": "Become a volunteer -  Turkey Creek Sanctuary Society QUESTIONS? Visit our FAQ page to find your answers! 321.676.6690 321.676.6690 Sign In Create Account Bookings Orders My Account Signed in as: filler@godaddy.com Bookings Orders My Account Sign out Signed in as: filler@godaddy.com Home The Nature Center Dog Policy Classes / Planks / Events Coming Events Nature Tours Donations and Store Biking at Turkey Creek Kayak Tour Volunteer Opportunities FAQ Contact Account Bookings Orders My Account Sign out Sign In Bookings Orders My Account Become a volunteer VOLUNTEER APPLICATION PROCESS Volunteers run our Nature Center. The center is not open if we have no volunteer for a scheduled shift. Consider becoming a volunteer to help us remain open during our intended hours. All you need is a friendly smile, a pleasant attitude, and an appreciation for Turkey Creek Sanctuary. If you're interested in becoming a Volunteer at the Nature Center, complete the Online Application below or come to the Nature Center during our open hours. One of our Volunteers can help you fill out the form. ONLINE APPLICATION The minimum age to volunteer is 18. There is no maximum age! To complete and submit your application online, follow the process below: Download, edit, and complete the Palm Bay Volunteer Service Corps (PBVSC) application . Scan (if filled out by hand) and save it on your computer to upload through our website. Fill out the Turkey Creek Sanctuary Volunteer Information Request Form to submit your completed PBVSC application and your schedule and interests to the Park and the Nature Center staff. * *Must have a valid Driver's License or State ID and be able to pass a background check.** Connect With Us Copyright © 2023 Turkey Creek Sanctuary Society, Inc. - All Rights Reserved. Powered by Home The Nature Center Dog Policy Classes / Planks / Events Coming Events Nature Tours Donations and Store Biking at Turkey Creek Kayak Tour Volunteer Opportunities Contact Privacy Policy QUESTIONS?  Visit the FAQ page. Looking for answers to your questions? Look no further than our FAQ page!  Check it out now and get the answers you've been searching for. Go to FAQ page. This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/palm-bay/birding-wildlife-viewing/turkey-creek-sanctuary/",
      "text": "Turkey Creek Sanctuary - Visit Space Coast Skip to main content Item Added to Itinerary My Planner Share My Itinerary Added to Wishlist Copied to Clipbord Surf Cams Map Local Weather Explore Fall is for Foodies Kennedy Space Center Visitor Complex Port Canaveral Wildlife Viewing Cocoa Beach Brevard Zoo Things To Do Sea Turtle Season Attractions Beaches Communities Restaurants Tours Museums Stay Bed and Breakfast Campgrounds Hotels Vacation Rentals Events Blogs Launches My Itinerary Visitor Information Vacation Planner Accessibility on the Space Coast Beach Safety Transportation and Map Search for: Search Follow Us on Social Media facebook-f instagram youtube pinterest-p Search for: Search Home Turkey Creek Sanctuary Add to Wishlist Turkey Creek Sanctuary Turkey Creek Sanctuary is a 130-acred sanctuary surrounded by sand pines, saw palmettos and live oaks. A boardwalk natural trail twists and turns along the murky, bass-filled black water creek, a major stopover for spring and fall migratory birds including the woodpecker and rare purple martin amongst other wildlife. For a place to get outside and enjoy the scenic landscape, Turkey Creek Sanctuary provides that and more. The on-site nature center provides educational interpretive exhibits and a gift shop where you can take home a souvenir to commemorate your time there. Add to Trip Visit Website Direction 1518 Port Malabar Blvd NE Palm Bay, FL 32905 Contact (321) 676-6690 Discover More nearPalm Bay All Hotels Restaurants Events Add to Wishlist Yellow Dog Cafe Palm Bay Create your own 3-course experience at Yellow Dog Cafe for $49 per guest. Appetizer: Caesar Salad | Spinach Salad | House Salad | Housemade Chips with Warm Blue Cheese and Green Onions | Spinach Artichoke Dip | Charred Jalapeno with Bacon Cream Cheese Entrees: Stuffed Flounder | Beef Burgundy |… Add to Trip Add to Wishlist Candy Wonderland Palm Bay Candy Wonderland provides little ones with the perfect opportunity to explore, engage and enjoy a one-of-a-kind play experience in a safe and secure environment. Our interactive kids playground takes the candy-theme to the extreme – with colorful ball pits, multiple role-play houses, wave slides, toddler areas, ninja course, carousel, candy… Add to Trip Add to Wishlist Evo Catering, LLC Palm Bay “EVO”lving with the way you eat with our dine in or take out restaurant, custom off-site catering and our meal prep service that allows you to have a taste of home or to try something exotic without needing a kitchen or sink. The restaurant has daily specials with great food… Add to Trip Add to Wishlist Springhill Suites by Marriott West Melbourne Palm Bay Melbourne and the Beaches Kick back and feel your worries melt away as you settle in for a rewarding stay at SpringHill Suites West Melbourne. Our spacious hotel suites and vibrant spaces are perfect for working, playing or relaxing. Take the stress out of travel with perks like free WiFi, outdoor pool and a… Add to Trip Add to Wishlist Fairfield Inn & Suites Melbourne West/Palm Bay Melbourne and the Beaches Get comfortable at Fairfield Inn and Suites Melbourne West Palm Bay. Our Melbourne Florida hotel has everything you need to recharge on the road. Refresh in our suites with signature plush Marriott bedding, ergonomic workspaces, and free WiFi. Start your morning with selections from our complimentary breakfast served daily. Maintain… Add to Trip Add to Wishlist Paramotor Orlando Palm Bay Paramotor Orlando, based at Valkaria Airport in Brevard County, has been a prominent feature in the Florida skies for almost 10 years—becoming the go-to sight for both tourists and locals alike. Recognized as one of the nation’s premier paramotor schools with an impeccable safety record, we pride ourselves on offering… Add to Trip Add to Wishlist Palm Bay Paintball Park Palm Bay 15 acre paintball field opened every weekend. It’s a City park managed by Nightmare Inc. Add to Trip Add to Wishlist The Tangiers Palm Bay Temporarily Closed   Located directly across from the scenic view of the Indian River, The Tangiers presents a classic Vegas inspired performance venue for variety arts entertainment as well as a beautiful and spacious event center. Enjoy a rotating cast of incredible talents by vocalists, dancers, musicians, aerialists, comedians, magicians… Add to Trip Add to Wishlist Malabar Mo’s Bar & Grill Palm Bay Malabar Mo’s is one of the best places to relax inside or on the deck. Have a great one, tip one back and enjoy with great company. The service is top notch. The atmosphere is cheerful and welcoming. Locals and tourists become friends. Live music on Sundays. Award winning Jumbo… Add to Trip Add to Wishlist Harris Establishment Farms Palm Bay Join us for our 2024 Spring Flower Festival, open Thursdays and Fridays from 2:30pm to 6:30pm, and Saturdays and Sundays from 9:30am to 4pm. Please note that the last entry into the farm is 30 minutes prior to closing. Your admission includes a variety of activities such as Animal Viewing… Add to Trip Add to Wishlist Brevard County Tours Palm Bay Dolphin and manatee tours along the Indian River Lagoon and the beautiful Turkey Creek in Palm Bay, FL. Come enjoy 2 hours of searching for dolphins, manatees, alligators while cruising on a comfortable 24′ pontoon boat with a maximum of 6 people aboard. Brevard county tours also offers fishing charters…. Add to Trip Add to Wishlist Paddling Paradise Palm Bay Welcome to the Space Coast #1 destination for paddling on the water. The Beautiful Turkey Creek Sanctuary and the Indian River Lagoon are at you “paddle tips” Add to Trip Add to Wishlist Yellow Dog Café Palm Bay Located on Malabar’s scenic Indian River, we offer fresh seafood, sandwiches, steak, and comfort food. Voted the best in Brevard for The Best Fine Dining, Most Romantic and Best Waterfront Dining. Along with a wonderful menu we offer a variety of beer, cocktails, and mocktails. Try different cocktails by ordering… Add to Trip Add to Wishlist Lazy Turtle RiverFront Grill & Tiki Bar Palm Bay A tropical paradise !!! Lazy Turtle Riverfront a Florida restaurant with Islands flar and tropical drinks keeps flowing Add to Trip Add to Wishlist Ven Pa Ca Latin Food Palm Bay Authentic Puerto Rican eats. Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your... Add to Trip Add to Wishlist Hilton Garden Inn Cape Canaveral near Cocoa Beach Experience the perfect blend of comfort, convenience, and coastal charm at the Hilton Garden Inn Cape Canaveral. Our brand-new hotel features 156 spacious, modern guest rooms and welcomes all travelers. Planning an event? Our 775-square-foot meeting room is ideal for gatherings, and our professional culinary team is ready to make... Add to Trip Add to Wishlist Homewood Suites by Hilton Viera Melbourne Brand‑new, 4‑story, all-suite hotel with 131 spacious suites providing separate living and sleeping areas—ideal for families, business travelers, and extended stays. Nestled off Interstate 95 in the vibrant Viera/Borrows West district, it offers convenient access to the USSSA Space Coast Sports Complex, Brevard Zoo, The Avenue Viera shopping & dining, and... Add to Trip Add to Wishlist Springhill Suites by Marriott West Melbourne Palm Bay Kick back and feel your worries melt away as you settle in for a rewarding stay at SpringHill Suites West Melbourne. Our spacious hotel suites and vibrant spaces are perfect for working, playing or relaxing. Take the stress out of travel with perks like free WiFi, outdoor pool and a... Add to Trip Add to Wishlist Fairfield Inn & Suites Melbourne West/Palm Bay Get comfortable at Fairfield Inn and Suites Melbourne West Palm Bay. Our Melbourne Florida hotel has everything you need to recharge on the road. Refresh in our suites with signature plush Marriott bedding, ergonomic workspaces, and free WiFi. Start your morning with selections from our complimentary breakfast served daily. Maintain... Add to Trip Add to Wishlist Hyatt Place Cape Canaveral Explore the Space Coast from our modern rooms at Hyatt Place Cape Canaveral, from rooftop views of live rocket launches from Kennedy Space Center and the Cape Canaveral Space Force Station. Relax at our outdoor pool, enjoy a meal at The Placery or grab to-go snacks at The Market after... Add to Trip Add to Wishlist Comfort Suites Titusville Near Kennedy Space Center Exciting news! We’ve just launched the brand new Comfort Suites Titusville near Kennedy Space Center, offering the perfect blend of comfort, convenience, and value for your next business trip to the heart of Florida’s Space Coast. Stay in Style, Work with Ease: Spacious guest rooms featuring plush bedding, flat-screen TVs... Add to Trip Add to Wishlist Hotel Melby Hotel Melby celebrates the raw and the refined, where artistry dances with science and the process of discovery itself is on display. From evocative artworks and cultural diversity to alluring explorations of space and time – Hotel Melby stands as a doorway to the vibrant and distinctive essence of Melbourne.... Add to Trip Add to Wishlist Element Melbourne Oceanfront Inspired by Westin Hotels & Resorts, the Element Melbourne Oceanfront believes in providing travelers, whether on the road for work or leisure, not just a great place to stay, but a place to stay connected, feel alive, balanced and maintain their rituals and lifestyles. With stunning views of the Atlantic... Add to Trip Add to Wishlist Comfort Inn & Suites Melbourne-Viera We are family owned/operated hotel since 2007 . We treat our guests like family and offer both King and Double Room types. We offer free amenities such a fully hot breakfast, swimming pool and laundry facilities. We love to host families, sports teams, business travels and leisure guest. Add to Trip Add to Wishlist Holiday Inn Express Cape Canaveral Holiday Inn Express Cape Canaveral is ideally located next to Terminal 3 at Port Canaveral and the Jetty Park Beach & Pier. We are just minutes from a variety of restaurants, shopping destinations, and popular attractions like the Kennedy Space Center Visitor Complex. As the first choice for the increasing... Add to Trip Add to Wishlist Seascape Motels Modern amenities meet Old Florida style in this hidden oceanfront treasure — with southern charm and hospitality! Quaint and affordable, the Sea Scape has character. We take pride in our cleanliness, service and repeat business. Every day is perfect at the Sea Scape Motel & Apartments. You’ll awake to magnificent... Add to Trip Add to Wishlist Americas Best Value Inn Satellite Beach Melbourne Come and enjoy an out-of-this-world atmosphere at the America’s Best Value Inn Satellite Beach. A short walk from the beach, this pet friendly hotel is conveniently located less than 15 minutes from the Melbourne Orlando International Airport and less than 16 miles from Port Canaveral. America’s Best Value Inn Satellite Beach invites you... Add to Trip Add to Wishlist TownePlace Suites by Marriott – Cape Canaveral / Cocoa Beach Designed for longer stays, our property features fully equipped kitchens, lobby bar, poolside beverage service with covered seating. Hydro-stations throughout the hotel. 24-hr fitness and business center. Meeting space to accommodate groups up to 30. Balconies in select suites offering fantastic views of port, rocket launches and the Banana River. Add to Trip Add to Wishlist The Pineapple Estate EGAD A Beautiful Private Estate Vacation home nestled in the wonderful Eau Gallie Arts District. The Estate Sleeps 22, has direct river access, minutes to the Atlantic Ocean and boasts the best distant, unobstructed views of the Florida Sunrises, Sunsets and Rocket Launches. Walking distance to Restaurants, shopping, night life venues... Add to Trip Add to Wishlist Hola! Cuban Kitchen Experience the vibrant flavors of Cuba at Hola! Cuban Kitchen, a casual fine dining destination where authenticity meets elegance. Savor traditional Cuban favorites like ropa vieja, picadillo, and palomilla steak, as well as house specialties like our signature Paella—all crafted with our unique Cuban flair. Enjoy hand-crafted cocktails including refreshing... Add to Trip Add to Wishlist Cuba Bistro At Cuba Bistro, we bring the heart of Cuba to every cup of coffee, plate of food and freshly baked pastelito. Family-owned and proudly rooted in tradition, we serve up flavors that feel like home. Stop by for a Cafecito and stay for the love. Add to Trip Add to Wishlist Pacha Kava Lounge Pacha Kava Lounge in Rockledge, FL, is a unique, family-friendly kava bar and social hub known for its enchanting, whimsical decor, diverse menu of house-made kava and herbal teas, and commitment to community with regular events like Bingo and open mic nights. Patrons praise the welcoming atmosphere, knowledgeable and friendly... Add to Trip Add to Wishlist Zero Gravity Wine Bar More than just a wine bar, Zero Gravity Wine Bar offers a tasting experience for everyone, whether you’re just getting started or already love wine. You don’t need to be an expert here. Our founders are passionate wine lovers who believe tasting should be fun, relaxed, and open to all.... Add to Trip Add to Wishlist Forgotten Block Butcher and Market Nestled in the heart of Historic Cocoa Village, Forgotten Block is the Space Coast’s neighborhood butcher and market with a passion for sustainability, quality, and community. We specialize in locally sourced meats, house-made charcuterie, artisanal deli offerings, and provisions. From dry-aged beef, charcuterie, and handcrafted sausages to our tallow-based soaps... Add to Trip Add to Wishlist J. Bird’s Island Eatery Nestled just steps from Port Canaveral and the Kennedy Space Center, J. Bird’s Island Eatery serves up good vibes from sunrise to tiki time. Whether you’re fueling up before a cruise, taking a midday poolside break, or winding down after a space center visit, J. Bird’s is your tropical nest.... Add to Trip Add to Wishlist Aves’ Place Located in the heart of Brevard County, Aves’ Place is a destination for families across the Space Coast, offering a variety of freshly made lunch options, hand-scooped ice cream, treats and fresh bakery items and is home to Treasures Boutique, an upscale resale boutique featuring clothing, furniture and more. A... Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Toasty Coconut Toasty Coconut is Merritt Island’s Newest stop for quick, Savory Bites, Boba, Coffee, and BLUE BELL ICE CREAM! Add to Trip Add to Wishlist Ice Cream Hut Merritt Island Located just minutes from the beach, The Ice Cream Hut of Merritt Island is your go-to destination for handcrafted ice cream, nostalgic treats, and unforgettable family fun. We offer an exciting variety of premium flavors, dairy-free options, and signature items like cookie sandwiches, waffle tacos, and banana split boats—all made... Add to Trip Add to Wishlist Evo Catering, LLC “EVO”lving with the way you eat with our dine in or take out restaurant, custom off-site catering and our meal prep service that allows you to have a taste of home or to try something exotic without needing a kitchen or sink. The restaurant has daily specials with great food... Add to Trip Add to Wishlist Kabob-a-licious Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a... Add to Trip Add to Wishlist 2 georges oceanside bar & grill 2georges oceanside bar & grill (formerly Sage Bistro) was purchased by Jeff and Jeannine George in August 2023. The married couple have an extensive background in the Food and Beverage Industry along with Hospitality, Marketing and Social Media. 2georges oceanside bar & grill was part of the rebranding which reflects... Add to Trip Add to Wishlist Humpavelli’s Pizza Family-owned since 2013 to serve you the best food with the always freshest ingredients. We pride ourselves on having the friendliest customer service around as we make your food to order in an open kitchen to show you what we’re all about. We make everything in-house every morning to continuously... Add to Trip Add to Wishlist Southern Kingfish Nationals The Southern Kingfish Association (SKA) will be hosting its SKA Nationals Kingfish Championships November 19 – 22, 2025 in Port Canaveral, Florida. The SKA Nationals will feature elite teams from across the Southeast and Gulf competing for the coveted SKA Nationals Championship. The event is free and open to the... Add to Trip Add to Wishlist Rock & Roll Revue: Autumn Boogie It’s Autumn? Maybe somewhere else but it’s late summer here. We have a fab lineup of the dance music that you love – from the fabulous 12-piece Rock & Roll Revue. $15.00 Add to Trip Add to Wishlist Autumn Market Join us for the Nancy Higgs Community Center’s Autumn Market! This event will take place on two separate days, so if you miss the first one, don’t be discouraged! When: October 7 and November 4 Come enjoy food trucks, fresh baked goods, local produce, and crafts made by local artisans.... Add to Trip Add to Wishlist Creatures Fest Join us at the Barrier Island Center for a free, fun, family event to celebrate animal diversity, ecology and conservation with a Halloween theme. Enjoy critteriffic games, touch tank, live animal encounters, conservation booths, scavenger hunt, eco-arts and crafts, black light not-so-scary experience, food truck, and more! Costumes encouraged and... Add to Trip Add to Wishlist St. Vincent de Paul Friends of the Poor 5K Run Walk Cocoa Beach 2nd Annual Friends of the Poor 5K Run Walk – fun for all ages. To raise awareness of the needs of our local neighbors who are working poor, homeless, disabled and veterans in the Cocoa Beach – Cape Canaveral Community. Race starts at 8:00 am. Same day registration starting at... Add to Trip Add to Wishlist Harvest Festival Harvest Fest at The Enchanted Forest is BACK! Dress up in costume or your favorite fall clothes and enjoy a day full of family fun! Dive into exciting games, hands-on crafts, and delicious bites from local food trucks. Get creative with pumpkin painting and scarecrow making. Explore the creepy-crawly building... Add to Trip Add to Wishlist 11th Annual Kidtoberfest Brevard County Parks and Recreation is proud to present Tim Burton’s The Nightmare Before Christmas at the FREE Cars Under the Stars Movie in the Park happening in Wickham Park! Audio will be available through car stereo and external speakers . The movie will begin once the sun goes down.... Add to Trip Add to Wishlist 4th Friday Starry Nights Join Brevard parks and Recreation Department and the Max K. Rodes Community Center for an artisan market under the stars! Meet talented local artisans and find one-of-a-kind gifts. Enjoy live D.J. music and peruse food from a variety of local onsite food trucks. Add to Trip Add to Wishlist 14th Annual North Brevard Fall festival and Trunk-or-Treat Join Brevard Parks and Recreation for the 14th Annual North Brevard Fall Festival and Trunk-or-Treat! This exciting three-hour event is the ultimate way to celebrate the season! Come dressed in your best costume and connect with local groups and organizations while diving into all our thrilling activities. Don’t miss out... Add to Trip Add to Wishlist Haunted Trail at Rotary Park October 17 & 18, 24 & 25 (Fridays and Saturdays) Cost: $5 for ages 12 & under | $10 for ages 13 & up Get ready for a frightful night filled with thrills and chills! Explore multiple scare zones packed with eerie creatures, jump scares, and bone-chilling surprises around every... Add to Trip Add to Wishlist Free Concert Featuring The Bella Donna Project Join the Brevard Parks and Recreation Department and experience the greatest hits of Stevie Nicks with a live music performance by the Bella Donna Project! Feel free to bring lawn chairs or peruse a variety of local on site food trucks during the show. Add to Trip Add to Wishlist Cocoa Village Sidewalk Sale “Leave it to Bargains” at the Cocoa Village Sidewalk Sale! Cocoa Village boutiques, art galleries, jewelry stores, and consignment shops are bringing their sale racks to the sidewalks at this yard-sale-style shopping event! Pick up a map at one of 3 starting locations: Bobbi’s at Parkside, Lucia Jewelry, or Village... Add to Trip Add to Wishlist North Brevard Art League Holiday Artisan Market The North Brevard Art League will hold a Holiday Artisan Market on Saturday and Sunday, November 1st and 2nd, 2025 from 10 am – 3 pm. The Market will be held in the NBAL Studio located at 1421 Draa Rd., Titusville, FL. Admission and parking are free. The show will... Add to Trip Add to Wishlist Sensory Boo at the Zoo Families of children with exceptionalities are invited to enjoy a magical evening of trick-or-treating, games, sensory exploration and more as you stroll through the Brevard Zoo’s Paws On area. As a come and go event, timed entry tickets are available. Costumes Encouraged! Members: $2 Non-members: $6 Add to Trip Add to Wishlist Cocoa Village Haunted History Tour Join us for the Opening Night of the Cocoa Village Haunted History Tour on September 20th at 8:00 PM—an adults-only experience that dares you to step into the shadows of one of Florida’s most historic towns. Led by our expert guide Zach, a seasoned performer with decades of acting and... Add to Trip Things to Do The Space Coast Bucket List Experience the thrill of a rocket launch, catch a wave and much more, discover the top things you NEED to do when you visit the Space Coast. View Article Stay Connected Don’t miss out on our monthly newsletter for exciting updates on attractions, local events, and personalized itineraries. Name (Required) First Last Zipcode (Required) ZIP / Postal Code Email (Required) Name This field is for validation purposes and should be left unchanged. Subscribe Vacation Planner Dive into the Space Coast Vacation Planner then launch into an unforgettable getaway. View Digital Planner About Contact Us Visitor Center Press Room Travel Professionals Sports Commission Film Commission Submit Your Business Submit an Event Events Calendar Follow Us on Social Media facebook-f instagram youtube pinterest-p Vacation Planner Privacy Policy © 2025 Copyright Florida’s Space Coast Office of Tourism All Rights Reserved"
    },
    {
      "url": "https://turkeycreek.org/kayak-tour",
      "text": "About Us -Turkey Creek Sanctuary Society QUESTIONS? Visit our FAQ page to find your answers! 321.676.6690 321.676.6690 Sign In Create Account Bookings Orders My Account Signed in as: filler@godaddy.com Bookings Orders My Account Sign out Signed in as: filler@godaddy.com Home The Nature Center Dog Policy Classes / Planks / Events Coming Events Nature Tours Donations and Store Biking at Turkey Creek Kayak Tour Volunteer Opportunities FAQ Contact Account Bookings Orders My Account Sign out Sign In Bookings Orders My Account About Us Kayaking Turkey Creek Sanctuary Turkey Creek is an oasis within the city of Palm Bay. It runs from the Melbourne-Tillman Dam north to the Indian River, approximately 3 miles. The creek is a “lazy river” most days requiring easy paddling. High water levels or wind can make the paddling a bit more challenging. Always check the weather prior to beginning any kayak trip. Wear your floatation vest, and bring a good hat, sunscreen, bug spray, and plenty of water. Pull-out areas with restrooms and/or picnic areas are identified on the detailed maps below . Be sure to look up, down, and listen during your trip! There is an abundant variety of birds in the trees along the creek, mammals on the banks, plus fish and reptiles. Please take only photos and good memories. Most importantly, have fun!! Geography and History Turkey Creek is a major tributary of the Indian River Lagoon. The creek mouth forms a bay surrounded by palms from which the city was named. The creek is fed by an extensive canal system covering 100 square miles of land, draining into the Tillman Dam. While the creek is normally slow-moving, it can become engorged after heavy rains and thus move swiftly. Turkey Creek is a brackish water creek, whose natural brown coloring comes from tannins in the leaves of oak trees that have fallen in the water. Beneath the wet hammock along the banks of the creek is a unique geological rock stratum called the “Anastasia Formation”. Perched on this limestone rock is a bed of fossil bones over 250,000 years old. Click the links below to access the self-guided kayaking routes and enjoy! Paddling Route 1: Turkey Creek Sanctuary Turkey Creek Sanctuary is comprised of 133 acres of wonder, biodiversity and natural resources. The park is part of the Brevard County Environmentally Endangered Lands (EEL) Program and the East Florida Birding Trail. It was established in 1978 when the land was donated to the City of Palm Bay and the Florida Audubon Society by the General Development Corporation.  All plants and animals are protected. No fishing is allowed on this stretch. Paddling Route 2:  Turkey Creek Sanctuary to Indian River Approximately 2 hour round trip through the straight, wider section of the creek. This section goes by housing, several bays and ends at the Indian River. Keep an eye out for dolphin and manatee in the bays. Castaway Point is home to beautiful water birds and has a small beach. Download Kayaking Information Click below to download a PDF of the guided tours. Brochure of Kayak Route 1 (pdf) Download Brochure of Kayak Route 2 (pdf) Download Brochure of Kayak Routes and Map Overview (pdf) Download Connect With Us Copyright © 2023 Turkey Creek Sanctuary Society, Inc. - All Rights Reserved. Powered by Home The Nature Center Dog Policy Classes / Planks / Events Coming Events Nature Tours Donations and Store Biking at Turkey Creek Kayak Tour Volunteer Opportunities Contact Privacy Policy QUESTIONS?  Visit the FAQ page. Looking for answers to your questions? Look no further than our FAQ page!  Check it out now and get the answers you've been searching for. Go to FAQ page. This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://turkeycreek.org/ola/services/nature-tours",
      "text": "Nature Tours QUESTIONS? Visit our FAQ page to find your answers! 321.676.6690 321.676.6690 Sign In Create Account Bookings Orders My Account Signed in as: filler@godaddy.com Bookings Orders My Account Sign out Signed in as: filler@godaddy.com Home The Nature Center Dog Policy Classes / Planks / Events Coming Events Nature Tours Donations and Store Biking at Turkey Creek Kayak Tour Volunteer Opportunities FAQ Contact Account Bookings Orders My Account Sign out Sign In Bookings Orders My Account Welcome to the Turkey Creek\nSanctuary Society Website! Welcome to the Turkey Creek\nSanctuary Society Website! Welcome to the Turkey Creek\nSanctuary Society Website! Welcome to the Turkey Creek\nSanctuary Society Website! Welcome to the Turkey Creek\nSanctuary Society Website! QUESTIONS? Visit the FAQ page for answers. Turkey Creek Sanctuary | Palm Bay, Florida TURKEY CREEK SANCTUARY PARK The park property was donated to the City of Palm Bay and the Florida Audubon Society in 1978 by the General Development Corporation i n partnership with Florida Communities Trust .  Later, in 2004, Brevard County's Environmentally Endangered Land Program added acreage to the Sanctuary. Now, the Sanctuary consists of 130 acres of undeveloped, native Florida land The Sanctuary stands on a small section of what was once an ancient Atlantic Ocean dune. This dune is part of a series of dunes formed by wind and wave action when the ocean extended across the state. Through the ages, life, death, and decay have gradually enriched the sand so that a forest stands where only sea oats could survive. Our Sanctuary is a refuge for native Florida plants like sand pines, scrub and turkey oaks, cactus, wire grass, scrub paw paw, large flower rosemary, and more. In addition to the plant life, the Sanctuary is also home to many species of native Florida wildlife, such as manatees, alligators, gopher tortoises, and bobcats. As a part of The Great Florida Birding and Wildlife Trail , many species of birds can be seen while walking through the Sanctuary. TURKEY CREEK SANCTUARY SOCIETY Efforts to preserve Turkey Creek Sanctuary began in 1981 with the formation of a citizen support group.  This group still exists today as the Turkey Creek Sanctuary Society, Inc., a registered 501(c)3 non-profit, and a proud Community Partner of the City of Palm Bay. OUR MISSION The sole purpose of the Turkey Creek Sanctuary Society is to raise funds to support the improvement and upkeep of  Turkey Creek Sanctuary and to educate the community on the vital importance and the many benefits of Florida wildlife and its natural environment. Stay in touch with our newsletter, \"The Creek\" Enter your email below to sign up for our quarterly newsletter. Email Subscribe In the end, our society will be defined not only by what we create, but by what we refuse to destroy. John Sawhill Copyright © 2023 Turkey Creek Sanctuary Society, Inc. - All Rights Reserved. Powered by Home The Nature Center Dog Policy Classes / Planks / Events Coming Events Nature Tours Donations and Store Biking at Turkey Creek Kayak Tour Volunteer Opportunities Contact Privacy Policy QUESTIONS?  Visit the FAQ page. Looking for answers to your questions? Look no further than our FAQ page!  Check it out now and get the answers you've been searching for. Go to FAQ page. This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://crittercreekfarmsanctuary.org/our-team/",
      "text": "Our Team – Critter Creek Farm Sanctuary Our Team The Critter Creek Farm Sanctuary team consists of a group of primarily volunteer workers who donate their time, energy, money, and love to keep CCFS up and running. None of the board members draws a salary for their board duties. Our team is rounded out by veterinarian Dr. Joe Guevara. Though he is officially considered an independent contractor and not a staff member, Dr. Joe has worked with CCFS from the very beginning and works closely with the sanctuary to advise on all manner of health issues. Whether it's walking the fields to remove potentially harmful plants or showing up on a Sunday (and his wedding anniversary) for a sick pig, Dr. Joe has always been there for us. Erin Amerman Founder, Board President Erin founded Critter Creek Farm Sanctuary with three rescued cows in 2016, and is currently president of the Board of Directors. Her road to rescue started where most such things naturally begin: with a rat. At age 7, her mother told her she could finally have her first pet, a hamster. Ecstatic, she went to the pet store to pick out her hamster. But as she held a couple hamsters, who only wanted to pee on her, bite her, or run away from her, a young woman working at the pet store asked her if she had ever considered a rat. She and her mother exchanged looks. A rat? People have pet rats? The young woman explained that rats are wonderful little animals, but no one gives them a chance because they are unfairly judged to be bad and unworthy. Erin held the rat, and he was sweet. There was no biting, there was no running away. He did pee on her, though. Guess which animal she came home with? That rat, named Templeton, taught her a lot about how society can treat very differently two species of animal who would seem to be very similar... You can read the rest of Erin's bio and story here . Chris Amerman Co-Founder, Board Treasurer, and Sanctuary Director Chris met Erin at the University of West Florida in 1995 and they married in 1997. Always an animal lover, he gave up animal products shortly after they married when he ran out of arguments against it. While in medical school, they began volunteering for a no-kill animal shelter and rescuing cats and dogs, which has continued to this day. Through the years, Chris has usually tried to be the voice of reason about their rescues, but Erin generally isn't very good at listening. At CCFS, Chris is Treasurer of the Board of Directors and the Sanctuary Director. He has also developed something of a donkey problem. In this case, Erin tries to be the voice of reason, but Chris generally isn't very good at listening, either. Colin Callahan Facilities Manager, Animal Care Specialist Colin joined Critter Creek Farm Sanctuary in early 2020 as a volunteer. A geneticist by trade, Colin has worked as a bench scientist at institutions such as Johns Hopkins University and the University of Florida. However, in 2024, due to his love of animals and dedication to the sanctuary’s mission, he decided it was time for a career change and came to work for the sanctuary full-time. He is currently the facilities manager and primary caretaker at the Critter Creek facility, where he maintains the grounds, prepares the facility for events, maintains infrastructure, performs vehicle and small engine maintenance, and carefully monitors the animal residents’ health and wellbeing. Colin has a B.S. degree in microbiology and cell science from the University of Florida and a Master of Science in ecology with an emphasis on population genetics from Utah State University. Meredith Berry Science Director, Interim Board Secretary Dr. Meredith Berry is a professor at the University of Florida in the Health and Human Performance department, with special interests in conservation psychology, behavioral research in decision-making, and behavioral economics. She began volunteering for Critter Creek in 2020, and in 2024, she was invited to join the Board. Her background in conservation science and experimental psychology makes her a great asset to the sanctuary’s conservation and science programs, and in October 2024, she directed the first-ever study on sanctuaries as advocacy tools. Meredith completed her postdoctoral training at Johns Hopkins University. She has a Ph.D. in forest and conservation sciences from the University of Montana, an M.S. in experimental psychology from Utah State University, and a B.S. in Psychology from the University of Florida. The author of over 50 scientific publications, her research is frequently covered in popular press news outlets such as Scientific American, Pacific Standard Magazine, Fast Company Magazine, and The Huffington Post. Katelyn Braglia Volunteer Coordinator, Humane Educator Growing up in Jupiter Farms, FL, Katelyn developed a lifelong love for the outdoors, participating in youth service-learning camps hosted by a local wildlife sanctuary. After relocating to Nevada with her family, she combined her passions for nature and education—working at both a wildlife sanctuary and a preschool center while attending the University of Nevada, Reno. She volunteered at her first farm animal sanctuary in Las Vegas after graduating with her bachelors. The bonds she formed with the resident animals during her time solidified her dedication to activism, humane education, and compassionate animal care. When Katelyn returned to Florida in December 2023, she was excited to connect with the Critter Creek community after following them on social media. After a year of volunteering, she officially joined the team in December 2024 as Volunteer Coordinator and Humane Educator. With a B.S. in Human Development and Family Studies, minor in Developmental Disabilities, and experience as a middle school science teacher, Katelyn now gets to combine her love of teaching with her commitment to animals—creating an accessible and positive experience for humans and animals alike! Please reach out to katelyn at katelyn@crittercreekfarmsanctuary.org for volunteer and education inquiries. Gretchen Sumrall Executive Assistant, Animal Care Specialist Gretchen joined the Critter Creek team in May 2025 after transitioning from her job as a USDA Chemical Ecology Assistant to pursue her passion for animal care. She now serves as Executive Assistant, supporting the sanctuary through a blend of hands-on animal care and behind-the-scenes business operations. Gretchen works closely with the team to help ensure the sanctuary runs smoothly—from feeding donkeys to organizing files. While she loves all the animals at Critter Creek, she has a special fondness for the donkeys and knows each one by their quirks. Outside of work, Gretchen enjoys autumnal walks with her dog, Duckie, taking her cat Sylvie on leash walks, and listening to Taylor Swift. Samantha M. Bennett-Clark Equine Manager Samantha joined the team in December 2019. She found her way to Critter Creek a few months prior when she urgently needed to find a home for two heifers, Jingles and Bella. Samantha graduated from the University of Florida with a bachelor’s degree in Animal Sciences and Plant Science and a minor in Agricultural and Natural Resources Law. An equine wizard, Samantha has been Critter Creek's equine manager since 2021. Samantha is also a bovine wizard, and she remains the only person who can handle our resident terror-bird, Cletus. When she isn’t working on the sanctuary or studying, Samantha enjoys spending time with her cats, steer, and horses. © Critter Creek Farm Sanctuary join our mailing list Name * Email * sign up"
    },
    {
      "url": "https://turkeycreeknp.com/",
      "text": "Jefferson County Greenways - Home close Home Visit Arrow down Ruffner Mountain Arrow Right Red Mountain Park Arrow Right Turkey Creek Nature Preserve Arrow Right Arrow Right Trails Arrow Right Event & Program Calendar Arrow Right Event Space Arrow Right FAQs Programs Arrow down Calendar Upcoming Events Arrow Right Youth Field Trips Junior Naturalist Wildlife Ambassadors At Home Resources Arrow Right College Field Science Internships Arrow Right Community Events &Â Programs Citizen Science Offsite Opportunities Volunteer Conservation Arrow down Arrow Right Biodiversity Arrow Right Monitoring Arrow Right Projects Arrow Right Research Support Arrow down Arrow Right Become a Member Arrow Right Campaign â East Side Park Arrow Right Donate Arrow Right Partnerships Arrow Right Volunteer About Arrow down Arrow Right History Arrow Right About Us Arrow Right Annual Report Arrow Right Event &Â Program Calendar Arrow Right Job Opportunities Arrow Right News Arrow Right Our Team Arrow Right Partnerships Shop Search Explore the trails We have miles and miles of great experiences awaiting you Arrow Right Find your perfect trail No items found. Menu Menu Visit Ruffner Mountain Arrow Right Red Mountain Park Arrow Right Turkey Creek Nature Preserve Arrow Right Arrow Right Trails Arrow Right Event & Program Calendar Arrow Right Event Space Arrow Right FAQs Programs Calendar Upcoming Events Arrow Right Youth Field Trips Junior Naturalist Wildlife Ambassadors At Home Resources Arrow Right College Field Science Internships Arrow Right Community Events &Â Programs Citizen Science Offsite Opportunities Volunteer Conservation Arrow Right Biodiversity Arrow Right Monitoring Arrow Right Projects Arrow Right Research Support Arrow Right Become a Member Arrow Right Campaign â East Side Park Arrow Right Donate Arrow Right Partnerships Arrow Right Volunteer About Arrow Right History Arrow Right About Us Arrow Right Annual Report Arrow Right Event &Â Program Calendar Arrow Right Job Opportunities Arrow Right News Arrow Right Our Team Arrow Right Partnerships Shop Cart Search Search Icon close close Explore your backyard: Connect with nature across Jefferson County Arrow Right Visit Us Arrow Right Become A Member Arrow Right Discover Trails Arrow Right Read Our Blog Upcoming Events Sep 11 2025 Ruffner Mountain Garden Workday Free Calling all volunteers! Come join our Volunteer Coordinator and our Conservation Director as we tend our native habitat gardens at Ruffner Mountain. See more Sep 12 2025 Greenhouse Workdays at TCNP Free Come join our Volunteer Coordinator and our Conservation Director as we seek to accomplish various tasks at the Turkey Creek greenhouse! See more Sep 13 2025 Landscaping with Native Plants Workshop Free In this workshop, youâll learn about Alabama native plants, the best ways to plant them, and landscaping design tips. Youâll also get a tour of the Ruffner Mountain habitat garden and get hands-on experience with propagating plants. See more Arrow Right All Events Arrow Right FAQs News September 10, 2025 Fall Native Plant Sale at Ruffner Mountain Greenhouse Fall is the perfect time to plant native species, and Jefferson County Greenways' Fall Native Plant Sale at the Ruffner Mountain Greenhouse has a large inventory to choose from. Cooler temperatures, warm soil, and autumn rains create ideal conditions for strong root development, giving plants a head start before spring. Arrow Right Read more September 10, 2025 Fall Native Plant Sale at Ruffner Mountain Greenhouse Fall is the perfect time to plant native species, and Jefferson County Greenways' Fall Native Plant Sale at the Ruffner Mountain Greenhouse has a large inventory to choose from. Cooler temperatures, warm soil, and autumn rains create ideal conditions for strong root development, giving plants a head start before spring. September 2, 2025 2025 MAPS Bird Banding at Ruffner Mountain The MAPS (Monitoring Avian Productivity and Survivorship) Bird Banding Program is a continent-wide initiative that collects critical, long-term data on the population trends and demographic parameters for over 150 target landbird species at multiple spatial scales. In general, each participating siteâincluding Ruffner Mountain in Birmingham, Alabamaâsets up 10 fine nets at specific parameters to catch, band, and release birds in their breeding habitat, roughly every ten days through the course of the breeding season. Arrow Right Read more September 2, 2025 2025 MAPS Bird Banding at Ruffner Mountain The MAPS (Monitoring Avian Productivity and Survivorship) Bird Banding Program is a continent-wide initiative that collects critical, long-term data on the population trends and demographic parameters for over 150 target landbird species at multiple spatial scales. In general, each participating siteâincluding Ruffner Mountain in Birmingham, Alabamaâsets up 10 fine nets at specific parameters to catch, band, and release birds in their breeding habitat, roughly every ten days through the course of the breeding season. August 28, 2025 UAB Students Help Salvage Native Plants for New Universally Designed Park On August 21, 2025, first-year students from the UAB Honors College rolled up their sleeves to help transform East Side Park into a universally designed nature sanctuary for the Birmingham community and the surrounding region. The students worked alongside Jefferson County Greenways (JCG) staff and volunteers to salvage native plants from Red Mountain Parkâs improvement zone to give them a second life at East Side Park. Arrow Right Read more August 28, 2025 UAB Students Help Salvage Native Plants for New Universally Designed Park On August 21, 2025, first-year students from the UAB Honors College rolled up their sleeves to help transform East Side Park into a universally designed nature sanctuary for the Birmingham community and the surrounding region. The students worked alongside Jefferson County Greenways (JCG) staff and volunteers to salvage native plants from Red Mountain Parkâs improvement zone to give them a second life at East Side Park. July 7, 2025 Red Mountain Park To See Improvements With Added Amenities Jefferson County Greenways is thrilled to announce a significant upgrade coming to Red Mountain Park, which will enhance the visitor experience and benefit the community. Thanks to funding from our partnership with Innovate Alabama Network, the park will be adding universally accessible restrooms at the Frankfurt Drive entrance. These amenities are designed to enhance safety and enjoyment for visitors by providing on-site restrooms that are well lit and accessible to individuals with disabilities. Arrow Right Read more July 7, 2025 Red Mountain Park To See Improvements With Added Amenities Jefferson County Greenways is thrilled to announce a significant upgrade coming to Red Mountain Park, which will enhance the visitor experience and benefit the community. Thanks to funding from our partnership with Innovate Alabama Network, the park will be adding universally accessible restrooms at the Frankfurt Drive entrance. These amenities are designed to enhance safety and enjoyment for visitors by providing on-site restrooms that are well lit and accessible to individuals with disabilities. Arrow Right More News Jefferson County Greenways Commission 283 Lyon Lane Birmingham AL 35211 205-202-6043 Jefferson County Greenways Foundation 1214 81st Street South, Birmingham AL 35206 205-833-8264 All content is Â© 2025, Jefferson County Greenways Visit Plan Your visit Upcoming Events Turkey Creek Nature Preserve Red Mountain Park Ruffner Mountain Visit FAQ Reservations Learn Youth Field Trips Wildlife Ambassadors Junior Naturalist Internships College Field Science Connect Become a Member Events & Programs Event Space News Support Volunteer Steward Native Plant Sale Citizen Science Volunteer Conservation Initiatives Support Membership Donate Sponsors &Â Partners United Campaign About History People Media & Blog Photo Gallery Postings Contact Contact Us info@jeffcogreenways.org Follow us Sign Up For Our Newsletter Instagram Facebook LinkedIn Website by Granyon Accessibility At Jefferson County Greenways, we strive to be inclusive. Where possible, we provide physical access to wild spaces and unaltered natural features. In the development of new facilities, we will make every effort to be universal in our designs. If you encounter a barrier to your enjoyment of our webpage or facilities, we want to know how we can do better! If there is a reasonable accommodation that may improve your experience, we want to work with you to meet your needs. Please let us know by emailing info@jeffcogreenways.org . Privacy Policy At Jefferson County Greenways, we value and respect the privacy of our donors, members, and subscribers. We are committed to protecting your personal information and ensuring your trust in how we collect, use, and protect your data. We do not sell, rent, or trade any personal information, including contact details, donation records, or membership information, to third parties. Your information is used solely to process donations, manage memberships, and communicate with you about our work and upcoming events. We will never share your personal information without your consent, except as required by law. We take all necessary measures to safeguard your data and ensure its confidentiality. If you have any questions about how we handle your information, or if you wish to review or update your details, please contact us at info@jeffcogreenways.org ."
    },
    {
      "url": "https://www.turkeyclassicfurniture.com/contact/",
      "text": "contact – Turkey Classic Furniture – Luxury Furniture Models Skip to content Home Classic Classic Sofa Set Models Classic Bedroom Models Classic Dining Room Set Classic Majlees Model Classic Door Models Corner Sofa Decoration Classic Bathroom Classic Kitchen Accessories Pet Furniture Chandelier Wall and Tv Units Kids and Teens Furniture Hotel Office Modern Contact Menu Home Classic Classic Sofa Set Models Classic Bedroom Models Classic Dining Room Set Classic Majlees Model Classic Door Models Corner Sofa Decoration Classic Bathroom Classic Kitchen Accessories Pet Furniture Chandelier Wall and Tv Units Kids and Teens Furniture Hotel Office Modern Contact Search Close Home Classic Classic Sofa Set Models Classic Bedroom Models Classic Dining Room Set Classic Majlees Model Classic Door Models Corner Sofa Decoration Classic Bathroom Classic Kitchen Accessories Pet Furniture Chandelier Wall and Tv Units Kids and Teens Furniture Hotel Office Modern Contact Menu Home Classic Classic Sofa Set Models Classic Bedroom Models Classic Dining Room Set Classic Majlees Model Classic Door Models Corner Sofa Decoration Classic Bathroom Classic Kitchen Accessories Pet Furniture Chandelier Wall and Tv Units Kids and Teens Furniture Hotel Office Modern Contact Search Name - Surname Email Country Phone Message Send SHOWROOM Masko Mobilya Kenti 4-B Blok No:11-13 Başakşehir / İstanbul WHATSAPP +90 552 445 65 05 PHONE +90 212 675 04 46 EMAIL info@turkeyclassicfurniture.com Instagram Facebook-square Youtube turkeyclassicfurniture.com ©2025 ASORTIE FURNITURE Sofa Sets Dining Room Badroom Models SetCorner Sofa Wall & TV Units Office Furniture Hotel Furniture Chandelier Kitchen Decor Accessories info@asortie.com Telephone :+90 212 675 04 46 Whatsap: +90 552 445 65 05 Masko Mobilya Kenti 4-B Blok No:11-13 Başakşehir / İstanbul"
    },
    {
      "url": "https://turkeycreek.org/faq",
      "text": "Frequently Asked Questions - Turkey Creek Sanctuary Society QUESTIONS? Visit our FAQ page to find your answers! 321.676.6690 321.676.6690 Sign In Create Account Bookings Orders My Account Signed in as: filler@godaddy.com Bookings Orders My Account Sign out Signed in as: filler@godaddy.com Home The Nature Center Dog Policy Classes / Planks / Events Coming Events Nature Tours Donations and Store Biking at Turkey Creek Kayak Tour Volunteer Opportunities FAQ Contact Account Bookings Orders My Account Sign out Sign In Bookings Orders My Account Frequently Asked Questions Please reach us at Turkeycreekfriends@gmail.com if you cannot find an answer to your question. Can I bring my dogs to Turkey Creek? No. We only allow trained service dogs at Turkey Creek. Emotional support dogs are not trained service animals! (Please see our dog policy page for additional information.) Do you rent Kayaks? No . We do not rent kayaks. Contact: Paddling Pardise at 321.258.4492, or Palm Bay Marina at 321.723.0851 Do you charge to visit the park? No. There is no fee to visit the park. Will we see Manatee or Alligators? Maybe. Manatees and alligators are wild creatures that come and go as they please. Manatee frequent Turkey Creek, and alligators live in the creek, but we can never guarantee that you will see them. Can I bike at Turkey Creek? Our bike trails are located east of the main Sanctuary, across Turkey Creek. (Please see our biking page for directions to the bike trails.) When are you open? The park is open dawn to dusk, 365 days a year. The Nature Center is open 7 days a week from 9am to 4pm. Is there a trail map? Yes. Maps are available at our outdoor Kiosk at the park's entrance or inside the Nature Center. Can I bring a wheelchair, scooter, or stroller? Yes. Our boardwalk and some trails are suitable for wheelchairs, mobility scooters, and strollers. No other wheeled vehicles are allowed within the Sanctuary. Is it safe to walk alone in the Park? Many individuals walk the boardwalk and trails alone every day. We are fairly busy, so you are rarely totally alone. However, if you want to feel safer, the boardwalk would be your best option. Can I have an event there?                  (Wedding, birthday, memorial, etc.) Yes. You must contact the rangers to make arrangements before the event. 321.676.6690 Do you accept unwanted animals? No. We do not accept any unwanted animals. If you find injured wildlife, call \"Florida Wildlife Hospital\" at 321.254.8843 Can we fish at Turkey Creek? No. Fishing is not allowed from the shoreline or the boardwalk within the Sanctuary boundaries. However, fishing is permited if you are on the water in a boat. Fishing is also allowed at Ais Trail Park and Goode Park, which are both downstream from the Sanctuary. Copyright © 2023 Turkey Creek Sanctuary Society, Inc. - All Rights Reserved. Powered by Home The Nature Center Dog Policy Classes / Planks / Events Coming Events Nature Tours Donations and Store Biking at Turkey Creek Kayak Tour Volunteer Opportunities Contact Privacy Policy QUESTIONS?  Visit the FAQ page. Looking for answers to your questions? Look no further than our FAQ page!  Check it out now and get the answers you've been searching for. Go to FAQ page. This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    }
  ]
}