{
  "fuentes": [
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://twobuks.com/",
      "email": "info@twobucks.com"
    },
    {
      "url": "https://twobuks.com/",
      "email": "jim@twobuks.com"
    },
    {
      "url": "https://twobuks.com/contact-us/",
      "email": "info@twobucks.com"
    },
    {
      "url": "https://twobuks.com/contact-us/",
      "email": "jim@twobuks.com"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    },
    {
      "url": "https://www.enrollwaresolutions.com/contact-us",
      "email": "info@enrollware.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://twobuks.com/privacy-policy/",
      "email": "jim@twobuks.com"
    },
    {
      "url": "https://twobuks.com/privacy-policy/",
      "email": "info@twobucks.com"
    },
    {
      "url": "https://twobuks.com/privacy-policy/",
      "email": "jim@twobuks.com"
    },
    {
      "url": "https://www.bucknbullsaloon.com/contact",
      "email": "info@bucknbullsaloon.com"
    },
    {
      "url": "https://www.bucknbullsaloon.com/contact",
      "email": "james@bond.com"
    }
  ],
  "mails": [
    "anirudh.shetye@skanem.com",
    "beatrice.malle@skanem.com",
    "info.nairobi@skanem.com",
    "info@bucknbullsaloon.com",
    "info@enrollware.com",
    "info@inzmo.com",
    "info@scibpaints.com",
    "info@twobucks.com",
    "james@bond.com",
    "jane@skanem.ke",
    "jim@twobuks.com",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "sachen.gudka@skanem.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com"
  ],
  "nombre_sitio": "twobuks.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://twobuks.com/",
      "text": "Home Home Menu About Us Events Contact Us Web Design Your content goes here. Edit or remove this text inline. Logo Design Your content goes here. Edit or remove this text inline. Web Development Your content goes here. Edit or remove this text inline. White Labeling Your content goes here. Edit or remove this text inline. VIEW ALL SERVICES Real People Real Cheers 727.442.0812 1915 N Hercules Ave Clearwater 727-442-0812 Best In Local Live Entertainment Karaoke Fridays Hospitality Worker VIP program Two Pool Tables Three “Bullshooter” Dart Boards Golden Tee PGA TOUR Golf Live Bands Saturdays Sports All The Time We Show all NFL Games 17 TV’s Great Food, Beer, Drinks, Staff Non-Smoking Environment Indoors Outdoor Patio Service With Smok ing General Trivia Tuesday Follow Follow Come Watch The Game With Us!! Join Us For Fun And More Back to Top Location: 1915 N Hercules Ave  Clearwater, Fl 33763 (At Sunset Point Rd.) QUICK LINKS Home Menu About Us Events Contact Us HOURS Mon-Thurs: 12 Noon-1:30am Fri: 12 Noon-3:00am Sat & Sun: 11:00am-3:00am Follow Follow GET IN TOUCH  727-442-0812  info@twobucks.com Quick Links Home Menu About Us Events Contact Us Hours Mon~Thurs: 12 Noon~1:30am Friday: 12 Noon~3:00am Sat & Sun: 11:am to 3:00am Get In Touch Call 727-441-0812 Email: jim@twobuks.com Location 1915 N Hercules Ave(At Sunset Point Rd)Clearwater FL 33763 ©TwoBuks , September 10, 2025 Privacy Policy • Terms of Service Powered By Hydrus Connect"
    },
    {
      "url": "https://twobuks.com/contact-us/",
      "text": "Contact Us | Two Buks Home Menu About Us Events Contact Us Web Design Your content goes here. Edit or remove this text inline. Logo Design Your content goes here. Edit or remove this text inline. Web Development Your content goes here. Edit or remove this text inline. White Labeling Your content goes here. Edit or remove this text inline. VIEW ALL SERVICES 727.442.0812 1915 N Hercules Ave Clearwater 727-442-0812 Contact Us Name First Last Phone Email Comments CAPTCHA Location: 1915 N Hercules Ave  Clearwater, Fl 33763 (At Sunset Point Rd.) QUICK LINKS Home Menu About Us Events Contact Us HOURS Mon-Thurs: 12 Noon-1:30am Fri: 12 Noon-3:00am Sat & Sun: 11:00am-3:00am Follow Follow GET IN TOUCH  727-442-0812  info@twobucks.com Quick Links Home Menu About Us Events Contact Us Hours Mon~Thurs: 12 Noon~1:30am Friday: 12 Noon~3:00am Sat & Sun: 11:am to 3:00am Get In Touch Call 727-441-0812 Email: jim@twobuks.com Location 1915 N Hercules Ave(At Sunset Point Rd)Clearwater FL 33763 ©TwoBuks , September 10, 2025 Privacy Policy • Terms of Service Powered By Hydrus Connect"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    },
    {
      "url": "https://www.enrollwaresolutions.com/contact-us",
      "text": "Contact the Team | Enrollware Skip to content Client Login All-in-One Platform Solutions Healthcare/AHA Corporate Government Continuing Education Pricing Contact Sign Up Contact Enrollware How to Reach Us To reach a representative, fill out the contact form on this page or give us a call. Phone: Support: 561-247-2432 Support Hours: Monday-Friday (8am-6pm ET) Email: Sales Inquiries: info@enrollware.com Support: support@enrollware.com Mailing Address: Fullsteam Software Holdings LLC DBA Enrollware Software 540 Devall Drive, Suite 301 Auburn, AL 36832 Password Assistance? Please contact your training center administrator. Enrollware can only issue usernames or passwords for the primary administrators of our direct clients. Online Class Registration and Management Features All-in-One Platform Pricing EnrollwarePay Solutions Healthcare Government Continuing Education Corporate Resources Contact Us Privacy Policy Terms & Conditions Responsible Disclosure Policy Client Login Follow Us © 2025 Enrollware. All rights reserved."
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://twobuks.com/privacy-policy/",
      "text": "Privacy Policy | Two Buks Home Menu About Us Events Contact Us Web Design Your content goes here. Edit or remove this text inline. Logo Design Your content goes here. Edit or remove this text inline. Web Development Your content goes here. Edit or remove this text inline. White Labeling Your content goes here. Edit or remove this text inline. VIEW ALL SERVICES www.twobuks.com Privacy Policy Type of website: Restaurant Website Effective date: 27th day of October, 2022 www.twobuks.com (the “Site”) is owned and operated by Two Buks. Two Buks can be contacted at: jim@twobuks.com (727) 442-0812 1915 N. Hercules Ave. Clearwater, Florida Purpose The purpose of this privacy policy (this “Privacy Policy”) is to inform users of our Site of the following: The personal data we will collect; Use of collected data; Who has access to the data collected; The rights of Site users; and The Site’s cookie policy. This Privacy Policy applies in addition to the terms and conditions of our Site. Consent By using our Site users agree that they consent to: The conditions set out in this Privacy Policy; and The collection, use, and retention of the data listed in this Privacy Policy. Personal Data We Collect We only collect data that helps us achieve the purpose set out in this Privacy Policy. We will not collect any additional data beyond the data listed below without notifying you first. Data Collected Automatically When you visit and use our Site, we may automatically collect and store the following information: IP address; Location; Hardware and software details; Clicked links; and Content viewed. How We Use Personal Data Data collected on our Site will only be used for the purposes specified in this Privacy Policy or indicated on the relevant pages of our Site. We will not use your data beyond what we disclose in this Privacy Policy. The data we collect automatically is used for the following purposes: Analytics and statistics for business use. Who We Share Personal Data With Employees We may disclose user data to any member of our organization who reasonably needs access to user data to achieve the purposes set out in this Privacy Policy. Other Disclosures We will not sell or share your data with other third parties, except in the following cases: If the law requires it; If it is required for any legal proceeding; To prove or protect our legal rights; and To buyers or potential buyers of this company in the event that we seek to sell the company. If you follow hyperlinks from our Site to another Site, please note that we are not responsible for and have no control over their privacy policies and practices. How Long We Store Personal Data User data will be stored until the purpose the data was collected for has been achieved. You will be notified if your data is kept for longer than this period. How We Protect Your Personal Data n order to protect your security, we use the strongest available browser encryption and store all of our data on dedicated servers. All data is only accessible to our employees and third party vendors hired to do specific tasks. Our employees & vendors are bound by strict confidentiality agreements and a breach of this agreement would result in the employee’s or vendors termination. While we take all reasonable precautions to ensure that user data is secure and that users are protected, there always remains the risk of harm. The Internet as a whole can be insecure at times and therefore we are unable to guarantee the security of user data beyond what is reasonably practical. Children We do not knowingly collect or use personal data from children under 13 years of age. If we learn that we have collected personal data from a child under 13 years of age, the personal data will be deleted as soon as possible. If a child under 13 years of age has provided us with personal data their parent or guardian may contact our privacy officer. How to Access, Modify, Delete, or Challenge the Data Collected If you would like to know if we have collected your personal data, how we have used your personal data, if we have disclosed your personal data and to who we disclosed your personal data, or if you would like your data to be deleted or modified in any way, please contact our privacy officer here: Jim Jim@TwoBuks.com (727) 442-0812 1915 N. Hercules Ave. Clearwater, Florida Cookie Policy A cookie is a small file, stored on a user’s hard drive by a website. Its purpose is to collect data relating to the user’s browsing habits. You can choose to be notified each time a cookie is transmitted. You can also choose to disable cookies entirely in your internet browser, but this may decrease the quality of your user experience. We use the following types of cookies on our Site: Functional cookies Functional cookies are used to remember the selections you make on our Site so that your selections are saved for your next visits; Analytical cookies Analytical cookies allow us to improve the design and functionality of our Site by collecting data on how you access our Site, for example data on the content you access, how long you stay on our Site, etc; Targeting cookies Targeting cookies collect data on how you use the Site and your preferences. This allows us to personalize the information you see on our Site for you; and Third-Party Cookies Third-party cookies are created by a website other than ours. We may use third-party cookies to achieve the following purposes: Modifications This Privacy Policy may be amended from time to time in order to maintain compliance with the law and to reflect any changes to our data collection process. When we amend this Privacy Policy we will update the “Effective Date” at the top of this Privacy Policy. We recommend that our users periodically review our Privacy Policy to ensure that they are notified of any updates. If necessary, we may notify users by email of changes to this Privacy Policy. Contact Information If you have any questions, concerns or complaints, you can contact our privacy officer, Jim, at: Jim@TwoBuks.com (727) 442-0812 1915 N. Hercules Ave. Clearwater, Florida ©2002-2022 LawDepot.com® Location: 1915 N Hercules Ave  Clearwater, Fl 33763 (At Sunset Point Rd.) QUICK LINKS Home Menu About Us Events Contact Us HOURS Mon-Thurs: 12 Noon-1:30am Fri: 12 Noon-3:00am Sat & Sun: 11:00am-3:00am Follow Follow GET IN TOUCH  727-442-0812  info@twobucks.com Quick Links Home Menu About Us Events Contact Us Hours Mon~Thurs: 12 Noon~1:30am Friday: 12 Noon~3:00am Sat & Sun: 11:am to 3:00am Get In Touch Call 727-441-0812 Email: jim@twobuks.com Location 1915 N Hercules Ave(At Sunset Point Rd)Clearwater FL 33763 ©TwoBuks , September 10, 2025 Privacy Policy • Terms of Service Powered By Hydrus Connect"
    },
    {
      "url": "https://www.bucknbullsaloon.com/contact",
      "text": "Buck' N Bull Saloon | Get in Touch Whats On Events Buck' N Bull Live: The Honky-Tonk Hoedown The Country Bottomless Brunch Country Cruisin' Who We Are Gallery Contact Tickets HIT US UP Get in touch here: Name: Email Address: Message: Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Early price. This will sell out. Come Join Us! We currently don't have any events scheduled, as soon as we're allowed to host events again we'll have loads going on! Book Tickets Buck' N Bull Saloon is the UK's biggest pop-up country music bar and nightclub. We frequently pop-up in venues around the UK, for information about our next events please visit our tickets page. Head Office: 5th floor, 167-169 Great Portland St, London W1W 5PF Drop Us a Line Navigation Home Who Are We Events Tickets Gallery Contact Exclusive pre-sales &Â more: Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. FollowÂ Us Copyright 2021 Buck'Â N BullÂ Saloon Wesbsite made with love by off brand ."
    }
  ]
}