{
  "fuentes": [
    {
      "url": "https://mollymalonesirishpub.com/covington/contact/",
      "email": "info@mollymalonesirishpub.com"
    },
    {
      "url": "https://molly-mchugh-s-irish-pub.ueniweb.com/",
      "email": "jack@mchughspubs.com"
    },
    {
      "url": "https://www.mollymaguiresphoenixville.com/",
      "email": "events@mollymaguirespubs.com"
    },
    {
      "url": "https://www.mollymaguiresphoenixville.com/",
      "email": "info@lmssolutions.biz"
    },
    {
      "url": "https://mollymalones.gr/",
      "email": "info@mollymalones.gr"
    },
    {
      "url": "https://www.irishrugby.ie/irfu/about/irfu-staff/",
      "email": "info@irishrugby.ie"
    },
    {
      "url": "https://www.cascadiadaily.com/2024/jun/09/beloved-bellingham-bar-reborn-refined-on-cornwall-avenue/",
      "email": "newstips@cascadiadaily.com"
    }
  ],
  "mails": [
    "events@mollymaguirespubs.com",
    "info@irishrugby.ie",
    "info@lmssolutions.biz",
    "info@mollymalones.gr",
    "info@mollymalonesirishpub.com",
    "jack@mchughspubs.com",
    "newstips@cascadiadaily.com"
  ],
  "nombre_sitio": "ueniweb.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://mollymalonesirishpub.com/covington/contact/",
      "text": "Contact Molly Malone's Irish Pub Covington | Get in Touch Today Home About Menus Dinner Brunch Late Night Order Online Drinks Menu Private Events Locations Louisville Covington Contact Home About Menus Dinner Brunch Late Night Order Online Drinks Menu Private Events Locations Louisville Covington Contact CONTACT US info@mollymalonesirishpub.com (859) 491-6659 112 E. Fourth Street, Roebling Point, Covington, KY 41011 At Molly Malone’s Irish Pub, we thrive on creating a lively atmosphere where you can dive into authentic Irish dishes and explore our fantastic selection of drinks. With live music every week and dedicated spaces for private events, we’re the ideal spot to gather with friends and celebrate special occasions. Quick Links Menus Calendar Gift Cards Private Events Locations Useful Links About Us Directions Contact Parking Order Online Covington 112 E 4th St, Covington, KY 859 491 6659 info@mollymalonesirishpub.com All rights reserved. Molly Malones 2025"
    },
    {
      "url": "https://molly-mchugh-s-irish-pub.ueniweb.com/",
      "text": "Molly McHugh's Irish Pub | Top Bar in Lakeland"
    },
    {
      "url": "https://www.mollymaguiresphoenixville.com/",
      "text": "Phoenixville Irish Restaurant & Bar | Live Music | Private Events Wukong778: Slot Thailand #1 | Link Slot Gacor Gampang Menang Hari Ini, Anti Boncos! WUKONG778 : SLOT GACOR GAMPANG MENANG slot gacor 4d Slot 4D Dengan MAXI188 Link Gacor Terpercaya Gampang Menang Hari Ini Skip to content Molly Maguire's Irish Restaurant & Pub Home 1/2 Way To St. Patrick’s Day Menu Menu Drink Menu Features Banquet Menu Catering Menu Parties & Catering Private Parties & Catering Inquiry The Fenix Bar & Lounge Molly’s up Top on the Rooftop What Guests Say Events Live Music More Visit Us Reservations Gift Cards St. Patrick’s Day Employment Virtual Tour Merchandise Order Online Home 1/2 Way To St. Patrick’s Day Menu Menu Drink Menu Features Banquet Menu Catering Menu Parties & Catering Private Parties & Catering Inquiry The Fenix Bar & Lounge Molly’s up Top on the Rooftop What Guests Say Events Live Music More Visit Us Reservations Gift Cards St. Patrick’s Day Employment Virtual Tour Merchandise GET READY! It's Almost our Annual 1/2 Way to St. Patrick's Day Party in. Friday, September 12th through Sunday, September 14th Find our more here! Check Out Our New Food Menu! View Here Welcome to Molly's! The Best Irish Restaurant & Pub in Phoenixville Where people come from all over for authentic Irish cuisine, top shelf cocktails & even better company! JOIN OUR TEAM! Now accepting applications for Hosts, Hostesses, Servers and Security! APPLY NOW! Patio & Balcony Seating Available for a Scenic View View Menu Book Our Private Party & Event Space! Learn More Molly Maguires Irish Restaurant and Pub Established in 2007 Molly Maguire’s Irish Restaurant & Pub, centrally located at the corner of Bridge & Main in the heart of downtown Phoenixville, is one of the finest authentic Irish Pubs in the entire Philadelphia area. Our Phoenixville restaurant menu offers outstanding Irish cuisine, mouth-watering desserts, a full bar with a fantastic craft beer selection, daily happy hour specials, and live entertainment & events every week! But don’t just take our word for it, see for yourself what people are saying about the best Irish Pub and restaurant in Phoenixville. Molly’s also offers numerous private dining rooms and a variety of group dining options to help make your special event a memorable one. Whether it’s a birthday party, rehearsal dinner or company event, Molly’s can easily accommodate any special occasion! View Menu & Order Online Reserve a Table Live Music Every Friday & Saturday Catering & Private Parties View Menu & Order Online Reserve a Table Live Music Every Friday & Saturday Catering & Private Parties CIGARS UNDER THE STARS OCTOBER 7, 7 PM -10 PM Join us for an evening of rich flavors and smooth indulgence, where fine whiskey meets premium cigars in the warm ambiance of Molly Maguire’s. Where: 3rd floor Roof Top at Molly’s *Limited tickets available for purchase below. Tickets are $70 each. The ticket includes 2 Premium cigars paired with bourbon and Tapas items. Please drink responsibly. Get your tickets here! HAPPY HOUR Monday – Friday 5:00pm to 7:00pm Drink Specials $5 Wines $5 Well Mixers $5 Draft Beers (16 oz.) Food Specials $7.50 Appetizers Choose from Colcannon Potato Balls, Cheesesteak Egg Rolls, Buffalo Chicken Egg Rolls, Pretzel Bites, or Irish Curry Fries BRUNCH IT! Saturdays & Sundays 11:00am to 2:00pm Full Breakfast Menu Omelets, Pancakes, Bounty Platters, Irish Breakfast, Celtic Breakfast Boxty, Breakfast Sandwiches, French Toast, Breakfast Burgers, Rasher’s, Bangers, Home Fries & more available! Brunch Drink Specials $6 Orange Crushes $5 Bloody Marys $5 Mimosas Gift Cards Give the gift of good food! Purchase Gift Card Gift Cards Give the gift of good food! Purchase Gift Card Follow Us on Instagram to Stay Up to Date on What’s Happening at Molly’s! Join Our Team! Molly Maguire’s is hiring! We are currently looking for experienced and skilled servers and runners to join our team at Molly’s! Part-time and full-time positions available. Experience is required & training will be provided. Learn more about employment at Molly’s and apply now at the link below! Learn More & Apply Now Take a Virtual Tour of Molly Maguires! Contact 197 Bridge Street Phoenixville, PA 19460 Phone: (610) 933-9550 Join Our Mailing List Find us on: Facebook page opens in new window Instagram page opens in new window Hours Sunday 11:00AM – 9:00PM Monday 11:00AM – 10:00PM Tuesday – Wednesday 11:00AM – 11:00PM Thursday – Saturday 11:00AM – 2:00AM Copyright © 2025 Molly Maguires. Website Designed & Managed by LMS Solutions, Inc. Go to Top"
    },
    {
      "url": "https://mollymalones.gr/",
      "text": "Irish Pub & Restaurant Glyfada Athens – Molly Malones's Athens – Irish Pub & Restaurant in Glyfada Athens. Molly Malone's Irish Pub Restaurant provides you the best experience in drinks and food. HOME  | MENU  | NEWS-EVENTS  | Irish Pub & Restaurant... A new Taste Experience... Enjoy unique Drinks... Authentic GUINNESS... The best Irish Pub in Athens... A must Irish Pub... About us. Molly Malones was the first authentic Irish Pub to be established in Athens . It was opened in Glyfada Athens in December 2003 and quickly became one of the most popular venues in the South Eastern suburb of Athens. Come and enjoy our unique blend of good food and drink in friendly surroundings served by cheerful and welcoming staff.! “All major sporting events are shown on out large-screen televisions and if there is a particular football match or other event that you would like to see please ask one of the staff if it is available and we will do our best to find it for you.” Legend Irish music…Hit play! https://mollymalones.gr/wp-content/uploads/2018/11/Saw-Doctors-Green-and-Red-of-Mayo-lyrics.mp3 . Menu. Take a brief look in our Menu (food & drinks). Menu Preview Photo gallery. . News - Events. Learn first our news and events we share with you, for you.! News - Events . Contact with us. Get in touch with Molly Mallone’s stuff. tel.: (210) 8944 247 | email.: info@mollymalones.gr Giannitsopoulou 8, Glyfada, Athens Meet James Joyce.. Best Irish Pub & Restaurant in Monastiraki, Athens..!! James Joyce © Copyright 2003 -2018 Molly Malones's Irish Pub & Restaurant at Glyfada  |  Giannitsopoulou 8, Glyfada, Athens - 210 8944 247"
    },
    {
      "url": "https://www.irishrugby.ie/irfu/about/irfu-staff/",
      "text": "Irish Rugby | IRFU Staff × Menu Home Ireland Rugby World Cup 2025 Tickets Shop Provincial irishrugby+ Energia AIL Playing the Game Running Your Club IRFU Ireland Fixtures & Results Tables Men Women Ireland Sevens Ireland Under-20 Ireland U18 & U19 Tickets Statistics Irish Rugby TV Galleries Supporters Club Provincial Celtic Challenge Celtic Challenge Fixtures & Results Women's Interprovincial Championship Connacht Leinster Munster Ulster Provincial News Provincial Fixtures Provincial Tables Exiles Junior Interprovincial Fixtures Statistics Energia AIL Men Women Energia Logo Playing the Game Age Grade Women Tag Rugby Touch Rugby Spirit of Rugby Coaching Refereeing Medical Nutrition Running Your Club Insurance Welcoming Clubs RugbyConnect Club Funding IRFU About IRFU News News Archive Aviva Stadium Charitable Trust History Strategic Plan Laws & Regulations Annual Report Sponsors & Suppliers Work with Us Men News Team Fixtures & Results Tables Management Past Players Women News Team Fixtures & Results Tables Management Ireland Sevens Sevens News Ireland Under-20 News Men’s Profiles Fixtures & Results Tables Men’s Management Ireland U18 & U19 News Tickets Hospitality Aviva Stadium Map Ten Year Tickets Terms & Conditions Duplicate Ticket Policy Men Fixtures & Results League Tables News Previous Winners Energia Bateman Cup Energia Men’s Junior Cup Women Fixtures & Results League Tables News Energia All Ireland Cup Age Grade Youth Rugby Aviva Minis Schools Third Level Rugby Women Give it a Try Club Spirit of Rugby Spirit Of Rugby Charter Safeguarding Disability Inclusion Anti-doping Coaching Welcome To Coaching Coaching Pathway Play Rugby Children’s Coaching Course Youth Coaching Course Senior Coaching Course Performance Coach Course High Performance Coaching Course Entry Criteria Further Information Rugby Ready Refereeing General Information Becoming a Referee Laws & Concussion Affiliate Referees Useful Resources Nutrition Eat2Compete Supplements Adult Nutrition Nutrition for Referees Welcoming Clubs Welcoming Clubs Background Case Studies Club Funding Documents & Forms Lotto Funding Financial Assistance Guidelines Club Excellence Award About IRFU Committee IRFU Staff History Team History Archive IRFU Presidents Captains Strategic Plan Women in Rugby Action Plan Energia Bateman Cup Energia Bateman Cup Fixtures Energia Men’s Junior Cup Energia Junior Cup Fixtures Aviva Minis What is Aviva Mini Rugby? Aviva Mini Rugby Festivals Aviva Mini Rugby Skills Zone Smart Rugby Give it a Try Minis Girls’ Youth Rugby Adult Rugby Find a Club Give It A Try Club Club Contacts Safeguarding Safeguarding Policy Best Practice Recruitment Parents & Guardians Concerns Young People Training IRFU Committee Committee Profiles Safeguarding Policy Homepage Jump to main content irishrugby.ie Shop Supporters Club RugbyConnect irishrugby+ Newsletter Tickets Hospitality Other Sites Aldi Play Rugby IQ Rugby Tag Rugby IRFU Charitable Trust Home Ireland Ireland Fixtures & Results Tables Men News Team Fixtures & Results Tables Management Past Players Women News Team Fixtures & Results Tables Management Ireland Sevens Sevens News Ireland Under-20 News Men’s Profiles Fixtures & Results Tables Men’s Management Ireland U18 & U19 News Tickets Hospitality Aviva Stadium Map Ten Year Tickets Terms & Conditions Duplicate Ticket Policy Statistics Irish Rugby TV Galleries Supporters Club Rugby World Cup 2025 Tickets Shop Provincial Provincial Celtic Challenge Celtic Challenge Fixtures & Results Women’s Interprovincial Championship Connacht Leinster Munster Ulster Provincial News Provincial Fixtures Provincial Tables Exiles Junior Interprovincial Fixtures Statistics irishrugby+ Energia AIL Energia AIL Men Fixtures & Results League Tables News Previous Winners Energia Bateman Cup Energia Bateman Cup Fixtures Energia Men’s Junior Cup Energia Junior Cup Fixtures Women Fixtures & Results League Tables News Energia All Ireland Cup Energia Logo Playing the Game Playing the Game Age Grade Youth Rugby Aviva Minis What is Aviva Mini Rugby? Aviva Mini Rugby Festivals Aviva Mini Rugby Skills Zone Smart Rugby Schools Third Level Rugby Women Give it a Try Minis Girls’ Youth Rugby Adult Rugby Find a Club Give It A Try Club Club Contacts Tag Rugby Touch Rugby Spirit of Rugby Spirit Of Rugby Charter Safeguarding Safeguarding Policy Homepage Best Practice Recruitment Parents & Guardians Concerns Young People Training Disability Inclusion Anti-doping Coaching Welcome To Coaching Coaching Pathway Play Rugby Children’s Coaching Course Youth Coaching Course Senior Coaching Course Performance Coach Course High Performance Coaching Course Entry Criteria Further Information Rugby Ready Refereeing General Information Becoming a Referee Laws & Concussion Affiliate Referees Useful Resources Medical Nutrition Eat2Compete Supplements Adult Nutrition Nutrition for Referees Running Your Club Running Your Club Insurance Welcoming Clubs Welcoming Clubs Background Case Studies RugbyConnect Club Funding Documents & Forms Lotto Funding Financial Assistance Guidelines Club Excellence Award IRFU IRFU About IRFU Committee Committee Profiles IRFU Staff IRFU News News Archive Aviva Stadium Charitable Trust History Team History Archive IRFU Presidents Captains Strategic Plan Women in Rugby Action Plan Laws & Regulations Annual Report Sponsors & Suppliers Work with Us Home Latest Squad Shop Menu Home IRFU About IRFU Staff IRFU Committee IRFU Committee Committee Profiles IRFU Staff IRFU Staff Executive & Operations Executive & Operations Chief Executive: Kevin Potts PA to the CEO and Union Committee Coordinator: Ellen Hanley IRFU Hospitality & Protocol Manager: Louise Hart Director of Operations: Gerard Carmody Head of Corporate and International Affairs: Garrett Tubridy Events & Operations Manager: Niamh McGroder Senior Event Operations Executive: Michael Hurl Travel, Accommodation and Functions Executive: Eugenie Thornton Reception & Admin Coordinator: Neasa Ni Dhurcain Reception & Admin Coordinator: Cathy Spear Team Operations & Travel Manager: Geraldine Armstrong Events & Operations Exec: Niall McCoy Event & Operations Executive: Carl O’Brien Travel & Accommodation Executive: Ayannah Danoso Team Services Executive: Hannah Hanlon Team Operations Executive: Nikki Corry Event Operations Coordinator: Sinead Hannon Logistics & Operations Manager: Ian McGill Logistics Coordinator: Johnny Ilies Logistics Assistant: Fran Markovic Legal Legal Consultant Counsel: Declan McPhillips Head of Legal: Seán Brassil Legal Counsel: William McEvoy Data Protection & Procurement Executive: Michael Cryan Human Resources HR Chief People Officer: Aileen Bailey Head of HR: Linda Murphy Senior HR Business Partner: Mairead Boland HR Business Partner: Sarah Fitzpatrick Rugby - Performance Rugby Performance & Development Performance Director: David Humphreys High Performance Centre Facilities HPC Facilities and Operations Manager: Oisin Daly HPC Facilities and Operations Executive: Mark Leonard-Doyle High Performance Centre, Facilities Officer: David Tansey Head Performance Chef: Maurice McGeehan Sous Chef: Alan Reilly Performance Chef De Partie: Billy Dolan-Geary Kitchen Porter: Istvan Kovacs Performance Head of High Performance Coach Development: Daragh Sheridan High Performance Leadership & Cultural Lead: Sean M Ryan Head of Elite Player Development: Peter Smyth National NTS & Talent ID Manager: Wayne Mitchell Head of Athletic Performance & Science: Nick Winkelman High Performance Project and Womens Performance Pathway Manager: Audrey O’Flynn National Elite Player Pathway and U18 Head Coach: Michael Hodge U20’s & Men’s National Talent Pathway Physiotherapist: Eoin Power National Team Forwards Coach (Set Piece)/ National Pathways Forwards Coach: John Fogarty Performance Pathway Scrum Coach: Seamus Toomey Women’s National WNTS and Talent Identification Manager: Katie Fitzhenry Performance Analyst (HPU): John Buckley Performance Analyst: Gordon Stirling Performance Analyst – IRFU Analytics Dept, Women’s Rugby: Cian O’Brien Performance Analyst – IRFU Analytics Dept: Jack Hannon Performance Analyst – Women’s Pathways: Luke Bonnar Data Scientist: Andrew Whale Business Intelligence Analyst: Claire Wallace Men’s Team National Team Coach: Andy Farrell Assistant Coach: Simon Easterby Assistant Coach: Andrew Goodman Forwards Coach: Paul O’Connell Assistant Backs Coach and IRFU Kicking Coach: Jonathan Sexton National Scrum Coach/National Academy Forwards Coach: John Fogarty Head of Athletic Performance, National Team: Aled Walters Head of Analytics & Innovation: Vincent Hammond National Team Doctor: Stuart O’Flanagan National Senior Men’s Lead Physiotherapist: Hamish Macauley Assistant Athletic Performance Coach, National Team: Ciaran Ruddock National Team, Assistant Analyst: Alan Walsh Kit & Logistics Coordinator: John Moran Women’s Head of Womens Performance & Pathways: Gillian McDarby Head of Womens Strategy: Lynne Cantwell Women’s XVs Head Coach: Scott Bemand National Women’s Scrum Coach Specialist & Throwing Coach (National Program & Pathways): Denis Fogarty National Women’s XV Forwards Coach: Alex Codling National Women’s Assistant Coach, Defence & Contact Area Skills: James Scaysbrook Kicking Coach – High Performance System: Gareth Steenson Head Coach – Women’s 7s (In Competition) & National Talent Coach: James Topping National Senior Women’s XV’s Team Physiotherapist: Aoife Healy Women’s U23 Squad Physiotherapist and Pathways Physiotherapist Co-ordinator (Maternity Cover): Ciaran Purcell Women’s XV’s National Teams Programme Manager: Elaine Ryan Head of Athletic Performance, Women’s 7s & Pathway: Orlaith Curran Sevens Programme Physiotherapist: Eduard Mias Sevens Administrator: Junaire Brown Performance Nutritionist: Anne-Marie Mulholland Provincial Talent Coach, WNTS – Connacht: Larissa Muldoon Provincial Talent Coach, WNTS – Munster: Niamh Briggs Provincial Talent Coach, WNTS – Ulster: Neill Alcorn Provincial Talent Coach, WNTS – Leinster: Matt Gill Pathway Athletic Development Coach, WNTS – Ulster: Paul Heasly Pathway Athletic Development Coach, WNTS – Connacht: Ann Caffrey Pathway Athletic Development Coach, WNTS – Munster: Lorna Barry Pathway Atheltic Development Coach, WNTS – Leinster: Greg Hollins IQ Rugby IQ Rugby Talent ID Coach: Kevin Maggs IQ Regional Talent ID Coach: Steven McGinnis IQ Programme Administrator: Lindsey Wordley Athletic Performance Head of Athletic Performance & Science: Nick Winkelman Head of Athletic Performance, Women’s Pathway & National Team: Edward Slattery Performance Analyst, IRFU Analytics Dept: John Farrell Research Officer: Chris Leckey Rugby - Development Rugby Development Director of Rugby Development: Colin McEntee Head of Rugby Development: Ultan O’Callaghan National Coach Development Manager: Jamie Turkington Training & Education Manager: Colin Moran E-Learning & Digital Co-Ordinator: Agustina Videla Rugby Competition Manager: Kevin Beggs Rugby Administration Assistant: Katherine Daly Rugby Administration Coordinator: Yvonne McGuinn Business Analyst – Rugby Development: Jennifer Kavanagh Domestic Game Coordinator: Tanya Abbas Curran Head of Participation: Eoin Hogan Head of Women’s Development: Amanda Greensmith National Rugby Development Manager: David Keane National Rugby Development Manager: Colm Finnegan Women’s and Age Grade Coordinator: Ava Elders Gallagher Head of Equity, Diversity & Inclusion: Anne Marie Hughes Projects Manager – Spirit of Rugby Programme: Stephen Gore Disability Inclusion Officer: David McKay Youth Council Coordinator: Meadhbh Lewis Medical & Nutrition Medical & Nutrition Medical Director: Rod McLoughlin Head of Performance Support: Phil Glasgow Head of Psychology: Siobhain McArdle Head of Nutrition: Emma Gardner Injury Surveillance and Medical Research Lead: Joe Shaw Specialist Rehabilitation Physiotherapist: Emma Gallivan Medical Manager – High Performance Game: Mairead Liston Medical Manager – Developmental Game: Caithríona Yeomans Medical Manager: Brian Boyd Medical Admin (part-time): Siobhan Hughes Performance Nutritionist, Women’s National XVs Team and Pathways: Emma Brennan Performance Nutritionist (part-time) Women’s National Talent Pathway Squad: Leanne Varley First Aid & Injury Prevention Coordinator: Shane Mooney Elite Player Pathway Nutrition Lead: Gary Sweeney Referees Referees Head of Referees: Dudley Philips National Referee Manager: Peter Fitzgibbon Referee Development Manager Leinster: Sean Gallagher Referee Development Manager Ulster: Richard Kerr Referee Development Manager Connacht: Andrew Fogarty High Performance Referee and Talent ID Manager: Frank Murphy High Performance Referees: Andy Brace, Andrew Cole, Eoghan Cross, Peter Martin Referee Coordinator: Julie Moran Referee Coordinator: Neysa Herity Marketing & Communications Marketing & Communications Chief Commercial Officer: Padraig Power Director of Communications: Aoife Clarke Head of Communications & Project Manager, IRFU 150: Peter Breen Head of Commercial (Maternity leave): Jessica Long Head of Commercial (Maternity Cover): Shane Martens Senior Commercial Manager, Business Development: Ben Mulligan Digital Marketing & Customer Relationship Manager: Barry Cunningham Senior Commercial Partnerships Manager: Sean Ryan Commercial Partnerships Manager: Mallorie Ronan Marketing & Sponsorship Executive: Rachel Cuddy Client Relationship Manager: Linda McCoy Communications Manager: Lisa Doyle Communications Manager: Ryan Bailey Content Creator: Alannah Owens Videographer: Robert Maguire Ticketing Head of Ticketing: Sheena Hickey Senior Ticketing Executive: Patrick Gavin Ticketing Executive: Louise Tighe Accessibility Ticketing Executive: Shannon Lynch Finance Finance Chief Financial Officer: Thelma O’Driscoll Head of Finance: Ruairi McLoughlin Management Accountant: Sharon Coffey Finance Manager: Jonathan Kenny ERP Consultant: Laura Thompson Payroll Administrator: Gary Oak Accounts Payable: Helen Buttker Accounts Payable: Sinead Quinn Accounts Payable Assistant: Maria Connolly Funds Administrator: Lindsey Murphy Charitable Trust Head of Operations, IRFU Charitable Trust: Linda Black IRFU Charitable Trust Fundraising and Relationship Lead: Brid Berkeley Charitable Trust finance & Administration Officer (part-time): Vita Versalovic Technology & Systems Technology & Systems Director of Strategy & Technology: Scott Walker Head of IT: Sid Carmody Senior IT Administrator: James Dunne IT Applications Manager: Ginine Power Application Support Administrator: Evin Cashman Desktop Support Engineer: Tony McAuliffe IT Desktop Engineer: Paul Mazzano Technical Support Analyst: Ian Keenan Strategy and Projects Manager: Kate Binchy Product Owner – Data System: Brian Scriven Latest News The Landscape Of Legends – Ireland Jersey Launch Ireland Squad Update With Gareth Steenson New to Rugby? Start Here with the ‘What is Rugby’ Webinar and Guides Official Sponsors Official Suppliers Official Charity Associations & Awards 10/12 Lansdowne Road, Dublin 4, Ireland +353 (0) 1 647 3800 Newsletter Email Us © Irish Rugby 2025 Content Images © Inpho Photography Ireland, Statistical Data © Opta Privacy Policy Cookies Delivered by"
    },
    {
      "url": "https://www.cascadiadaily.com/2024/jun/09/beloved-bellingham-bar-reborn-refined-on-cornwall-avenue/",
      "text": "Beloved Bellingham bar reborn, refined on Cornwall Avenue | Cascadia Daily News Menu Facebook Instagram Tiktok Youtube Sept. 5 Print Replica Newsletters Log in Search News Close News Open News By region Whatcom County Skagit County Local State Northwest Nation & World Whatcom County Skagit County Business Crime & Courts Education Elections Environment Government Health Immigration Special Reports News Obituaries By region Whatcom County Skagit County Local State Northwest Nation & World Whatcom County Skagit County Business Crime & Courts Education Elections Environment Government Health Immigration Special Reports News Obituaries Opinion Close Opinion Open Opinion Columns Ron Judd The Hammer Citizens Agenda Guest Commentaries Letters Submit a Letter Columns Ron Judd The Hammer Citizens Agenda Guest Commentaries Letters Submit a Letter Sports & Rec Close Sports & Rec Open Sports & Rec Prep Football Volleyball Tennis Swimming Cross Country College Volleyball Cross Country Soccer World Cup Travel Outdoors Recreation Sports calendar Prep Football Volleyball Tennis Swimming Cross Country College Volleyball Cross Country Soccer World Cup Travel Outdoors Recreation Sports calendar Living Close Living Open Living Arts & Entertainment Books Music Visual Art Food & Drink Profiles Community The A-List Music Calendar Gardening Travel Arts & Entertainment Books Music Visual Art Food & Drink Profiles Community The A-List Music Calendar Gardening Travel Classifieds Close Classifieds Open Classifieds Special Announcements Obituaries Legal Notices Local Services For Sale/Rent Job Openings Special Announcements Obituaries Legal Notices Local Services For Sale/Rent Job Openings Photos Free From CDN Events Close Events Open Events Community calendar CDN Events Community calendar CDN Events About Close About Open About Who we are Contact us Inside CDN CDN Announcements CDN Events Who we are Contact us Inside CDN CDN Announcements CDN Events Donate Subscribe All Sections Close All Sections Open All Sections News By region Whatcom County Skagit County Local State Northwest Nation & World Whatcom County Skagit County Business Crime & Courts Education Elections Environment Government Health Immigration Special Reports News Obituaries By region Whatcom County Skagit County Local State Northwest Nation & World Whatcom County Skagit County Business Crime & Courts Education Elections Environment Government Health Immigration Special Reports News Obituaries Opinion Columns Ron Judd The Hammer Citizens Agenda Guest Commentaries Letters Submit a Letter Columns Ron Judd The Hammer Citizens Agenda Guest Commentaries Letters Submit a Letter Sports & Rec Prep Football Volleyball Tennis Swimming Cross Country College Volleyball Cross Country Soccer World Cup Travel Outdoors Recreation Sports calendar Prep Football Volleyball Tennis Swimming Cross Country College Volleyball Cross Country Soccer World Cup Travel Outdoors Recreation Sports calendar Living Arts & Entertainment Books Music Visual Art Food & Drink Profiles Community The A-List Music Calendar Gardening Travel Arts & Entertainment Books Music Visual Art Food & Drink Profiles Community The A-List Music Calendar Gardening Travel About Who we are Contact Us Inside CDN Meet the news staff Meet the business team Media coverage CDN Announcements CDN jobs FAQ Who we are Contact Us Inside CDN Meet the news staff Meet the business team Media coverage CDN Announcements CDN jobs FAQ Community Weekly Watchdog Community Calendar CDN Events Photo Galleries Where to buy the print newspaper Our commitment to our community Reporting of crime policy Social media policy AI policy Weekly Watchdog Community Calendar CDN Events Photo Galleries Where to buy the print newspaper Our commitment to our community Reporting of crime policy Social media policy AI policy Advertise Advertise with us Ad Policy Submit a Legal Notice Submit a Classified Ad Submit an Obituary Submit a Special Announcement Advertise with us Ad Policy Submit a Legal Notice Submit a Classified Ad Submit an Obituary Submit a Special Announcement Subscriptions Log in My Account Subscribe Cascadia One Pass membership Donate E-Edition Customer support Log in My Account Subscribe Cascadia One Pass membership Donate E-Edition Customer support Connect Email newsletters Facebook Bluesky Instagram YouTube Email newsletters Facebook Bluesky Instagram YouTube Get unlimited local news and information that matters to you. Subscribe Today How do you use and rate our content? Take Survey Subscribe Today Living | Food & Drink | Brews & Spirits | Drink Cascadia Drink Cascadia Beloved Bellingham bar reborn, refined on Cornwall Avenue Uisce Irish Pub officially (re)opened for business in a new, improved location June 9, 2024 10:00 p.m. Bartender Cameron Frazier prepares a drink on Thursday, June 6. He worked as a bartender at the old Uisce Irish Pub and returned to work at the new location. ( Hailey Hoffman /Cascadia Daily News) By Brandon Fralic CDN Contributor Uisce Irish Pub is now open in downtown Bellingham. Gaelic for “water,” Uisce (pronounced “Ish-Kah”) celebrated its rebirth as a local watering hole on Thursday, June 6. Long-time Bellinghamsters will remember the original Uisce, which opened on St. Patrick’s Day in 2006. Bellingham’s beloved Irish pub was an institution, so the community was shocked to see it close in August 2022. Thankfully, owner Molly McGarry and her team promised to return — and nearly two years later, Uisce is back in business at a new location, 1409 Cornwall Ave. “It’s true what they say: One door closes and another one opens,” McGarry said. “In my opinion, this place is gonna work a lot better for us.” The new Uisce is smaller, which lends itself to a more intimate and refined pub experience. McGarry and her team brought the best qualities of the old Uisce to the new space, including what she calls the “magic” from years of gathering at the original pub. Dozens visited Uisce Irish Pub for its reopening at the new Cornwall Avenue location. ( Hailey Hoffman /Cascadia Daily News) “It was magic, and it was special. It was like the community hub to many different people over the years,” she said. “And so, I’m happy when people come in and they’re like, ‘Oh, it feels good’ — they sit in the same spot at the bar.” Built by Lummi Island woodworker Tom Lutz in 2006, the legendary Uisce bar looks right at home in the new space. Aaron Kuhaulua (AK Crafted Woods & Design) took the bar apart, removed 7 feet, and rebuilt it to fit inside the pub’s Cornwall Avenue location. Sitting beside me at the bar, McGarry explained one of its finer details: “The big ‘U’ circles are where we used to have our beer towers,” she said. “I hope that people can appreciate the detail that we took so long to create.” McGarry and her team rebuilt the new space from the ground up, only retaining one wall over a full year of construction. Little details are everywhere — from the Celtic knot along the floor to the orange dart board backdrop, which serves as an ode to the original Uisce. A bartender pours a drink. ( Hailey Hoffman /Cascadia Daily News) “All the artwork is the same. All of these are family portraits that we had in my old spot,” McGarry said, pointing out photos illuminated by hand-picked light fixtures. Large windows let natural light into the building, providing an “architectural view” of Uisce’s neighboring Federal Building. Constructed in Italian Renaissance Revival style in 1913, the historic building still serves as downtown Bellingham’s post office. Beer-wise, you can expect the classic Uisce lineup including Guinness Stout, Harp Lager, and Smithwick’s Red Ale along with a local beer, cider and gluten-free beer option. A couple next to me at the bar said Uisce is the only place they’ve found Harp on draft in Bellingham. It’s a subtle reminder that there’s no other place in town like Uisce, so we “cheers” to the new space with a round of golden Harps. When it comes to cocktails, Uisce is known for its Irish coffee and Old Fashioned — both made from family recipes. The cocktail menu also includes gin-based drinks like the negroni, Bee’s Knees, and French 75. Alternatively, spring for The Irishman — a pint of Guinness paired with an Irish whiskey. (Fun fact: Uisce boasts the largest selection of Scotch and Irish whiskey in Bellingham.) One of the most exciting additions to Uisce’s new space is food; specifically, pizza. Launching with a limited menu, Uisce now offers four personal-size pizzas: cheese; pepperoni; jalapeno and pineapple; and pesto, sausage and pepper. The dough is made fresh using a French baking technique called poolish, a type of pre-ferment (similar to a sourdough starter) that lends flavor and a toothsome, chewy texture to the finished crust. And, of course, they still offer their fan-favorite pretzels. Uisce is open every day of the year, even Christmas. “It’s actually one of our busiest days,” McGarry said. “We consider ourselves to be an industry bar. So, we get a lot of restaurant clientele when they get off work — we get a huge late-night following.” Uisce plans to host future events including trivia, whiskey tastings, live music and a belated St. Patrick’s Day Party. For now, McGarry — who is continuously interrupted during our conversation by delighted customers seeing the new bar for the first time — simply wants to celebrate the magic of Uisce with her community. “It’s exciting to see people’s excitement when they come in,” she said. “Some of these people … were some of my first customers back in 2006. And I haven’t seen them in years — friends that I consider family.” Uisce Irish Pub is open daily from 4 p.m. to 2 a.m. at 1409 Cornwall Ave. Info: uisceirishpub.com . From left, Margaret Driscoll, Kera Newman and Howie Meltzer play music together in the pub. Uisce Irish Pub has long been a hub for musicians to gather and play together while sipping beer and cocktails. ( Hailey Hoffman /Cascadia Daily News) Brandon Fralic's Drink Cascadia column appears monthly. Reach him at drinkcascadia@gmail.com . Latest stories Lifestyle Free from CDN Logging off life but living on: How AI is redefining death, memory and immortality ‘Gone but not forgotten’ could become a big understatement in the age of AI Sept. 9, 2025 9:00 p.m. Nation & World ConocoPhillips plans large layoffs in Alaska Company said it will be firing between 20% and 25% of its global workforce Sept. 9, 2025 11:15 a.m. Restaurants Review: Next Chapter Cafe New eatery serves Filipino food, handcrafted pastries on Village Book's mezzanine level Sept. 8, 2025 9:00 p.m. Have a news tip? Email newstips@cascadiadaily.com or Call/Text 360-922-3092 Read the Print Replica Subscribe to our free newsletters About Who we are Contact Us Inside CDN Meet the news staff Meet the business team Media coverage CDN Announcements CDN jobs FAQ Who we are Contact Us Inside CDN Meet the news staff Meet the business team Media coverage CDN Announcements CDN jobs FAQ Community Weekly Watchdog Community Calendar CDN Events Photo Galleries Where to buy the print newspaper Our commitment to our community Reporting of crime policy Social media policy AI policy Weekly Watchdog Community Calendar CDN Events Photo Galleries Where to buy the print newspaper Our commitment to our community Reporting of crime policy Social media policy AI policy Advertise Advertise with us Ad Policy Submit a Legal Notice Submit a Classified Ad Submit an Obituary Submit a Special Announcement Advertise with us Ad Policy Submit a Legal Notice Submit a Classified Ad Submit an Obituary Submit a Special Announcement Subscriptions Log in My Account Subscribe Cascadia One Pass membership Donate E-Edition Customer support Log in My Account Subscribe Cascadia One Pass membership Donate E-Edition Customer support Connect Email newsletters Facebook Bluesky Instagram YouTube Email newsletters Facebook Bluesky Instagram YouTube Copyright © 2025 Cascadia Daily News Privacy Policy Ad Policy Terms of Service Facebook Instagram Tiktok Youtube News By region Whatcom County Skagit County Local State Northwest Nation & World Business Crime & Courts Education Elections Environment Government Health Immigration Special Reports News Obituaries Opinion Opinion Columns Ron Judd The Hammer Citizens Agenda Guest Commentaries Letters Submit a Letter Sports Sports Prep Football Volleyball Tennis Swimming Cross Country College Volleyball Cross Country Soccer World Cup Travel Outdoors Recreation Sports Calendar Living Living Arts & Entertainment Books Music Visual Art Food & Drink Profiles Community The A-List Music Calendar Gardening Travel Classifieds Special Announcements Obituaries Legal Notices Local Services For Sale/Rent Job Openings Photos Free from CDN Events Community calendar CDN Events About Who we are Contact us Inside CDN CDN Announcements CDN jobs FAQ Donate Community Weekly Watchdog Community calendar CDN Events Photo Galleries Where to buy the print newspaper Our commitment to our community Advertise Advertise with us Ad policy Obituaries Log in My Account Subscriptions Subscribe E-Edition Customer support Connect Email newsletters Facebook Bluesky Instagram YouTube"
    }
  ]
}