{
  "fuentes": [
    {
      "url": "https://www.golfify.io/courses/golf-ufo-le-laval",
      "email": "stephane.lavergne@golfufo.com"
    },
    {
      "url": "https://www.ufotourgolf.com/contact-us/",
      "email": "pam@ufotourgolf.com"
    },
    {
      "url": "https://www.ufotourgolf.com/contact-us/",
      "email": "steve@ufotourgolf.com"
    },
    {
      "url": "https://www.par3-executive-golf.com/Canada/Quebec/QCMontrealGolfUFOLeLavalPar3.htm",
      "email": "info@9holegolfcourses.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/centre-du-golf-ufo/",
      "email": "golf-club-detail@2x.png"
    },
    {
      "url": "https://www.1golf.eu/en/club/centre-du-golf-ufo/",
      "email": "travel@albrecht.de"
    },
    {
      "url": "https://www.sevenoaksgolf.com/contact-us",
      "email": "dpylinski@sevenoaksgolf.com"
    },
    {
      "url": "https://www.fresenius-kabi.com/us/our-impact/engaging-communities/national-blood-donation-hall-of-fame",
      "email": "info.usa@fresenius-kabi.com"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "email": "tstuder@astrosecuritymonitoring.com"
    }
  ],
  "mails": [
    "dpylinski@sevenoaksgolf.com",
    "golf-club-detail@2x.png",
    "info.usa@fresenius-kabi.com",
    "info@9holegolfcourses.com",
    "pam@ufotourgolf.com",
    "stephane.lavergne@golfufo.com",
    "steve@ufotourgolf.com",
    "travel@albrecht.de",
    "tstuder@astrosecuritymonitoring.com"
  ],
  "nombre_sitio": "ufospensacolabeach.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.golfify.io/courses/golf-ufo-le-laval",
      "text": "Golf UFO - Le Laval - Full Scorecard and Ratings GOLFIFY Courses Pricing Knowledge Base Blog Log In Playing Golf UFO soon? Experience it like the pros, try our realtime leaderboards free today. Golf UFO 4600 Boulevard Dagenais Ouest Laval Québec, Canada +1 (450) 627-1214 Stephane.lavergne@golfufo.com Le Laval Duvernay Chomedey Le Fabre Designer / Architect: Type by: Parkland Opened: 1975 Guest Policy: Open Course & Slope Ratings Color Tee Course Rating Slope Rating Distance Red - - 1303 Full Scorecard Hole Red SI Par 1 124 7 3 2 145 6 3 3 166 4 3 4 145 9 3 5 132 5 3 6 130 8 3 7 185 2 3 8 160 3 3 9 116 1 3 OUT 1303 27 Total 1303 27 Download the Golfify app to score your round with live leaderboards and update tee information instantly, or send us an email at support@golfify.io . We will be happy to help! Lightning Fast Live Scoring, Leaderboards and More. Get Started for Free. Good to Know Privacy Terms of Use Deleting Your Account Resources Bulk Upload Template Blog Contact Us support@golfify.io Golfify Ltd © 2024"
    },
    {
      "url": "https://www.ufotourgolf.com/contact-us/",
      "text": "Contact Us - UFO Tour Golf Skip to primary navigation Skip to main content UFO Tour Golf Custom Golf Bags, Accessories and Apparel HOME HOME ABOUT ABOUT CONTACT CATFISH HUNTER VOLUME SOURCING CUSTOM GOLF BAGS CUSTOM GOLF BAGS GALLERY DESIGN PROCESS REVIEWS FOLDS OF HONOR FOLDS OF HONOR PRG ACCESSORIES PRG ACCESSORIES HOPKINS CUSTOM APPAREL HOPKINS CUSTOM APPAREL DESIGN REQUEST CUSTOM GOLF BAGS DESIGN REQUEST CUSTOM APPAREL DESIGN REQUEST CUSTOM ACCESSORIES DESIGN REQUEST FOLDS OF HONOR DESIGN REQUEST SOURCING PGA & LPGA TOURS CONTACT US Please enable JavaScript in your browser to complete this form. Name * First Last Email * Comment or Message Submit OUR TEAM Stephen T. Hopkins President steve@ufotourgolf.com 425-691-9040 Pamela G. Hopkins Office Manager pam@ufotourgolf.com 425-691-9040 Steve Hopkins Jr. Apparel Consultant steve@ufotourgolf.com 425-691-9040 © 2025 UFO Tour Golf. All Rights Reserved. Main Menu (2) HOME Back HOME HOME ABOUT Back ABOUT ABOUT CONTACT CATFISH HUNTER VOLUME SOURCING CUSTOM GOLF BAGS Back CUSTOM GOLF BAGS CUSTOM GOLF BAGS GALLERY DESIGN PROCESS REVIEWS FOLDS OF HONOR Back FOLDS OF HONOR FOLDS OF HONOR PRG ACCESSORIES PRG ACCESSORIES HOPKINS CUSTOM APPAREL Back HOPKINS CUSTOM APPAREL HOPKINS CUSTOM APPAREL DESIGN REQUEST Back DESIGN REQUEST CUSTOM GOLF BAGS DESIGN REQUEST CUSTOM APPAREL DESIGN REQUEST CUSTOM ACCESSORIES DESIGN REQUEST FOLDS OF HONOR DESIGN REQUEST SOURCING PGA & LPGA TOURS"
    },
    {
      "url": "https://www.par3-executive-golf.com/Canada/Quebec/QCMontrealGolfUFOLeLavalPar3.htm",
      "text": "Golf UFO, Le Laval (Par 3), Laval, Quebec, Canada Par 3 Golf Courses Home (current) United States Alabama Alaska Arizona Arkansas California Colorado Connecticut DC Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming International Africa Australia Austria Belgium Canada Caribbean China Croatia CzechRep Denmark Finland France Germany Hungary Iceland Indonesia Ireland Luxembourg Mexico Netherlands New Zealand Norway Portugal Singapore Spain Turkey United Arab Emirates United Kingdom Add/Edit Course About Us Join Email List Our Other Golf Sites GroupChips.com GolfPuns.com GolfMajors2020.com ReachTheGreen.com WinFreeGolfBalls.com Golf UFO, Le Laval (Par 3), Laval, Quebec, Canada Get your short game on! Canada Home Canada Map Quebec Home Golf UFO, Le Laval (Par 3) 4600 Boul.Dagenais Ouest Fabreville, Laval QC H7R 1L5 Phone: (450) 627-1214 Type: Public Par: 27 Holes: 9 Website: http://www.golfufo.com/fr/page/le_laval.html Comments: The Laval Course 9 hole par 27 over distances ranging from 116 to 185 yards and, illuminated 24 hours a day from St. Jean Baptiste to Labor Day. This course appeals to both the uninitiated and more experienced because of its many waters. It's perfect if you want a bit more challenging. Photos info@9holegolfcourses.com Copyright © Morton Technologies, LLC - All rights reserved | Privacy Policy Our disclosure to you: We spend a great deal of time keeping our directory up-to-date.  We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites.  We also partner with other advertisers like Rock Bottom Golf and earn commissions by linking to their websites as well.  Please contact us if you have any questions. Par 3 and Executive Golf Courses Privacy Notice × Privacy Notice This privacy notice discloses the privacy practices for Par 3 and Executive Golf Courses. This privacy notice applies solely to information collected by this website. It will notify you of the following: What personally identifiable information is collected from you through the website, how it is used and with whom it may be shared. What choices are available to you regarding the use of your data. The security procedures in place to protect the misuse of your information. How you can correct any inaccuracies in the information. Information Collection, Use, and Sharing We are the sole owners of the information collected on this site. We only have access to/collect information that you voluntarily give us via email or other direct contact from you. We will not sell or rent this information to anyone. We will use your information to respond to you, regarding the reason you contacted us. We will not share your information with any third party outside of our organization, other than as necessary to fulfill your request, e.g. to ship an order. Unless you ask us not to, we may contact you via email in the future to tell you about specials, new products or services, or changes to this privacy policy. Your Access to and Control Over Information You may opt out of any future contacts from us at any time. You can do the following at any time by contacting us via the email address or phone number given on our website: See what data we have about you, if any. Change/correct any data we have about you. Have us delete any data we have about you. Express any concern you have about our use of your data. Security We take precautions to protect your information. When you submit sensitive information via the website, your information is protected both online and offline. Wherever we collect sensitive information (such as credit card data), that information is encrypted and transmitted to us in a secure way. You can verify this by looking for a lock icon in the address bar and looking for \"https\" at the beginning of the address of the Web page. While we use encryption to protect sensitive information transmitted online, we also protect your information offline. Only employees who need the information to perform a specific job (for example, billing or customer service) are granted access to personally identifiable information. The computers/servers in which we store personally identifiable information are kept in a secure environment. If you feel that we are not abiding by this privacy policy, you should contact us immediately via email. Registration In order to use this website, a user must first complete the registration form. During registration a user is required to give certain information (such as name and email address). This information is used to create a unique user account for you to access our web portal. At your option, you may also provide demographic information (such as gender or age) about yourself, but it is not required. Orders We request information from you on our order form. To buy from us, you must provide contact information (like name and shipping address) and financial information (like credit card number, expiration date). This information is used for billing purposes and to fill your orders. If we have trouble processing an order, we'll use this information to contact you. Cookies We use \"cookies\" on this site. A cookie is a piece of data stored on a site visitor's hard drive to help us improve your access to our site and identify repeat visitors to our site. For instance, when we use a cookie to identify you, you would not have to log in a password more than once, thereby saving time while on our site. Cookies can also enable us to track and target the interests of our users to enhance the experience on our site. Usage of a cookie is in no way linked to any personally identifiable information on our site. Some of our business partners may use cookies on our site (for example, advertisers). However, we have no access to or control over these cookies. Sharing We share aggregated demographic information with our partners and advertisers. This is not linked to any personal information that can identify any individual person.  We use a credit card processing company to bill users for goods and services. These companies do not retain, share, store or use personally identifiable information for any secondary purposes beyond filling your order. Links This website may contain links to other sites. Please be aware that we are not responsible for the content or privacy practices of such other sites. We encourage our users to be aware when they leave our site and to read the privacy statements of any other site that collects personally identifiable information. Surveys & Contests From time-to-time our site requests information via surveys or contests. Participation in these surveys or contests is completely voluntary and you may choose whether or not to participate and therefore disclose this information. Information requested may include contact information (such as name and shipping address), and demographic information (such as zip code, age level). Contact information will be used to notify the winners and award prizes. Survey information will be used for purposes of monitoring or improving the use and satisfaction of this site. Close We'd like permission to email you ONCE a month! We promise, just once a month.  We will email you news about our site, deals and offers from Golf retailers, and other Golf info you might find interesting! You can opt-out at any time, but we hope you don't. Just enter your email below.  We will send you a validation link to confirm you really do want email from us (we respect your privacy). Email Address Also enter me for FREE Monthly Golf Ball Drawing at WinFreeGolfBalls.com * Click here to submit form and join our list! * We also own WinFreeGolfBalls.com - we will NEVER sell or otherwise transfer your email address to anyone.  Never! No thanks Golf info isn't important to me"
    },
    {
      "url": "https://www.1golf.eu/en/club/centre-du-golf-ufo/",
      "text": "Centre du Golf UFO, Laval, Canada - Albrecht Golf Guide Golf Courses Golf Hotels Golf Packages Bookshop Apps Sign in / Sign up Saved Items Deutsch English Español Italiano Albrecht Golf Guide Golf courses in North America Canada Québec Centre du Golf UFO 45 Hole Public Overview Courses Visitors Prices Amenities Reviews No image available Centre du Golf UFO 4600 boul. Dagenais Ouest, H7R 1L5 Laval, Canada Phone: +1 450-627-1214 www.golfufo.com Map Save Share Courses 9-Hole Le Fabre Course 18-Hole Le Duvernay Course 9-Hole Le Laval Course 9-Hole Le Chomedey Course Driving Range Visitors welcome? Yes - every day. Green fees CAD 10 - 20 (6-12 €) / 18 Holes Courses 9-Hole Le Fabre Course Opened in 1972 18-Hole Le Duvernay Course Opened in 1989 Technical difficulty: Moderate Scorecard Tee Par CR Slope Length Blue (Men) 70 68.8 121 6109 yards White (Men) 70 67.5 117 5793 yards Red (Women) 70 - - 5017 yards 9-Hole Le Laval Course Opened in 1975 9-Hole Le Chomedey Course Opened in 1987 Scorecard Tee Par CR Slope Length Blue (Men) 36 - - 2807 yards Red (Women) 35 - - 2800 yards Practice Facilities Driving Range Visitors All 4 Courses Visitors are welcome every day. Etiquette Softspikes required. Green Fees 9-Hole Le Fabre Course Green Fee Mon - Fri Sat, Sun, Holidays 18 Holes CAD 10 (6 €) CAD 10 (6 €) 18-Hole Le Duvernay Course Green Fee Mon - Fri Sat, Sun, Holidays 18 Holes CAD 20 (12 €) CAD 20 (12 €) 9-Hole Le Laval Course Green Fee Mon - Fri Sat, Sun, Holidays 18 Holes CAD 10 (6 €) CAD 15 (9 €) 9-Hole Le Chomedey Course Green Fee Mon - Fri Sat, Sun, Holidays 18 Holes CAD 15 (9 €) CAD 20 (12 €) Amenities Rentals Clubs for hire Electro-cart for hire Enlarge / get directions Nearby Courses GC Le Cardinal Ste Dorothee Laval (1.5 km) 18 Hole Le Club Laval-Sur-Le-Lac Laval-Sur-Le-Lac (3.1 km) 36 Hole GC Islesmere Ste Dorothee Laval (3.3 km) 27 Hole See all User Reviews There are no user reviews yet. Been to Centre du Golf UFO ? Share your experiences! Write a Review Golf Packages Tenerife, Spain Tivoli La Caleta Tenerife Resort 5 stars Very good 8,4 / 10 7 Nights 5 green fees from € 1475 per person Tenerife, Spain Hacienda del Conde Meliá Collection Golf & Spa 5 stars Wonderful 9,1 / 10 7 Nights HB unlimited golf from € 1231 per person La Gomera, Spain Hotel Jardín Tecina 4 stars Excellent 8,7 / 10 7 Nights HB 5 green fees from € 833 per person Majorca, Spain Elba Sunset Mallorca 4 stars Very good 8,2 / 10 7 Nights 5 green fees from € 855 per person Majorca, Spain VIVA Golf Adults Only 18+ 4 stars Superior Very good 8,4 / 10 7 Nights HB 5 green fees from € 1083 per person Sicily, Italy Verdura Resort 5 stars Excellent 8,8 / 10 7 Nights 4 green fees from € 1269 per person Porto Cervo, Italy Cervo Hotel, Costa Smeralda Resort 5 stars Excellent 8,8 / 10 7 Nights unlimited golf from € 1042 per person Cyprus Almyra 5 stars Very good 8,2 / 10 7 Nights 4 green fees from € 928 per person All Packages Get a €20 discount on your golf vacation with our newsletter Sign up for our newsletter and be the first to discover new golf packages, special offers, and exclusive golf tours. As a bonus, you will receive a €20 discount code for your next golf vacation. Yes, please send me the newsletter You can change your mind at any time by clicking the unsubscribe link in the footer of any newsletter you receive from us, or by contacting us at travel@albrecht.de . We will treat your information with respect. You can find details about our privacy practices here . By clicking above, you agree that we may process your information in accordance with these terms. Follow us on Instagram New Golf Guide Africa Asia Caribbean Central America Europe Middle East North America Pacific South America Golf Packages Book Golf Holiday Travel Themes Golf Round Trips Group Golf Tours Early Booking Deals Majorca Canary Islands Tuscany Algarve Andalusia Greece All Destinations Mobile App Golf Guide for iPhone Golf Guide for iPad Info Contact/Imprint Media Information Privacy Policy Terms Feedback © 2025 Albrecht Golf Verlag GmbH"
    },
    {
      "url": "https://www.sevenoaksgolf.com/contact-us",
      "text": "Contact Us, Directions | Seven Oaks Golf Club at Colgate University COLGATE UNIVERSITY | 315-824-1432 | CONTACT US Skip to main content Golf Download Our App Book A Tee Time Golf Rates Our History The Course Practice Facility Rules & Regulations Download Our App Book A Tee Time Golf Rates Our History The Course Practice Facility Rules & Regulations Join Students Events Outings Lessons Golf Instruction & Clinics Coaches Corner Golf Instruction & Clinics Coaches Corner Store Gift Cards Merchandise Gift Cards Merchandise Search Close Search Keyword Search Search Keyword Search 52° Wed 09/10 clear sky 72°/47° Thu 09/11 clear sky 71°/50° Fri 09/12 clear sky 72°/51° Book A Tee Time Contact Us Get in touch or find driving directions to Seven Oaks Golf Club at Colgate University. X CONTACT INFORMATION ADDRESS 2 E Lake Rd (East Lake & Payne Streets) Hamilton, NY 13346 PHONE Golf: 315.824.1432 Restaurant: 315.824.4420 FEEDBACK Comments & suggestions welcome Call 1.888.986.0699 to share comments HOURS OF OPERATION Currently Closed GET IN TOUCH OR FIND US Please submit your inquiry and a member from our team will in touch or utilize the map below for directions. We hope to see you soon! CONTACT US FORM First Name Last Name Email Phone Subject Message Submit MEET THE TEAM DALLAS C. PYLINSKI, PGA Director of Golf Email Dallas TYLER COWEN Assistant Golf Professional GOLF IS CALLING YOUR NAME Designed by the Legendary Robert Trent Jones Sr. Seven Oaks is a must play. PLUS avoid booking fees when you book direct! Book A Round MANAGED BY QUICK LINKS The Course Online Store Careers at Seven Oaks Colgate University Colgate Athletics Colgate Inn CONTACT US Golf: 315.824.1432 Restaurant: 315.824.4420 Submit an Inquiry facebook instagram twitter ADDRESS 2 E Lake Road Hamilton, NY 13346 Get Driving Directions PLAY GOLF CALL 315.824.1432 OR Book A Tee Time JOIN OUR EMAIL LIST SUBSCRIBE TO GET THE LATEST NEWS AND OFFERS I consent to receive emails from Seven Oaks Golf Club. I can unsubscribe anytime. Email Thank you for subscribing. Enter Another Email Subscribe Copyright © 2025. Seven Oaks Golf Club at Colgate University. All Rights Reserved. Privacy Policy Terms of Use Accessibility Sitemap"
    },
    {
      "url": "https://www.fresenius-kabi.com/us/our-impact/engaging-communities/national-blood-donation-hall-of-fame",
      "text": "Fresenius Kabi USA - National Blood Donation Hall of Fame Resource Center Newsroom Contact USA Current website: Fresenius Kabi USA - We Are Committed to Life Suggested websites based on your location: Fresenius Kabi Argentina Global Website: Fresenius Kabi Global Website Fresenius Kabi around the world Africa & Middle East MENA South Africa Asia Pacific Australia China China (Hong Kong SAR) India Indonesia Japan Korea Malaysia New Zealand Philippines Singapore Taiwan Thailand Vietnam Europe Austria Belgium Croatia Czech Republic Denmark Finland France Germany Great Britain Hungary Ireland Italy Netherlands Norway Poland Portugal Romania Russian Federation Slovakia Spain Sweden Switzerland Latin America Argentina Brazil Chile Colombia Ecuador Mexico Peru North America Canada USA Fresenius Group Our Impact Main menu Our Impact We are focused on transforming historic breakthroughs in science and health care into essential medicines and technologies — producing at scale what is needed most, always striving to expand accessibility and optimize safety and efficiency, while building resilience in the communities of caregiving. Our Impact Supporting Access Enhancing access to innovative, cost-effective therapies, improving affordability and availability of critical drugs to benefit U.S. healthcare and patients. Our Impact Engaging Communities Supporting the vital communities that connect every moment of care. Fresenius Kabi is investing more of our strength, experience, and passion to make more caring possible across the U.S. Engaging Communities National Blood Donation Hall of Fame We partnered with blood centers, through the National Blood Donation Hall of Fame, to recognize those who show an extraordinary commitment to blood donation. Engaging Communities Blood Collectors Week At Fresenius Kabi, we proudly honor the dedicated professionals who make blood donation possible. Blood collectors—phlebotomists, apheresis operators, donor recruiters, and technicians are the unsung heroes. Our Impact Stories & Insights Take a look behind the scenes. Read about employees, nurses and patients who are redefining courage and compassion in Fresenius Kabi's Inspiring Stories. close Products Main menu Products Find out more about Fresenius Kabi's capabilities in the areas of Pharma, Biopharma, Nutrition, and MedTech. Products Pharma Fresenius Kabi offers a leading portfolio of injectable drugs and delivery systems used to treat a broad spectrum of patients across the U.S. Products Biopharma BioSpecialized: Devoted to life-changing treatments. Making advanced, life-changing biopharmaceuticals medicines more accessible to more patients. Products Nutrition Our parenteral nutrition (PN) products are used to help care for critically and chronically ill patients in hospitals, long-term care facilities, and at home. Products MedTech Our teams are dedicated to supporting your role in healthcare, from donor-side to bedside, with infusion systems, apheresis devices, and cell and gene therapy instruments. MedTech Blood Collection and Processing Fresenius Kabi features medical technologies, equipment, data solutions, and the expertise to support the vital work of blood centers, hospitals, and plasma centers focused on patient care. Blood Collection and Processing Apheresis Collection Systems Provides blood centers with a full suite of apheresis technologies that help specialists efficiently collect their community's most needed blood products. Blood Collection and Processing Plasmapheresis Systems Focusing our plasmapheresis portfolio on the experience of donors, the people at the heart of a plasma center’s business. Blood Collection and Processing Therapeutic Apheresis Dedicated to providing hospitals and blood centers with flexible therapeutic apheresis and cell collection platforms that help meet your organization's goals. Blood Collection and Processing Component Manufacturing Offers comprehensive blood component manufacturing equipment designed for efficiency and accuracy in blood centers' component manufacturing operations. Blood Collection and Processing Manual Blood Collection Offers a broad range of manual collection technologies designed to enhance the efficiency and effectiveness of blood centers' whole blood manual processes. Blood Collection and Processing Specialty Products Offers a range of Specialty Products to support your blood collection and processing needs. Blood Collection and Processing Autotransfusion Designs and manufactures autotransfusion devices to meet the high expectations of perfusionists. MedTech Cell and Gene Therapy Technologies Dedicated to working with all cell therapy labs to address research and manufacturing challenges, from process development to full commercialization. MedTech Data Management Solutions Provides flexible solutions designed to drive operational improvements through data driven insights and essential integration with your computer systems. Products IV Therapy Fresenius Kabi features a range of IV Therapy offerings including infusion systems, IV solutions, accessories and more. close Careers Main menu Careers Join our team and be part of a company that is committed to advancing healthcare with innovation and compassion. Explore exciting career opportunities and contribute to making a real difference in patients' lives around the globe. close Company Main menu Company The people of Fresenius Kabi work every day to solve the real-world challenges medical professionals and their patients face. Company Managing Tariff Impacts As global economic conditions continue to evolve, we remain steadfast in our mission to provide high-quality, affordable, and reliable medicines and medical technologies to the caregivers and patients who depend on us. Recently, fluctuating tariff conditions in the United States have created new challenges across industries, and we want to assure you that we are actively managing this situation. Company Mission, Vision, and Principles Together with our Fresenius colleagues across the globe, we are Committed to Life. To each and every one of us, the patient always comes first. Company Leadership Fresenius Kabi USA Executive Management Company Fresenius Group Fresenius is a global healthcare group whose three core business platforms — (Bio)Pharma, MedTech, and Care Provision — provide a unique combination of medical expertise, clinical practice, industrial production, and technological know-how that helps ensure a growing number of people have access to world-class therapies. Company Governance Learn more about the rules, controls, policies, and practices of Fresenius Kabi. Governance Ethics & Compliance Fresenius Kabi USA strives to uphold ethical standards and legal duties in its pharmaceutical operations, guided by the Corporate Compliance Program. Governance California Supply Chains Act Fresenius Kabi is deeply committed to the protection and advancement of human rights, and conducting business in an ethical and appropriate manner. Governance State Disclosures State Disclosures Governance Data Protection & Binding Corporate Rules Data Protection Principles and Risk Assessment Company Quality Management The quality and safety of our products and services are the foundation of our business activities. Company Environmental, Health and Safety Committed to preserving and protecting the environment and our natural resources, and to providing a safe and healthful workplace for our employees. close Search X What are you looking for? Search Our Impact Engaging Communities National Blood Donation Hall of Fame Fresenius Kabi has partnered with blood centers, through the National Blood Donation Hall of Fame, for over 25 years. This program was developed to recognize individuals who have demonstrated an extraordinary commitment to blood donation. Blood centers across the country submit nominations from which inductees are chosen annually based on their demonstrated commitment and passion to donating blood and/or encouraging blood donation. We invite you to nominate a donor, volunteer or advocate who has demonstrated an unwavering commitment and passion for donating blood and/or encouraging blood donation. Anyone can submit a nomination and there is no limit to the number of nominations per blood center. Nominees cannot be a blood center employee and they must be living. How to nominate a donor Although the deadline has passed to submit nominations for our 2025 program, we always encourage submissions. Send us an email with the story of your most inspiring donor, volunteer or advocate to info.usa@fresenius-kabi.com . Be sure to include the following information in your nomination: Donor Name Blood Center Name and Location Tell us about your nominee Please include details in your nomination about the person’s commitment and dedication to donating blood or being a volunteer or how they are an advocate to create awareness on the need for blood. The more detail the better. Click here to nominate a donor When inducted into the Fresenius Kabi National Blood Donation Hall of Fame, there are several ways an individual is recognized: At a ceremony held at their nominating blood center where they will receive a personalized award, certificate and lapel pin They will be featured in the Fresenius Kabi Product and Donor Eligibility Dating Calendar and on this website A template news release will be provided to the nominating blood center to promote their story through local media They will be promoted through Fresenius Kabi social media channels 2024 National Blood Donation Hall of Fame Inductees Bertha Axtman Vitalant Minot, ND I Do It Because I love it and I love to help people! When Bertha Axtman and her husband Albert hosted their first blood drive in the late 1960s, they began a remarkable tradition. They organized beef donations from local cattle farms and made sloppy joes with Albert’s secret recipe, rallied community members to bake homemade cookies, and served lunch to everyone who gave blood — then committed to hosting another two-day drive every eight weeks. Bertha continued running the drive herself after Albert passed away, even through her own battles with cancer. Her vision issues now create a bit of a challenge but she has an army of volunteers in the community that are willing to lend a hand, and with her trusty magnifying glass at the check-in table, she’s able to find each eager donor on the list. Everyone’s help ensures it’s the biggest and best blood drive in western North Dakota! After more than 50 years, hundreds of drives, and tens of thousands of donations, at 94 years old, Bertha is still leading the charge, and making sure everyone, volunteers and donors alike, feel appreciated and special — and that they all get a taste of those famous sloppy joes and fresh baked cookies. Ana Cruz Hollingsworth Carter BloodCare Bedford, TX It was the most difficult time of my life, seeing Zane struggling. Ana Cruz Hollingsworth’s son was born with congenital diaphragmatic hernia, and spent his first 10 days on life support. “I remember individuals wearing nursing scrubs, repeatedly entering Zane’s room with a small cooler. Constantly, that little cooler brought the blood my son needed to survive.” Zane thrived after his ordeal, which Ana attributes to the expert medical care and “those people — our anonymous heroes — who donated blood so my baby would have an opportunity to live.” The experience motivated Ana to become a vocal advocate for blood donation, especially within the Hispanic/Latino community. As the founder of a content and production company, Ana had well-established social media and podcast platforms and began sharing her experience to inform and inspire her substantial audience of more than 80,000 followers. Importantly, through her personal experiences and respected voice, Ana has been able to dispel myths among prospective Hispanic/Latino donors. In recognition of her ongoing efforts, she and her family were guests of honor at the 2024 unveiling of the Donando Esperanza (Donate Hope) mural in Dallas that shares her message of the importance of blood donation to the community’s health and welfare. Monte Engh LifeServe Blood Center Johnston, IA It’s a good feeling being part of a system that is making a difference. Monte has been a lifelong blood donor, with 291 donations resulting in 68 gallons, but when he retired he decided he wanted to do more for the cause. “Years ago I read an article about a gentleman that had donated a large amount of blood and was a volunteer driver. I kept it in the back of my mind.” So he joined the team to ensure blood products are available throughout the region, and in the last four years has made more than 1,100 trips — more than 4,300 volunteer hours and 156,000 miles driven. He’s out more than 20 hours a week, typically taking the long, less desired trips, “since I enjoy the ride”. Monte gives with a smile on his face and has a great time getting to meet everyone involved, from donor centers to hospitals. “It’s always good when you come in — everyone is glad to see you.” When he’s not driving, Monte can be found sharing his talents on local Habitat for Humanity projects, at reconstruction efforts across the country after disasters, or in Africa on development programs. He’s the definition of a volunteer! The Fontanez Family Versiti Blood Center of Illinois It’s about showing how to give back-but winning’s not bad either! Chris Fontanez, along with his son, Lucas, and daughter, Sydney, have found a way to make blood donation a fun family tradition, by transforming their regular visits to the blood center into a friendly competition — with the winner proudly holding onto a makeshift trophy until the next appointment. The runner-up, in a spirit of camaraderie, volunteers to bring donuts to the blood collection team. The thoughtful gestures and infectious smiles of the Fontanez family make them a joy to have at the center. Chris has contributed 26 lifetime products, equivalent to 3 gallons, and his children are working hard to catch up. Lucas has made 13 donations, Sydney, a bit younger, has made four — and she’s recently expanded her involvement by joining the volunteer group. The family’s collective loyalty and dedication to blood donation, starting as soon as they are eligible, is a testament to their values of compassion and service. With a lifetime of donating ahead of them, they’ll be helping the community for many years to come — and setting a shining new example for Saturday morning family time. Alejandro Herrera OneBlood South Miami Facility My daughter is alive because of blood donations. I am giving back! Alejandro Herrera became a dedicated regular blood and platelet donor during his daughter's fight with cancer. After seeing the remarkable impact the generosity of so many other blood donors had on his daughter's life, he wanted to give back and pay it forward. She not only survived, but she is now cancer-free and started her nursing studies in the fall of 2024. Alejandro realized his family's story could inspire others to give and save lives, so he reached out to the principals of his daughter's and son's schools and several others in the region, helping them facilitate drives and encouraging countless young people to donate. He also rallied his extensive personal and business network and worked with his church and other faith-based organizations. Alejandro’s sheer force of personality has revived long-dormant relationships with the blood collection community and convinced decision-makers that hosting blood drives is essential to save lives in their community. In the process, Alejandro has become one of the Miami region’s most dedicated blood donation advocates and champions. He is committed to continuing his work into the future so that everyone has the same opportunity to live that his daughter was given. Robert Hungerschafer American Red Cross Vancouver Donor Center It’s like going to lunch — but lunch is filling, donating is fulfilling. Twenty-four times a year — nearly every other Sunday — Robert Hungerschafer wakes up at two in the morning and drives 512 miles roundtrip to his favorite donation center, so that he can check in for his 6:30 am appointment for blood, platelet, and plasma donations. He says his “annual goal is to donate enough to help as many lives as I can.” After more than 1,100 donations — well over 330 gallons — Bob says that he’s motivated to keep giving toward his target of 1,500 times because he wants to reduce suffering, and because, “Every appointment saves lives...You feel fulfilled. You feel like you helped somebody, you’ve accomplished something, and it’s very easy. The hardest part is just making the time.” Bob’s yellow lab, Kirin, is also a regular blood, platelet, and plasma donor, who runs excitedly to the door of the veterinary blood bank for his appointments. Injured pets need blood too, and Bob wants to make sure that the supply is there when it’s needed. Together, Bob and Kirin are offering hope and healing to humans and animals alike. Judith “Judy” LaMusga, Esq. Solvita Blood Center Dayton, OH I said right then, ‘Oh my God, I'm coming back. This is important’. Judy has been a platelet donor since the early 1980’s and averages 20 donations per year — totaling more than 575 donations. Early on in her giving, a nurse told her that a particular donation was going straight from collection to a specific cancer patient at a local hospital — the nurse couldn’t share the name, but because of that story, Judy knew she had to keep giving. “Those kinds of connections make you committed to the understanding that if you don’t give, it’s not going to be there. Someone is not going to receive it, and someone could die.” Beyond her personal donations, Judy has been a lifelong advocate for blood collection. She was an original organizer of her local blood center’s recruitment program and was honored with an Award of Distinction in 1998 for her work. More recently, she was part of the delegation that gave testimony in 2018 for legislation establishing January as Ohio’s Blood Donor Awareness Month, and in 2022, the University of Dayton Law School honored Judy with the Francis J. Conte Special Service Award in honor of her extraordinary service to the community. Ray Lebron San Diego Blood Bank San Diego, CA Regardless of who you are, your blood is red and always needed. Ray began donating blood in college in the Philippines, continued to do so as a Marine, and would occasionally visit a center in San Diego after he started working in the area. But he became a dedicated donor when a co-worker’s infant nephew was injured in a mass shooting in 1984. Inspired by the knowledge that his donation that day was immediately helping to save lives around him, he has since donated more than 190 times, and recently celebrated his 33rd gallon donation. That experience also drove a passion for blood donation advocacy, and a commitment to encouraging people of color, particularly those of Asian descent, to donate blood. For decades, he chaired blood drives at his former workplace, his community, and now is the chair for his church’s four drives a year. He also regularly volunteers for activities hosted by his local blood center, like the annual drive at Comic-Con, helping out however he can. When he’s not out championing the cause, Ray can be found supporting his community as a docent at the San Diego Marine Corps Museum and as a volunteer at his church. Susan Malloy American Red Cross Greater Pennsylvania Region–Northeastern PA District It’s incredible how many people are being helped in Mark’s name. When Mark Malloy, Jr. passed away at twenty-two years old, his mother Susan wanted to find a way to honor his memory. Inspired by another family in the community, she decided to host a blood drive. In the eight years since Mark’s passing, her now annual event has collected more than 950 units of blood in his honor — and become one of the largest in Northeastern Pennsylvania. “When you lose a child, people tell you, ‘Whatever you need — call me,’ and every year when they show up, that’s them keeping their word to me,” Susan said. Susan’s family and friends have helped to grow the event, which takes place every September — “Every year, it just keeps getting bigger!” In addition to blood donations, they hold a tee-shirt and basket raffle fundraiser, which has brought in more than $33,000 for Red Cross disaster relief. “It gives us a way to look forward to something because the anniversary of his passing is so hard,” Susan said. “This has become such a good way to help our community and I can’t see us ever not doing it.” J. David Myers Blood Bank of Delmarva Newark, DE I’m continuing the Myers family’s 70-year tradition of giving. J. David Myers grew up knowing the importance of service — and of blood donors — as his mother organized the first group for the blood bank of Delaware in 1954 and both his parents were long-term donors. He gave for the first time himself in 1972, during basic training for the army, and has been a regular donor since then, making hundreds of donations. Since 1998 alone, he has given platelets 315 times. During his long career at Amtrak David was an ambassador for the local blood bank, encouraging coworkers to donate and receiving many awards for his volunteer activities. When he retired, in 2012, he started volunteering in the ER at the local children’s hospital. He began working on mobile blood drives and donor recruitment, going on to become a mobile processor for the blood bank, giving thousands of hours to the community. He’s willing to jump in wherever it’s needed — even playing the role of the blood center’s mascot, “Delmar” the bloodhound. In whatever capacity, David is generously continuing the family tradition of ensuring a safe blood supply for all. Huston Ochoa OneBlood Ft. Lauderdale Commercial Oakland Park, FL Donations are acts of kindness that have a powerful healing effect. Huston Ochoa started donating blood to connect to his father who was a hemophiliac, who died when Huston was young. Every time he donates, he imagines how his father received a gift from someone else that helped him to battle hemophilia’s debilitating effects. Huston believes that “saving a life doesn’t mean doing something heroic. For two hours every two weeks, there are the joys of intimately getting to know the staff and talking with the other donors. It is a powerful feeling to both enjoy simple human interaction while knowing that my platelets and whole blood donations will have lasting effects once I’m gone.” Huston knows each of his donations will ultimately help someone, but it means even more when he thinks about the many processes and helping hands it goes through to get to a particular patient. As a Social Worker in a community health center and a doctoral student, he knows first-hand the positive impact organizations filled with dedicated professionals can have on those in need and hopes, in the future, to help train the next generation of service-oriented clinicians and expand support networks in the region. Jasper Smith American Red Cross Blood Donation Center Oakland, CA It’s cool to know I’ve helped so many people that I’ll never meet. Jasper Smith began donating blood 13 years ago when his friend Chaznee Brown, who has since passed away from sickle cell anemia, organized a blood drive. He celebrated his 50-gallon donation milestone in July 2023, and is on track to meet his goal of 24 donations this year. “By donating platelets and blood, I’m keeping Chaznee’s efforts alive. Sickle cell is a huge problem in the African American community and there is a shortage of African American donors,” Jasper explains. Jasper also serves on the Red Cross’s local chapter Biomedical Committee that has been honored for the work it has done to help diversify the blood supply. He speaks at local events about the importance of blood donation, and he goes on social media regularly to share videos he creates to inspire others to roll up a sleeve. He's proud that he is supporting patients facing life-threatening illnesses or severe injuries. “During one of my appointments, the staff shared that there was a 66-year-old cancer patient who had just gotten out of surgery and because of my blood type, my donation was headed to her, pronto!” 2023 Inductees Nanette Allen Vitalant Blood Donation Rapid City, SD I’ve signed people up while grocery shopping! Nanette started donating blood on a whim in 2004 and was immediately hooked. She’s now donated more than 60 times with Vitalant, and more than 10 gallons total. Nanette says, “knowing that each time I donate could be life or death for someone has made donating a priority in my life.” In 2007, a long-time donor and volunteer Nanette knew was killed in an accident. Realizing the difference, he had made in the lives around him, Nanette decided to honor him by volunteering as a drive coordinator. The first time was in 2012 for a drive at her youngest daughter’s school — in part to make sure no one skipped class — and she’s continued almost monthly since. Well-known and respected in the community, she’s amazing at getting others “hooked” on donating and is a bit relentless at making sure her donors are getting their appointments scheduled. “My husband really doesn't like going anywhere with me, since, without fail, we run into at least one blood donor I have to speak with!” Key to her success is sharing countless stories of local people whose lives were saved because of a blood donor. “When blood donating becomes more personal, the desire to donate increases.” Scott and Samantha Baker OneBlood Fort Myers Donor Center Fort Myers, FL No one ever became poor from giving. Scott Baker had always been afraid of giving blood, but after his dad passed away in 2010, Scott and his wife, Samantha, decided to start donating annually on his father’s birthday — Valentine’s Day — as a way to honor him and his service in the Marine Corp. In 2018, when they went to the OneBlood center, they were shocked to learn that only two other people had been in — despite the Parkland school shooting earlier that day that had left so many people injured and needing blood. That was the moment they knew they wanted to do more for the cause. Scott, a water district superintendent, and Samantha, a general manager of a ballroom gown manufacturer, tapped their incredible network to help them navigate the process of setting up a blood drive, collect raffle prizes from the local business community, and get the word out. The event was a huge success — no surprise for two “born party planners”, well-known for their love of bringing together friends, food, and fun. To-date they’ve hosted six of their now-annual drives — helping to save more than 1,000 lives — and they have no plans of stopping. “Giving back in this way just comes naturally to us.” Yvonne Dauterive LifeServe Blood Center Des Moines, IA I have found that sense of purpose. Yvonne Dauterive was a regular blood donor for many years; having received blood on a few occasions herself, and having had a niece who passed away from leukemia at age three, she knew how important the blood supply was. When she retired from the chaotic world of IT, she felt she “had to do something more for the greater good of all people and to honor my niece.” So, for the past two years, Yvonne has given more than 500 hours to LifeServe, delivering blood products to local hospitals and picking up and packaging food donations, each multiple times a week. Yvonne has an incredible work ethic and, drawing on her past professional experience, happily shares knowledge or makes suggestions that improve how things are done — and always with an abundance of energy that brightens everyone’s days. But most importantly, Yvonne loves, and takes great pride in, being part of the blood donation community, “I was looking for a place that was welcoming… Many of the people in the hospitals, in the labs and other volunteers, I now call friends.” Pat Henry LifeSouth Community Blood Centers Atlanta, GA Our success is based on true partnership. In 2002 Pat Henry, the founder and CEO of Dragon Con — an annual gathering for science fiction, fantasy and pop culture fans — invited LifeSouth to hold a one-day blood drive at the convention to help combat anticipated blood shortages over Labor Day weekend. There was little expectation it would have much impact, but more than 20 years later, it’s become a wildly successful, 5-day event — some years attracting as many as 3,000 donors. Pat and his wife Sherry make it all possible, ensuring ample space, full staff and volunteer support, and unlimited access to the convention for recruiting. The drive embraces the spirit of Dragon Con, each year unveiling new themes, free books, custom t-shirts, and cosplay promotions, and Pat actively and enthusiastically promotes the event across the web and social media. He has inspired many to try donating for the first time, while reminding returning donors — many of whom now make donating blood part of their Dragon Con tradition — of the need to donate throughout the year as well. Since its founding, the Dragon Con drive has collected an incredible 40,098 donations, and Pat’s advocacy has made countless lifelong donors and provided an immeasurable contribution to the health of our communities. Sherman Hirsch American Red Cross North Platte, NE They call me the ‘gift that keeps giving’! For the better part of his 92 years, Sherman Hirsch has been giving back to his country and his community. He served in the Korean War and upon his return, brought his energy and experience to a wide range of local volunteering programs — from ringing bells for the Salvation Army to participating in Kiwanis projects that helped to construct playgrounds, the Iron Horse Park, and a homeless shelter. In 1990 Sherman added donating whole blood to his long list of activities. At the time, he was working as a Social Studies and Biology teacher, and a coworker suggested it. He quickly became a regular, visiting the North Platte American Red Cross center twice a month, even after long school days. When he retired in 1995 — by then a Superintendent — he found himself with a lot more time on hand, and switched to platelet donation. To date he has donated more than 800 times — more than 1,560 units! Sherman continues to bring a smile to everyone’s faces when he enters the center, every two weeks, without fail. He brightens the center with his joyful presence — and with inspiring stories about the amazing things he’s had the opportunity to see and do. Kirk Hunter Carter BloodCare Bedford, TX It was my most precious anniversary gift. Diagnosed with aggressive lymphoma in 2011, Kirk Hunter received a series of platelet transfusions that saved his life — the most memorable one an emergency transfusion that had to be performed on his 25th wedding anniversary to his wife, Maureen. Prior to his illness, Kirk, a college chemistry professor, didn’t even know that chemotherapy patients needed transfusions. But following his firsthand education as a platelet recipient, he’s made it a personal mission to raise awareness, inspire donors, and show gratitude for “the entire team of folks who make this precious resource safe and available”. He and Maureen have shared their experience as guest speakers and as part of video series for Carter BloodCare’s website, social media feeds, donor centers and mobile drives, newsletters, and more, and his story has helped to reach hundreds of thousands of people. His selfless volunteerism and emotional appeal genuinely move audiences — including a high school student who wrote, “Kirk showed me I can make a difference. Because of him, I went to give blood the very next day. I’ll keep giving as long as I can.” Scott MacGregor Vitalant Folsom, CA I send hope and prayers with every donation. A former leader at California Highway Patrol, Scott MacGregor knew professionally how important blood donation was, but in 2013, when his 7-year-old daughter’s life was saved by blood transfusions and a bone marrow transplant, the cause became personal. He has since donated more than 260 times — and he thinks of both his daughter and the recipient of his gift of life, every time. But Scott has taken on a much bigger role in the cause, as a speaker, teacher, and advocate, sharing his family’s story to drive awareness and inspire action. He has volunteered hundreds of hours with Vitalant and with Be The Match, leveraged his social media and cycling teams, offered testimony in legislative efforts, and even become a transplant courier, traveling around the world delivering precious cargo. Scott has a particular interest in diversifying the donor base, reaching out to those of all heritages, ethnicities, ages, and socioeconomic status. In all these endeavors, he demonstrates an unmatched level of kindness, meeting people where they are and extending gratitude for their lifesaving gift. As a result, Scott can count thousands of new donors and marrow registrants — and their impact for generations to come — as part of his lasting legacy. Darlene Olso Rhode Island Blood Center Providence, RI Supporting fellow donors — that’s time well-spent! Darlene began donating whole blood at Rhode Island Blood Center in 1983 and then became a platelet donor. To date, she’s donated more than 600 times — putting her at the 76-gallon mark! Additionally, after retiring from her career in engineering in 2018, Darlene joined the center’s volunteer team. She’s already served more than 1,700 hours, always carefully scheduling around her platelet donation schedule. Darlene has helped at countless mobile blood drives and donor center, where she welcomes donors and provides support to them and the staff. “If I can ease a donor’s anxiety, offer comfort, coach them about iron rich foods, help them better prepare for their next donation and, through education, encourage them to become a lifelong donor, it’s time well spent”. Darlene adds, “I especially enjoy high school and college drives, offering a little mentoring while I care for the students”. She also speaks at the Be The Match national blood stem cell and bone marrow registry and assist with registrations in hopes they may someday be a patient’s lifesaving match. Staff and donors alike agree that Darlene is a wonderful, knowledgeable, and helpful team member — a true “rockstar” for the cause. Kelly Robinson Versiti Blood Center of Illinois Aurora, IL Donating reminds me of how lucky I am. At eighth grade graduation, Kelly received a peer-nominated award for outstanding character given annually in honor of a former student who passed away from leukemia. Since then, Kelly has made it her mission to support kids fighting cancer. When COVID cancelled many blood drives, Kelly, too young to donate herself, organized her first drive to ensure patients could get the transfusions they needed. Since then, Kelly has helped organize 11 drives. With inspired motivation strategies — like committing, for every donor that attended, to purchase a loaf of bread from a struggling local bakery that would be donated to a community food pantry — they’ve collected a total of 389 units of blood. Kelly’s efforts earned an award from the Leukemia and Lymphoma Society, which led her to take on that cause as well, conducting an online campaign that raised $50,000. They also brought her an invitation to join the Community Advisory Board of Versiti’s Blood Center of Illinois. The first teen member ever, Kelly is already making her mark, with a recent presentation to 125 Versiti leaders on ways to improve student participation at high school blood drives. All that, and she still found time to begin donating, when she turned 16! Robert L. Sihler American Red Cross Pasadena, CA Giving is a blessing for the recipient—and the donor. When Robert Sihler was eighteen, he went to the Pasadena Red Cross Center to donate blood for the first time. He remembers the center then, “It was just 4 small beds, with only travel posters on the ceiling for entertainment. It was thrilling when we got a black and white tv!” 47 years — and more than 1300 units — later, he’s still donating at the same place. Throughout that time, whatever was happening in his own life, Bobby never wavered in his commitment to give. Everyone at the center considers him to be their number one donor as far as donations, dedication, faithfulness, consistency — and heart. Bobby was one of the first donors to join the Aphaeresis Program when it started in the 1990s, and he’s returned every two weeks because he knows his donation helps patients in need —especially those fighting cancer. He can always be counted on to give extra time to the center, spreading the word about donating through social media, helping the site coordinator, volunteering in the canteen, or supporting the phlebotomists and nurses, and even the national organization. All to make sure the experience of every donor as positive as possible. Larry Turner Solvita Blood Center (formerly Community Blood Center) Dayton, OH I enjoy helping people get out of scrapes. Larry Turner started donating blood in 1966, when he was in college, working nights at NCR. “We went to the old auditorium and donated up on tables,” he said. “We roughed it back in those days!” He’s never stopped giving; now 76, he averages one plasma and two platelet donations a month. He donated throughout the Covid epidemic, despite the risk factors of the illness for a person his age, and he recently passed his 800th donation. He’s served on the Dayton Community Blood Center’s first apheresis advisory board, joined the bone marrow donor program, and even captained “Life Leaders” teams at NCR and Holy Trinity Church. Well-known as one of those people “you could call at 1:00 am”, in an emergency, it’s no surprise that Larry served in the Army Reserves and has been a Red Cross disaster response volunteer, working to help those both far away and close to home. In his down time, he can be found in his shop, nurturing his passion for woodworking or relaxing with his wife, Linda, and their children and grandchildren. “But if I can help, that’s what I do. I just show up… As long as I can, I’ll keep doing that.” Jim Walker San Diego Blood Bank San Diego, CA A hat got me into the habit of giving! In 1968, when Jim Walker’s wife Linda was pregnant, she found out she was anemic. Jim immediately joined the San Diego Blood Bank Stork Club that focused on donations for newborn babies and pregnant mothers. But he jokes that early on he really was motivated by the hat he would get for donating 10 gallons. By time he reached his goal, he had gotten the habit of going in every eight weeks. He’s been giving ever since — more than 50 years and a total of 170 gallons! He says “it’s a matter of learning to find the time, so that it becomes part of your routine…It’s a good thing that I’m fortunate enough to do it, because it’s a habit that helps others — and we all need help.” For the past 12 years Jim has also volunteered weekly at the center, at drives, and at special events, offering a smile, a laugh, and snack to everyone who stops by. His positive nature and cheerful attitude ensures that every donor he meets has an exceptional experience. He carries that same joyful spirit to his work with Optimist International, an organization that focuses on youth development and support — and to his bowling game! 2022 Inductees Taylor Berley OneBlood, Inc. Daytona Beach, FL Taylor, who began donating at a drive at his Embry-Riddle Aeronautical University in April of 2021, represents the future of platelet donation. Having lost three grandparents to cancer, Taylor has a true personal connection to donating platelets. Upon learning about platelets’ short shelf life and the challenges with their collection, he has made it his personal mission to donate as often as possible. He’s committed himself to saving as many lives as possible. Everyone looks forward to days when Taylor’s name is on the appointment list — he’s a true friend of The Platelet Bus. He arrives early and helps out the team however he can, picking up lunch for the staff, helping with sign-ups, and passing out snacks and drinks to other donors. He is willing to reschedule any time, if it helps register one more donor with limited availability. And he’s passionate about spreading the word about donation and recruiting other students on campus by informing them of the critical mission of platelet donation. He proudly displays his “2 Gallon Donor” sticker on his laptop — and looks forward to replacing it with a “3-Gallon Donor” sticker soon. Joyce “Brissy” Brislawn OneBlood, Inc. Miami, FL In 2013, Brissy, a Health Science Instructor, first developed a Blood Drive Committee program that would ensure the entire high school was made aware of this important event and that students could take responsibility in the process. Today, with her guidance, students on the committee conduct classroom presentations promoting the importance of blood donation and create inspiring banners to cover the school. They distribute consent forms during lunch and before school and reach out to local vendors to provide snacks for donors. On the day of the drive, Brissy even has the school’s marching band create a spectacle in front of the media center where the drive is held. Their efforts have been award-winning! Brissy knows how crucial blood drives are, so when schools were closed to outside partners because of Covid, she reached out to her local government office to promote blood drives in the community. This year she urged her administration to add a second day to the school drive, allowing her to bring even more young people into the blood community and building the next generation of both donors and drive organizers. Laura Catron Carter BloodCare Bedford, TX Laura’s daughter Lola was born in 2016 with a rare congenital heart defect. Within three days of her arrival she had her first major open heart surgery, which required several units of blood. Since that time she has had several post-operative complications and two additional major surgeries, bringing her total transfusions to 30 units. But today, says Laura, Lola “runs and runs and runs. I guess she’s making up for lost time.” Laura’s passionate advocacy for blood donation is driven by six powerful words: “Thirty strangers helped save Lola’s life.” Laura uses her platform as a social media influencer to share her personal story and raise awareness of the need for donors — her Love for Lola page has more than 9,000 followers on Facebook and more than 381,000 on TikTok. She has volunteered as guest speaker at donor recognition events and local high schools, urging audiences to donate. And Laura has hosted five Love for Lola drives, collecting enough to help 360 patients in need. In promoting these events, Laura notes, “With every heartbeat, she wins.” Through Laura’s dedication and advocacy, the community wins too, as people respond to her heartfelt call to ensure “that a blood shortage is never the reason a child is not here.” Kathleen “Katie” Ellis Community Blood Center Dayton, OH A platelet donor since 1976 and a blood donor before that, Katie is the first woman — and only the fifth person at Community Blood Center — to reach 600 lifetime donations. Year after year her dedication has made her the blood center’s top female donor, and even through the pandemic she has kept her commitment to donating platelets twice per month. Katie was a pediatric nurse and spent years coaching soccer, softball, and golf teams at the same high school where her late husband Bob was the legendary head soccer coach. These days — at 74 — she’s still busy. “I volunteer at the boys’ basketball games, sell tickets for soccer and volleyball, play golf and watch the grandchildren. I donate when I’m not babysitting!” She urges others to join her in finding the time to give. Her message on her milestone donation day? “Oh, try to come out and give. If you’ve got the time, it’s only an hour and a half out of your day. If you can help somebody — one person! — it’s going to be really good. You’re going to feel good knowing you helped somebody else. It’s like your good deed of the day. Why not?” Dan Ertel Bloodworks Northwest Eugene, OR Dan grew up in a military family, learning from an early age that he had “the responsibility to improve people’s lives in my community.” He began donating blood when he saw the Bloodmobile pull up at his college and for the last four decades has spent his Thursday afternoons donating platelets. With more than 60 whole blood and 500 platelet donations already, he plans to continue to donate — and promote the mission — for as long as he can. Dan has sponsored countless blood drives at his workplace and with other local groups, and about ten years ago he was the catalyst for a local Pint for Pint program, an ongoing annual promotion that has issued approximately 25,000 vouchers for a pint of beer or soda. Every time Dan donates, he uses social media to encourage his friends to do the same. His constant message is that “there’s always a shortage, there’s always a need, and there’s no substitute for blood. It’s a great way to save lives, especially lives of people you’ve never met—and you always get cookies.” Larry and Michelle Hach Upper Peninsula Regional Blood Center Marquette, MI Michelle was a public school teacher in the 1990s when the PTA had a blood drive. She was surprised to see how few people joined her in giving. Having spent many years volunteering for drives in the past and “working with many dedicated and selfless people”, she called the blood center to offer her time—and spent the next fourteen years as the volunteer coordinator. In 2008, having inspired the desire to donate in countless others, including her own children, she turned the position over to her husband Larry. Larry began giving blood when he was in college. His father was one of the coordinators of that first drive and Larry remembers sitting on a cot together as they both gave blood. He sees his work as a way to honor his father’s legacy and does everything he can think of to raise awareness and encourage donation, from putting up posters to appearing on local radio stations. “Each time that I coordinate a blood drive, it takes me back to that day that I donated blood with Dad. It makes me feel like I’m carrying on in his footsteps.” Floyd Harris, Jr. Family Community Blood Center Dayton, OH Floyd Harris, Jr. passed away in September of 2020, after struggling with a bleeding disorder that required multiple blood transfusions. To honor the memory of the man they loved — who once played in the minor leagues with the Reds — his family began an annual blood drive. As his daughter Jackie said, “He got so much blood when he needed it. Now we just want to give back.” After a successful first year — held in April 2021, on what would have been Floyd’s 80th birthday — brought in 21 first-time donors, the second was almost double in size. His daughter Kenyetta hopes “it will grow more and more every year.” Floyd’s daughter Felicia said recruiting donors means not just educating people about the general need for blood, but also about the need for diversity among donors — she emphasizes the need for blood in Black communities for the treatment of sickle cell disease. She finds that once people try donating they continue to give, so she encourages first-timers. “I did have a nice amount of people who gave (for the first time) last year and since then they’ve gone out and done it themselves!” Scott Laubner New York Blood Center Enterprises New York, NY A few months into the pandemic, Scott, the Lifestyle Services Manager at a large residential property management company in New York, became aware that many of the city’s blood drives weren’t happening. Most drives had been in offices where donors could donate while they were at work, but the majority had shifted to a remote work environment. So he swung into action, opening the doors to StuyTown & Peter Cooper Village for drives and engaging its 21,000 residents in the cause. Since July 2020, Scott has ensured two to four events happen every month — more than 50 drives so far that have resulted in more than 1,600 donations — and goes out of his way to make each one a success. He’s teamed up with tenant groups and clubs, and a nurse from Mount Sinai Beth Israel across the street, sent eblast announcements, and posted short videos on social media to raise awareness of the events. He’s even had the air conditioning system in the donation space upgraded to make it more comfortable and assists with parking access for the blood bank staff — a task that’s not so simple in New York City! September Nott American Red Cross Peoria, IL September is a long-time platelet donor and supporter of the platelet donation community, with a current total of 187 donations and 490 units donated. But beyond her gift of life, September found a unique way to help protect and connect the platelet donor community during the pandemic — donating roughly 1,800 hand-sewn masks to platelet donors and platelet collection staff members. Early in the pandemic, September realized she could do something to help maintain a sense of togetherness, which she felt was increasingly important as the world became physically distanced. She used her sewing skills to start making masks, and she offered her “September Masks” to donors across the country via the Red Cross Platelet Donors Group on Facebook. As she had hoped, the masks did inspire camaraderie during such difficult times. Donors appreciated having a way to share their pride in being a part of the platelet collection community, and September’s masks gave platelet donors across the country another way to spread the word about the importance of platelet donation. James O’Gara American Red Cross, Greensboro Fixed Site Greensboro, NC James began donating at the age of 17, giving blood at a high school drive because he wanted “to be a blood donor just like my mother.” A few years later James learned how important platelets were for everyone from babies to patients undergoing burn and cancer treatments, and he committed himself to being a regular platelet donor. Today, he reminds everyone that, “In a time of worldwide pandemic, we can feel powerless to make big changes to the world. But if we are able, we can donate blood and platelets to help save lives. That is always powerful and makes a difference!” James hopes that his giving inspires his children, like his mother’s inspired him — “this is something that I was able to show my daughters and teach them.” He’s always trying to raise awareness for important causes — and look cool to his daughters — dying his beard pink for breast cancer in October or wearing a “recycle yourself” platelet donor T-shirt. And while his rockstar days may be over, he does get noticed! One day he was approached by a woman who, seeing his shirt, told him that she was a breast cancer survivor who had received platelets at a nearby medical center. She thanked him, noting he may have saved her life. Gary Sprague Vitalant Tempe, AZ Gary and his wife Peggy became frequent platelet donors more than 30 years ago when a colleague of Peggy’s was diagnosed with cancer. In 2001 Gary needed platelets himself. After an emergency appendectomy resulted in frightening post-surgical complications that were almost fatal, transfusions saved his life. “Words can barely express my gratitude to the donors who give platelets regularly,” Gary said. “I believe I am alive today because of their generosity.” After patiently waiting through the required recovery period, Gary returned to donating platelets regularly in March 2003 — and has now donated more than 370 times. Grateful for the platelet transfusions that helped save his life, Gary has become an enthusiastic advocate for donation and serves on his center’s speaker’s bureau. Known as “Arizona’s Singing Cowboy,” he and his horse Dusty perform for audiences across the state, raising awareness of the need for donors, and Gary recently wrote a song called “A Hero’s on the Way” about donating. By volunteering his time and sharing his personal story Gary hopes to inspire others to become regular donors. Ellen Tichy LifeStream Blood Bank San Bernardino, CA When Ellen’s daughter Cassi was diagnosed with Ewing Sarcoma in 2017, Ellen was moved not only to become a regular donor but also to organize drives to encourage others to give. The first blood drive she hosted was in support of Cassi, collecting over 200 pints of blood, and since Cassi’s passing Ellen has become a spirited champion of the need for blood donation. Ellen doesn’t just host monthly blood drives — she personally attends each one and coordinates with staff to make it successful. No matter the time, no matter the weather, Ellen is always there, making sure these drives collect as much as possible. She recruits widely, speaking to community members and local businesses about the need for blood for lifesaving procedures, and has generated over 300 donations just since 2020 — despite the challenges of blood collection in a pandemic. Ellen goes above and beyond in encouraging others to donate and finding new ways to bring in donors. Her giving spirit and dedication to keeping Cassi’s memory alive is a shining light that inspires donors, staff, and members of the community. 2022 In Memoriam Inductees Barbara “Barb” Bekaert ImpactLife Davenport, IA Barbara Bekaert was a dedicated and passionate advocate for the cause of blood donation. She began donating blood and volunteering in 1999, making an astounding 388 lifetime blood and platelet donations and volunteering a remarkable 13,833 hours. Barb passed away in November 2020 but her legacy will live on, continuing to change lives, thanks to the generous gift she left to ImpactLife in her estate. Barb did everything she could to encourage donors in her many hours of volunteering, reaching out to each possible donor as an individual. She welcomed donors at the registration desk and worked in the Donor Recruitment department, sending thank you letters to first time donors and helping with whatever other administrative tasks needed doing. She always had a smile on her face and was truly a delight to be around. Her kindness and generosity are widely missed by everyone she knew. Joseph Nyman American Red Cross Richland, WA As a young man, Joseph Nyman began his working life by serving in the U.S. Army. In his civilian career, Joe worked as an electrician and programmer. Once retired, Joe enjoyed several bonus careers, including setting up medical equipment for a home health company and transporting clients with intellectual and developmental difficulties. Joe loved, and was dearly loved, by each of his clients. Joe freely offered his time and talent to others and was always willing to help anyone, whether he knew them or not. Throughout his entire adult life, Joe donated whole blood and platelets, giving an amazing 610 units. In 2019, Joe retired for real, but his passion and commitment to the Red Cross never ended. Joe continued to donate platelets until he sadly passed away in October 2021. Joe is dearly missed by his family, friends, and the many people who remember him as a loving and kind person. Wayne Wolfe Community Blood Center Dayton, OH A former horticulture teacher who also served in the Army, Wayne Wolfe dedicated his retirement years to coordinating his church blood drives, building the program over 23 years into award-winning monthly events. He was a dedicated donor who made his 80th blood donation after surviving lymphoma. Wayne passed away in April of 2022 and is greatly missed by his family and the blood donation community. Wayne was a tireless advocate for blood donation, creatively encouraging people to be ongoing donors. He would print small blood drive schedules and glue them to refrigerator magnets to hand out at blood drives. He was never shy about standing up during services to announce he needed more donors for the church sponsored blood drive. “If they don’t want to hear me talk,” he would say, “they’d better do it.” Moved by his passion, donors always answered his call. The family held a memorial blood drive in his honor, and his daughter Cathy will continue Wayne’s legacy as coordinator of the monthly blood drives — encouraging the community to keep giving in the same spirit as Wayne. 2021 Inductees Candy Yolles San Diego Blood Bank San Diego, CA GATHERINGS OF GIVING Candy Yolles has been more than a regular donor. She started in 1994 chairing drives for her work for 11 years encouraging employees to give. Then in 2008 for the past 14 years she’s been the host of her own personal drive “Candy’s Friends and Family Blood Drive” personally inviting donors and ensuring that each of them has a positive experience. And in-between her own drives, especially around holidays when there is a critical need, Candy coordinates additional group gatherings of friends and family at donation centers. When COVID-19 hit, Candy knew that patients would still be needing blood—but she also knew that donors might be hesitant. She immediately rallied a group to give, leading by example and reassuring them that they would be safe. To date Candy has recruited more than 100 first-time donors, many of whom she has encouraged to become regular donors—including within her own family. She has inspired her 2 sisters, nephews, niece, brother n laws, husband and her two children to give frequently. Whether reassuring a new donor, encouraging a regular one, or providing individual guidance to new advocates who want to coordinate blood drives of their own, Candy educates and empowers everyone she knows to help others. Scott Hamilton American Red Cross Apheresis Carolinas Region Durham, NC ANOTHER WAY TO SERVE Scott Hamilton's support of the American Red Cross Blood program began with his time in the military, in the 1980’s, at Camp Lejeune in North Carolina. Like his father, a veteran of World War II, he believed in service. He also shared a belief with his father that donating blood was another way to serve, so he continued to give after he left the military. In 2000, while working for the University of North Carolina at Chapel Hill, Scott began donating platelets. He gave every two weeks, on Thursday afternoons, and came to be appreciated for his reliability and “good veins”. A consistent Triple Donor, each of Scott’s donations has the potential to help multiple patients. Scott’s extraordinary commitment has helped to save and improve countless lives. He retired from UNC in 2016, allowing him to spend more time with his family—especially his Granddaughter Sienna—but he still makes time for visits to the Platelet Center. His service to the community is truly unending. Russell Heerdt LifeServe Blood Center Des Moines, IA WORK WORTH DOING In 2001, after going through surgery for cancer, Russell Heerdt was inspired to become a blood donor. He moved to Des Moines in 2008 and, since then, has donated thirty times, giving over 6 gallons of blood. Russell understands the importance of a safe and stable community blood supply and, with his O negative blood type, is always willing to donate double red cells. But Russell's dedication does not stop at donating blood—in 2010 Russell began volunteering his time as a driver. No matter the time of day, or night, Russell drove supplies and products to donor centers and hospital partners around the state. In addition to driving, Russell assists with odd-jobs and projects, including donor services, recruitment and even handyman! In just 11 short years, Russell has already volunteered over 4,900 hours and counting. Russell’s impact is truly immense and he is well respected throughout the blood center and community for his commitment and work. When asked how he stays so motivated through all these years, he said, “I am enjoying my retirement volunteering here. I would rather ‘work’ like this than play golf…this gives me something to do and feel good about.” Martha Waller Mississippi Blood Services Flowood, MS FINDING A SILVER LINING Martha Waller became a donor because of her experience as a COVID-19 patient. She was referred as a possible COVID convalescent plasma (CCP) donor through Anderson Regional Health System in Meridian, MS. When the center team reached out and asked Martha if she would be willing to consider CCP donations, she said yes. Antibody tests confirmed that she was the perfect candidate for CCP, except for one major drawback. Martha lives in Waynesboro, more than a two-hour drive from Flowood, where the center was set up to do CCP donations. But she didn’t let it stop her. Martha happily presented to donate plasma 12 times in 2020—despite the four-hour round-trip drive. When her antibody titer count became too low to donate CCP, she asked if she could switch over to a different type of donation so that she could continue to help save lives in Mississippi. She knows there may come a time when she won’t be able to give anymore, so for now she says “I want to donate as often as l can.” Nick Politis OneBlood, Inc. Miami, FL NOURISHING A HEALTHIER COMMUNITY In addition to being a dedicated platelet donor himself, Nick Politis has made blood donation an integral part of his business, Mr. Green’s Produce, for over a decade. He has sponsored blood and platelet drives, each time leading the way by donating his own platelets. He encourages his staff to donate by finding fun incentives to offer them at every drive, and often sends home fresh fruits and vegetables with the center staff—as a “thank you” for the lifesaving work that they do every day. Just as Nick did in previous times of national crisis, like the 9/11 tragedy and many Florida hurricanes, when the COVID pandemic began he called right away to set up a platelet donation appointment. He has continued to run regular drives throughout the pandemic at his business and he continues to find the time to donate at other location in between the drives that he hosts. Nick recently moved his business to a new location, bringing fruits and vegetables to a community lacking access to fresh produce. Moving a business is no small task, but it didn’t stop Nick from sponsoring blood drives at his new location soon after his move. Whether building the blood supply or providing healthy food options, Nick Politis is a community business owner who makes a difference. Lourdes Cofresi OneBlood, Inc. Miami, FL INSPIRING THE NEXT GENERATION Lourdes Cofresi is the National Honor Society Advisor at Christopher Columbus High School. For the last eight years she has also been their Blood Drive Coordinator. Twice a year she leads a committee in strategizing new ways to educate, encourage, and support potential new donors—ultimately scheduling anywhere from 60 to 120 appointments each time. Her efforts have won her OneBlood’s Coordinator of the Year. Her commitment stems from a diagnosis in 2003 of a clotting disorder, Factor 7 deficiency, that makes her susceptible to bleeding out during surgery or trauma. Lourdes can’t donate the blood she might need someday, so she works diligently to engage those who can. At the beginning of the COVID pandemic, Lourdes was contacted by a Columbus alumnus who wanted to host a blood drive. Proud of the former student’s initiative and eager to make the event a success, she got permission to be on the closed school campus and then sent out emails to get donors to sign up online. With Lourdes on the team, interest and participation soared. And of course, she was the first person on site and stayed, under a tree in the hot South Florida sun, until the last donor was done. Despite the ongoing challenges of the pandemic, Lourdes went on to set up two more drives at the school last year. Under her gracious, caring, and watchful eye, each drive produced over 30 pints—and everyone participating stayed safe. Tim Thompson Blood Assurance Cartersville, GA A CHAMPION FOR THE CAUSE Tim Thompson has been a blood and platelet donor with Blood Assurance since 2003, personally donating over 23 gallons. During 2020, he was forced to self-quarantine due to COVID-19 exposure to ensure the safety of the blood supply. His first time back in the chair was after a long wait of a few weeks and when he sat down he said, “It feels good to be home.” Tim was also the Blood Drive Coordinator for Chemical Products Company, promoting the drive to the 110 employees he works with and generally getting about 25% of them to participate. Since 2009, his company has collected over 1,600 units for patients in need. Even with the pandemic going on, they managed to host five blood drives in 2020. Tim talks about the center and blood donation everywhere he goes, wearing the Blood Assurance jacket that he earned by giving platelets 24 times in one year. He encourages his coworkers to donate platelets outside of the drives, and has recruited several of them to become regular platelet donors. He has a passion for blood donation, is a champion in his community, and his efforts as a donor and a coordinator have potentially saved thousands of lives. Laurie Brey Versiti Blood Center of Illinois Grayslake, IL MAKING EVERY DONOR FEEL VALUED Laurie learned of the importance of blood donation at a local community drive and was hooked immediately. She makes sure to arrange her schedule to capitalize on every single donation opportunity she can find. She currently has 36 donations under her belt and is a loyal 4 times a year whole blood donor—even during COVID. Wanting to continue the rewarding feeling and help those within her community, Laurie began hosting even larger blood drives, starting at her church and ultimately bringing them to her work at a large insurance company. She takes the time to contact donors personally to educate them on the value of blood donation and schedule their appointment. She always takes care of her donors on the day of the drive with treats—whether it is coffee cakes or homemade masks. Laurie has Tobias their LLC comfort dog attend many of her drives since he is such a calming force to all that love on him. She makes every drive special giving a big thank you to each donor. In 2020 her drives brought in 265 donations. Laurie goes out of her way with extraordinary efforts to make sure local communities can benefit from her blood drive, joining the center in its diverse donor focus in 2021. She makes sure she has materials translated into Spanish, and gets support from her church, so that all potential donors know and understand how important their donation is—especially given the special blood types that many of the diverse donors in her community have. Amy Ziegler Vitalant Denver, CO DOING WHAT IT TAKES In 1999 Amy Ziegler, the PE Teacher at Dakota Ridge High School, began hosting blood drives. She promotes each drive herself, gets students and staff to fill out the sign-up sheet, comes in early to hang the blood drive signs all over the school, sets up the gym with tables and chairs, and meets the crew before the event starts. Many high schools are hesitant to allow students to be out of class to donate blood, but Amy has been an incredible liaison with her school to allow students to give during school hours. And when autopheresis devices became available for high schools to collect double red cells and plasma, Amy championed the new technology, so that students could make the most of each donation. Though it has been difficult during the pandemic for many schools to host blood drives, Amy advocated for the importance of donations during this time, and worked with her administration to host an event on the campus. Since she couldn’t promote the drive with her usual posters she reached out to students digitally, using social media to share information and making an online sign-up sheet with all the relevant forms, including those for parental consent. No matter what else is going on, Amy wants her students to understand the importance of donating blood and helping the community. Jim Abernathy OneBlood, Inc. Palm Harbor, FL KEEPING OTHERS SAFE Jim Abernathy didn’t like needles, but when he learned of a blood drive in his office building that he could go to during his lunch hour he decided to give it a try. Surprised at how smoothly it went, he became a regular donor. In 2012 he moved to Florida and found a center near his new home—and between July 2012 and March 2017, he donated a total of 15 times. The following month, his 12-year-old son Jackson was diagnosed with Ewing’s Sarcoma, a very rare type of cancer, the treatment for which required both whole blood and platelet transfusions on a regular basis. When Jim saw firsthand the daily need for blood, he committed to donating as often as possible. Jackson was type O-, and Jim is O+, so he knew Jackson wasn't using his blood but depended on others to keep him safe—and Jim wanted to help provide that safety for the many other patients going through similar cancer treatments. This led to him donating platelets, which he has been doing most weekends for the past four years. Jim was a blood donor before it was personal, but now he donates in honor of his son, who passed away in April of 2020. Since Jackson was diagnosed, Jim has donated more than 76 times. Jim has donated over 20 gallons and hopes to keep going until he reaches 100. The Ivory Family Community Blood Center Dayton, OH A LEGACY OF GIVING Mike Ivory grew up in a big Irish-Polish family, and as the youngest he was modestly gleeful on April 21, 2021 to be the fourth Ivory sibling to reach the milestone of 100 lifetime blood donations. “I’m the last of 11 children, eight boys and three girls,” said Mike. “We’re all doing it. It was something instituted by our parents, Bob and Josephine Ivory. Donating what you have—clothes, money, or blood—to those in need.” His brother Jim even remembers hurrying with his mother to the center to donate blood after the 1974 Xenia tornado, “We ended up being the first to have blood drawn.” Jim leads the family with 304 lifetime donations, followed by Bill with 192 and Tim with 134. Eight of the surviving Ivory siblings are donors and as of August 2021 they had collectively made 887 donations. “I’m honored to be part of this family,” said Jim, who after heart surgery can no longer donate. “I always tried to get people to go.” Mike didn’t let the COVID-19 pandemic break his streak of donating, with four platelet and plasma donations in 2020 and more than double that number in 2021, including a COVID-19 Convalescent Plasma donation. It’s an uphill climb to catch up to his brothers in donations, but that’s a source of inspiration. “I really had that goal of 100, but I’m not going to stop,” he said. “My goal now is 200—and to find out where my brothers’ numbers are!” Wes Wright American Red Cross Ashville Fixed Site A BIG SMILE AND A KIND HEART Wes Wright grew up learning of the importance of blood donation from his father, a hospital administrator, and appreciates that in donating he is helping people he will never meet. He began donating platelets in 1983 in Winston Salem, and has been a loyal platelet donor in Asheville since 1992. A Senior Vice President at a bank in Asheville, Wes can be found at the center just about every other Friday, rolling up his sleeves with a smile to donate platelets. Recently, he celebrated his 100th platelet donation, but his impact at the center goes far beyond the blood he donates—he enjoys getting to know the staff and the other donors, and his kindness makes everyone’s day better when he comes in to give. Wes is a devoted father of ten children, five of whom were adopted internationally and several of whom have special needs. He and his wife have had their hands full at home, but he still makes time to donate every other week. He keeps his appointments scheduled out as far as possible and plans to continue to give as long as he is allowed. The many lives he has saved are a testament to Wes’s unending generosity. 2020 Inductees Marsha Asplin Gulf Coast Regional Blood Center Houston, TX ADVOCACY THAT WORKS LIKE A CHARM For 37 years, at least twice a month, Marsha has donated split platelets. She’s accumulated 1,375 lifetime donations — more than 170 gallons. But that’s just a small part of her contribution. When Marsha’s not donating, she is spreading the word about blood donation as a Commit for Life volunteer. Since 2004, she’s volunteered more than 13,000 hours. Her passion and excitement make her a frequently requested team member at drives, and her leadership and teaching skills make her an especially effective recruiter of new volunteers and donors. Everyone she speaks to comes away with a deep sense of the importance of blood donation and their vital role in the mission — and few can escape her charm. Once, at a drive, a donor said she was retiring and wasn’t sure what she would do with her free time. Marsha suggested volunteering, and now the two ladies can be found encouraging others to join the cause — together! Andrew Azan American Red Cross Northeast Region of Pennsylvania Ashley, PA AN EXPANDING CIRCLE OF DOING GOOD Andrew is a dedicated, long-time blood donor, but his commitment to the cause led him to building a broad and growing family of regular sponsors, donors, and volunteers in his Pennsylvania community. Seeing a need for more local events, Andrew started monthly blood drives in Northampton County across multiple locations — country clubs, community centers, and YMCAs. Andrew promotes, attends, donates and volunteers at every one of them. But he doesn’t stop there. To celebrate everyone’s participation and energize them to continue giving — and spread the word to their families and friends — Andrew created an annual recognition program for his sponsors and his donors, held at one of his sponsor sites. Recently, Andrew has set his sights on engaging the next generation of donors. Active in the Boy Scouts, he’s mentored an Eagle Scout and helped him start his own successful blood drives at a local fire house. Andrew proves to us all just how expansive one person’s impact can be. Steven Davidson LifeStream Blood Bank San Bernardino, CA FIGHT WITH ME AS A FAMILY Steven’s battle with Acute Lymphoblastic Leukemia began when he was diagnosed on his 10th birthday. To pass the time while in the hospital, he and his mom created an Instagram page called Steven The Cancer Crusher to bring awareness and love to those affected by cancer. His social media following quickly grew to more than 4,500 followers offering encouragement and support. In his hometown, Steven has become a well-known superhero and role model, creating awareness campaigns and hosting blood drives with collaborations from the local bike and lowrider community. His magnetic charm and optimism shines through even as he continues his personal battle. His dream is to keep helping people, to keep people’s hopes high, and to give people strength and inspiration. When Steven grows up, he hopes to become a doctor or scientist and help find a cure for cancer. With his warrior’s mindset, nothing is impossible. “I may be just a kid,” Steven says, “but I’ve inspired thousands to fight with me as a family.\" Wendy Ellis American Red Cross Portland Donation Center Portland, OR SERVING THE WORLD THROUGH GIVING When the Red Cross started its blood services program during World War II, Wendy’s parents signed up. Her two brothers served during the Vietnam War and became blood donors. Wendy continued the family tradition, when, as a student at Portland State College, a professor had an accident and there was a request for blood donations. With a rare blood type, Wendy became an often-called-on donor, and gave whole blood for many years, racking up 171 donations. In 1979, when platelet donating first started, she switched over. “I could donate every two weeks!” she says. At 75, she is nearing her 500th platelet donation — continuing even during the COVID-19 pandemic. What keeps her coming back? After college, Wendy worked for a bank in the international department. “It gave me an appreciation of the interconnectedness of our world,” she says. And donating, to her, “is a way to take that extra step for your friends or neighbors or fellow citizens. It saves lives, literally! I am still in awe of that fact. Sunnie Fenk Vitalant at Parkway Center Pittsburgh, PA HONORING ALL THE PATIENTS IN OUR LIVES Sonja — “Sunnie” to her friends — started donating platelets three years ago when two close friends were diagnosed with leukemia. She was looking for a way to help. “Because of the nature of their illness,” she says, “I couldn’t do much more than send cards. When I found out about platelet donation and how they’re used for cancer patients, it was perfect. I decided I would donate regularly.” Now she visits the center to donate every two to three weeks. She’s a cheerleader for the cause, convincing friends to donate with her as part of a lunch date or urging others, through social media, to consider giving platelets. When Sunnie heard about her center’s idea for “platelet parties,” she jumped at the chance to be the first hostess. “I think it’s a fantastic idea. Since I started posting about the parties, I found that most people don’t know why platelets are needed, but everyone knows someone who’s had cancer. I explain to them that this is your way to honor them, by helping other cancer patients who are fighting for their lives.” Elaine and Mark Fredricks American Red Cross Salem Donation Center Salem, OR A COUPLE WITH LOVE ENOUGH TO SHARE With beaming smiles, Elaine and Mark arrive at the center to donate platelets every two weeks, like clockwork. Elaine, a Certified Nursing Assistant who helps homebound patients in the community, says she’s simply paying forward the gift of 26 units she received in 2004 during her recovery from emergency surgery. Mark says he’s just doing his bit to help others. Together, Mark and Elaine have donated more than 500 times. And with each visit, the couple brings their energy and kind words. On special occasions, like donor-appreciation events, they’ve even arrived with crocheted stuffed animals, the products of Elaine’s crafting talent. Mark and Elaine lift the spirits of staff, volunteers, and donors alike. They are heroes not just for their generous platelet donations, but for showing us all how to live more joyful lives. John Jenkins OneBlood Lake Park, FL WHEN SELFLESS GIVING GIVES BACK John started donating years ago after seeing a commercial on television about the need for blood. It’s not surprising, given his commitment to helping others. He volunteers at Florida’s Roosevelt Elementary School tutoring 2nd and 3rd graders and reading to 1st grade students. He works with his fraternity — Omega Psi Phi — to secure scholarships for graduating seniors and on a variety of social action projects. And he assists with community outreach programs at the Kravis Center for the Performing Arts. When John first gave blood, he was surprised to find it so easy and painless, and it soon became one of his passions. He has donated more than 550 times, and through his role as an administrator at the local community college, John champions a mobile blood drive program. But it wasn’t until his daughter needed a transfusion in 2019 that the importance of what he was doing really hit home. To know that blood was available for her made him realize that all blood donors are heroes. Kris Kavelaris Versiti Milwaukee, WI EVERY DAY IS A NEW DAY TO MAKE A DIFFERENCE The accident in 1998 changed the course of his life. Kris ended up in the hospital for three months where he had four surgeries, received blood transfusions, and had to learn to walk again. The doctors and nurses – and blood donors – had saved his life. When Kris was released, he felt he had to make a difference, and he started donating blood as a way to give back. With a rare, O-negative blood type — found in just 7 percent of the U.S. population — he’s a highly desired “universal donor” whose blood products are critical for trauma cases and emergency rooms. Kris is a loyal blood donor, and although at retirement age, he isn’t done finding ways to help people in need. He has enrolled in Milwaukee Area Technical College’s nursing program and is passionate about spreading the message of donation. “It feels so satisfying. Ask yourself — if not me and you, then who? If not today, then when?\" Joe McDonald San Diego Blood Bank San Diego, CA HONOR, COURAGE AND COMMITMENT Joe embodies the values of a Marine – honor, courage and commitment. He’s a Vietnam veteran, a husband, father, and grandfather, and at times, even Santa Claus. Joe joined the Marines when he was 18. In 1963, aboard the USS Springfield, he donated blood for the first time for a fellow Corps member. Since then, Joe has traveled the world, visiting 50 countries and he’s been present for historic events. Joe shook hands with John F. Kennedy two days before he was elected president. Joe was in Washington DC where he witnessed Martin Luther King’s “I Have a Dream” speech at the Lincoln Memorial. Through it all, Joe has made it a priority to support those in need, donating blood for patients and bringing joy to children and adults alike by playing Santa. It’s another tradition he developed in the Marines, when he delivered toys to an orphanage in Vietnam. Joe plans to reach his lifetime goal of 100 gallons within a year — and, true to the Marine tradition, is letting nothing stand in his way.\" Michael Otterman Blood Assurance Chattanooga, TN IN HELPING OTHERS, WE HEAL OURSELVES Mike’s connection to blood donation is deeply personal. His daughter, Simone, was diagnosed with ALL Leukemia as an infant and passed away shortly before her 2nd birthday. “During her time in treatment, she used bags of blood and platelets and I remember being so thankful of those nameless people who donated for her. Since the loss of my little girl, I’ve been giving platelets every month. Not only does it allow me time to reconnect and remember Simone, but I know the value of my blood products to other people who desperately need help.” As CEO and President of Lodge Cast Iron, an organization with deep roots in Tennessee, Mike is also a believer in the positive impact that doing good can have on employees and communities, bringing people together, especially in times of crisis. So he’s championed blood drives at the company for years, collecting 784 units since 2009. And as COVID-19 began to pose challenges for the blood supply, Mike lent his voice to a campaign encouraging other local businesses to safely re-open their doors for donation events or join the cause for the first time. Warren Pitcher LifeServe Blood Center Des Moines, IA DRIVEN (AND DRIVING) TO SERVE Warren grew up seeing his father donate blood regularly, and today he carries on the family tradition. With O+ blood, he steps up with whatever is most needed — platelets, plasma, double red cells, or whole blood — 16 gallons worth over 100 donations. But Warren’s influence reaches well beyond the blood he donates. He has been the primary chairperson for his church’s blood drive for more than 25 years. During his tenure, Warren has touched the lives of thousands of hospital patients. He’s also one of the community’s longest-tenured and most dependable volunteer drivers — the perfect fit for someone who taught drivers education for almost 20 years. Warren has spent more than 4,000 hours transporting blood products to hospitals for transfusions, or to laboratories for processing. When asked what keeps him going after all these years, Warren’s answer is clear: “I enjoy the people and giving back. And I know the only way patients can receive blood is through donations.\" Rush Roberts OneBlood St. Petersburg, FL FIRST IN LINE TO HELP OTHERS Rush has been a Hillsborough County firefighter and paramedic for almost 14 years. On the job as a first responder, he contracted COVID-19 during an emergency call. Rush had planned to compete in an Ironman race. Instead he ended up fighting for his life. After 21 days of quarantine and emergency room visits, he finally received a negative test indicating he had won the battle. And true to his profession, his second question — after first asking when he could visit with his family again — was, “When and where can I donate convalescent plasma?\" Not surprisingly, Rush became the first donor at his center to come back and donate his second round of convalescent plasma — and to schedule his third. Despite the difficulties he’s been through, he considers himself luckier than most and wants nothing more than to help others overcome this disease. 2019 Inductees Adair E. Andrew American Red Cross Asheville, North Carolina Hitting new milestones of caring Adair E. Andrew, a retired high school teacher from St. Louis, Missouri, is proof that when you put your mind to something, you can do it. Adair sets impressive goals for every activity he takes on—hiking, biking, walking, even reading. At 44, he decided to walk 44 miles to celebrate his birthday, and he did the same thing, adding a mile each year, for a decade. When he turned 55, he changed things up, joining his brother on a 965-mile cycling trip. Since he and his wife, Marti, moved to Asheville, North Carolina, Adair has put this same dedication towards donating platelets. He is frequently found in the donor chair, keeping up with his reading—and hitting new milestones, Adair was most recently recognized for having donated more than 700 times. But he hasn’t stopped there. Taking his optimism on the road, Adair became a volunteer driver. When his center needed someone to be interviewed by the local news station to get others excited about donation, he was the first to step up. With every new challenge, Adair reminds us all just how much we can do to help those in need in our communities. Dexter Emoto, RN LifeStream Blood Bank San Bernardino, California A nurse who goes the distance Dexter Emoto is a blood donation marathon man – a long-distance runner and registered nurse who knows that anything worthwhile takes effort, enthusiasm, and endurance. Dexter specializes in post-anesthesia care and recovery at Loma Linda University Health, where he sees first-hand the need for blood. It’s his job to give patients transfusions.  While many days are routine, he’s also called to serve during crises like the 2015 San Bernardino terrorist attack, which left 14 people dead and 22 seriously injured. His patients remember his expertise, wit, and compassion. What they don’t know is that he is also a dedicated donor. For more than 40 years, Dexter has regularly donated blood and plans to continue, he says, for “as long as I am healthy and fit to do so.” In 2018, Dexter began organizing and recruiting for blood drives on the Loma Linda campus.  The drives are now a fixture of his center’s calendar. Whether it’s the patients he’s helped or the donors he’s inspired to carry on his legacy of service, Dexter Emoto’s influence will be felt for many years to come. Theodore Hale Community Blood Center Dayton, Ohio Never giving up on a chance to save lives Theodore Hale is 19 years old—a college sophomore—and he’s already banked 30 donations towards his lifetime goal of 1,000. Whether it’s donating a gallon of blood, cycling 100 miles—or, as he did for 10 years, compete in the Ohio Special Olympics—Theo sets the bar high and says that success is about never giving up. “If you don’t persevere you won’t get anywhere,” he says. “Life is full of failures. You take them and learn from them.” Theo was inspired to donate platelets by his mentor Glenn Stoops, a longtime donor. The two biked to the blood center to donate the day before Theo graduated from Fairmont High School. They were celebrating his many honors—summa cum laude and National Honor Society; the faculty award for academics, leadership and service; and being voted “Mr. Fairmont” by his classmates. Getting to that first donation, though, wasn’t easy. Theo wanted to donate as soon as he turned 16, but he was turned away. “I kept getting deferred. Weight, blood pressure, I think it was 10 times,” he says.  But, just like with schoolwork, Theo never gave up on his chance to save lives. Peter R. Hall American Red Cross Josephson Blood Donor Center Mobile, Alabama A generous soul and a bright spirit Peter Hall has spent much of his life supporting his community and church. He’s a retired teacher who worked in public schools for 30 years, first in Dayton, Ohio, and then in Mobile, Alabama.  Peter is a 17-year parishioner of St. Pius X Catholic Church and a member of its St. Vincent DePaul society, which provides food services to those in need.  He’s also a member of the Knights of Columbus, another faith-based service organization. Peter also volunteers with the Ronald McDonald House and serves meals to their clients. Since 1986, Peter has also donated blood. For more than three decades, he was always ready to give a pint in the hope it would help someone regain their health. So, three years ago, when asked if he would like to try making a platelet donation, he was more than happy to spend the extra time providing this lifesaving gift. Since then, he’s become a dedicated platelet donor, and has given more than 233 units. For those who know him well, it’s no surprise.  Peter is a generous soul and bright spirit who can always be counted on in times of need. Sarah Hansgate, Jillian Truesdale, and Dawn Wolf ConnectLife Williamsville, New York Giving blood gave them friendship Every other Saturday morning they arrive at the center at the same time.  Three ladies who have bonded over their shared commitment to saving lives through donation. Sarah Hansgate, Jillian Truesdale, and Dawn Wolf had each been donating platelets for several years. Though they’re all about the same age, live in the area, and in some way or another crossed path’s before, it was in the hours they were seated next to each other that their commonalities blossomed into deep friendship. Today these donor buddies can be found lined up in a row, laughing the time away as they share the latest stories of their daily lives—and the gift of their platelets. More often than not, the lively conversation continues well after their donations are completed, either at the center’s refreshment area or out at a local restaurant. Sarah, Jillian, and Dawn represent what giving back is all about. Together, this trio are not just contributing to their community, they’re helping create it. They’re a true band of heroes. Sister Damien Hinderer Hoxworth Blood Center Cincinnati, Ohio A calling to care Most donors have a personal reason for giving. From the beginning, Sister Damien Hinderer's has been centered in her faith. “I pray for all the people I donate for, even though I don't know who they are,” she says.  “Some place along the line, they need prayers. You care for them even though you don't know them. You know that you're helping them in some small way, maybe some large way.” Sister Damien has been donating twice a month for close to 60 years. In 1960, she made her first donation to help a sister who had a bleeding ulcer. “They asked those of us who were novices here if we wanted to go over and I said, ‘Yeah, I will.’ That was my first donation, and I've been giving ever since.” She donates triple platelets every visit, which equates to 72 lifesaving units of platelets a year. Just recently, Sister Damien was recognized for reaching the 80-gallon donation mark. When asked about her milestone donation, she smiled and said, “This vein belongs to Hoxworth,” but it really belongs to all those who have benefited from her calling to care. James R. Kuhlmann The Donor Center at Roswell Park Buffalo, New York Setting a world record For James (Jim) R. Kuhlmann, it began in 1970, when his dad was unable to keep his donation appointment. Jim went in his place and that began a nearly 50-year streak of donating platelets. “Donating was easy and I felt so good knowing I was helping someone right in my community,” he says. Several years ago, Jim contacted the Guinness World Records to see if he might qualify for a world record. It took some time, but he did. For his total donations on record through April 2017, Jim qualified and is the current record holder in the category of most donated blood-apheresis (platelets). “Being the world record holder is exciting, but what’s really important is knowing I’m able to help patients in need,” he says. Today, Jim continues to donate every two weeks—either in Buffalo, New York, or between golf games in Florida, where he lives during the winter. He’s an easy-going, funny, intelligent, and determined man, who regularly encourages others to donate. “We all make time for what’s important to us,” Jim says, “but do we make time for what’s important to others? Nothing is more important than helping someone fight for their life.” Dawn Marisch Versiti Milwaukee, Wisconsin Life-changing perspective On what began as a typical summer day on June 1, 2011, Dawn Marisch found herself in an extraordinary—and life-threatening—situation. Dawn was the principal at an elementary school and her students were rehearsing for “concert day” when Dawn suddenly suffered an aneurysm. She was treated by first responders and rushed to the hospital where she had four surgeries and received a remarkable 90 units of blood, platelets and plasma over the following four days. “It wouldn’t have mattered how great the physicians were if we didn’t have the blood that I needed,” she says.  “It was very humbling to realize how many people—how many everyday heroes—it took to save my life.” Now a blood donor herself, Dawn is grateful for her chance to save others. As an O-negative donor—the universal blood type used in emergencies like the one she experienced—Dawn understands the impact of just one donation, not just for patients, but for their families as well. To anyone considering donation, she says “it truly is a life-saving gift.” Steve Pringle LifeServe Blood Center Des Moines, Iowa A sense of duty After 23 years in the Army, and 30 years working for city of Clive, Iowa, Steve Pringle decided to retire. Retirement didn’t mean relaxation, though. Steve found a new way to serve—as a blood donor and center volunteer. Steve first became involved with the volunteer blood donor program during his military career. He knew first-hand the importance of blood donation from his tours in Vietnam.  He happily donates whatever blood component is needed most on any given day -- whole blood, double red cells, platelets, or plasma.  He’s donated more than 63 gallons, according to LifeServe in Des Moines. He’s also logged 4,000 volunteer hours at the center, more than anyone else in the organization during his tenure, touching almost every department with his generosity. Steve is best known for his work as a driver, transporting blood to hospitals for transfusion or to the lab for processing and delivering supplies to our various locations—always at the least desirable times and over the longest distances. What drives Steve to serve others with such selflessness, day in and day out? His answer is simple: “I enjoy the people, so it doesn’t feel like work at all.” Jamie Stembridge OneBlood – Tampa Kennedy Tampa, Florida Inspiring a community Jamie Stembridge doesn’t do anything halfway. Whether it’s making the most of the outdoors—camping, fishing, or four-wheeling—spending quality time with friends, family and her two pups, or advocating for those in need. Jamie was a committee member of the non-profit Hooked on Hope, which helps breast cancer patients with financial issues during treatment, when she heard about Natalie, a local patient in need of platelets. She joined Natalie’s cause, stepping up to become a directed donor. When she learned that Natalie would need more than Jamie could give, she turned to social media. Jamie’s plea went viral, and the center quickly had more than 70 directed donations. Many were from people who, like Jamie, had never donated before. With all their generosity, and a successful bone marrow transplant, Natalie was soon able to make her own platelets. And the enthusiasm Jamie inspired has continued—the donors she brought in for Natalie still support the center today. Jamie didn’t just help increase donations; she helped build a stronger community. Marqus and Ashley Valentine Vitalant Tempe, AZ Sick Cells Elevating the voices of sickle cell Diagnosed with sickle cell anemia at 6 months old, Marqus Valentine spent countless weeks of his childhood in the hospital.  He has endured strokes, acute chest syndrome, sepsis, and chronic pain.  He had to repeat grades, because he missed so much school. Doctors said Marqus might not live past 10 years of age.  Today he is 36, thanks to blood donations and the assistance of friends and family.  He was also named a Blood Services Hero by the American Red Cross Chicago Region. Marqus’s younger sister, Ashley, who spent her early years in hospital playrooms while Marqus recovered, saw first-hand how few resources were available to people with sickle cell. Ashley now holds a master’s degree in Research Methods, and advocates for improved health care coverage and treatment for sickle cell patients. Marqus and Ashley have created a not-for-profit organization called Sick Cells, which “seeks to elevate the voices of the sickle cell disease community and their stories of resilience.” Using the power of film and storytelling, Sick Cells highlights the disparities around sickle cell through personal experiences.  As a result, Marqus and his supporters are influencing decision-makers and making a difference for families. Scott Zechiel City of Hope Donor Center Duarte, California Walking alongside those who save lives When Scott Zechiel was 16 he was raced to the hospital for an emergency appendectomy. During the procedure he lost so much blood, he needed six transfusions. Scott is now a 54-year-old software engineer and a passionate blood donor. For the past 14 years he’s been thanking those who helped him by giving back. Commuting from Orange County to Duarte every two weeks, Scott has made 332 donations so far and is looking forward to his 350-donations milestone. And he’s gone one step further, registering with the “Be the Match” registry for potential bone marrow donors. He tells everybody that he lives for his donation days, “because I just enjoy them so much.” That joy shines through—Scott’s positive attitude, dedication, smile, and enthusiasm bring something special to the center every time he’s there. As a thank you he was invited on his center’s Rose Parade float. Scott was characteristically humbled by the experience, saying, “It was just the ultimate, to be alongside all these wonderful people—doctors, nurses, and such—who work to save lives every day.” 2018 Inductees Dan Porter American Red Cross Richland Donor Center Richland, Washington Dan Porter first started giving blood at his place of work. For years, he saw it as another way he could give back to his community — as he does with his woodworking skills, making props and other needed items for the local dance company and other service groups. But when two of Dan’s close friends were diagnosed with cancer, his commitment to donation became all that much more personal. He learned about the importance of platelets to cancer patients — one of his friends, with whom he spent quite a bit of time, at one point was receiving platelets on a weekly basis. Both friends have since passed away, but Dan saw how their transfusions allowed these men to go home and spend additional, precious time with their families. Knowing that there is often a shortage, Dan now donates platelets with The American Red Cross whenever he can. Since 1993, he’s given a total of 320 units. Dan says he is a lucky man, grateful for his health, and for being able to help others in this way. JoLynn Cunningham MEDIC Regional Blood Center Knoxville, Tennessee Many years ago, when a colleague asked her to participate in a drive for his wife, JoLynn forced herself to face an extreme fear of blood and needles. Though she fainted that first time, JoLynn didn’t let it stop her. Through sheer persistence, she’s become a platelet donor who generously gives doubles and triples at each donation — although to this day she still can’t look at the needles! JoLynn keeps to her biweekly commitment to donation, as well as organizing MEDIC drives, even though she’s an extremely busy lady. A retired professor of Child and Family Studies from the University of Tennessee, Knoxville, she still mentors PhD students, supports the Children’s Defense Fund, and regularly serves as staff or sits on the boards of a number of community non-profits. A life-long music, nature, and animal lover, JoLynn has brought her passions to a myriad of other volunteer programs, from her church choir to the Knoxville Zoo. Yet JoLynn has selflessly scheduled all of these activities, as well as elective surgeries, trips out of the country, and day-to-day living, to maintain her platelet schedule, completing more than 400 procedures since 1999. For everything she’s done for others, JoLynn has twice been honored as recipient of the UT National Alumni Association Public Service Award. She does truly live the spirit of Tennessee — the Volunteer State — and the Torchbearer statue that shines over the UT community, in providing leadership and service that improves the world around her. Lauren McCrary Carter BloodCare Bedford, Texas Lauren McCrary knows first-hand how important it is for blood to be on the shelf for those in need, especially cancer patients. Ten years ago, she was diagnosed with acute myeloid Leukemia. After a tough battle, and many units of blood products along the way, Lauren received a bone marrow transplant from an anonymous donor. Lauren eventually got to meet him, a firefighter from Seattle named Patrick. They’ve since become life-long friends, and Lauren has become a vocal advocate of blood and marrow donation. In 2012, in addition to her duties as library aide and student council sponsor at Castleberry High School in Ft. Worth, Texas, Lauren took on the role of the school’s blood drive coordinator. She actively encourages all students and faculty to donate whole blood and if possible, platelets, plasma or red cells — and to sign up for the bone marrow registry. With Lauren at the helm, the school has donated more than 400 units to the community supply. For Lauren, it’s a way to pay forward the lifesaving generosity that she had been so lucky to receive. Keith Olson American Red Cross Bend, Oregon Keith Olson is a newcomer to platelet donation, having started with the American Red Cross in Bend, Oregon last year, after a whole blood staff member encouraged him to try it at a blood drive out of town. Keith’s wife had received chemotherapy, and platelet donation seemed like an positive way to honor of his wife. Despite a busy schedule — Keith has a sports equipment manufacturing company, raises steer on his ranch, announces rodeos in 10 states and 2 provinces in Canada, and always makes time for family, including his son and young granddaughter, who live with him on his ranch — he is now a regular platelet donor, coming in to the center once a month. His commitment to platelet donation is no surprise — as a member of the clergy and a volunteer for Beulah’s Place, an organization that helps get homeless girls off the street, Keith is well-known for making time to help others. But he gives the credit to being self-employed, which, “gives me the flexibility to give back that others might not have.” William O’Hara Central Blood Bank Monroeville, Pennsylvania When William O’Hara started donating blood 35 years ago, he never imagined he’d be marking his 500th donation, but that’s just what he did on May 20, 2018 at Central Blood Bank’s Monroeville center. “When I started, I figured maybe I’d reach 100, 150. Every time I hit another 100 marker, I tell the team, this might be it. They assure me I’ll be around until 600. If I can, I will,” says Mr. O’Hara, 70, a U.S. Navy veteran and retired engineer. Mr. O’Hara originally was a whole blood donor. But about 20 years ago, a coworker mentioned that he donated platelets. “He said it takes a little longer, but encouraged me to try it.” Mr. O’Hara liked the idea that his platelet donations help cancer patients, and it became a habit he’s happy to stick with. “They really go to someone who needs it.” To this day, a personal thank-you from years ago remains a powerful inspiration. “The first Christmas after I started donating platelets, I got a Christmas card from a family whose child was receiving platelets. That really made it hit home.” Valerie Alpizar One Blood Deland, Florida A nurse by training — first in oncology and now in home health — Valerie Alpizar has always been well aware of the importance of donating. She first became a whole blood donor when she was in college, then switched to platelets 20 years ago, for a friend who had cancer. Valerie is now a dedicated platelet donor. She donates a triple product every other week, as many times as she can. She’s currently working towards her next milestone — 30 gallons! To the One Blood team, Valerie is more than just a donor — she’s part of the family. And her positive attitude, warm demeanor, and friendly disposition bring some extra sunshine to the Deland branch, every time she comes in. James and Peter Cole Vitalant (formerly BloodSource) Folsom, California Peter Cole was familiar with blood donation long before he was able to participate, having tagged along whenever his dad, James Cole, gave blood. James’s weekly donations were an inspiration to everyone whose path he crossed. So it was no surprise that when Peter turned 16, he was ready to lend an arm, starting a family tradition —and a friendly, but fierce, competition — that has continued for nearly two decades. Peter and James’ good-natured ribbing spurs them on to keep blood donation at the top of their to-do lists. They have responded to the call to give, often going in together, regardless of what is needed on any given day — whole blood, red cells, platelets, and plasma both for transfusion and for plasma-based medicine. Together they have donated a staggering total of 2,375 times, with James meeting the milestone achievement of 1,000 donations and Peter of 1,300 donations early in 2018. And Peter has recently upped the game by becoming a volunteer at BloodSource centers. The willingness of this father-son team to help in any way, along with good humor and easy laughter, bring smiles to staff and donors alike. Jim McCullough LifeServe Blood Center Des Moines, Iowa Jim McCullough became a blood donor when he joined the ROTC in college, continuing through his time with the Iowa National Guard and 37 years in the Army. When he retired as a Colonel in 2001, he became a volunteer driver for LifeServe Blood Center. Along with his wife Pat, he’s put in thousands of hours picking up blood from local drives for processing and testing. When Jim started donating blood, it was because he wanted to do something for others — patients he would likely never know. But over the years, he’s been personally connected to a few of those who have benefited from his generosity — a good friend living with leukemia and his own brother-in-law, who was diagnosed with myasthenia gravis. Jim saw first-hand how transfusions helped them come back to life and enjoy usual activities again. It’s been added incentive to keep rolling up his sleeves, giving blood and getting out on the road. Beyond his work with LifeServe, Jim is an unsung hero for veterans, volunteering at the Iowa Veterans Hospital and for the Iowa Military Gold Star Museum. Olivia Shorter and Family American Red Cross Greater Chicago and Northern Illinois Region Olivia Shorter was diagnosed with sickle cell disease when she was just 7 days old. While her condition can be managed, it requires medical care and regular blood transfusions — Olivia receives one as often as every two weeks. When Olivia was asked what she wanted for her seventh birthday, instead of asking for a gift, she replied, “I want to have a party for kids just like me.” And, as her mom, Danielle has said, “You can’t say no to that!” So, with the help of her parents, older brothers, and a host of family and friends, the first Sickle Cell Awareness party was held in September of 2017. Olivia recalls the day saying, “A lot of people came and donated blood, and a lot of kids had fun. And grownups too.” Danielle agrees that it was a great success, and truly inspiring that so many came to lend their support. “It was humbling. I’m so grateful. And I guess we’ll have to do it again!” The second annual party will be held in September 2018 — as September is not just Olivia’s birthday month, it’s also Sickle Cell Awareness Month. Andy Decker SunCoast Blood Bank Sarasota, Florida For more than a decade at Suncoast in Sarasota, Florida, and before that, for many years at a center in New Jersey, Andy Decker has been giving the gift of platelets every two weeks, rain or shine. He’s one of those special people who make recruiters’ jobs so easy and rewarding. More often than not he calls in before they can reach out to him, and his first words on the phone are always, “When do you need me?” Andy didn’t even let his own health issue interrupt his regular donation schedule for longer than it absolutely had to. About 18 months ago, Andy was diagnosed with cancer. Thankfully, his treatments were successful. Andy waited through his one year mandatory deferral, then called the center to set up his next appointment — on the very day that he became eligible to donate. Since then, just like always, he’s been going in every two weeks, right on the dot. Donors like Andy don’t come back again and again because they feel obligated to — they donate because they have an unconditional love for humanity. Andy brings that with him every time he walks through the center’s door. Pat Yahnke Nebraska Community Blood Bank Lincoln, Nebraska Pat Yahnke was inspired sixteen years ago to donate blood because of her husband, Ken, a long-time donor. A dedicated supporter of the American Cancer Society — she often drives cancer patients to their medical appointments — Pat recognized that blood donation was another way she could help them. Today, Pat is an avid double-red cell donor as well as an important part of the Nebraska Community Blood Bank (NCBB) volunteer team, serving in the donor center canteen and at blood drives. Pat loves working with the collections team and meeting new people, especially first time donors who might be a little nervous. With Pat greeting them right after their donation, donors can’t help but feel like heroes. Pat is humble about all that she does, saying, “I just talk to people and hopefully make their blood donation journey a little more enjoyable.” Her warmth, helpful attitude, and fun personality undoubtedly do! Dustin Guillermo Blood Bank of Hawaii Honolulu, Hawaii 15 years ago Dustin Guillermo took a phone call for his coworker from the Blood Bank of Hawaii. His colleague — a donor on the center’s Wall of Fame — inspired Dustin’s first donation. It was then that he realized how important blood donors had been in his own life — they had ensured supply was there for his grandfather, who often needed transfusions after weekly dialysis treatments. Today, Dustin, a universal donor, is regularly at the center. He recently donated his 88th unit of whole blood and is well on become a double-century donor. But beyond that, Dustin has become a donation champion, actively recruiting family and friends through social media (and even strangers driving behind him, as his license plates read “DN8 BLD” and “GIV BLD”). He once noticed a friend on Facebook posting about donation. Dustin thanked her and asked, “What made you donate blood?” Her response was, “You.” She explained that his posts and passion really touched and inspired her to do her part to save lives. With a new generation of donors like Dustin, the nation’s patients are in good hands. 2017 Inductees Jeremy K Evans American Red Cross Woodland Hills Donor Center Woodland Hills, CA Jeremy started donating with the American Red Cross in 2004, as a student at Hollywood High School. He was soon introduced to the world of apheresis donation, and has become a passionate, committed, and much-valued blood donor. To date, Jeremy has given a total of 500 plus units. Jeremy’s dedication to serving his community and country extends far beyond blood donation. He's currently a Medical Dispatcher/EMT for Air St. Luke's in Boise, Idaho, a Cal Fire wildland firefight hand crew, an EMT and 911 Dispatcher for McCormick Ambulance for LA County, a Disaster Service EMT volunteer for the City of Torrance, and, in September, will be deployed as an Army Medic Healthcare Specialist for the California Army National Guard. But he never lets this difficult work keep him from donating — Jeremy has been known to come to the center after a 48-hour shift as an EMT to continue the mission of saving lives. Jeremy is a true hero, in every facet of his life, and an example for all to follow. Thomas Van-Dorn American Red Cross Fullerton Donor Center Fullerton, CA Mr. Van-Dorn started donating whole blood in 1987, and became a platelet donor ten years later. He knows the importance of platelet donations first-hand, as his son died at an early age after having received many platelet transfusions. Since then, Mr. Van-Dorn has donated in his memory. Blood donation is far from Mr. Van-Dorn’s only contribution to the community. He has worked for The City of Azusa in California as a Community Improvement Inspector for the Business License Division for 8 years. He is active in the church, and also in the arts, participating in many local musicals, barbershop quartets, and choirs — in fact it was through The Second Generation Choir that he met his wife 33 years ago. Still, Mr. Van-Dorn never lets anything else get in the way of his support for blood donation. Not only has he never missed an appointment, he will not travel to any deferral area, because of his commitment to the apheresis program. In July 2016, Mr. Van-Dorn gave his 900th donation, and set a new, inspiring goal: reach 1,000 units by early 2018. Felix Lilly American Red Cross Portland Donor Center Portland, OR Felix’s journey as a platelet donor began in 2007. He was 10 years old and fell out of a tree breaking his wrist and femur, which snapped in half. When he became aware of the blood and platelet donations he needed to heal, he began to understand how important it was that people give blood. For the next six years, Felix talked about how he couldn’t wait to be old enough to donate so that others in need would have the blood and platelets that were available to him. In 2014 Felix started donating platelets — a triple every two weeks and 24 times in a rolling calendar year. To date, he’s given more than 183 units of platelets. When asked why he donates, his answer is inspiring. “I do it because I know I’m helping save the lives of cancer patients, burn victims, and anyone else who needs platelets to survive. I do it for the young kids with chronic diseases so they have a chance to thrive as adults.” It’s that passion that makes Felix a true platelet Super Hero. Joshua Ford American Red Cross Durham Blood Donation Center Durham, NC Joshua became a donor when he was 18 and has been a very regular donor for 10 years now. Joshua drives about an hour each direction to come to the center, but he always arrives with a big smile and a basket of fresh, homemade baked goods for the staff — and everything he bakes is delicious. Joshua jumped in to help with recruiting donors on a big drive at North Carolina State University, as he can’t understand why there isn’t more participation from young donors. When asked why he became a donor himself, as a young man, Joshua’s response is simple. “It was the right thing to do to help save lives,” he says. Joshua was recently selected as a bone marrow match for a patient, and happily agreed to donate. His only concern was that he would have to skip a few platelet donations in preparation for the procedure. It’s just one more wonderful way Joshua is an inspiration to the many young people in our communities who believe that helping others is a priority in life. Thane Hill Bonfils Blood Center Denver, CO Thane is more than an amazing teacher at Columbine High School in Littleton, Colorado, he’s also their blood donation champion. Through his leadership, the school has ranked number one out of more than 100 high schools who hold blood drives in the state, year after year, for the largest blood drives and most blood collected. His efforts have resulted in more than 3,200 units collected and more than 9,500 lives saved. Equally important, they have provided a means for many to help heal their community, even years after the school’s devastating tragedy. Through education and innovative programs, Thane has inspired and enabled students to give as much as possible. He created the first-ever Colorado High School/Alumni Summer Blood Drive, bringing together school alumni and thelocal community during months that are difficult for blood centers, and he is developing the Gallon Donor Award, to celebrate those who donate at least three times each year. Thane’s enthusiasm and ideas have spread well beyond Columbine, and he is now a sought-after source of advice for other school leaders interested in engaging today’s youth in the life-saving mission of blood donation. Lisa Truitt Carter BloodCare Bedford, TX Lisa has been hosting blood drives for more than nine years. To date, she has helped collect more than 500 units of blood and saved more than 1,500 lives. Her passion emerged after her own need for a blood transfusion and first took form in the annual blood drive she runs at her office at ERA Colonial Real Estate. She’s grown the drive from one bus and 20 units collected, to two buses and 50 units collected. To ensure her events are successful, she’s been known to encourage potential donors to eat iron-rich foods by making them her “secret recipe” spinach salad. In September 2013, tragedy struck when her son, Will Truitt passed away after a motorcycle accident. To honor him, she started hosting two more drives each year: The Will Truitt Memorial Blood Drives, held in May on Mother’s Day weekend and in September during Labor Day week. She also began Motorcycles, Moms and Me, a non-profit bringing everyone together to promote both blood donation and motorcycle safety. Lisa Truitt was honored by Carter BloodCare as the 2016 Circle of Life recipient for her steadfast support of their community blood program. Susan Leugers Community Blood Center Dayton, OH Susan was a dedicated blood donor before she lost her daughter Chelsea Lukey to cancer in 2010. It was one of the things Chelsea was most proud of about her mom, and something she wished she could do too. So, six years after Chelsea’s death, Susan decided to launch a blood drive in Chelsea's honor in their small town of Botkins, Ohio. At the first Chelsea Lukey Memorial Blood Drive, held in July 2016, 76 donors participated, including 34 first-time donors. One of newcomers was Chelsea’s own brother, Nathan. Based on her success, Community Blood Center asked Susan if she could hold her second annual drive just six months later, to help boost blood collections during the challenging holiday season. She readily agreed. It resulted in increased participation, with 91 donors, including 16 first-timers, and hit 115 percent of the collection goal. “I’m passionate about being a blood donor, and it was the obvious thing to do in Chelsea’s honor,” said Susan, who has donated more than 130 times. Her passion has now become an inspiration for the whole Botkins community. Bobby Daquara New York Blood Center Brooklyn, NY Bobby Daquara has been committed to blood donation for a very long time. The Green House Café, a Brooklyn, New York restaurant owned by Bobby, and his partner, John Keegan, has been the site of blood drives since 2009. In February 2013, Bobby and his wife lost their daughter, Haley, to leukemia. She was just 10 years old. After Haley died, the drive was renamed Haley’s Comets in her honor and significantly expanded. Along with their team, they now run blood drives seven times a year, including in the critical, high-demand months of July and December. In the eight years he’s been running blood drives, Bobby has supported the community by collecting more than 1,700 donations. Bob Grant Oklahoma Blood Institute Oklahoma City, OK Mr. Grant has been giving blood with Oklahoma Blood Institute for its entire four decades. Mr. Grant first started giving blood when he learned about a little girl who was born with a life-threatening kidney disease. Since then, he’s made it his mission to donate every chance he gets.  And when Mr. Grant sets his mind on a goal, he meets it. At 82 years old, he became the oldest graduate of the University of Central Oklahoma. Now, at age 85, Mr. Grant has a friend drive him to give platelets every other Friday.  His eyesight is deteriorating, but he’s still going strong.  Mr. Grant has given nearly 70 gallons of blood, adding up to more than 550 platelet and blood donations. He says giving blood has helped him conquer alcoholism and cope with the death of his wife. A character in every sense of the word, Mr. Grant loves to share the life-saving power of blood donation with others. “One, you get a $400 physical!  Two, it’s good for your system: you rebuild your blood.  And, three, you save somebody’s life! What a combination of things to do!” says Mr. Grant. “Doesn’t cost anything, just takes a little bit of time, and I’ve got time.” Dwayne Hutcheson OneBlood Titusville Donor Center Titusville, FL Dwayne started donating whole blood at 18 years old, when his father talked with him about the importance of blood donors. After realizing the value of his rare blood type, AB+, he started actively donating platelets and plasma. Dwayne has worked at Kennedy Space Center for over 20 years in Titusville, Florida, where he was raised. In his spare time has set up many blood drives at local churches and volunteers on those drives to help recruit future donors. He enjoys preaching about the importance of blood donation. He likes to remind people that “blood doesn’t grow on trees” and that following accidents or illness, donations can be the thing that “helps people survive, to be with their families.” He believes he has encouraged more than 1,000 people to become donors over the years. Dwayne is now 44 years old, and has donated more than 133 gallons of blood, platelets and plasma. Dwayne always donates the maximum amount he can in a year, because, as he says, “it’s more important to give than receive”. George Soper OneBlood Rockledge Donor Center Rockledge, FL George originally started donating blood when he was just 20 years old, at the start of his 23-year career in the U.S. Navy. Whenever there was an appeal for donors, George was ready and willing to serve. Since his service in the military, George has retired again, from 15 years as a science teacher at Satellite High School in Satellite Beach, Florida. Though he remains actively involved in many school activities, helping out with the drama club and the volleyball, basketball, and softball teams at Satellite High and Eastern Florida State College, he still finds time to donate platelets every 2 weeks, 24 times a year. According to George, the best part of donating is, “knowing that it’s helping people, and working with the people at the blood bank, because their commitment to healing others is so uplifting”. Over the span of 26 years, he’s donated a total of 141 gallons of blood — helping to save approximately 3,384 lives in the process. George is truly a hero, and admired by many in his dedication to the cause. Josh Beard Mississippi Valley Regional Blood Center Davenport, IA Following the example of his mother and his brother, Josh Beard began donating blood in 2009. But in 2014, Josh experienced first-hand the importance of giving. He and his wife, Chelsea, saw their first son, Milo, struggle with the effects of Rh disease. Milo received a blood transfusion just days after his birth. In 2016, after multiple consultations and tests, Josh and Chelsea found out their second child would face the same complications as Milo. At just 23 weeks, the baby received an in-utero blood transfusion. Four more in-utero transfusions later, the Beards welcomed another son, Brooks. Milo and Brooks are now happy and healthy, growing boys, but without the generous donations of volunteer donors, the Beard brothers would not have survived. So, Josh gives back to those who gave for his family, every 56 days. In addition, the Beard family hosts a blood drive thoughtfully named “The Beard Brothers Give Back,” in an effort to thank donors and replenish all they have used and more. In Memoriam Inductee E-I Sellon Washington State University College of Veterinary Medicine E-I, a handsome golden retriever, was rescued in 2010 and in turn helped rescue other dogs from ill health through the canine blood donor program at the Washington State University College of Veterinary Medicine. Over 6 years, right up until he passed away this spring at age 9, he gave 26 times, helping to save approximately 70 other dogs. He was always friendly, happy, and excited to donate —and gave great high fives. An inspiration to his fellow four-legged and two-legged human friends, E-I will be much missed. 2016 Inductees Shaun M. Brennan American Red Cross Donor Center Jonesboro, Arkansas Every year, for the last four years, Shaun Brennan has donated plasma or platelets on Thanksgiving Day, Christmas Day and New Year’s Day – what he calls his “Grand Slam Donation Milestone.” He regularly drives more than 170 miles round trip from his home in Tennessee to donate platelets with the Red Cross in Jonesboro, Arkansas. “It’s the easiest 170 miles I ever drive, because it’s all about saving lives,” he says. In all, Brennan has made more than 400 donations of platelets and plasma, enabling lifesaving therapies for patients across the country. His consistency and dedication as a platelet and plasma donor is exceeded only by his record streak of running nearly 1,400 consecutive days without missing a day. Whether it is dedication to fitness or to saving lives, Brennan is considered by everyone who knows him to be a humanitarian who inspires others through his generosity and commitment to helping others. Wendell Clark Community Blood Center Dayton, Ohio Wendell Clark was Community Blood Center’s top all-time blood donor, having made 608 donations, when he learned he had prostate cancer. The cancer was treatable with surgery, and it meant Clark had to wait at least two years before being allowed to donate again. “His first thought when he learned he had cancer wasn’t about himself,” says Mark Pompilio, who works for Community Blood Center. “It was, ‘I can’t donate.’” Clark beat the cancer. And nearly two years to the minute after his surgery he was back at the Community Blood Center in Dayton, Ohio, making his regular donation of platelets and plasma. His dedication has made him a local media celebrity, which allows him to get out the message of the importance of blood donation. “This is Day One,” Clark said of his amazing comeback. Today, he continues to be Community Blood Center’s top donor and is confident he can resume his schedule of more than 30 donations a year. Ann Farmer Carter BloodCare Bedford, Texas Ann Farmer is well aware of the vital role blood donation plays in health care. Her father was a surgeon and her brother and son are surgeons today. But it was her husband’s death in 2015 that motivated her to lead a very successful blood and organ donation drive, across seven locations simultaneously. Dubbed the “Big Give,” this single drive collected 167 units of blood. Farmer recently retired as community resource coordinator for Tarrant County, Texas, and the Big Give has become an annual event. It provides a lasting legacy to Farmer, who worked for years with Carter BloodCare to coordinate quarterly blood drives across multiple county locations, from a county court building to a car-repair barn. At drives like these, Tarrant County employees have donated more than 3,000 units of blood to date. “Ann also coordinated the county United Way campaign, worked with the local food bank and other community activities,” says Colleen Horan, field recruitment consultant for Carter BloodCare. “But the blood center was nearest and dearest to her heart. She really understands the importance of a safe blood supply.” Ina Hubbard Heidemann LifeServe Blood Center Des Moines, Iowa Ina Hubbard-Heidemann is a sixth-grade teacher and grandmother who sets an example for her students and family by how she lives and serves in her community. Hubbard-Heidemann began donating blood in the 1960s and continues to this day. She has been a blood center volunteer at LifeServe Blood Center in Des Moines, Iowa, since 2011. Last year, she volunteered nearly 200 hours, delivering supplies and picking up blood from two area donor centers each week and returning them to the main location for processing and testing. She often brings along one of her grandchildren to help load the vehicle and to keep her company on the trips. In the classroom, Hubbard-Heidemann teaches about blood types as part of her science and math curriculum. Last year, she won a grant to take her class on a service trip and tour of LifeServe Blood Center. Hubbard-Heidemann says it’s important to start teaching students early on about the importance of giving back and respecting our resources. Ed Hunt BloodSource – Granite Bay Granite Bay, California Ed Hunt donates blood regularly and also volunteers at his community BloodSource blood center. For the last 11 years, he has also assisted on mobile blood drives and signed up donors for the national bone marrow registry. He has donated whole blood and source plasma more than 200 times. Currently serving with Southern Baptist Disaster Relief, an organization that coordinates with American Red Cross Disaster Services, Ed has volunteered to help victims of six major disasters, including Hurricanes Sandy and Isaac, and is always on call to provide disaster relief. He has traveled to Central America on behalf of Living Water International to bring clean water to communities where such resources are scarce and looks forward to future international trips to help others. “Whatever your passion, interest or capabilities,” Hunt says. “There’s a service organization that can use your help as a volunteer.” Tammie Klein Carter BloodCare Bedford, Texas Tammie Klein wants every citizen of Alvord, Texas – population 1,334 – to donate blood, and she’s well on her way to achieving her goal. As blood drive coordinator for Alvord Elementary School, she was in a perfect position to start with Alvord’s youngest generation. In conjunction with Carter BloodCare, Klein started the Junior Leaders program at her school. The program teaches students who are too young to donate blood themselves the importance of blood donation and its impact on the community. They learn how to organize a blood drive, manage an education and awareness campaign, and encourage their parents, teachers and neighbors to donate blood. In just two years, the Junior Leaders Blood Drive at Alvord Elementary School grew from collecting 100 units to collecting 168 units. Its success led surrounding schools to get on board, resulting in collecting nearly 1,000 units during the 2015/16 school year. Klein also donates her time at the blood drives – from babysitting children so parents can donate to recruiting support from local businesses. Hanna Malak The Oakland Blood Center Oakland, California As a child, Hanna Malak’s younger brother was diagnosed with leukemia. A cancer of the blood-forming tissues, leukemia weakens the body’s ability to fight infection. Thankfully, Hanna’s brother beat his fight against cancer, but that experience spurred Malak to dedicate himself to the treatment and prevention of childhood cancers. Transfusions of whole blood, platelets and other blood components, along with bone marrow and stem cell transplants, are important in the treatment of leukemia patients. Malak began donating blood as soon as he was able, in 2010, starting with whole blood and switching to platelets in 2012. He has since donated platelets about 80 times. Malak recruits others to donate blood and blood components and volunteers at Camp Okizu, which supports families of children with childhood cancers. His dedication has been described as “off the charts” and he has been an inspiration to others to give the gift of life. Patrick McDonald Gulf Coast Regional Blood Center Houston, Texas Patrick McDonald began donating in 1974. He recently made his 831st donation, passing the 100-gallon mark. Between donations, McDonald also volunteers at Gulf Coast Regional Blood Center’s Pasadena, Texas location. He helps host quarterly blood drives that yield more life-saving blood components. “He recognizes the magnitude that donating blood has on lives throughout the world,” says Brian Gannon, CEO. “Helping people is part of Patrick’s DNA.” Even when he’s not donating or helping with a blood drive, McDonald shows up to help blood center staff restock supplies and other tasks so they can provide care to donors. McDonald says donating blood and encouraging others to do so is one way he tries to “leave my mark on the world.” Given all the lives he’s helped save, it’s fair to say he has done so already. Dick “Paco” Newman Barnes-Jewish Hospital Pheresis Center St. Louis, Missouri Dick Newman, better known as “Paco” by all who know and love him, has been donating platelets at Barnes-Jewish Hospital in St. Louis for more than 15 years. He has donated platelets more than 280 times, and recruits others to join him. Despite working full time at a school, he makes time to drive the two hours to donate platelets because he knows platelets save lives. At the hospital, Newman regularly regales staff and donors with stories about his work and life of service. “At his school, they celebrate Paco Day on his birthday because the kids love him so much,” says nurse Mary King. “They all wear bib overalls and a red bandana, which is his signature outfit.” In addition to donating blood, Newman rescues dogs and plays Santa Claus each year on Christmas Day for lower-income families. “Heart of Gold” is how those who know Newman describe him. He is more than a dedicated platelet donor. He is dedicated to saving lives. Garland L. Slayton American Red Cross Carolinas Region Some people make the world a better place simply with their presence. Garland L. Slayton is one of them, according to the staff at American Red Cross Blood Services in Durham, NC, where Slayton has donated blood for “longer than I can remember.” Slayton, who is 88, is now a regular platelet donor. But it’s not just his donations that make him so loved by his blood center staff. “It’s Garland’s incredible attitude,” says Mary Spradlin, Apheresis Team Supervisor. “No one can recall a time when he was ever in a bad mood.” Slayton drives an hour each way from his home in Danville, Virginia, to donate. He always has a smile and hug for staff when he arrives. And he often brings gifts like hot biscuits, flowers and candy. Throw in his sense of humor, caring attitude and positive outlook on life and there isn’t a person Garland meets who doesn’t want to be just like him when they “grow up.” Bill Williams American Red Cross Omaha, Nebraska William “Bill” Williams has donated more than 1,000 units of platelets. Between donations he volunteers his time to the Honor Flight Network, which honors American veterans, especially those who served in World War II. Williams donates platelets because of the lives he knows he’s helping to save, whether they are cancer patients, burn victims or bone-marrow transplant recipients. Through the Honor Flight Network, Williams helps coordinate charter flights for veterans to Washington D.C. to visit and reflect at their memorials. The organization gives first priority to World War II veterans given their age and difficulty in making the trip themselves. Since organizing its first flight in May 2005, the Honor Flight Network has brought more than 100,000 veterans from almost all 50 states to see their memorials. Veterans, perhaps more than others, understand the meaning of sacrifice and the vital importance of blood donation. Williams, in his commitment to service, is helping honor and support veterans and patients, making their lives – and those of their families – better at the same time. 2015 Inductees G. Ronald Clements NIH Blood Bank Bethseda, Maryland G. Ron Clements lives his life in service to others. After retiring in 1984 with 24 years as a police officer, Ron went on to provide 21 years of combined military service in the District of Columbia Air National Guard and Maryland Army National Guard. He also served as a volunteer firefighter. During this time he also found time to amass hundreds of blood and platelet donations at the National Institutes of Health (NIH) Blood Bank. Mr. Clements is an avid wood sculptor and creates wooden toys to entertain young patients at the The Children’s Inn at NIH, which provides a residential “Place Like Home’’ for families with children participating in leading-edge research studies at the NIH in Bethesda, Maryland. Robert L. Cline American Red Cross Miami, Oklahoma Robert Cline is dedicated to helping the people of Miami, Oklahoma. He is a regular blood donor and has donated countless volunteer service hours to the American Red Cross, Salvation Army and the First United Methodist Church. Robert is also a member of the American Legion Honor Guard, which is dedicated to honoring fallen veterans at their funeral services. In addition to all of these activities, Mr. Cline also finds the time to remain an avid bee keeper – and he volunteers to help other bee keepers in the area keep their hives active. Dick Coffee American Red Cross Josephson Donor Center Mobile, Alabama Dick Coffee has been a dedicated blood donor for more than 25 years. He also volunteers at the American Red Cross disaster relief office and has a reputation for going above and beyond when helping people in need. Mr. Coffee is affectionately referred to as “Mr. Red Cross” in his community. At 80, Mr. Coffee lights up the room for the staff and other donors when he walks in to the blood center. He always has a smile and is always happy to help. Brooke Hall Rex Blood Services Raleigh, North Carolina Brooke Hall is driven to help others. She is a platelet donor, a member of the national Bone Marrow Registry and has shaved her head to raise money for childhood cancer research. Brooke brightens the days of those around her through her positive outlook, her smile and by sharing inspirational quotes from Dr. Seuss. After her graduation from UNC-Chapel Hill, Brooke will pursue a career in nursing. One of her favorite Dr. Seuss quotes is “Today I shall behave as if this is the day I will be remembered.” Daniel Long Carter BloodCare Bedford, Texas Daniel Long is dedicated to helping his community. He is active with numerous Rotary Clubs in the Dallas-Fort Worth area and has helped champion many successful blood drives. He is also active in his support of the Battle of the Badges - blood drives where police and fire departments compete to see which can encourage the most people to give blood. Daniel also can be found volunteering at local college blood drives. Daniel works hard to share the message of the need for blood donors. In doing so, he exemplifies the Rotary International motto of \"Service above self.” Paul G Miller Jr. Children’s Hospital Colorado Blood Donor Center Paul Miller is a platelet donor who strives to achieve 24 donations each year. Paul is also an incredible advocate for blood donation in the community. He speaks about the importance of blood donation at local businesses and community events, and promotes blood donation through the use of social media. Paul is an advocate for the fight to cure childhood cancer and works with groups such as the St. Baldrick’s Foundation to promote childhood cancer awareness. He is a giving man, both with his time and efforts to serve his community. James Querry Community Blood Bank of Northwest Pennsylvania & Western New York James Querry is a leader for college blood drives at Mansfield university. He has planned and executed numerous drives, and is always the first to show up the morning of a drive and one of the last to leave. He recruits new donors, helps with refreshments, holds the hand of first time donors, promotes drives via social media, and donates blood himself. Because of his leadership, Community Blood Bank has instituted a Best Practice program and shares examples of his dedication at colleges and universities throughout Northwest Pennsylvania and Western New York. Kayla Ripplinger American Red Cross Portland Platelet Donation Center Kayla Ripplinger has lost loved ones to cancer and tragic accidents. As a result, she was determined to find ways to help others in need and make a difference. Kayla became a blood donor and advocate for blood donation. She coordinated blood drives at her work. When she learned she has a high platelet count, she focused on donating platelets and inspiring others to do so as well. Kayla recruited her friends and created a club called Priceless Platelets that makes regular trips to donate in groups. She wants to reach as many people as possible with the message on the constant need for platelets. For patients in need, Kayla's efforts are a priceless gift. Larry Smith Community Blood Center Dayton, Ohio Larry Smith has been blind from birth and he spent his early childhood in an orphanage fighting illness. He struggled with his grades at the school for the blind until he met the “Angel” of his life, a house mother named Indus Disbennett. Disbennett helped Larry improve his health and inspired him to dedicate his life to helping others. Larry is a regular blood donor. Even a snowstorm could not keep him from his annual tradition of donating the day after Christmas. Walter Swenson United Blood Services Rapid City, South Dakota Walt Swenson began driving for United Blood Services in 1988. Since then he has made more than 6,500 trips and spent nearly 25,000 hours behind the wheel delivering lifesaving blood products to hospitals, throughout Wyoming, South Dakota and Nebraska. Soon Mr. Swenson will achieve the milestone of driving one million miles to help patients in need. Ralph Vaughan ARUP Blood Services Sandy, Utah Ralph Vaughan began donating blood after his daughter Lara was diagnosed with Stage IIIB Hodgkin’s Disease. That was more than 40 years ago. Today, Lara is a teacher, artist and author - and Mr. Vaughan is dedicated to donating blood. He recently donated his 1,000th unit on apheresis. Ralph is married to his high school sweetheart and they have five grown daughters and five grandchildren. Lauren Zurick Community Blood Bank of Northwest Pennsylvania & Western New York Lauren Zurick started donating blood when she was in high school, but never fully understood the impact it could have for people in need. Days after her son Austin was born, she felt something was wrong and took him to the emergency room. Austin was diagnosed with liver failure and was given blood transfusions immediately. After spending the first two months of his life fighting to survive, Austin is now a healthy 3-year old. Mrs. Zurick is grateful that blood was available when her son needed it. She continues to donate regularly and also shares her story via media interviews, radio ads and speaking opportunities so others will understand the impact they can have by donating lifesaving blood. 2014 Inductees Dan Davis Barnes-Jewish Hospital Pheresis Center Saint Louis, Missouri Dan Davis is best described as a cheerful individual with a big heart. Davis has been a dedicated platelet donor for 25 years, in which time he has donated more than 600 times. He also donates granulocytes at a moment’s notice when there is a patient need. Dan works full time, but always makes time to donate platelets. Davis has also recruited his children and has turned platelet donation into a family affair. We all count on people like Dan Davis, who are committed to saving lives. Michael Desjardins The American Red Cross Portland Blood Donor Center Michael Desjardins was introduced to the need for blood and bone marrow donors when his daughter was battling aplastic anemia. Desjardins became a faithful platelet donor and started organizing bone marrow drives across the state of Maine. Today, his daughter is doing well and Desjardins remains grateful to the donors that helped save her life. To continue to help others in need, the Desjardins family and local Elks club hold a 5K race and walk every year to raise money for the Maine Children’s Cancer Program. The race is held in conjunction with a blood drive that same weekend. Michael Desjardins is an advocate for these causes and his work continues to help patients and their families. Dan Dye American Red Cross Carolinas Region Dan Dye is dedicated to using his talents to help improve the lives of those around him. Dan is involved in every aspect of blood donation in his community. He is an active member of the Durham Platelet Recruitment Committee that develops new donor recruitment strategies, he sponsors blood drives at his local church, he volunteers his time at additional local drives, and he is a dedicated platelet donor. Dan is also a gifted artist who creates paintings, jewelry and woodworks. Some of his artwork is on display at the platelet donation center for his community to enjoy. Dan Dye certainly has mastered the art of giving. BM2 (SW) Rio Flores Training Support Center Great Lakes Blood Donor Site Coordinator for the Armed Services Blood Program Navy Petty Officer 2nd Class Rio Flores, Navy Military Training Instructor (NMTI) assigned to Student Indoctrination Division onboard Training Service Center, Great Lakes, Illinois, joined the Navy in 2004 and has served on several surface ships and at many commands. For the past year, she has excelled as a site coordinator for the Armed Services Blood Program. The number of donors rolling up their sleeves at Training Support Center Student Indoctrination blood drives is a testament to her hard work. Petty Officer Flores is dedicated to going above and beyond, ensuring blood products are readily available to the Navy fleet. Flores’ motto is, “Do what needs to be done, and do it better than (anyone). Mike Gorton BloodSource Mike Gorton is a frequent plasma donor and volunteer at his blood center. He volunteers at many of the large mobile drives and encourages others to get involved through donating and volunteering. He helped produce a video that encourages younger donors to consider apheresis donations. Gorton not only saves lives through his work at the blood center, he is also a firefighter who has been named the CAL Firefighter of the Year. Mike is dedicated to saving lives in his work and through his volunteerism. Martha Herbert and Sandy Middleton American Red Cross Florence, South Carolina Martha Herbert and Sandy Middleton met while donating platelets at the American Red Cross in Florence, South Carolina. These two friends now meet every other Wednesday to donate, chat and give the gift of life to people in need. Herbert and Middleton are among the most frequent platelet donors in their community, each having donated platelets more than 300 times. They give new meaning to being friends for life. Rick Herndon American Red Cross Tri-Cities Donor Center Rick Herndon received a call late one Saturday night. It was from the blood bank where he is a regular platelet donor. A newborn at the hospital needed a platelet transfusion and Rick was an HLA-match. Rick scrapped his Father’s Day plans and donated a double-unit of platelets that helped save the infant’s life. Rick explained why this was so important to him. “My wife and I had a premature baby in 1987. He spent his whole life, which was just 11 months, in a hospital. When I heard there was a baby needing my platelets on Father’s Day... It was just so joyful to think the family may now have a healthy child. This was a real moment for me.” It was a moment for us all. April Meyers Hoxworth Blood Center April Meyers serves as a spokesperson for the Greater Cincinnati Down Syndrome Association, volunteers her time at Hoxworth Blood Center, is a dedicated blood donor and actively promotes blood donation through social media channels. Meyers wants everyone to know that having Down Syndrome doesn’t limit her from being a lifesaver and she challenges others to take up the cause. Meyers can often be found at her neighborhood donation center greeting donors and serving fresh baked chocolate chip cookies. She is an inspiration to us all. James G. Morgan Hoxworth Blood Center Jim Morgan was raised on a farm in Kentucky with eight siblings. His parents were hard workers and instilled the same ethics in their children. Morgan made his living as a truck driver and after retirement wanted to give back to his community. Because he’s been a long time dedicated blood donor, he decided to volunteer as a driver picking up and delivering blood products for Hoxworth Blood Center. For the last 11 years, Morgan has driven more than 450 miles every week picking up blood from donor centers and delivering blood to area hospitals. When Jim learned there was an Amish community hat wanted to donate, but had no way of getting to the donation facility, he began a shuttle service for Amish donors. Nancy Umstead Cape Fear Valley Blood Donor Center Cape Fear Valley Health Nancy Umstead’s first blood donation was inspired by the fact that it allowed her to receive two days off from physical training at her Air Force base. After that, she continued to donate every eight weeks, realizing it was a way of doing something good for people in need. At the time, Umstead didn’t know her act of kindness would hit close to home. Years later, her husband, Chuck, was diagnosed with aplastic anemia. Umstead then began to donate platelets. Chuck is now in remission, but that has not stopped Nancy from continuing to be a dedicated platelet donor. She is thankful that platelets were available when her husband needed them and donating is her way of paying it forward. Al Whitney Platelets Across America Aultman Blood Center Al Whitney began donating blood and organizing blood drives in 1965. His blood drives continued for decades, collecting thousands of units. In 2007, Whitney began “Platelets Across America,” a campaign, to raise awareness of the need for blood donations in the United States. Whitney’s goal: donate platelets in all 50 states. Along the way, he does media interviews to further raise awareness. He achieved his goal and has now set off to repeat his amazing journey. Michael Zapata Jr. American Red Cross Carolinas Region Michael Zapata Jr. is very passionate about his mission to help save lives and he doesn’t allow anything to deter him. Mr. Zapata’s journey to his donation center involves eight bus transfers. He is a dedicated donor who donates platelets the maximum number of times allowed per year and has been doing so for decades. When he arrives at the donation center, it is with a big smile and treats for the staff. When anyone comments on his tremendous commitment, he says he is happy to do it. “It’s never more than one hour (that) I wait at the bus stop, and I am well prepared. I have my walker, umbrella, hat, sunscreen, water and snacks.” You also have a big heart Mr. Zapata, and it’s made of gold. 2013 Inductees"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "text": "Contact | Reach Us Today — Astro Security Monitoring 0 Skip to Content Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu About Services Videos Contact PAY INVOICE Get in Touch Looking to schedule a service call or an estimate, call or email Troy at: (916) 252-9121 tstuder@astrosecuritymonitoring.com or fill out the form below. Name * First Name Last Name Phone * (###) ### #### Email * Message * Thank you! Astro Security Monitoring 4799 24th Street Sacramento , CA 95822 Sales & Service (916) 252-9121 tstuder@astrosecuritymonitoring.com To Cancel an Alarm Activation Call: (888) 610-4366 The monitoring center is available 24 hrs a day 365 days a year! Make sure you have your account # ready. ACO License 5779 & Contractors License C7 804676"
    }
  ]
}