{
  "fuentes": [
    {
      "url": "https://uncorkcapital.com/about/",
      "email": "favicon@2x.png"
    },
    {
      "url": "https://uncorkedtouringcompany.com/uncorked-wine-tasting-tours-boozy-field-trips/about-the-uncorked-team/",
      "email": "info@uncorkedtouringcompany.com"
    },
    {
      "url": "https://www.uncorkedkitchen.com/blog/what-is-uncorked-kitchen-wine-bar",
      "email": "info@uncorkedkitchen.com"
    },
    {
      "url": "https://www.uncorkedeustis.com/contact-us",
      "email": "winecellarsmtdora@comcast.com"
    },
    {
      "url": "https://www.uncorkedeustis.com/contact-us",
      "email": "winecellarsmtdora@comcast.net"
    },
    {
      "url": "https://www.uncorkedadventures.org/about-us/",
      "email": "uncorkedadventures@outlook.com"
    },
    {
      "url": "https://uncorkcapital.com/team/jeff-clavier/",
      "email": "favicon@2x.png"
    },
    {
      "url": "https://uncorkcapital.com/team/jeff-clavier/",
      "email": "team_hero_jeff@2x.jpg"
    },
    {
      "url": "https://www.uncorkednola.com/who-we-are/",
      "email": "jessica@uncorkednola.com"
    },
    {
      "url": "https://www.linkedin.com/company/uncorkedandcultured",
      "email": "info@brenaeroyal.com"
    },
    {
      "url": "https://www.enrollwaresolutions.com/contact-us",
      "email": "info@enrollware.com"
    },
    {
      "url": "https://uncorkcapital.com/team/",
      "email": "favicon@2x.png"
    },
    {
      "url": "https://leadiq.com/c/uncorked-ventures/5a1dbc382300005b00ba39d0/email-format",
      "email": "john@uncorkedventures.com"
    },
    {
      "url": "https://leadiq.com/c/uncorked-ventures/5a1dbc382300005b00ba39d0/email-format",
      "email": "name@company.com"
    },
    {
      "url": "https://leadiq.com/c/uncorked-ventures/5a1dbc382300005b00ba39d0/email-format",
      "email": "sales@leadiq.com"
    },
    {
      "url": "https://www.uncorkedeustis.com/events",
      "email": "winecellarsmtdora@comcast.net"
    }
  ],
  "mails": [
    "favicon@2x.png",
    "info@brenaeroyal.com",
    "info@enrollware.com",
    "info@uncorkedkitchen.com",
    "info@uncorkedtouringcompany.com",
    "jessica@uncorkednola.com",
    "john@uncorkedventures.com",
    "name@company.com",
    "sales@leadiq.com",
    "team_hero_jeff@2x.jpg",
    "uncorkedadventures@outlook.com",
    "winecellarsmtdora@comcast.com",
    "winecellarsmtdora@comcast.net"
  ],
  "nombre_sitio": "uncorkedeustis.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://uncorkcapital.com/about/",
      "text": "About - Uncork Capital Companies Team About News Thoughts Jobs F T M © 2025 Uncork Capital For builders and dreamers, there are no well-worn paths. But there is a guide who’s got your back. For builders and dreamers, there are no well-worn paths. But there is a guide who’s got your back. How We Invest Uncork is a seed-stage venture capital firm with over $1.2 billion under management. In May 2025, we announced two new funds: a $225M seed fund (Uncork VIII) and a $75M opportunity fund earmarked for larger investments in mature, existing portfolio companies (Uncork Plus IV). Integrity Comes First: We value honesty, transparency, consistency, and forthrightness above all else. While we look for the right Team, large TAM (Total Addressable Market), and market Tailwinds, we recognize that early-stage companies often pivot. That’s why we prioritize founder–market fit above everything else. When we believe in a founder’s vision, we move quickly — with deep conviction and a full commitment to support them through every stage of their journey. We don’t aim to be the leader, but we take pride in being the leader’s most trusted guide. We’re often the first major check on the cap table and frequently lead rounds. We invest at fair valuations, on fair terms, with complete transparency — when your term sheets are clean, there’s nothing to hide. Our average initial investment is $2.5 million, targeting an initial ownership position between 12% and 15%. When we commit, we go beyond capital — we open doors, leveraging our network to help fill out your round with high-quality, aligned investors who add more than just money. Founders choose Uncork because of how we show up: with steady guidance, hard-won perspective, and meaningful support that moves the needle. We stay close during the early years — the most critical, intense, and defining period in a company’s life. As new investors join and boards evolve, we make space when it’s time, but we never disappear. When others lose their conviction or composure, we remain steady and engaged. Just ask our founders. Our commitment is for the long haul. We offer perspective and support whenever it’s needed — even when the advice is tough to hear. The trust we build endures. Many of the most successful founders we’ve backed have chosen to partner with us again — for their next venture, and the one after that. What We Invest In We have a rich history of backing new ideas across the tech landscape, long before they become obvious. From tools that help CTOs and developers sleep at night to virtual prayer communities and AI-generated content detection — heck, we even invest in satellites and lab-grown diamonds. B2B Applications & Services We invest in the platforms and services that power modern business — built to intelligently optimize, automate, and accelerate growth. Human Interest provides affordable, full-service retirement plans tailored to businesses of all sizes. GPTZero an AI detector for checking whether a document was written by a large language model such as ChatGPT. Carrot Fertility is a global healthcare platform helping millions worldwide with ongoing fertility and family support. Wrapbook is the next standard in payroll and production accounting for the entertainment industry. Front an AI-powered customer operations platform that enables teams to streamline communication and provide exceptional service at scale. DevTools, Infra & Security The rise of modern infrastructure and developer tools has redefined what’s possible, making it faster, cheaper, and more efficient to create software from the ground up. Today, companies of every size and stage can harness the power of AI to build, deploy, and operate with the sophistication once reserved for the world’s leading tech organizations. We invest in the platforms and services driving this shift — the ones turning complexity into leverage and giving ambitious teams the tools to scale with confidence. LaunchDarkly helps software teams build better software, faster. SendGrid is an email delivery platform that processes more than 134 billion emails each month for more than 58 thousand customers. Tailscale is building the new internet: trusted, human-scale networks that just, well, work. Coder is the open-source platform that brings human developers and AI coding agents together in context-rich environments on your own enterprise infrastructure. Consumer Services & Marketplaces Consumer and business marketplace platforms that turn attention into community and community into durable, scalable business. With strong network effects and clear paths to scale, they’re built to grow fast, create lasting value, and be tough to displace. ClassDojo fosters stronger connections and better communication between teachers, parents, and students, both in and out of the classroom. Poshmark’s fashion buyers-sellers create a virtuous cycle where users sell, feel the love, and buy again and again. Hallow is the leading Catholic meditation, prayer & sleep app, helping millions globally feel closer to their religion. Frontier Tech Cutting-edge technology that challenges your assumptions and changes the way you look at the world. We continue to push the boundaries, investing in high-alpha opportunities in areas like space, robotics, silicon, quantum, and hardware that tackle large markets with fresh, unconventional approaches. Loft Orbital is a space infrastructure company that provides a simple, fast, and reliable way to deploy missions to low Earth orbit. Fitbit pioneered wearables by giving consumers actionable insights to manage their health. Focal Systems takes the power of deep learning computer vision and applies it to brick-and-mortar retail to automate and optimize stores. Lumina is building all-electric autonomous construction vehicles, starting with a bulldozer ($80B to $120B are spent on excavation in the US annually) Presso is an AI-robotics company revolutionizing garment care with its on-demand, low-carbon, express garment care machines. Are you building something futuristic that doesn’t neatly fit in a bucket? We should talk. /04 /04 How We Work Yes, cash matters. But founders don’t choose Uncork just for the check. They choose us because of how we show up: steady, honest, and fully in it. We bring real perspective, hard-won through years of building, backing, and navigating the unknown. We know how much the early days matter. We help where it counts. This is how we work. Direct. Committed. Founder-first. Always. No Playbook. No Bullshit. Just Partnership Every startup is different. We won’t hand you a formula. Instead, we collaborate one-on-one to help you build the version of your company only you can build. We offer tailored support, adapt alongside you, and connect you with trusted experts from our network. We say what we mean: our feedback is honest, direct, and always in service of your long-term success. A Team of Venture Ecosystem Insiders We help you raise the right money, from the right people, at the right time. Our team stays tapped into what matters at other VC firms—people, pace, and priorities—so you can frame your story and raise your next round with confidence. When It Hits the Fan Things will go sideways. Something breaks. A PR meltdown. Co-founders clash. A container gets held in customs. We've seen it all. When it gets messy, we don’t flinch. We lean in. You can count on us to listen, strategize, and stay with you through the hard parts. Talent: The Real Edge A strong early team accelerates everything. We help you build it. We advise on hires, coach you through executive decisions, and help you shape a culture that scales. We bring pattern recognition, and we show up in the details. Platform & Community At Uncork Capital, we believe founders are the driving force behind innovation, and one of our core missions is to help them bring their visionary ideas to life. Through carefully curated events — from intimate dinners and curated conversations to large-scale summits — we foster meaningful connections and encourage the exchange of ideas. Our expanding library of founder-focused playbooks provides actionable insights and proven strategies to address key challenges at every stage of company building. We pride ourselves on supporting entrepreneurs through every milestone, from funding announcements and contract negotiations to hiring decisions and beyond. Every member of our team serves as a dedicated resource for Uncork founders, and we actively tap into the broader Uncork Community — a network of founders, investors, advisors, and top-tier service providers — to deliver comprehensive, hands-on support to our portfolio companies. The Uncork platform has been developed over the years thanks to our strategic partnership with Goodwin & Silicon Valley Bank Reaching Out Most founders find us through our network: other founders, co-investors, operators, and accelerators. Can’t find a warm intro? No problem. Send your pitch to: pitches@uncorkcapital.com. If it’s a fit, we’ll be in touch. Our History Uncork Capital has been backing bold founders at the seed-stage since before seed was a category. We started in 2004, raised one of the first institutional seed funds in 2007, and have since invested in 275+ companies — with 100+ outcomes that have collectively generated $59B of enterprise value and, yes, a few total wipeouts (because that’s part of the journey). Our companies have raised more than $8B in follow-on capital from the world’s best venture capital firms. Today, we’re in the final stages of investing out of our $200M seed fund (Uncork VII) and a $200M opportunity fund (Plus III) for breakout winners.  And on May 1st, 2025, we announced the raise of a $225M seed fund (Uncork VIII) and a $75M opportunity fund (Plus IV) that we will deploy over the next three years. Read our announcement here. Want to get to know our our team better?"
    },
    {
      "url": "https://uncorkedtouringcompany.com/uncorked-wine-tasting-tours-boozy-field-trips/about-the-uncorked-team/",
      "text": "About Us - UNCORKED Touring Company Skip to the content (336) 986-3969 Contact Us Home About Us In the Press Explore Lexington Where To Stay Book Your Tour Boozy Tours Brew Tour Boozy Field Trip Tour Wine Tasting Tour for Two Custom Wine Tours Lilac Wine Tour Orchid Wine Tour Violet Wine Tour Wine Tours with Brunch Davidson County Wine Tour Surry County Wine Tour Childress Signature Tasting in The Barrel Cave Shelton Vineyards Grand Tasting Tour Need A Ride? Transportation Service UNCORKED Gallery Cart My Account Contact Us Home About Us In the Press Explore Lexington Where To Stay Book Your Tour Boozy Tours Brew Tour Boozy Field Trip Tour Wine Tasting Tour for Two Custom Wine Tours Lilac Wine Tour Orchid Wine Tour Violet Wine Tour Wine Tours with Brunch Davidson County Wine Tour Surry County Wine Tour Childress Signature Tasting in The Barrel Cave Shelton Vineyards Grand Tasting Tour Need A Ride? Transportation Service UNCORKED Gallery Cart My Account Contact Us Home » About Us Meet the UNCORKED Team Aaron Paul Owner/Shuttle Bus Ambassador Hello, I’m Aaron. I’m excited to become a member of the Davidson County community.  We have recently decided to move from the hustle and bustle of Austin, Texas to Lexington, NC.  I developed a passion for wine by frequently visiting the Hill Country area of Texas, the fifth ranked area for wine making.  I’m a big red wine lover and enjoy sharing what I have learned with others. I am former US Army and served in Iraq. My background is in logistics and finance with a passion for teaching. I’m looking forward to both learning about and assisting with the growth of the Lexington, and Davidson County business community. Cheers! Stacey McIntyre Owner/Marketing Goddess Hi, I’m Stacey. I am the co-owner of UNCORKED Touring Company. I am excited to have recently moved to North Carolina from Austin, Texas where I learned about the wine tour industry and the good fortune of having local vineyards in your backyard. My background is in marketing/ advertising as a designer so you know our buses will be “selfie-perfect.” If you see me around town with Aaron, my sister Jodi, or my two dogs, be sure to stop and say hello. I’m thrilled to be a part of the Lexington community! Jodi McIntyre Operations Manager/Driver/ CEO of Good Times Hello! I’m Jodi the manager of UNCORKED Touring Company. I will be starting my role as driver, manager, customer service in the fall of 2022. I have lived in Wilmington, North Carolina for the past five years, currently making the move from beach to wine country. I have owned and operated a successful pet care business for eighteen years and now excited to apply my service-based knowledge to UNCORKED. I am so excited to become a part of the Lexington and Davidson County community and can’t wait to bring you on a tour! Have questions or want to partner with UNCORKED? CONTACT US LET'S GET UNCORKED! UNCORKED Touring Company Contact Info (336) 986-3969 info@uncorkedtouringcompany.com Contact us to become a featured wine on our tours. The Small Print Company Policies Waiver We are fully insured. Contact us with questions. Follow Us Facebook Instagram YouTube LinkedIn Leave a Review ✕ Stay in touch and Let's get UNCORKED! * indicates required Email Address * First Name * Last Name * Company Stay in touch and Let's get UNCORKED! * indicates required Email Address * First Name * Last Name * Company Wine + Friends UNCORKED Touring Company has these available dates: Select dates and then click the \"Start a Poll\" button to use WhenAvailable to \n      find out what times work best for your group. March 7, 2025 @ 11:00 March 8, 2025 @ 11:00 March 9, 2025 @ 11:00 March 14, 2025 @ 11:00 March 15, 2025 @ 11:00 March 16, 2025 @ 11:00 March 21, 2025 @ 11:00 March 23, 2025 @ 11:00 March 28, 2025 @ 11:00 March 30, 2025 @ 11:00 April 4, 2025 @ 11:00 April 5, 2025 @ 11:00 April 6, 2025 @ 11:00 April 18, 2025 @ 11:00 April 19, 2025 @ 11:00 April 20, 2025 @ 11:00 April 25, 2025 @ 11:00 April 26, 2025 @ 11:00 April 27, 2025 @ 11:00 Start a Poll UNCORKED Touring Company looks forward to hearing back from you when you have finalized\n      the date with your group! Let’s get UNCORKED! Loading Comments... Write a Comment... Email (Required) Name (Required) Website"
    },
    {
      "url": "https://www.uncorkedkitchen.com/blog/what-is-uncorked-kitchen-wine-bar",
      "text": "What is Uncorked Kitchen & Wine Bar? An Interview with the Founders In-Person Events Wine Bar Private Events Book an event 8171 South Chester Street, Suite A, Centennial, CO (720) 907 3838 Login ☰ In-Person Events Date Nights Cooking Events Baking Classes Wine Tastings & Events Family Cooking Classes Kid/Teen Camps Kid/Teen Birthdays Gift Cards Wine Bar Wine Tastings & Events Wine Bar Menu Reservations Gift Cards Private Events About Uncorked Our Team FAQs Hours & Directions Blog & Press Vendor Partners Book An Event In-Person Events Date Nights Cooking Events Baking Classes Wine Tastings & Events Family Cooking Classes Kid/Teen Camps Kid/Teen Birthdays Gift Cards Wine Bar Wine Tastings & Events Wine Bar Menu Reservations Gift Cards Private Events About Uncorked Our Team FAQs Hours & Directions Blog & Press Vendor Partners What is Uncorked Kitchen & Wine Bar? Uncorked Kitchen & Wine Bar (Uncorked) co-owners, Katie Robbins the CEO and Eric Robbins the Executive Chef, want to share how they came up with their offering and explain how it’s different from other cooking classes & event spaces out there. In this interview you can learn more about their passion for providing a space and experience that enhance lives and communities through cooking food and wine. WHERE IT ALL STARTED Five years ago, Katie and Eric started to plan their return to Colorado from Massachusetts. Eric, a Colorado native, always knew he wanted to come back to Colorado and raise his family here. Eric was building his career as a Chef at the time, and Katie was running a My Gym Franchise with her father back in Massachusetts. When they started to explore what they would do when they moved to Colorado, Katie knew she could not open the franchise there, since it had already been established by others in Colorado. So she started to ideate on what business she could start with her husband Eric on their return. Their entrepreneurial juices started to flow and Uncorked was established two years ago in the Fall of 2015. In this interview you will hear how they came up with the concept, and what excited them about building this startup from the ground up. They have put together an amazing team of chefs and wine bar staff to ensure as soon as you walk in the door you feel welcomed, comfortable in your surroundings, and can’t wait to come again. After two years in business, they have exceeded their own expectations and continue to enhance the offering for you, their devoted clients. HOW DID YOU DECIDE THAT UNCORKED WAS THE BUSINESS YOU WANTED TO LAUNCH IN 2015? Katie: In 2012 we were sitting around our house with Eric and my dad, and talking about what we wanted to do when we got back to Colorado. We were looking to combine our expertise and create a business we would both be passionate about. Initially we thought that with my experience with My Gym, and Eric’s experience as a chef, we could create a drop-in play space with a cafe. We realized that this didn’t make sense financially. We started to brainstorm further, and the more we thought about it, we wanted to be closer to the food and event space offering. Eric had been working with Sur La Table and developing his love of cooking and interacting with people, we wanted to enhance that offering so we came up with the concept of cooking events with a wine bar people could come hang out at, even if they were not attending an event. Eric: When we started to research where in Colorado we could build our business, we saw that South Denver was underserved. We wanted to give this area a taste of downtown’s sophistication in the southern part of Denver. HOW DID YOU COME UP WITH THE NAME? Eric: We crowdsourced it! Uncorked Kitchen came from the community and helped us build our brand, once we explained what we wanted to offer. The name embodied the wine aspect of the bar as well as the energy/excitement of unleashing your culinary self in the kitchen. WHAT EXCITES YOU WHEN YOU WAKE UP AND DO THIS EVERY DAY? Katie: Working with and developing our Uncorked Kitchen team. Providing a super fun place to work, making them a second family that’s committed to our mission of providing great experiences for our community. Eric: I too, love our team. What excites me more is seeing people enjoy food and cooking. Seeing that it’s not a burden, and it’s not complicated. I love exposing people to cooking methods and seeing how they enjoy it with others, and knowing how easy it will be to recreate at home. WHAT SURPRISED YOU ABOUT THIS EXPERIENCE: BUILDING A STARTUP FROM THE GROUND UP, OR SEEING YOUR VISION COME TO LIGHT? Katie: How different and personal it is building your own business vs. owning a franchise business! It showed me how much more connected you are to the success of your offering when it’s your “baby”. And while stressful at times, how much fun I’m having with this. Eric: The support and belief others in our community have in our concept and its success. Being able to do what I love and share it with others in a space we created. I love it when our team is as excited about what we are doing as we are; and seeing the growth we have had in the last two years, knowing we are just getting started! WHAT IS YOUR FAVORITE EVENT HOSTED AT UNCORKED? Katie : Chef Showdown event. We did it as our one year anniversary event and are making it annual. It’s a fundraiser event in which all of our chef instructors compete in an iron chef-style event, and proceeds are donated to a specified charity. This year we are donating to the American Cancer Society as a tribute to family members we have lost to cancer. Eric : Tapas and Sangrias is another favorite event we make sure is always on the calendar. WHAT MAKES AN EVENT SPECIAL? Katie: Since I manage the front of house, I get to be on the front line in designing our private and corporate events. A phone call or discussion to understand our client’s needs, the goal, the style… it flexes my creativity in hosting something unique for our clients that they will not be able to achieve anywhere else. We want to make sure it reflects the client’s needs, and it’s interactive and create. Eric: My team and I are responsible for building the event program and experience in the kitchen for our public events. We want to make sure we create an environment where people let their guard down, stop thinking about the rules, and get engaged. Our chefs love sharing their tricks of the trade with our clients, which brings an excitement to the table and lets them have fun. WHAT DO YOU THINK SETS YOU APART FROM OTHER COOKING EVENT SPACES OUT THERE? WHAT TRENDS ARE YOU EXCITED ABOUT? Eric: We are not a cooking school or a restaurant. We offer cooking and wine experiences and want our clients to come in and make connections with others in our community. Whether it’s attending one of our adult kitchen or wine bar events, we want to provide a place for people to connect and have fun.  We also selected this area of Colorado to provide a place where people can hang out that is not part of chain of restaurants. This way we can guarantee the experience will be unique to them. Katie: Offering local beers and spirits in our Wine Bar allows us to support local businesses and share their amazing offering with our clients. We update our bar menu seasonally to make sure our clients have something new to try when they return. Our wine flights and tastings are also a unique offering in the area. WE LOVE SEEING THE KIDS PROGRAMS, WHICH SEEMS TO ALIGN WITH KATIE’S EXPERIENCE OFFERING PROGRAMS FOR CHILDREN. WHAT IS THE BEST PART OF THE PROGRAMS FOR KIDS, FOR YOU AS OWNERS? Katie: We’re a family driven business. The kids are so excited to get involved and show their parents what they’ve learned. They get excited about participating! Eric: The parents appreciate that we’re giving their children fundamental skills for life and an opportunity to feed their family. When we hear from the parents after their kids have been in one of our programs, they share how excited their child was to be able to serve what they made. That brings a huge smile to my face – every time I hear that a different connection is being made at the dinner table at home. YOU HAVE TWO KIDS UNDER THE AGE OF FIVE. WHAT DO YOUR KIDS THINK OF THE BUSINESS? Katie: It’s a family business. Everyone on the staff knows the kids. McKenna spent her first six months in what is now our event space, playing with her nanny. Eric: Carver calls class “Chef class”.  He refers to this as “the business” and says “My daddy is a chef.” Carver loves to help and be involved in the kitchen. WHAT DO YOU WANT TO BE REMEMBERED FOR? WHAT MARK DO YOU HOPE UNCORKED LEAVES ON THE COMMUNITY YOU ATTRACT IN? Both: We want to be remembered for making home cooking enjoyable and attainable, and for providing incredible, memorable experiences as soon as you walk through our doors. We want to be the first place people think of to host their events. We want to help kids grow their confidence in the kitchen and find new ways to connect with their friends and family. We want to build a legacy business for our kids to see this place as a second home when they want a creative outlet and to connect with their community. We want our staff to feel as though they are part of our Uncorked family and grow with us. We are excited to go from the “startup” phase of our business into the “grown up” phase and can’t wait to share what we have planned for 2018 as we grow the business. Katie and Eric lead from the heart and it shows. Their efforts to build Uncorked Kitchen and Wine Bar to where it is today, and the plans they have for the future is so excited to witness! You have to see it for yourself. The Uncorked Wine Bar – with its spectacular views of the mountains – is open Tuesday through Saturday from 3:00 – 10:00 PM MST. Happy Hour is served from 3:00 – 6:00 PM MST Tuesday through Friday. If you would like to host your own private or corporate event at Uncorked, please submit this form and a member of the Uncorked team will help you design your event. To purchase a seat in a public event, click here to check out the calendar. Categories News Recipes Interviews/FAQs Blog Recent Posts Sparkling Wine Tasting in Denver Colorado Looking for Cooking Lessons in Denver? Do You Offer Beginner Cooking Classes in Denver? Search Location 8171 South Chester Street, Suite A, Centennial, CO (720) 907 3838 info@uncorkedkitchen.com Hours Closed Monday Tuesday-Friday 3pm–10pm Saturday 12pm-10pm Sunday 12pm-6pm HAPPY HOUR Tuesday-Friday 3pm–6pm Sunday 12pm-6pm Newsletter JOIN Gift Cards Careers Event Policies Terms/Conditions Privacy Contact"
    },
    {
      "url": "https://www.uncorkedeustis.com/contact-us",
      "text": "Contact Us — Uncorked 0 Skip to Content Home Menu Events Wine Shop Contact Us Open Menu Close Menu Home Menu Events Wine Shop Contact Us Open Menu Close Menu Home Menu Events Wine Shop Contact Us Contact Us We are located in beautiful downtown Eustis, FL on Bay Street. Join us for a glass of vino and sunset views on Lake Eustis. Location 120 North Bay Street, Eustis, FL 32726 Phone 352-409-3035 Hours Monday–Thursday: 4pm–9pm Friday - Saturday: 3pm-10pm **🍽️ Special Group Lunch Hours at Uncorked 🍽️ We’re adjusting our lunch hours to better serve large groups and provide a more focused dining experience! Starting Friday April 11th, we’ll be offering a Group Lunch Special during a select time window, exclusively for groups of 10 or more. Whether it's a work gathering, family celebration, or special event, we’ve got you covered! ✨ New Group Lunch Hours on Fridays and Saturdays Only: Available for Groups of 10 or More Hours: 11:30 AM – 1:30 PM Reservation Required 🍴 Group Lunch Package: Enjoy a specially curated menu designed for large parties. Our team will prepare delicious, crowd-pleasing dishes to make your event unforgettable. 📞 Book Your Group Today! Call us at 352.409.3025 or visit winecellarsmtdora@comcast.net to reserve your spot. Please note: Regular lunch service will be unavailable outside of these hours, so be sure to gather your group and enjoy a fantastic meal at Uncorked ********************************************** Sundays: Closed Subscribe to Our Newsletter Sign up with your email address to receive news and updates on upcoming events and specials. Sign Up Menu Events Wine Shop Contact Us 352-409-3035 120 North Bay Street, Eustis, FL 32726"
    },
    {
      "url": "https://www.uncorkedadventures.org/about-us/",
      "text": "About Us – Uncorked Adventures The long ride Home About Us Press Writings Donate The long ride Menu The long ride Home About Us Press Writings Donate The long ride At UnCorked Adventures we believe there is an incredible untapped potential in everyone. OUR MISSION AND PHILOSOPHY Our mission is to help people live better with Parkinson's disease while we work together to find a cure UnCorked Adventures Founder & chairman Bill Bucklew Bill learned in 2012 that he had Parkinsons Disease, after 7 years of misdiagnosis. Immediately deciding to embrace it enabled him to engage with the community to raise awareness and research funding towards a cure and advance science by donating his body and resources to multiple clinical trials, which continue to this day. Bill has had great success in slowing the disease’s progression through regular exercise and key lifestyle changes, along the way, challenging what the worlds foremost experts deemed possible. Bill has walked across the United States and Great Britain, completed an Ironman and the longest ski ultramarathon, run all the Worlds Major Marathons in a row, climbed Mt. Kilimanjaro, Assembled a team of PWP to complete the grueling Blue Ridge Relay, completed 11 triathlons and more than 40 marathons and continues to develop and train for new challenges in 2023 and 2024. Bill has had the great honor of traveling the world, sharing his story on the incredible impact upon his life that a positivity of purpose and holistic wellness has had.  Bill lives with his wife and family in the Northern suburbs of Chicago. Meet Our Incredible Team The Team UnCorked Adventures is an all volunteer team, who are passionate to challenge the status quo, to make the world a better place, striving to discover our true capabilities in the process. Treasurer Heidi Heidi, Bill’s wife, is a founding member of UnCorked and a founding member of the first local chapter of the National Charity League and she is also a CPA.  Heidi completed her first marathon in 2022 by running New York and has run numerous other races, including the Chicago half marathon and countless 5k’s. Vice President Kristy Kristy is a founding member of UnCorked and has been active, both on the administration and participatory side.  Kristy expects to finish completing all the world major marathons in Tokyo next March, and has qualified and ran the Boston Marathon multiple times, among others.  Kristy lives with her husband and four daughters in the northern suburbs of Chicago. Director Steve Steve is a founding member of UnCorked and is extremely active, he loves to take long walks with his dog Nico, cycle and paddle board in the summer and has a passion for live music that has him bouncing around the World to see some of his favorite bands.  Steve lives with his two daughters in the northern suburbs of Chicago. Director steve Steve has an unrivaled energy and passion for life and is a great connector of people.  Steve is always willing to participate in almost anything and that includes endurance events.  He has completed the American Birkebeiner, multiple triathlons, mid-distance races and numerous 5k’s. Steve lives with his wife and two daughters in the Northern suburbs of Chicago Director Peter Peter began fundraising and exercising soon after his diagnosis in 2018. Having never run a distance over a 5K in his life, Peter committed to running the New York marathon in November of the same year, which he did successfully. Peter continues to challenge himself by running all the world majors and had an exercise streak of 700+ days in a row Director Mark Mark is a founding member of UnCorked and has Parkinson’s in his immediate family. Mark is an incredible cook, but can be caught eating extremely healthy during the week and stays fit by doing Matrix workout routines and running.  Mark has also been known to compete in triathlons and five 5k’s.  Mark lives with his wife and two daughters in the northern suburbs of Chicago. “Only those who will risk going to far, can possibly find out how far one can go” TS Elliot Copyright © 2024 UnCorked Adventures All Rights Reserved Phone: (773) 263-5026 Email: uncorkedadventures@outlook.com Pin It on Pinterest Loading Comments... Write a Comment... Email (Required) Name (Required) Website"
    },
    {
      "url": "https://uncorkcapital.com/team/jeff-clavier/",
      "text": "Uncork Capital - Jeff Clavier Companies Team About News Thoughts Jobs F T M © 2025 Uncork Capital Jeff Clavier Founding Partner Jeff began advising and investing in early stage tech startups more than 25 years ago after first working as a CTO for a fintech startup in France. He founded Uncork Capital in 2004 (then called SoftTech VC) to serve an unmet need of startup founders: active support and capital for companies in their first 18 months of life. Over the years, Jeff brought on partners with diverse backgrounds and networks; together they have invested in 280+ companies. With equal doses of humor, candor and hustle, Jeff works hard to help guide his companies through the most critical early stages. He is often the first large check, as well as the longest relationship, for the founding team. Jeff has supported multiple companies that have reached successful outcomes, including Fitbit (NYSE:FIT); Sendgrid (NYSE:SEND, Twilio); Eventbrite (NYSE:EB); Postmates (Uber); Poshmark (NASD:POSH); Mint (Intuit); Brightroll (Yahoo); LiveRamp (Acxiom); Wildfire (Google); Sapho (Citrix); Vungle (Blackrock); Docsend (Dropbox) and Poka (IFS). The founders of his most successful companies have a few things in common: a clear vision for their product or industry, an understanding of the dynamics of their market, smarts and determination. It was never easy: each of them almost failed multiple times, but pushed through adversity to make it happen. His current investments include ClassDojo, DroneDeploy, Vidyard, Front, Shippo, Carrot Fertility, and Memfault. He is a board director at Loft Orbital, Inscribe, Messari, Usergems, and a few still-stealth startups. Jeff was born, raised, and educated in France. He graduated from Université Paris Descartes with an MS in Computer Science and a degree in Distributed Computing. He was an early employee at a fintech startup called Effix, where he started as a developer and became its CTO. Reuters acquired Effix, and Jeff moved into product development and leadership roles across the company. In 2000, he immigrated to the U.S. and joined RVC, Reuters’ $450 million corporate venture capital fund, as a general partner in its Silicon Valley office FACTOIDS: Former board member of the National Venture Capital Association (2015-2019) Veteran of the Forbes Midas List, and the CB Insights Top 100 VCs Loves spending time with friends and family, whether hanging out, traveling, skiing or hiking Dedicated oenophile/grape nut with an eclectic wine collection, who most recently launched a small wine project in Walla Walla, WA Won’t call it a day until he’s logged 15,000 steps on his Fitbit — often at his walking desk or on a “walk and talk”. Has become addicted to strength training on Tonal during the pandemic Select Current Investments ClassDojo , Vidyard , DroneDeploy , Front , Shippo , Loft Orbital , Inscribe , Memfault , Carrot See All Investments Select Previous Investments Brightroll , Mint.com , LiveRamp , Fitbit , SendGrid , Eventbrite , Vungle , Postmates , Poshmark , Sapho , DocSend , Poka Tweets by jeff Whitney Bouck Board Partner & Go-to-Market Advisor Whitney “Whit” Bouck brings more than three decades of hands-on experience as a go-to-market leader, advisor, and operator. Her passion lies in helping B2B software companies scale, grow, and navigate pivotal moments with confidence and clarity. Whit has a proven track record of driving transformative outcomes for both startups and global enterprises. She’s guided companies through IPOs, acquisitions, and major milestones, including leading HelloSign as COO through its $230M acquisition by Dropbox. At Box, she built and scaled the enterprise business as General Manager and CMO, following senior leadership roles at EMC and Documentum. Along the way, she’s facilitated three IPOs, two spin-offs, 15 acquisitions, and three successful company sales. As Board Partner and Go-to-Market Advisor at Uncork Capital, Whit works closely with founders to develop the strategies and foundations needed for long-term success. She also serves on the boards of Paycor, Trengo, Mutiny, Writer, and BlueOcean, while advising numerous other high-growth startups. Whit earned her BA in Philosophy, Politics, and Economics from Claremont McKenna College. Factoids: Splits her time between San Francisco and Lake Tahoe. Enjoys skiing, hiking, and cooking. Writes her own food blog, Whit’s Kitchen . Recognized as one of the Top 40 Women in Revenue and one of the World’s 100 Most Innovative CMOs. Named a Silicon Valley Woman of Influence (2009) and Top 40 Under 40 (2003). Andy McLoughlin Managing Partner Andy advises and invests in seed-stage startups that help every business operate like the best companies in the world. The idea: productize the business software and developer tools that tech-forward behemoths typically build internally for their use; create lasting value by delivering productivity gains and cost savings across functions ranging from sales & marketing to finance & operations. He loves investing in “unsexy” ideas and deeply technical teams. A few examples: LaunchDarkly, a developer tool that helps companies control and measure feature releases and product updates; Human Interest, which makes it easy for small and medium businesses to provide their employees with retirement investment plans; and Tailscale, who are building the new internet: trusted, human-scale networks that just, well, work. Andy has also led Uncork’s investments in Crossbeam, Coder, Focal Systems, Mutiny, Fountain, Nuon, and more. As a former startup entrepreneur, Andy empathizes with the myriad challenges founders face. In 2006 he co-founded Huddle, a London-headquartered enterprise collaboration platform, which became one of Europe’s most awarded and well-known enterprise technology startups, raising more than $80 million in venture funding before its acquisition in 2017. Over the years, Andy led technology, product, marketing, and strategy, and oversaw the company’s US expansion. Prior to joining Uncork in 2015, Andy was an active angel investor. Among the 40+ startups in which he was typically each company’s first investor are business software platforms Intercom, Bugsnag, Tray.ai, and Pipedrive (acquired by Vista Equity Partners for $1.5 billion), as well as consumer products such as Calm and Postmates (acquired by Uber for $2.65 billion). Born and raised in the UK, Andy holds a BA with honors in Economics from the University of Sheffield, a global top 100 university nestled in Yorkshire’s stunning Peak District. In 2010, he moved from London to San Francisco, where he set down roots and built a family. FACTOIDS: Awarded an OBE in the 2015 Queen’s Birthday Honors list for services to the UK technology industry Co-founder of the Founders Pledge, a non-profit which helps entrepreneurs pledge part of their personal liquidity upon exit to charity Extremely proud dad to two beautiful and bubbly girls Loves to ski but too easily bored for just one mountain; find him on black diamond runs across the Lake Tahoe area. Loves hosting friends for dinner; mixes a mean cocktail — especially the classics: Manhattans; Negronis; and Gin Martinis (you know he’s British, right?) Kauffman Fellow, and a member of the most excellent Class 22 ✌🏻✌🏻 Select Current Investments LaunchDarkly , Human Interest , Crossbeam , Tailscale , Mutiny , Coder , Fountain , Focal Systems See All Investments Select Previous Investments Postmates , Dashbase Tweets by Bandrew Amy Saper Partner Amy invests in and advises seed-stage B2B startups. Her primary focus is on AI-enabled applications for engineering, product, and design teams, and the API layer that decreases the friction in the creation of these applications. She has felt the heart-pumping sense of urgency that comes with the amplified risks and possibilities of building early-stage, hyper-growth startups. As a former product marketer and product manager at companies that have fundamentally changed the way the world communicates (Twitter), travels (Uber), and conducts commerce online (Stripe), she has seen customers discover the transformative power of technology as it comes alive in their hands. And as an investor and board member, she has fielded countless late-night phone calls with founders unsure of what path to take next. Amy gravitates toward technical founders who question the limitations of the status quo and design from first principles in pursuit of building delightful experiences that will open up new worlds of possibilities for their users. She gets a thrill from working with technologies and teams that break open artificial constraints, such as solving problems within design limitations; improving communication across departmental barriers; and challenging preconceptions about the roles of people and technology in the workplace. Amy deeply understands what it takes to bring new ideas to the world. She joined pre-revenue Twitter in 2010 and worked with then-CEO Dick Costolo through Twitter’s IPO in 2014, helping scale the company from 200 to 4000 employees, and $20M – $1.5B in revenue. While there, she built products for advertisers and developers and helped the company expand overseas, relocating to Singapore to open Twitter’s APAC HQ and launch the business in 14 new markets. At Uber, Amy worked in product management on Uber for Business. She met Stripe founders John and Patrick Collison when Stripe had a few hundred employees and worked on their team for three years in a cross-functional role blending product management and product marketing for Stripe’s Connect, Billing, and Atlas products. She left to become an early stage Partner at Accel, where she led the firm’s investments in Gamma, Beam, Complete, Sprinter Health, WellTheory, and others. Amy earned an MBA from Stanford Graduate School of Business and a BS in Science, Technology and Society at Stanford University, where she was a Mayfield Fellow and President of Stanford Women in Business. Recently, she spent three years lecturing about entrepreneurship in Stanford’s Management Science and Engineering department. Factoids: – Classically-trained singer who competed across California, sang backup in a Michael Jackson music video, and opened a cappella for Ben Folds and Sara Bareilles at LA’s Hollywood Palladium – Avid traveler who visited 50 countries before she turned 30 – Lives in San Francisco with her husband and rambunctious kids – Third-generation woman in STEM: mom is a physician and grandmother was a nuclear engineer – Aims to break 10,000 steps every day: loves a walking meeting. Ask about her favorite routes in SF – Created and fosters a burgeoning community for women in product and engineering Susan Liu Partner Susan has spent a decade investing in B2B startups and is especially excited about founders using AI to reimagine legacy markets. She goes deep in her diligence–she loves spending time with potential buyers of the product to understand their workflows, pain points, and market dynamics. Before joining Uncork Capital in 2021, she was a software investor at Scale Venture Partners, where she focused on the future of work and enterprise software. Having partnered with dozens of Series A and B startups, Susan knows what it takes for seed-stage companies to reach the next milestone—and she’s not afraid to roll up her sleeves to help founders get there. At Uncork, Susan has backed companies like Numeral, which is automating sales tax for CPG and software businesses, and Ivo, an AI-powered contract review platform built for in-house legal teams. Earlier in her career at Scale VP, she sourced companies including WalkMe (acquired by SAP for $1.5B) and Wrike (acquired by Citrix for $2.25B). Susan has been named to the Forbes “30 Under 30” list and honored with a “Rising Star Award” by the NVCA. She graduated from UC Berkeley with a degree in Economics. Susan is passionate about supporting underrepresented founders and investors and acts as a mentor to young women in the industry. FACTOIDS: A Bay Area native, Susan was born in Oakland and raised in Alameda Student of the growth mindset. Always learning Susan has a young daughter and two feisty pups — a shih tzu/poodle mix and a cavapoo Loves international travel, especially learning about different cultures, trying the food, and exploring Always on the move. Enjoys a Barry’s, Rumble, or Core Power class Select Current Investments Ivo AI , Bezi , Numeral , Amperos Health See All Investments Select Previous Investments Groove Tripp Jones Partner Tripp has invested in a dozen companies that are now worth more than $1 billion each. The three things Tripp invests in are “team, team and TAM,” especially if the market is overlooked or underdeveloped. He’s also “business model focused,” which means he is equally enthusiastic about investing in B2B or consumer companies, as long as there is some form of network effect or a high likelihood of recurring revenue. Prior to joining Uncork in the summer of 2021, Tripp was a General Partner at August Capital, where he sourced and invested in dozens of early-stage startups, including BARK (NYSE: BARK), Sendbird, Hipcamp, Yumi, and Wattpad (acquired by Naver). Like many people, Tripp hates his phone, so he’s trying to invest against it — and into things that make life richer, such as BARK, which had a $1.75 billion IPO in 2021 and creates subscription boxes of goodies for well-loved pet dogs; and Hipcamp, a sort of Airbnb for the outdoors that makes it possible for private landowners to make money from their property without exploiting it, and for urban dwellers to spend more time in nature. Hipcamp’s founder and CEO, Alyssa Ravasio, “has a clear vision of the world she wants to see in 20 years; she’s just working towards it.” When looking at consumer businesses, Tripp spends a lot of time thinking about the needs of women, who control 83% of the American consumer economy in terms of buying power and influence. More specifically: “She’s not part of the coastal urban elite. She lives in underappreciated cities and towns like Boise or Cincinnati. She prioritizes her baby, family, friends, her dog, and then eventually, herself. She is the American economy.” It’s more than just shopping: it’s rethinking and improving the experiences across all consumer reaching sectors, like banking, healthcare, and insurance. Tripp has wanted to be a VC since he was eight — which sounds strange, but is one of the quirks of growing up in the San Francisco Bay Area. He earned a BA in Psychology from Princeton University. FACTOIDS: Can hold his own as an in-home short order cook and makes his wife and three young kids a hot breakfast every day His first job out of college was as a ski coach at Squaw Valley, where he helped found the Squaw Valley Big Mountain ski team Happiest while exploring Mt. Tam and the trails of Marin County with some combination of his children, dog, and mountain bike Select Current Investments GPTZero , DubClub , Final Round AI See All Investments Select Previous Investments neo.tax Sarah Du Senior Associate Sarah is an investor at Uncork Capital, where she invests in seed-stage businesses across AI applications and infrastructure. She works across sourcing, thesis development, diligence, and portfolio support, with a strong focus on backing breakout founders early. Her recent work includes investment theses on voice AI and model evaluations infrastructure, as well as founder resources on topics like writing investor updates and navigating fundraising. A highly engaged partner to founders, Sarah is known for being a proactive connector—whether it’s introducing customers, co-investors, new hires, or go-to-market partners. She’s energized by ambitious and passionate founders and is deeply embedded in accelerator and founder communities. She regularly hosts events to bring operators, builders, and early-stage investors together.Previously, Sarah spent two years at Bessemer Venture Partners. While there, she sourced and supported companies in the seed, Series A and Series B stages, including peer-to-peer home-swapping marketplace Kindred and risk management platform Chaos Labs. Earlier, Sarah was a venture fellow at Pear VC and worked at Sierra Ventures and Drop, a fintech startup. Sarah graduated with honors from Princeton University, where she studied Political Science and Computer Science. She co-founded the university’s first student-led VC fund, which backs student entrepreneurs with $1k–$10k grants. Factoids: – Bi-lingual lifelong learner, addicted to Duolingo’s gamified language lessons – Hip-hop dancer with the occasional dip into contemporary, Chinese traditional, classical Indian and swing – Podcast addict, currently listening to “No Stupid Questions,” “The Best One Yet,” and “On Being” – Grew tired of being the only girl out of 100+ kids playing hoops at camp in Beijing, so she recruited girls from neighboring schools and launched her own all-girl basketball camps – Loves building community in unexpected ways, such as partnering with two time NBA All-Star Baron Davis on an interactive fireside chat and pick-up games Adriana Roche Head of Talent Adriana is a trusted confidante, experienced thought partner and strategic advisor to Uncork portfolio company founders and leaders on a range of “people”-related issues, including recruiting, people operations and systems, and employer branding. As workplace dynamics become more complicated and startup leaders struggle to determine the right work-from-home balance, whether and how to get involved in political and societal discourse, how to attract, engage and incentivize top talent, how to continually drive innovation, and what kind of company culture to cultivate, the role of people officer is becoming more critical than ever before. Throughout her career, Adriana has helped multiple hyper-growth tech companies thoughtfully scale their teams in ways that map to their strategic objectives, while working closely with leadership to help them understand the psychology and anthropology of human interactions in the context of their business and industry. As Adriana’s career evolved, she has found that the “playbooks” of the past have proven to be obsolete; in their place, she has helped develop new ways to safely experiment and pivot when necessary to unite disparate teams behind shared beliefs and help them accomplish challenging feats. Adriana has seen firsthand many of the team-related issues startups face. She joined Uncork from Mural, a maker of visual team collaboration software, where she was Chief People Officer as the company grew from 150 employees to 900 in just two years. Prior to that, Adriana was VP, People and Places at Segment, a customer data company that grew from 50 people to 650 in four years and was acquired by Twilio in 2020. Earlier, Adriana led employer branding and managed a large recruiting team at Dropbox. She was also a recruiting manager at Salesforce and a recruiter at Google. Born and raised in Venezuela, Adriana immigrated to the U.S. when she was seventeen. She earned a Master’s degree in Organizational Psychology at New York University and a Bachelor’s degree in Psychology at College of the Holy Cross. FACTOIDS: Immigrated to Boston from Latin America with her parents when she was in her senior year of high school, spent a year in Paris, France, lived in New York City, and later built a career in tech in Silicon Valley, so you might say she’s good at adapting to new environments Fluent in French and Spanish Happiest in or near water — scuba diving, swimming, water skiing, etc., and has gone so far as to paint numerous walls in her home the color of the ocean “Any Given Sunday” in Adriana’s family means an open door, dozens of friends, and lots of food — most likely including homemade Arepas Long before pursuing a career in “people,” Adriana thought she would grow up to work with animals, so she adopted and cared for lots of pets. Among them: an English Sheep Dog, a Rottweiler, two land turtles, three canaries, ten parrots, multiple tanks full of numerous kinds of fish, a bunny, a horse, and an Anaconda named Kana Ashley Cravens Head of Operations and Platform Ashley is the operational cornerstone of Uncork Capital. As the firm’s first hire, she played a pivotal role in establishing its foundational processes and systems. Today, her contributions span every facet of the business, encompassing operations, compliance, fundraising, HR, and events—all while ensuring the firm operates at peak performance. Ashley leads Uncork’s Operations and Platform team, with a mission to help founders and their teams succeed. She builds scalable networks, resources, tools, strategic playbooks, and knowledge to drive growth across the portfolio—whether by saving companies hundreds of thousands of dollars, negotiating key contracts, or forging strategic partnerships. Ashley also curates high-impact events and professional development opportunities designed to strengthen teams, accelerate success, and foster a thriving founder community. While Ashley has a natural talent for optimizing processes and finding the most efficient paths forward, her true passion at Uncork lies in building and nurturing relationships. This shines through in the events she crafts, including networking happy hours, strategic dinners, curated founder-focused “Uncork Sessions,” the annual summer party, the Annual General Meeting (AGM), and the Uncork Capital Summit—a two-day event where portfolio founders come together to exchange ideas, share experiences, and learn from one another. Ashley is also the Co-Managing Director of Let’s Talk Ops, a community dedicated to elevating the next generation of operations leaders. Driven by her passion for mentorship and knowledge sharing, she works to create pathways for emerging operators to grow, connect, and lead, ensuring the future of the industry is stronger, more diverse, and better equipped to scale successful companies. Before joining Uncork (then SoftTech), Ashley spent more than a dozen years in the finance industry. She served as a marketing director and registered insurance and securities assistant at Rosenbaum Financial in Portland, Oregon. Prior to that, she was a licensed broker at Morgan Stanley, managing accounts for two vice presidents and serving as a client relationship manager. She began her career at Smith Barney, where she conducted mutual fund due diligence and specialized in client relations, marketing campaigns, and organizing special events for high-net-worth clients. Ashley earned her BS in Business Administration with a focus in Marketing from the University of Oregon. Factoids: Passionate traveler who loves exploring new places and experiencing different cultures Opera-trained singer who now prefers the audience to the stage Happiest when living life with her family, preferably by water Aspiring painter of portraits. Favorite medium: acrylics Expert at creating crowd-pleasing meals from a half-stocked pantry in just 20 minutes Avid reader of crime and fantasy novels Joyce Lee Head of Finance Joyce leads finance for all of Uncork Capital’s fund operations, including valuations, portfolio reviews, limited partner reporting, firm-wide budgets, strategic financial planning, and fund formation. Her professional rigor, tireless work ethic, and positive energy have been instrumental in strengthening Uncork’s financial systems as the firm continues to scale, allowing the investment team to spend more time with founders. Joyce joined Uncork Capital in 2022 after serving as Vice President of Finance at Sierra Ventures, where she spent fourteen years leading the firm’s financial reporting, accounting, limited partner communications, and regulatory compliance functions. She began her career at Ernst & Young in San Jose, where she audited clients in the technology and biotech industries. Reflecting on her venture experience, Joyce believes, “While meticulous attention to detail is essential, the real impact lies in maintaining a clear vision of the broader strategic goals.” Joyce holds a Master’s in Accounting from the University of Notre Dame’s Mendoza College of Business and a Bachelor’s in Business Economics from UCLA. Growing up in Silicon Valley after immigrating from Taiwan, she was deeply influenced by her father, an engineer whose dedication instilled in her a strong work ethic. Outside of work, Joyce is an avid sports fan and a strong believer in the power of teamwork and perseverance. She’s a dedicated supporter of the Golden State Warriors, San Francisco 49ers, and San Francisco Giants, and never misses an opportunity to watch the Olympics — drawn to the competition, drive, and resilience athletes demonstrate at the highest level. Her love of fast-paced collaboration also extends to her love of action movies, particularly those starring Tom Cruise, Matt Damon, and Liam Neeson. She is also a passionate foodie, always in search of the best Japanese cuisine in the Bay Area. Factoids: Immigrated from Taiwan to California at age six and has lived in the Bay Area ever since Raised two young sons during the pandemic, further sharpening her multitasking abilities Diehard Warriors, 49ers, and Giants fan — and proud Warriors season ticket holder Always on a quest to find the best Japanese ramen (recommendations welcome!) Obsessed with word games and aims to complete The New York Times crossword puzzle every day Believes that any great day can be made better with an action movie marathon Jessica Jimenez-Pizarro Executive Assistant & Office Manager Jess sees herself as a net that prevents and catches problems that crop up throughout the day:  a missed flight; a lost communication; a rushed meeting; a frozen screen in the middle of a high-stakes presentation. She is motivated by knowing that the people around her feel supported and valued. Her skillset, which includes flexibility, empathy, and thinking fast on her feet, helps her deliver on that promise. In her primary role as Executive Assistant, she works most closely with Amy Saper and Tripp Jones to help them accomplish more in less time. As an office manager, Jess makes sure the logistics of the office flow as smoothly as possible. She also cares about and for Uncork guests, making an effort to understand their unique needs and providing each of them an experience that enables them to feel comfortable and at ease throughout their visit. Prior to joining Uncork, Jess was Recruiting Coordinator in candidate care and recruiting at Meta, most recently for executive office hires. Earlier in her career, Jess was an inventory manager for a cosmetics retailer, where she perfected the art of customer service through ruthless prioritization. Jess is a curious person who loves technology and is evidence that you don’t need to be in a technical role to meaningfully contribute to fast-growing companies. She is enthusiastic to be working with a team of people who see companies not only for what they are, but also what they can become. Factoids: Born and raised in the Bay Area and graduated from San Francisco State University. Voracious reader of fantasy novels Fan of classic, mostly-downbeat jazz: Chet Baker, Duke Ellington, Miles Davis, Oscar Peterson Salsa aficionado goes out dancing at least once a week, especially if the music is Cuban or Peruvian Lisa (LJ) Cohen Executive Assistant Lisa Jo Cohen (aka LJ) is Air Traffic Controller and Calendar Tetris Master for Jeff, Andy, and Susan. She loves finding ways to iterate on processes in order to find the most efficient pathway or organization. If there is a bug in a system she will find it, and enjoys the challenge of QA for new tech gadgets and apps. She tries to think 5 steps ahead and be thoughtful about priority and scheduling shifts. Prior to joining Uncork, LJ was the Executive Personal Assistant to the CEO at Houzz, where she helped grow the company from 750 employees to over 1,800 and expand internationally while also overseeing the Co-Founder’s family estate. At Yahoo she supported the CDO with M&A process development and implementation from initial research of potential acquisitions to compiling deal presentations for quarterly Yahoo BOD and Comp Committee meetings. LJ began her career at a tech incubator supporting the Founder & CEO, where for 9 years she oversaw all logistics of multiple start-ups from initial engineering concept meetings and building core teams to developing the technology, funding and spinning out viable technologies. LJ graduated Cum Laude from San Jose State University with a BS in Business Administration/Accounting. FACTOIDS: Graduated college at age 16, started her own business, and then sold everything at 18 to backpack through Europe Shares the love of int’l travel with her husband, and just returned from a 10-mo adventure worldschooling their 4 kids in Egypt, Central, and South America. Named inventor on patent for Mova Motion Capture technology used in the Marvel movies (she formulated the red/green color balance for the makeup application technique) WWA ranked wakesurfer who would spend every summer day at the lake if possible! Regularly runs away to join the circus to perform/train for flying trapeze…but always comes back because it’s her family (both and home and Uncork) that grounds her Tilly McLain Operations and Community Manager Tilly is an Uncork Capital Operations and Platform team member who supports the network founders, executives, and partners. As Community Manager, Tilly’s focus is adding value for founders and their executive leaders by understanding their needs and cultivating resources that drive professional development. Tilly’s career spans 15 years of community management at investment firms and startups. She’s been a database guru, social marketer extraordinaire, and workflow & process development expert. You name it! Tilly has discovered a lot working alongside investors and entrepreneurs. She learned that it’s tough to grow your company alone and that you need people willing to help you along the way. She’s found that staying connected with other founders and giving back to the community is the best way to ensure that happens. That’s why she’s super committed to helping entrepreneurs grow their companies so they can get more done faster, which means she spends her time coming up with new ways to help you get the most out of the resources Uncork Capital has to offer. Regardless of your growth stage, you’ll find Tilly enthusiastic about supporting your goals. She loves working with founders, executives, and entrepreneurs because their passion is contagious. Tilly is the kind of person who will make you feel like anything is possible. Tilly grew up in Portland, Oregon, but has called San Francisco her home for 15 years. You can find her out and about walking her corgi around the city or online @misstillytilly on all socials. Factoids: – Low-Code automation wizard – Logged over 1,500 hours on Animal Crossing during the pandemic – Impeccable taste in pop music – Owns over 120 pairs of sunglasses – Sagittarius Sun, Scorpio Moon & Scorpio Rising See All Team Members 01 / By now you might be wondering what it’s like to Work with Uncork. By now you might be wondering what it’s like to Work with Uncork."
    },
    {
      "url": "https://www.uncorkednola.com/who-we-are/",
      "text": "Discover Curated Wines, Spirits & Brews | New Orleans | Uncorked Offerings Home What We Do Brands We Like Our Events FAQs Contact Us Home What We Do Brands We Like Our Events FAQs Contact Us Wholesale Distribution At Uncorked, we import and curate a diverse selection of fine wines, spirits, and brews, ensuring each product meets our high standards of quality and sustainability. Our Diverse Selection of Quality Wines, Spirits, and Brews At Uncorked, we pride ourselves on offering a dynamic portfolio that evolves with the seasons. Our collection features exceptional products from small to mid-sized brands and independent producers. Quality Focused We prioritize quality-driven selections to ensure every sip is a delightful experience. Sustainable Choices Our offerings include estate-grown, organic, and bio-dynamic options for the conscious consumer. Discover the Unique Themes in Our Curated Beverage Portfolio Committed to Quality and Sustainability in Every Sip Our portfolio showcases a diverse selection of beverages that emphasize quality and sustainability. Emphasizing Small to Mid-Sized, Independent Brands for Authentic Experiences We prioritize small to mid-sized brands that offer unique and authentic flavors. Quality-Focused Selections That Reflect Our Passion for Excellence Each product is carefully selected to ensure the highest quality and taste. Explore Our Latest Offerings Download our complete Summer 2025 Portfolio today! Download Brands We Like View all Events Upcoming See below for exciting events in your area! View all Festivals Wine Tastings Wine Dinners Private Event Market Visits View all Tastings Workshops Festivals Private Events Wine Tastings Thu 18 Sep 2025 Tasting at the Wine Store with Jason Broussard Sold out 5:30PM-7:30PM at 4402 Nelson Rd Building 2, Lake Charles, LA 70605 Free & Open to the public! Wine Tastings Fri 19 Sep 2025 Tasting at Lake Street Liquor with Jason Broussard Sold out 4:00PM-6:00PM at 4336 Lake St, Lake Charles, LA 70605 Free & Open to the public! Wine Tastings Wed 10 Sep 2025 Tasting at Vin Ami with Jason Broussard Sold out 5:30PM-7:30PM at 3505 Country Club Rd, Suite B, Lake Charles, LA 70605 Free & Open to the public! Wine Tastings Fri 12 Sep 2025 Tasting at International Market with Bass Barfield Sold out 4PM-6PM at 3940 Barron St, Metairie, LA 70002 Free & Open to the public! Market Visits Thu 25 Sep 2025 Olim Bauda Market Visit Sold out New Orleans Ask your rep if you'd like to schedule a tasting, host an event, or just say hi! Wine Tastings Sat 13 Sep 2025 Pinhook Tasting at Acquistapace Covington with Erik Christensen Sold out 11AM-2PM at 125 E. 21st Ave, Covington, LA 70433 Free & Open to the public! Wine Tastings Wed 10 Sep 2025 K.Luke Whiskey Tasting at Dorignac's with Owner / Master Blender Jonathan Maisano Sold out 4:30PM - 6:30PM at 710 Veterans Memorial Blvd, Metairie, LA 70005 Free & Open to the public! Wine Dinners Wed 17 Sep 2025 Tequila Supper Club with Lane Primeaux at Lola Covington Sold out 517 N New Hampshire St, Covington, LA 70433 Delicious tequila will be sampled throughout supper plus wine! Join us for our next LOLA Supper Club on Wednesday, Sept 17th. Doors open at 6pm. $125/person. Our supper clubs are intimate, flavorful, and unforgettable -- and seats fill up quickly. Tickets can be purchased on their website at lola.kitchen Reserve a spot now! Market Visits Tue 30 Sep 2025 Winemaker Laurent Drouhin in town! Sold out 9/30-10/1 in New Orleans Market Visits Tue 30 Sep 2025 Obsidian Wine Co. Market Visit Sold out 9/30-10/2 throughout Louisiana Ask your rep if you'd like to schedule a tasting, host an event, or just say hi! Market Visits Tue 30 Sep 2025 Escala Humana Winemaker Market Visit w/ JC Chaplin (Brazos) Sold out 9/30-10/2 throughout Louisiana Ask your rep if you'd like to schedule a tasting, host an event, or just say hi! Market Visits Tue 23 Sep 2025 Canella Spumante Market Visit Sold out 9/23-9/24 throughout Louisiana Ask your rep if you'd like to schedule a tasting, host an event, or just say hi! Market Visits Tue 23 Sep 2025 K.Luke North LA Market Visit Sold out 9/23-9/25 in Shreveport and Monroe! Ask your rep if you'd like to schedule a tasting, host an event, or just say hi! Market Visits Tue 16 Sep 2025 Rosenthal (Importer) Market Visit Copy Sold out 9/16-9/18 throughout Louisiana Ask your rep if you'd like to schedule a tasting, host an event, or just say hi! Market Visits Tue 16 Sep 2025 Grapejuice Group (Importer) Market Visit Sold out 9/16-9/18 throughout Louisiana Ask your rep if you'd like to schedule a tasting, host an event, or just say hi! Market Visits Tue 09 Sep 2025 L'Ecole Winery Market Visit Sold out 9/9-9/11 throughout Louisiana Ask your rep if you'd like to schedule a tasting, host an event, or just say hi! Market Visits Tue 09 Sep 2025 K.Luke Market Visit Sold out 9/9-9/11 throughout Louisiana Ask your rep if you'd like to schedule a tasting, host an event, or just say hi! Market Visits Tue 09 Sep 2025 Gainey Vineyards Launch & Market Visit Sold out 9/9-9/11 throughout Louisiana Ask your rep if you'd like to schedule a tasting, host an event, or just say hi! Wine Tastings Sat 13 Sep 2025 Nunu's Maurice Tasting with Jason Broussard Sold out 12PM-2PM at 9512 Maurice Avenue, Maurice, LA 70555 Free & Open to the public! Wine Tastings Fri 05 Sep 2025 Lake Street Liquor Tasting with Jason Broussard Sold out 4PM-6PM at 4336 Lake St, Lake Charles, LA 70605 Free & Open to the public! Wine Tastings Wed 17 Sep 2025 Commander's Palace Tasting with Alex Minton Sold out 5PM - 7PM at 1403 Washington Ave, New Orleans, LA 70130 Free & Open to the public! Wine Tastings Thu 25 Sep 2025 Tasting at The Chicory House with Alex Minton Sold out 5PM - 9PM at 2727 Prytania St, New Orleans, LA 70130 Free & Open to the public! Wine Tastings Sat 27 Sep 2025 Old Metairie Bottle Shop Tasting with Alex Minton Sold out 3PM - 5PM at 3127 Metairie Road, Metairie LA 70001 Free & Open to the public! Wine Tastings Fri 05 Sep 2025 Greek Wine Tasting w/ Alex Minton at Swirl Sold out 5PM - 7:30PM at 3143 Ponce De Leon St. New Orleans, LA 70119 Free & Open to the public! No matching events found. Check back soon! Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Location: 2110 W Thomas Street, Hammond, LA 70401 Phone: (504) 828-5708 Click here to email us Home What We Do Our Team Contact Us Events Calendar FAQ s Brands We Like Wine Spirits Beer Non-Alcoholic Â© 2025 Uncorked. All rights reserved. Website by Anntoine Marketing + Design Privacy Policy"
    },
    {
      "url": "https://www.linkedin.com/company/uncorkedandcultured",
      "text": "Uncorked & Cultured | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Join now Sign in Uncorked & Cultured Media Production New York, NY 781 followers A media company unapologetically connecting BIPOC to wine, wellness, culture, and adventure. Follow View all 4 employees Report this company About us Uncorked & Cultured is a digital platform and media company connecting BIPOC audiences around the world through wine, wellness, culture, adventure. We create original content amplifying BIPOC entrepreneurs; host global cultural adventures; and through our community provide marketing solutions for companies looking to tap into the growing BIPOC luxury & lifestyle consumers. We are publishers of the Sip Consciously Directory, an assemblage of Black-owned wine businesses in the 3-tier wine distribution chain, and are producers of the State of Black Wine Business Forum, LatinX State of the Wine Industry Summit, and the annual Juneteenth Napa Experience. Website http://www.uncorkedandcultured.com External link for Uncorked & Cultured Industry Media Production Company size 2-10 employees Headquarters New York, NY Type Self-Owned Founded 2020 Locations Primary Harlem New York, NY 10037, US Get directions Employees at Uncorked & Cultured Angela McCrae Media Owner • Diversity in Wine Advocate • Startup Founder • People Connector • Community Builder • Manifestor Uncorked and Cultured, LLC Founder at Uncorked & Cultured See all employees Updates Uncorked & Cultured reposted this Angela McCrae Media Owner • Diversity in Wine Advocate • Startup Founder • People Connector • Community Builder • Manifestor 5d Edited Report this post I’m super excited to participate in SommCon next week to facilitate the Supplier Roundtable: Growth, Grit, and Game Plans. It’s super personal for me after seeing the sacrifice, stress, and overwhelm of new entrepreneurs entering the wine market and not knowing where to start or focus. \n\nHaving this collaborative dialogue around critical market dynamics, creative problem-solving, and relationship management will help craft beverage suppliers maximize their business impact and growth potential. I hope to see you there prepped and ready to get vulnerable, real, and optimistic about the future of your business. #sommcon #wineeducation #wineproducer #craftbeverage #winebusiness 152 38 Comments Like Comment Share Uncorked & Cultured reposted this Jessica Yañez-Perez Cultural Connector | Host of Wine & Chisme Podcast | Amplifying BIPOC Voices Through Storytelling & Events | Creator of First U.S. Latiné-Owned Wine Directory 6d Report this post 🚨 Season 6 Premiere 🚨\n\nI’m thrilled to launch the new season of The Wine & Chisme Podcast with Sofia of Cramoisi Vineyard in Oregon’s Willamette Valley.\n\nIn this episode, Sofia shares her journey from Mexico City to U.S. vineyard owner, what it means to represent Latinas in wine, and how she’s building a legacy rooted in passion, sustainability, and storytelling.\n\n🎧: https://lnkd.in/gmGs-TWn 📺: https://lnkd.in/gyg_k44q #WineAndChisme #LatinaLeadership #WineIndustry #OregonWine …more 12 Like Comment Share Uncorked & Cultured reposted this Chinedu Rita ROSA Africa Wine Export🍷Mentor🍷Brand Creation 🍷Keynote Speaker 🍷Marketing Strategist 🍷Media advice 🍷President Bordeaux Business Network🍷Food & Wine pairing expert 🌹President CGBW France 🥂Event planning 🥂Wine tourism 2w Report this post Afro Wine Week Count Down starts now!\n\nSo if you do not know about this amazing initiative brought to life by my friend and sister in wine Tuanni Price, taking place in Capetown from the 6th of September, you should...\n\nI am honoured to be amongst the speakers with focus on the Importance of Africa : Why Representation and Recognition matters!\n\nAhead of Cape Wine 2025, Afro Wine Week will bring together 20+ speakers, curated tastings, and think-tank sessions designed to:\n\n🍇 Spotlight Black-owned wine brands ready to scale\n🍇 Demystify trade, exports & investment opportunities\n🍇 Build a pipeline of Black talent across the industry\n🍇 Put representation in the vineyard, the boardroom & beyond\n\nExcellence doesn’t need permission — it needs platforms that we as individuals can create together.\n.\nSo if you support Inclusion, Diversity, Recognition, Equity and amplifying underrepresented voices in the wine trade, be sure not miss the Afro Wine Week #AfroWineWeek #CapeWine2025 #Inclusion #WineIndustry #Empowerment #BuildingLegacy #EmpowerThroughWine #WineLeadership #UnlockingPotential #PathwaysToPower …more 59 5 Comments Like Comment Share Uncorked & Cultured 781 followers 1mo Report this post If you’re looking to connect with creators for and by the culture, be sure to download Hayti app today! Congratulations to Cary Wheelous for this credible nod from Google. 💜🧡 Google Play business community 65,418 followers 1mo They saw a problem and built the answer. Meet 20 new #WeArePlay founders from across the U.S. making an impact with their apps & games including:\n\n🐕 Finch Care : With over 10 million downloads, Thomas (Nino) Aquinas Nugraha Budi and Stephanie Yuan wanted to make self-care more accessible ,so they built a global community around lovable digital pets that thrive as people complete their self-care goals. Their fun and simple approach to building positive habits has resulted in over 10 million downloads.\n\n🧑💻 Speechify : Inspired by his own challenges with dyslexia, Cliff Weitzman created Speechify which turns text into accessible audio. His app has evolved into a global platform that processes billions of words weekly for millions of users in over 60 languages and 200 voices.\n\n🎧 Hayti : In order to amplify underrepresented Black voices on a global scale, Cary Wheelous created Hayti -showcasing the latest news curated from over 200 Black publishers and 2,000 podcasters.\n\nRead their stories and more at g.co/play/weareplay 1 Like Comment Share Uncorked & Cultured reposted this Kenneth Stephens Jr. Construction Lawyer | Construction Litigation | Construction Arbitration | Liens, Defects, & Change Orders | Winery Owner @PurNoire 1mo Report this post Cat’s out the bag. Yes... Pur Noire Houston Is Closing… Temporarily\n\nThe building that houses our Houston tasting room was sold, and it’s being torn down.\n\nFor the past six months I’ve dreaded writing this post, but here we are.\n\nWe built Pur Noire from scratch. Bootstrapped. Intentional. Rooted in culture and quality. We created a space where people could sip, connect, learn and relax. And now, because we don’t own the real estate it, we have to walk away from it.\n\nBut we’re not folding.\n\nWe’ve finalizing a new temporary space in Midtown, so that we can keep pouring. But we also know we can’t keep building our future on someone else’s land. So, we’re doing what a lot of us were taught not to do. We’re asking for help.\n\nWe’ve launched a crowdfunding campaign to raise $500,000 in two phases:\n·       $250K to eliminate the SBA debt that’s holding us back\n·       $250K to help purchase a permanent 4,000 sq. ft. winery right here in Houston\n\nA space we own. A space no one can take from us. A space where we can make wine, host cultural experiences, and continue building something that matters.\n\nIf you’ve ever believed in what we’re building, or believed in the idea of ownership, legacy, and creative control, this is the moment.\n\nYou can support or share the campaign here: https://lnkd.in/g2HRN2Vc We appreciate every dollar, every repost, and every word of encouragement. And if this resonates with you, I’d love to hear from you in the comments. #ownership #crowdfunding #wineculture #entrepreneurship #legacy …more 177 13 Comments Like Comment Share Uncorked & Cultured reposted this Association of African American Vintners 754 followers 2mo Report this post A Toast to a True Trailblazer 🍷\n\nAfter nearly three decades of pioneering work in the wine industry, our beloved founder, Mac McDonald, has announced his retirement and the closing of Vision Cellars.\n\nIn his recent interview with Wine Spectator, Uncle Mac shared with signature wisdom and wit:\n\n\t“Over 27 years ago, I started the Association of African American Vintners. I didn't start that as a Black thing. I started that to get more African Americans or people who look like me to drink wine. I didn't care if they bought my wine or not, as long as they were drinking wine. It was about the whole industry.”\n\nMac didn’t just make award-winning wines—he made history. As the founder of the Association of African American Vintners (AAAV), he created a space where Black winemakers could be seen, supported, and celebrated. His vision gave rise to a vibrant and inclusive wine community that continues to grow across the country and globe.\n\nWhile this marks the closing of a personal chapter, Mac’s legacy is far from over. It lives on through AAAV’s continued mission, the scholarship established by the Sonoma County Library Foundation in his name, and a newly forming 501c3 foundation in his name.\n\nMac, thank you for showing us what’s possible—and for making space so others could follow. We raise our glass to your impact, your legacy, and your well-earned rest.\n\n📖 Read more in Wine Spectator: https://lnkd.in/gebFi2ng #AAAV #LegacyOfMac #InclusiveWine #BlackVintners #WineIndustry #VisionCellars #Trailblazer #ThankYouMac Why Is Mac McDonald Walking Away From Winemaking? winespectator.com 59 5 Comments Like Comment Share Uncorked & Cultured reposted this Brenae Royal Leader in the wine industry. \nInfo@brenaeroyal.com 2mo Report this post I’m so happy to have won my first grant! Thank you to the judges and everyone who made this possible! My mission is just beginning! Cheers to all of the 2025 Reciepents! \n\nREPOST: \n\n@brooklynbrewery\nWe're proud to announce the five winners of our Calling All Makers Grant Program - innovators, creatives, and community leaders who will each receive $10,000 to continue their inspiring work.\n\n🍷In Food & Beverage: Brenae Royal (@_cabrenae),\nfounder of @VioletsParadiseWines\n💼In Entrepreneurship: Carla Scholz, founder of @SoakiTUpShop\n🎨In the Arts category: @DimithryVictor, visual artist \n🎶In Music: Tipa Tipo (@tipatipomusic), a tropical soft rock band\n📢In Activism: @Wawa_Gatheru, founder of\n@BlackGirlEnvironmentalist\n\nA huge thank you to everyone who applied. It wasn't easy choosing from such an inspiring group of talented makers - you made this decision incredibly tough (in the best way). And of course, thank you to our amazing judges (@garrettoliver, @stevekhindy,\n@laurenmartin_studio, @saidahb, and @stacylentz) for lending their time, care, and insight throughout the selection process.\n\nIn the coming weeks, we'll be introducing each of these winners individually right here. But in the meantime, check out their Instagrams to learn more about the amazing work they're doing.\n\nRaise a glass to these incredible people - we can't wait for you to get to know them.\n\nTipa Tipo photo by: @mbzphotog / Tipa Tipo styled by: @bridgettekburton 113 27 Comments Like Comment Share Uncorked & Cultured reposted this Tabnie Dozier EMMY-Award winning Journalist-Storyteller-Media Specialist-Philanthropist-Content Creator- Keeping Tabs Vlog 4mo Report this post Thank you again, Kelly Carter , Andrew Freeman , Angela McCrae , Prentice Penny and everyone that played a role in this unforgettable night!! Tabnie Dozier Enterprises LLC 186 followers 4mo 🔥 #TrailblazerTuesday : When Courtney B. Vance speaks — we listen. 🎬🍷✨ \n\nAt a recent screening of Netflix 's Uncorked, directed by Prentice Penny, Vance delivers yet another powerful performance. The legendary actor took a moment to honor the many forms of artistry that breathe life into this film — and into our world. From the careful craft of a winemaker 🍇 to the bold vision of a director 🎥, from the soul of an actor 🎭 to the creativity in the kitchen 🍽️ — Vance reminded us that art is everywhere, and for many artists, it’s not just work — it’s a calling. We honor his legacy, his excellence, and his unwavering support for all the arts. #TDE #CourtneyBVance #Uncorked #NetflixFilm #StorytellingWithSoul 8 Like Comment Share Uncorked & Cultured reposted this Tabnie Dozier EMMY-Award winning Journalist-Storyteller-Media Specialist-Philanthropist-Content Creator- Keeping Tabs Vlog 4mo Report this post Thank you, Angela McCrae and Uncorked & Cultured for allowing me the pleasure to pen a marvelous piece about #blackownedbusinesses ! Bookmark this article for your next trip to Louisville, and please share with visitors heading into town for the Derby!! https://lnkd.in/ghwaKmNs The Kentucky Derby Experience You Don’t See on TV https://uncorkedandcultured.com 21 9 Comments Like Comment Share Uncorked & Cultured reposted this Dine Diaspora 1,284 followers 5mo Report this post The Black Women in Food Summit lineup just got even better! 💃🏾 🔥 \n\nWe’re thrilled to announce more incredible speakers—leaders, innovators, and trailblazers redefining the food industry.\n\nFrom visionary chefs to innovative entrepreneurs, these speakers are bringing bold ideas, deep insights, and unstoppable passion to the stage. You won’t want to miss it!\n\nAnd we’re not done yet—stay tuned for more on the 2025 Black Women In Food Summit!\n\n🎟️ Secure your spot now for an unforgettable experience: https://lnkd.in/d3j2DHs8 | LINK IN BIO\n.\n. #BWIFSummit #BlackWomenInFood #DineDiaspora +2 54 Like Comment Share Join now to see what you are missing Find people you know at Uncorked & Cultured Browse recommended jobs for you View all updates, news, and articles Join now Similar pages Silver Oak Wineries Oakville, California Caviar Dream Food and Beverage Retail Chicago, Illinois Fresh Glass Productions Media Production San Diego, CA Hiatus Cheesecake Food and Beverage Manufacturing Baltimore, MD Association of African American Vintners Wineries Livermore, California The Veraison Project Wine & Spirits MFHA - The Multicultural Foodservice & Hospitality Alliance Restaurants Providence, RI The Garcia Companies Venture Capital and Private Equity Principals Beverly Hills, California Be Inclusive Hospitality Hospitality Whiny Baby Food and Beverage Services Show more similar pages Show fewer similar pages LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at Uncorked & Cultured Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://www.enrollwaresolutions.com/contact-us",
      "text": "Contact the Team | Enrollware Skip to content Client Login All-in-One Platform Solutions Healthcare/AHA Corporate Government Continuing Education Pricing Contact Sign Up Contact Enrollware How to Reach Us To reach a representative, fill out the contact form on this page or give us a call. Phone: Support: 561-247-2432 Support Hours: Monday-Friday (8am-6pm ET) Email: Sales Inquiries: info@enrollware.com Support: support@enrollware.com Mailing Address: Fullsteam Software Holdings LLC DBA Enrollware Software 540 Devall Drive, Suite 301 Auburn, AL 36832 Password Assistance? Please contact your training center administrator. Enrollware can only issue usernames or passwords for the primary administrators of our direct clients. Online Class Registration and Management Features All-in-One Platform Pricing EnrollwarePay Solutions Healthcare Government Continuing Education Corporate Resources Contact Us Privacy Policy Terms & Conditions Responsible Disclosure Policy Client Login Follow Us © 2025 Enrollware. All rights reserved."
    },
    {
      "url": "https://uncorkcapital.com/team/",
      "text": "Uncork Capital - Team Companies Team About News Thoughts Jobs F T M © 2025 Uncork Capital When we partner, we help founders navigate the difficult stuff like scaling and building their team, making the right decisions at crossroads, and raising more capital. When we partner, we help founders navigate the difficult stuff like scaling and building their team making the right decisions at crossroads, and raising more capital. Investment Team Managing Partner Andy McLoughlin Managing Partner Andy McLoughlin view profile Founding Partner Jeff Clavier Founding Partner Jeff Clavier view profile Partner Amy Saper Partner Amy Saper view profile Partner Susan Liu Partner Susan Liu view profile Partner Tripp Jones Partner Tripp Jones view profile Senior Associate Sarah Du Senior Associate Sarah Du view profile Platform Team Head of Talent Adriana Roche Head of Talent Adriana Roche view profile Head of Operations and Platform Ashley Cravens Head of Operations and Platform Ashley Cravens view profile Head of Finance Joyce Lee Head of Finance Joyce Lee view profile Executive Assistant & Office Manager Jessica Jimenez-Pizarro Executive Assistant & Office Manager Jessica Jimenez-Pizarro view profile Executive Assistant Lisa (LJ) Cohen Executive Assistant Lisa (LJ) Cohen view profile Operations and Community Manager Tilly McLain Operations and Community Manager Tilly McLain view profile Board Partner & Go-to-Market Advisor Whitney Bouck Board Partner & Go-to-Market Advisor Whitney Bouck view profile We won’t make it worse. Promise. We support founders in making better decisions, avoiding common pitfalls, and—every now and then—changing the course of their company. Ten years in, the feedback’s the same: “We wouldn’t be here without you.” Meet the Uncork portfolio —founders pushing boundaries and building exceptional companies. Meet the Uncork portfolio —founders pushing boundaries and building exceptional companies."
    },
    {
      "url": "https://leadiq.com/c/uncorked-ventures/5a1dbc382300005b00ba39d0/email-format",
      "text": "Uncorked Ventures Email Formats & Email Address Examples | LeadIQ Learn more at LeadIQ.com Start free Most Common Email Formats at Uncorked Ventures The most accurate and popular Uncorked Ventures 's email format is  (ex. ). Uncorked Ventures also uses as email structures. Uncorked Ventures uses up to 1 different email patterns. Uncorked Ventures Email Formats Example Percentage First@uncorkedventures.com John@uncorkedventures.com 50% First@uncorkedventures.com John@uncorkedventures.com 50% Frequently Asked Questions What does Uncorked Ventures do? The company's main headquarters is located in 1320 Everett St, El Cerrito, California 94530, US operates in the Beverage Manufacturing industry , along with similar companies like Andreessen Horowitz Khosla Ventures New Enterprise Associates (NEA) . You can visit uncorkedventures.com contact Uncorked Ventures 's headquarters by phone at +1-510-426-**** . Explore Uncorked Ventures 's company overview page for more information. What is Uncorked Ventures 's email address format? Uncorked Ventures 's email format typically follows the pattern of First@uncorkedventures.com; this email format is used 50% of the time. Other contacts within LeadIQ's database had email formats such as First@uncorkedventures.com . Looking for more contact data? Unlock accurate emails and phone numbers from millions of profiles verified in real-time. How many employees does Uncorked Ventures have currently? Uncorked Ventures has approximately 2 employees . Key team members to contact include Sr. Director Human Resources: M. K. . For more team information and contact data, explore Uncorked Ventures 's employee directory with LeadIQ. Everything for prospecting, in one platform. What you can expect from LeadIQ: B2B data verified in real-time Sync data to your CRM, & add it to an outreach sequence in one click Integrations with your tech stack for optimal efficiency A patented AI cold email generator Account & contact-level job change tracking Uncorked Ventures Email Format Beverage Manufacturing United States 2-10 Employees Uncorked Ventures provides top notch wine clubs and wine gift baskets to our discriminating customers. Sign up for free to view info Company overview Employee directory Verify Uncorked Ventures email addresses Verify Email Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Sign me up Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Book a demo Platform Identify prospect data Track sales triggers Compose personalized messages Enrich Salesforce data Success Stories Resources Pricing Blog Company Search Support Careers Data Community Our Data Privacy Center Legal Privacy Policy Cookie Policy Terms of Service Do Not Sell or Share My Personal Information Compare LeadIQ vs. Zoominfo LeadIQ vs. Apollo LeadIQ vs. Lusha LeadIQ vs. Cognism LeadIQ vs. Seamless.ai LeadIQ vs. Usergems LeadIQ vs. Champify Contact 1-888-653-2347 support@leadiq.com sales@leadiq.com Â© LeadIQ, Inc. All rights reserved."
    },
    {
      "url": "https://www.uncorkedeustis.com/events",
      "text": "Events — Uncorked 0 Skip to Content Home Menu Events Wine Shop Contact Us Open Menu Close Menu Home Menu Events Wine Shop Contact Us Open Menu Close Menu Home Menu Events Wine Shop Contact Us Our Events Sep 12 Al Dematias - 70's 80's Classic Rock Friday, September 12, 2025 7:30 PM 9:30 PM Uncorked (map) Google Calendar ICS View Event → Sep 13 Seamus Saturday, September 13, 2025 7:30 PM 9:30 PM Uncorked (map) Google Calendar ICS Soft Country Classics View Event → Sep 9 Trivia with Dominic Tuesday, September 9, 2025 7:00 PM 9:00 PM Google Calendar ICS Join for an evening of fun and inquisitiveness and prizes!  Reservations are required. Please call 352.409.3035 to reserve your spot. View Event → Sep 8 Wine Class w/ Tony & Nancy Monday, September 8, 2025 6:30 PM 8:00 PM Google Calendar ICS “Tony & Nancy’s Napa & Oregon Picks It is still hot and we need refreshing wines to drink class! A wine class that includes wine sampling paired with small plates is an excellent way to explore both the flavors of wine and food together.  Featuring Selections from International Locations Price: $25.00 View Event → Sep 6 Cherokee Saturday, September 6, 2025 7:30 PM 9:30 PM Google Calendar ICS View Event → Sep 5 Paul Smithson Friday, September 5, 2025 7:30 PM 8:30 PM Google Calendar ICS Americana & Original Acoustic Sounds View Event → Aug 30 Rob Redeye - Classic Jazz, R&B, Blues, and a bit of Country Saturday, August 30, 2025 7:00 PM 10:00 PM Uncorked (map) Google Calendar ICS View Event → Aug 29 Denny, Blues & Country Friday, August 29, 2025 7:30 PM 9:30 PM Uncorked (map) Google Calendar ICS View Event → Aug 28 Professional DJ Thursday, August 28, 2025 6:00 PM 8:00 PM Google Calendar ICS Professional DJ Alan Trueba, Wax on Wax off, Playing the best set of 80’s Alternative, New Wave, b-sides. All played and mixed live on vinyl… View Event → Aug 26 Women's Social Night Tuesday, August 26, 2025 5:00 PM 7:00 PM Uncorked (map) Google Calendar ICS 🍷 Ladies’ Wine & Social Night 🍷 Calling all women who love great wine and even better company! Join us on Tuesday, May 13th from 5:00 PM – 7:00 PM for a fun and relaxed evening of sipping, snacking, and socializing as we kick off a new women’s wine social group. Cost: $16.99 per person + tip Includes 2 glasses of wine + delicious appetizers Whether you’re looking to unwind, make new friends, or just enjoy a girls' night out — this is for you! RSVP by May 10th winecellarsmtdora@comcast.net or call 352 .409.3035 (Spots are limited – don’t miss out!) View Event → Aug 23 Sarah Di Battista Saturday, August 23, 2025 7:30 PM 9:30 PM Google Calendar ICS British Singer/ Songwriter Acoustic View Event → Aug 8 Andy & Joe -    Americana & Jazz Music Friday, August 8, 2025 7:30 PM 9:30 PM Uncorked (map) Google Calendar ICS Great Harmony, and fun night View Event → Aug 1 David Oliver Willis Friday, August 1, 2025 7:30 PM 9:30 PM Google Calendar ICS In the house, former American Idol contestant with be performing this evening with his acoustical guitar. View Event → Jul 26 Sal & Izzy Saturday, July 26, 2025 7:00 PM 10:00 PM Google Calendar ICS Sexy harmonies Multi-genre, Covers and Originals View Event → Jul 18 Seth Pause Friday, July 18, 2025 7:30 PM 9:30 PM Google Calendar ICS View Event → Jun 7 John - Jazz on Tap Saturday, June 7, 2025 7:30 PM 9:30 PM Uncorked (map) Google Calendar ICS Easy Listening Jazz favorites View Event → May 30 Jon Roman Friday, May 30, 2025 7:30 PM 9:30 PM Google Calendar ICS Finger Style Blues View Event → Apr 22 Wine Class with Ken w/ Riboli Family Wines Tuesday, April 22, 2025 6:30 PM 9:00 PM Uncorked (map) Google Calendar ICS Riboli Wines from Paso Robles, California Presenting a wonderful selection of wines from the Paso Robles region of California. The Riboli family have 4 generations of winemaking experience based on quality of superb wines. Tuesday, April 22nd, 2025 6:30 PM-8:00 PM $25.00pp Uncorked 120 North Bay Street Eustis, FL, 32726 Reservations are required. Please call us at 352-409-3035 View Event → Mar 27 Sunset Sip & Stroll Thursday, March 27, 2025 6:30 PM 8:30 PM Downtown Eustis (map) Google Calendar ICS Enjoy Eustis downtown for an evening of Wine, Beer and Food sampling throughout the downtown area. Uncorked with be providing the music of John on Tap. More information can be found with the Eustis Area Chamber of Commerce. View Event → Mar 17 St Patrick's Dinner Monday, March 17, 2025 4:00 PM 8:00 PM Wine Cellars Uncorked (map) Google Calendar ICS Serving Potatoe Leek Soup, Corned Beef Sandwiches, and Corned Beef Dinner.  Reservations Suggested. View Event → Mar 8 Chuck Moseholder Saturday, March 8, 2025 7:30 AM 9:30 AM Uncorked (map) Google Calendar ICS Country Music View Event → Feb 25 Trivia with Dominic - Reservations Requested Tuesday, February 25, 2025 7:00 PM 9:00 PM Uncorked (map) Google Calendar ICS To guarantee your spot, please call to reserve at 352-409-3035 . View Event → Feb 14 Valentine’s Dinner Friday, February 14, 2025 4:00 PM 10:00 PM Google Calendar ICS A delicious and romantic Valentine's dinner package! For $65, you're getting a great deal with a bottle of Prosecco, Chicken Parmesan, Bread, Salad  and Dessert. View Event → Feb 9 Super Bowl Party Sunday, February 9, 2025 6:00 PM 11:00 PM Wine Cellars Uncorked (map) Google Calendar ICS Join us to watch the game and cheer on your favorite time.  We will be offering game day appetizers and food. View Event → Dec 20 Vic on Guitar Friday, December 20, 2024 7:30 PM 9:30 PM Google Calendar ICS View Event → Dec 9 Wine Dinner with J Vineyards & Orin Swift Monday, December 9, 2024 6:30 PM 8:00 PM Uncorked (map) Google Calendar ICS You're Invited to a Holiday Wine Dinner at Uncorked! Join us for a delightful evening filled with fine dining and exquisite wines! Date: Monday, December 9th Time: 6:30 PM Evening Highlights: - Gourmet Dinner: Enjoy a multi-course meal, expertly paired with our award-winning wines. - Wine Tasting: Experience the depth and richness of our exclusive selections. We can’t wait to celebrate with you! Cheers, Nancy Presented by Natalie J Vineyards & Orin Swift Winery Team View Event → Dec 7 Tommy Treadway Saturday, December 7, 2024 7:00 PM 9:00 PM Google Calendar ICS View Event → Nov 29 Zac Mello Live Friday, November 29, 2024 7:00 PM 10:00 PM Uncorked (map) Google Calendar ICS Join us on Friday, October 4th from 7 to 10 for Zac Mello! Zac is the lead singer/songwriter/guitarist for The Longest Hall. He performs songs from every era and genre on the acoustic guitar and vocals. View Event → Oct 18 Triple Play Plus: Classic Rock Friday, October 18, 2024 7:00 PM 10:00 PM Google Calendar ICS Classic Rock View Event → Oct 12 Wine Tasting Saturday, October 12, 2024 5:00 PM 7:00 PM Google Calendar ICS Wine Tasting: $10 per person with a $3.00 discount on any bottle purchase. View Event → Subscribe to Our Newsletter Sign up with your email address to receive news and updates on upcoming events and specials. Sign Up Menu Events Wine Shop Contact Us 352-409-3035 120 North Bay Street, Eustis, FL 32726"
    }
  ]
}