{
  "fuentes": [
    {
      "url": "https://unioncraftbrewing.com/taproom/",
      "email": "info@unioncraftbrewing.com"
    },
    {
      "url": "https://www.unionkitchenct.com/contact",
      "email": "info@unionkitchenct.com"
    },
    {
      "url": "https://theunionkitchen.dk/about-us/",
      "email": "airport@theunionkitchen.dk"
    },
    {
      "url": "https://theunionkitchen.dk/about-us/",
      "email": "kitchen@theunionkitchen.dk"
    },
    {
      "url": "https://theunionkitchen.dk/about-us/",
      "email": "local@theunionkitchen.dk"
    },
    {
      "url": "https://theunionkitchen.dk/about-us/",
      "email": "obro@theunionkitchen.dk"
    },
    {
      "url": "https://www.unionstreetbrewing.com",
      "email": "info@unionstreetbrewing.com"
    },
    {
      "url": "https://www.unionkitchenct.com/our-story",
      "email": "info@unionkitchenct.com"
    },
    {
      "url": "http://unionpizza.com/union-squared-evanston",
      "email": "events@unionpizza.com"
    },
    {
      "url": "http://unionpizza.com/union-squared-evanston",
      "email": "heather@unionpizza.com"
    },
    {
      "url": "http://unionpizza.com/union-squared-evanston",
      "email": "unionsquaredchicago@unionpizza.com"
    },
    {
      "url": "https://www.sdtaproom.com/contact",
      "email": "mgmt@sdtaproom.com"
    },
    {
      "url": "https://annarborobserver.com/the-restaurant-as-sleepover/",
      "email": "awylie@comcast.net"
    },
    {
      "url": "https://uniontaproomwh.com/contact/",
      "email": "info@uniontaproomwh.com"
    },
    {
      "url": "https://www.unionpiepizza.com/about-1",
      "email": "luke@unionpiepizza.com"
    },
    {
      "url": "https://www.tapandkitchen.com/",
      "email": "awards-logo@2x.png"
    },
    {
      "url": "https://www.tapandkitchen.com/",
      "email": "info@tapandkitchen.com"
    },
    {
      "url": "https://unioncraftbrewing.com/well-crafted/",
      "email": "info@unioncraftbrewing.com"
    },
    {
      "url": "https://uniontaproomwh.com/",
      "email": "info@uniontaproomwh.com"
    },
    {
      "url": "https://visitcentralflorida.org/featured/union-taproom/",
      "email": "info@uniontaproomwh.com"
    },
    {
      "url": "https://unioncraftbrewing.com/",
      "email": "info@unioncraftbrewing.com"
    }
  ],
  "mails": [
    "airport@theunionkitchen.dk",
    "awards-logo@2x.png",
    "awylie@comcast.net",
    "events@unionpizza.com",
    "heather@unionpizza.com",
    "info@tapandkitchen.com",
    "info@unioncraftbrewing.com",
    "info@unionkitchenct.com",
    "info@unionstreetbrewing.com",
    "info@uniontaproomwh.com",
    "kitchen@theunionkitchen.dk",
    "local@theunionkitchen.dk",
    "luke@unionpiepizza.com",
    "mgmt@sdtaproom.com",
    "obro@theunionkitchen.dk",
    "unionsquaredchicago@unionpizza.com"
  ],
  "nombre_sitio": "uniontaproomwh.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://unioncraftbrewing.com/taproom/",
      "text": "UNION Craft Brewing UNION Hall & Beer Garden - UNION Craft Brewing Visit Us UNION Hall & Beer Garden Take A Tour! Beers Find Our Beer News & Events Latest News Upcoming Events Host Your Event Store Beer Unites About Union Write Us Donations Distributor Portal Visit Us UNION Hall & Beer Garden Take A Tour! Beers Find Our Beer News & Events Latest News Upcoming Events Host Your Event Store Beer Unites About Union Write Us Donations Distributor Portal UNION Hall & Beer Garden HOURS Monday CLOSED Tuesday – Thursday 4-10pm Friday – Saturday 12-10pm Sunday 12-8pm DIRECTIONS / PARKING 1700 W 41st St #420, Baltimore, MD 21211 Google Maps Apple Maps We have limited on-site parking. Park only in marked spaces. From live concerts from local musicians to national touring artists, monthly bingo, karaoke, makers markets, and an annual pinewood derby – We love to have fun at UCB. Click here to host your event at UNION. Upcoming Events Host Your Event Carroll & Sons Fine Foods ‘A Restaurant About Nothing’ is located inside UNION Hall and serves a rotating menu of snacks, sandwiches, entrees, and desserts. For more details, weekly menus, and catering inquiries visit their Carroll and Son Fine Foods Get an up-close look at the brewery and learn about our brewing process while being mildly entertained by our knowledgeable staff. Tickets are $10/person and they include: a flight of beer (three 7oz pours,)  an insider’s look at tri-clamp fittings, and a few terrible jokes Take A Tour! We sell cans, bottles, fill growlers & crowlers during scheduled UNION Hall hours – some beer-to-go options are not available during ticketed events. Growlers, Quart Cans, and Sixers are always for Take-Away only and can not be consumed in Union Hall or the Beer Garden. FAQs Who can visit the brewery? Everyone is welcome. UNION Hall & Beer Garden is a family-friendly location; we’re happy to host guests of all ages during regular operating hours. Some events are 21+, so please make sure to check your tickets. Anyone under the legal drinking age must be accompanied by an adult within 6 feet at all times. Are pets allowed? Pets are only allowed in the outside Beer Garden and must remain on a leash and with you at all times. Is the brewery ADA accessible? Yes. ADA Parking is located just off the Beer Garden and there is a leveled walkway from the ADA parking spots to the entrance. How can I safely plan my visit to the brewery? UNION Craft Brewing is a working factory. To ensure the safety of our guests, staff, and equipment: NO running, standing /climbing on furniture, access to the Brewhouse, Silo Area, or Stage unless authorized. Please keep the table in its place. Adults are expected to drink responsibly and plan a safe way to get home. We encourage guests to take advantage of public transportation or rideshare services, and please note that we will not tow cars left overnight on the premises. Our priority is your safety, and we want to ensure that you have a responsible and enjoyable visit. Do you offer non-alcoholic options? Yes! Try our Hopwater Springs – a non-alcoholic hoppy seltzer. We also offer bottled sodas and sparkling water. Do you offer gluten free options? Yes. We offer white, rose, and red wine made by friends at The Wine Collective. Try our cider made in collaboration with our friends from ANXO in Washington, D.C. Do you offer wine and spirits? Yes. We offer white and red wine made by friends at The Wine Collective. We do not offer spirits at this time. Can I bring in outside alcohol? No. According to Maryland State Law, alcoholic beverages other than beer & cider we produce are not allowed to be consumed on our premises. Are outside food and beverage allowed? No. Aside from treats and snacks from The Charmery & Vent Coffee Roasters, no outside food or beverage is permitted in UNION Hall or the Beer Garden. Except for Birthday Cakes- they are always welcome. Please bring your utensils, plates, napkins, and party hats for the celebration. Do you offer Beer Flights? Yes. Ask our beertenders about flights. What is your smoking policy? UNION Hall & Outside Beer Garden is a smoke-free area. Like in grade school, we ask that you smoke by the flagpole. Code of Conduct UNION Craft Brewing is dedicated to creating a welcoming, inclusive, and harassment-free environment. Our staff and management participated in Safe Bars training. If you feel uncomfortable, harassed, threatened, or unsafe, please ask one of our staff for help. We will take your lead in how you want the situation handled. If you would like us to, we will step in and stop the behavior. If the harasser doesn’t stop, they will be told to leave and not allowed back in. When visiting, you are required to refrain from the following behaviors: Behavior that is unruly, disruptive, or illegal in nature Intoxication or other signs of alcohol impairment that results in irresponsible behavior. Foul or abusive language or obscene gestures. Failing to follow instructions from UCB staff. Verbal or physical harassment of guests or UCB staff. Guests are responsible for their conduct as well as the conduct of their guests in their party. UCB staff will promptly intervene to support an environment where guests can enjoy the space from the above behavior. Guests who violate these provisions will be subject to ejection without refund. Please know that unruly or illegal behavior will not be tolerated. Read UNION’s Values. Get Social Upcoming Events Current Month Date august tue 05 aug 2:00 pm tue 2:00 pm Round up and Match Kick off with Friends of the Jones Falls UNION Craft Brewing at UNION Collective 1700 W 41st Ste 420 Baltimore, MD 21211 tue 05 aug 6:30 pm tue 6:00 pm Game Watch: O's @ Phillies Stay in touch Leave this field empty if you're human: © 2025 UNION Craft Brewing All Rights Reserved. (410) 467-0290 • 1700 W 41st St, Suite 420 Baltimore, MD 21211 X"
    },
    {
      "url": "https://www.unionkitchenct.com/contact",
      "text": "Contact Us  — Union Kitchen 0 Skip to Content Menu Our Story Photos Calendar Events & Private Dining Catering Reservations Open Menu Close Menu Menu Our Story Photos Calendar Events & Private Dining Catering Reservations Open Menu Close Menu Menu Our Story Photos Calendar Events & Private Dining Catering Reservations Hours Monday - Thursday 4PM-9PM Friday & Saturday  11AM-11PM Sunday 11AM-9:30PM* *kitchen closes at 8pm (860) 598-8000 info@unionkitchenct.com Union Kitchen | 43 LaSalle Rd  | West Hartford, CT info@unionkitchenct.com (860)598-8000 Click Here for Job Openings Click Here to Order Online Hours Monday - Thursday 4PM-9PM | Friday & Saturday  11AM-10PM | Sunday 11AM-8:00PM 43 LaSalle Rd. | West Hartford, CT | 06107 Legal Notices"
    },
    {
      "url": "https://theunionkitchen.dk/about-us/",
      "text": "About us - TheUnionKitchen Skip to content MENU THE UNION KITCHEN CITY THE UNION KITCHEN ØSTERBRO THE UNION KITCHEN AIRPORT THE UNION LOCAL LOCATIONS THE UNION KITCHEN CITY THE UNION KITCHEN ØSTERBRO THE UNION KITCHEN & BAR FREDERIKSBERG THE UNION KITCHEN AIRPORT THE UNION LOCAL MENU THE UNION KITCHEN CITY THE UNION KITCHEN ØSTERBRO THE UNION KITCHEN AIRPORT THE UNION LOCAL LOCATIONS THE UNION KITCHEN CITY THE UNION KITCHEN ØSTERBRO THE UNION KITCHEN & BAR FREDERIKSBERG THE UNION KITCHEN AIRPORT THE UNION LOCAL BAR BOOK A TABLE TAKE AWAY THE UNION KITCHEN CITY THE UNION KITCHEN ØSTERBRO SHOP GIFTCARD TAKE AWAY THE UNION KITCHEN CITY THE UNION KITCHEN ØSTERBRO SHOP GIFTCARD A passionate group with a taste for international food Who is The Union Kitchen? We are a team of people who all appreciate high quality ingredients from all over the world, the perfect mix of casual and sophisticated atmosphere, and we love to give our guests an extraordinary gastronomic experience. see menu We are not only passionate about the food menu, but also the cocktails you can find at our dining locations and especially our Cocktail Bar, The Union Local, which offers you tasty cocktails. For us, diversity is not only found in our staff, but also in our food. Pay us a visit from dusk til dawn – and you’ll discover all kinds of flavours, both new and traditional. BOOK A TABLE Welcome inside wherever you are CITY THE UNION KITCHEN CITY STORE STRANDSTRÆDE 21 1255, KØBENHAVN K DENMARK SEE RESTAURANT ØSTERBRO THE UNION KITCHEN ØSTERBRO ØSTER FARIMAGSGADE 16A 2100, KØBENHAVN Ø DENMARK SEE RESTAURANT LOCAL BAR THE UNION LOCAL LILLE STRANDSTRÆDE 16. KØBENHAVN, 1254 DENMARK SEE BAR AIRPORT THE UNION AIRPORT STORE STRANDSTRÆDE 21 1255, KØBENHAVN K DENMARK SEE RESTAURANT Let’s keep in touch Sign up for our newsletter and be the first to know about menu changes, events, and other cool stuff from our restaurants. We promise not to spam your mailbox. E-mail Subscribe Instagram Facebook-f Spotify THE UNION KITCHEN CITY Store Strandstræde 21, 1255, KBH K +45 33 14 54 88 kitchen@theunionkitchen.dk SMILEY rapport THE UNION KITCHEN ØSTERBRO Øster Farimagsgade 16A, 2100, KBH Ø +45 23 26 73 90 obro@theunionkitchen.dk SMILEY rapport THE UNION LOCAL Lille Strandstræde 16, 1254, KBH K +45 30 46 42 14 local@theunionkitchen.dk SMILEY rapport THE UNION AIRPORT Kystvejen 2 , Terminal 2 Airside, 2770, Kastrup +45 42 13 33 15 airport@theunionkitchen.dk SMILEY rapport GENVEJE SHOP GIFTCARD SITEMAP Dansk Copyright © 2023 The Union Kitchen – Alle rettigheder forbeholdes Forretningsvilkår – Privatlivspolitik See menu THE UNION KITCHEN CITY THE UNION KITCHEN ØSTERBRO THE UNION KITCHEN AIRPORT THE UNION LOCAL Book a table The Union Kitchen City The Union Kitchen Østerbro The Union Local Menu The Union Kitchen City The Union Kitchen Østerbro The Union Kitchen Airport The Union Local Locations The Union Kitchen City The Union Kitchen Østerbro The Union Kitchen & Bar Frederiksberg The Union Kitchen Airport The Union Local Bar Book a table The Union Kitchen City The Union Kitchen Østerbro The Union Local Take Away The Union Kitchen City The Union Kitchen Østerbro Shop Giftcard DK / ENG"
    },
    {
      "url": "https://www.unionstreetbrewing.com",
      "text": "Union Street Brewing Co. - your Hudson NY brewery 0 Skip to Content Home Menus In the News Private Events Events Calendar About Us Photo Gallery Open Menu Close Menu Home Menus In the News Private Events Events Calendar About Us Photo Gallery Open Menu Close Menu Home Menus In the News Private Events Events Calendar About Us Photo Gallery Come and drink a craft beer with us. Opening Fall 2025 - Kingston location Hudson OPEN EVERY DAY BUSINESS HOURS Monday 3-9 pm Tuesday 5-9 pm Wednesday 5-9 pm Thursday 5 - 9 Friday 12 - 10 Saturday 12 - 10 Sunday 12 - 8 Kitchen closes 1 hour prior to brewery closing. Please give us a heads up if you are coming with a group of 8 or more to ensure we are ready for you. We welcome families with well behaved kids, but we are 21 years and older after 7 pm on Fridays and Saturdays. We welcome all well behaved dogs in the garden and service dogs in the taproom. Get in touch with our cycling club to join our Sunday morning rides. Tap room, beer garden, event space and craft brewery located in the heart of historic Hudson. Join our mailing list (we don’t share your info!) Email Address Sign Up Thank you and see you soon! 716 Union Street Hudson, NY 12534 Opening Fall 2025 36 Broadway, Kingston NY 12401 info@unionstreetbrewing.com Hudson T: 518.822.1133"
    },
    {
      "url": "https://www.unionkitchenct.com/our-story",
      "text": "Our Story — Union Kitchen 0 Skip to Content Menu Our Story Photos Calendar Events & Private Dining Catering Reservations Open Menu Close Menu Menu Our Story Photos Calendar Events & Private Dining Catering Reservations Open Menu Close Menu Menu Our Story Photos Calendar Events & Private Dining Catering Reservations Our Story Union Kitchen is a Contemporary American restaurant in the heart of West Hartford Center. The restaurant has been nominated two years in a row for Best Restaurant: Hartford County by the Connecticut Restaurant Association. The Food Chef Tim East is a fan of seasonal cooking. At Union Kitchen, Tim showcases lighter & fresher dishes with a focus on vegetables. Dishes on the menu combine innovation and tradition. Don’t be surprised to find unique, regional dishes alongside New American classics. The Wine Our four-time Wine Spectator award winning wine list focuses on farmers and producers who are committed to quality winemaking often following organic, biodynamic, and sustainable practices. Most importantly, the goal is to showcase wines that are delicious and speak to a sense of place. The Cocktails Bar Manager MeKayla’s craft cocktail menu leans into an impressive spirit wall that displays over 450 labels. The team is also proud to boast the state’s largest collection of amari and an impressive cellar beer collection. Meet Our Team Vish Badami DIRECTOR OF OPERATIONS Vish was born with a passion for hospitality despite being the first in his family to venture into the restaurant world. He is most comfortable on the floor of a dining room- talking to guests about exciting wine producers, crafting beverage menus with the bar team and working with the front of house and kitchen team towards a shared vision. His career has included managing restaurants that have been recognized by the James Beard Foundation (Rasika in Washington DC) and San Pellegrino’s World’s 50 Best (Indian Accent in NYC). After taking a break to get his master’s degree from the Hotel School at Cornell University, Vish moved to his wife’s hometown of West Hartford to be closer to family. Vish is a certified sommelier with the Court of Master Sommeliers and is currently pursuing his advanced certificate. Tim East HEAD CHEF With a focus on contemporary cooking and clean flavors, Tim’s kitchen philosophy has always been, technique driven and ingredient focused. After honing his craft with both internationally recognized chefs such as Todd English, and Bobby Flay, and at renowned local restaurants like the former Cavey’s in Manchester, Tim took the reins at Union Kitchen in West Hartford. At Union Kitchen he worked to modernize and elevate the menu to offer a mix of creative dishes and familiar standbys. Curiously minded and forward thinking, Chef Tim finds inspiration for his dishes from many different sources, it could be an old Appalachian recipe that was passed down by his family or from one of the teams many food trips to numerous world class restaurants or simply from flipping through his collection of over 250 cookbooks. The menu at Union Kitchen is constantly changing and ever evolving. Tim is beyond excited to lead the culinary program at Union Kitchen and its sister restaurant Crush Wine bar and share his unique take on Modern American dining. Jill Feldman GENERAL MANAGER A West Hartford native, Jill grew up in a family of adventurous eaters where food and travel were always at the center of conversation. After graduating with a master’s degree in clinical psychology, Jill paused her doctorate pursuit journey for what she thought would be a brief intermission. She moved to New York City, got a job in a restaurant, and fell in love with serving others. She decided to start a career in hospitality. She has worked in a range of restaurants from small neighborhood spots in Brooklyn to award winning tasting menu restaurants in Manhattan. Jill loves taking care of guests and thrives on human connection. She firmly believes that hospitality comes first and people will always remember how they are treated. After moving back home to be closer to family, Jill joined her husband Vishwas at Union Kitchen as assistant general manager. She is excited to lead the team as Union Kitchen continues to grow. MeKayla Roy BAR MANAGER MeKayla Roy is a Connecticut native who has been fortunate to live all over the world, from Georgia to Ireland. She’s grown up in the world of hospitality and truly loves witnessing what the power of good hospitality can do for people. When she’s not behind our marble, she’s busy training hospitality establishments de-escalation techniques as a partner with the Connecticut Safe Bars chapter. In short, Ms. Roy is 1 part bartender, 2 parts activist, and 3 parts hospitality aficionado, stirred and best enjoyed straight up. info@unionkitchenct.com (860)598-8000 Click Here for Job Openings Click Here to Order Online Hours Monday - Thursday 4PM-9PM | Friday & Saturday  11AM-10PM | Sunday 11AM-8:00PM 43 LaSalle Rd. | West Hartford, CT | 06107 Legal Notices"
    },
    {
      "url": "http://unionpizza.com/union-squared-evanston",
      "text": "Union Squared Evanston, Detroit Style — UNION GROUP HOMEPAGE Union Pizzeria Union Squared UNION GROUP HOMEPAGE Union Pizzeria Union Squared Union SQUARED EVANSTON Purchase a digital gift card Order for pick up PICK UP Orders & dining room open CLOSED MONDAYS SUNDAY, TUESDAY, WEDNESDAY 4:00 - 9:00PM THURSDAY - SATURDAY 4:00 - 10:00PM CALL: 2 2 4 - 7 1 4 - 3 1 0 0 Summer Thursday Bocce sign up Opens May 15th! Come check out our Bocce courts! Available to customers during regular business hours.                                                                                                   Spring session of our Thursday night tournaments available for Sign up is available through our online ordering platform Space is limited! Sister restaurant to Union Pizzeria & Union Squared Chicago, Union Squared Evanston features Detroit-style pan pizzas in this charming little Evanston hot spot. If you’re not familiar with Detroit-style pies you don’t know what you’ve been missing! It’s a regional Michigan favorite baked in a custom black square (technically a rectangular) metal pan that is made in Detroit, of course. It has a light  and fluffy focaccia-style crust with a buttery bottom and crispy edges that is then topped off with the creamiest Wisconsin Brick cheese and finally finished with the most delicious tomato sauce you’ll ever eat. Our newest spot offers 15 indoor seats, plus a generous 50 seat beer garden just behind the restaurant. The menu includes 11 staple pies & rotating a special that can be ordered whole, or you can choose from two of our classics in individual 1/4 pie size, three salads, hot spinach dip appetizer and warm chocolate chip blondie. For drinks choose fromLocal Temperance & Sketchbook beers on draft and many other breweries.                                                                                   We now offer wine by the bottle & glass and Boozy Slushies. PURCHASE A GIFT CERTIFICATE Union Squared beer garden reservations are now available for 6 or more only. Beer garden is open after May 8th weather permitting, 60° or higher with no rain. Order Online for pick up only MENU View our menu → ALWAYS CLOSED: Labor Day Memorial Day Easter Sunday July 4th Thanksgiving December 24th, 25th January 1st CARRYOUT ORDERS & RESERVATIONS ARE ACCEPTED BETWEEN: Monday - Closed Sunday & Tuesday-Thursday 4pm–*9:00pm Friday & Saturday 4pm–*10:00pm *or until we run out of dough BEER GARDEN Open weather permitting! No rain & 60 degrees or higher. Dining is first come, first served. Reservations accepted for groups of 6 or more. Interested in renting out Union Squared for your event? Check out our PRIVATE EVENTS PACKET 2024 Please contact Events@unionpizza.com if our beer garden is the right fit for your event! CONTACT Union Squared Evanston 1307 Chicago Avenue Evanston, Illinois Phone: 224 714 3100 General Inquiry Email: heather@unionpizza.com Facebook: facebook.com/unionpizzasquared/ View our calendar of events Back To Top Union Pizzeria, 1245 Chicago Avenue, Evanston, IL, 60202, United States 8474752400 heather@unionpizza.com UNION SQUARED EVANSTON 1307 Chicago Avenue Evanston, IL 224-714-3100 News & Reviews UNION PIZZERIA 1245 Chicago Avenue Evanston, IL 847-475-2400 News & Reviews Cart ( 0 )"
    },
    {
      "url": "https://www.sdtaproom.com/contact",
      "text": "Get in Touch with SD TapRoom | Contact Us Today — SD TapRoom 0 Skip to Content Beer Draft List Bottles Wine & more Pliny the Younger Food Brunch Brewery (North Park) Reservations Private Events Contact Contact Us Employment Fundraiser Hosting Gift Cards About About Events Press Open Menu Close Menu Beer Draft List Bottles Wine & more Pliny the Younger Food Brunch Brewery (North Park) Reservations Private Events Contact Contact Us Employment Fundraiser Hosting Gift Cards About About Events Press Open Menu Close Menu Folder: Beer Back Draft List Bottles Wine & more Pliny the Younger Food Brunch Brewery (North Park) Reservations Private Events Folder: Contact Back Contact Us Employment Fundraiser Hosting Gift Cards Folder: About Back About Events Press Visit us 1269 Garnet Ave. San Diego, CA 92109 (6 blocks from the beach) mgmt@sdtaproom.com // (858) 274-1010 Hours Mon – Thurs: 10:30am – 11:00pm Fri & Sat : 10:00am – 12:00am Sun: 10:00am – 11:00pm Kitchen Hours Mon – Thurs: 10:30am – 9:30pm Fri & Sat : 10:00am – 10:00pm Sun: 10:00am – 9:30pm Brunch Hours Sat & Sun 10:00 am – 1:00 pm Hit us up! Name * First Name Last Name Email * Subject * Message * Thank you! LOCATIONS PACIFIC BEACH 1269 Garnet Ave. San Diego, CA 92109 (858) 274-1010 Mon – Thurs: 10:30am – 11:00pm Fri & Sat : 10:00am – 12:00am Sun: 10:00am – 10:00 pm Pizza Delivery in Mission Beach Pizza Delivery in Pacific Beach NORTH PARK 2000 El Cajon Blvd. San Diego, CA 92104 (619) 539-7738 Mon - Friday:  11:00am - 11:00pm Sat & Sun: 10:00am - 11:00pm Subscribe Stay informed, deals, discounts, etc. Email Address Sign Up Thank you! Check your email to confirm subscription. Copyright © 2025 TapRoom Beer Company. All Rights Reserved. Privacy Policy"
    },
    {
      "url": "https://annarborobserver.com/the-restaurant-as-sleepover/",
      "text": "The Restaurant as Sleepover - Ann Arbor Observer TRENDING: A Paletería in Scio Vintage media, flowers, and immigrant crafts at Lobby Shops Your Media Exchange Takes Diggers’ Spot A Convenience Store at Briarwood Mall? Samba Bowls and Buff City Are Gone Advertise Contribute Subscribe Login News Education Government Business Environment Health Sports Crime Maps a2view Marketplace Dine Restaurant Reviews Real Estate My Neighborhood Events Today This Month Nightspots Concerts Galleries Senior Events Kids Events Event Reviews Submit Events Community Nonprofit News Profiles My Town Family Summer Camps Fake Ad and I Spy Issues Blogs Pulp – AADL Arts News Memorials / Obituaries Guides Ann Arbor Chelsea Dexter Saline Select Page Search The Restaurant as Sleepover A soft-power couple reimagines Fingerle’s millwork shop. By Dave Algase\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t| [email protected] Nov 22, 2022 | Dine , Marketplace | Comment: 1 | An hour with Ann Stevenson and Curt Catallo in the open lounge of their newest restaurant, Union Rec , leaves the distinct sense of a soft-power couple comfortably in their element. They plan to open their long-awaited creative reuse of Fingerle Lumber’s millwork shop to the public November 30. “We did not have a business background,” Ann Stevenson says, “but we’ve developed it over these last twenty-eight years.” She and husband Curt Catallo just added Union Rec on S. Main to their metro Detroit collection. | Photo: J. Adrian Wylie Catallo, from Clarkston, and Stevenson, a Minnesota native, met at Bennington College in Vermont. Armed with her liberal arts degree, the fine-arts major followed him back to Michigan in 1991 and lived at William and Third, giving private art lessons and teaching pre-K at the Ann Arbor YMCA. They married in 1997 in Minneapolis, then settled in his hometown. Catallo’s parents had bought an old Baptist church there, mainly to save it from disrepair. The couple turned it into the Clarkston Union Bar & Kitchen. It did so well that they began opening more. Their locations are now into the double digits. “We did not have a business background,” Stevenson notes, “but we’ve developed it over these last twenty-eight years.” Scattered across metro Detroit, their Union Joints restaurants all repurpose existing structures into individually themed culinary community fixtures. “You know what else makes us a little insane is that we design and build them and brand them ourselves,” Catallo says. The largest and, until now, the newest is the 503-seat Union Assembly on Woodward Ave. in downtown Detroit, which includes a venture named Mom’s Spaghetti, in conjunction with Eminem. Union Rec—short for “Recreation”—will serve morning coffee and American comfort food and drinks in the former mill off S. Main. Along with the main building, the three-quarter-acre site includes two sheds and a surface parking lot, a rarity in that area. Parking’s free except for football game days, when the ten-minute walk to Michigan Stadium makes it a tantalizing tailgate venue. Stevenson and her design team, including a contractor on staff, were up for the challenge of reimagining a space that had supplied lumber for all their previous build-outs, by way of local carpenter and longtime friend Cameron Magoon. Ironically, Union Rec is the first Union Joint to be built without Fingerle lumber—the company closed in 2019 after eighty-eight years in business. The Fingerle family sold their main lumberyard to the U-M, but Stevenson and Catallo got the mill. “It’s a gray concrete box. So the idea is: How do you transform it into something that has a little bit of alchemy to it?” Stevenson reflects. She was inspired by Magoon’s son Cole, who got an early look at the site and saw its potential for “like, the best sleepover.” “And I said, ‘That’s exactly it’—that folly and that festiveness of having limitless choices. And that was a ton of fun being able to think about a kid designing their own fort.” They came up with largely open floor plan that includes a lunch counter, bar, a private dining room, and a central fireplace encircled by unmatched chairs. Most were salvaged and reupholstered in “a cacophony of clashing prints—but that gives them that dynamic spirit,” Stevenson says. Concrete structural posts are wrapped in afghan knits and other softening textiles. Large-screen TVs seem to blend into the background inconspicuously when not in use. “It’s gonna be big-spirited food in a big-spirited space,” she says. The menu shows a similar level of craft, partially flavored by their long familiarity with Ann Arbor (son Cassius is a U-M sophomore; daughter Coco is a freshman at Sarah Lawrence) and by pandemic-era Zoom focus groups with a U-M fraternity house. Though Union Joints have diverse menus, the couple say, they’re all grounded in a shared concept: It’s food your grandma might have served—whether your grandmother came from Dexter or Ecuador or Tokyo. “With this community, we had a license to kind of push our comfort food a little further,” says Catallo. “It’s pretty messy and sharable and visceral,” Stevenson adds. “That idea of what American is is really broad, as it should be, right? And so it’s barbecue, but it’s also Latin flavors as well.” Alcoholic offerings reflect the couple’s affinity for tequila and mezcal, as well as a slushy machine for margaritas and a rum concoction called a Painkiller. They could’ve used a stiff one back in the pivotal month of March 2020, when Ann Arbor State Bank put off their closing scheduled for the 17th. “And the bank said, let’s wait a week,” Catallo recalls, “That bank was absorbed by Level One, who we have a great relationship with, but they weren’t looking to loan a restaurant any money during a pandemic, and they were already helping us on one.” Riding to the rescue was none other than investor Roger Penske Jr. “He and his wife Jennifer have been friends for twenty-five years,” Stevenson relates, “And they’re very gracious about being fans of what we do. And they said, ‘Hey, if you ever want a partner, you know, keep us in mind.’ “We definitely were in need, and he came through and just said ‘yep’ without a doubt. We’ve learned a lot from him, and especially just about having really high expectations about how things are done.” “He wants to be a part of what we’ve been doing for twenty-eight years without changing it,” Catallo says. “What a gift to have in a partner.” It was Penske’s idea to add an employee scholarship program here to incentivize local workers still in school. Both owners also eagerly share credit with a barback they hired nineteen years ago at their first joint. Julie Lattanzi went on to earn her degree in human resources from Wayne State in 2014 and create their company’s HR department when it grew to need one. Union Joints now employs about 750, Lattanzi reports, including seventy-eight at Union Rec as of November 11. (Forty-four percent live in Ann Arbor and 28 percent in Ypsilanti.) Lattanzi says they currently have 340 job openings across the company, and will need at least thirty more for Union Rec to realize plans to open for lunch and continue to develop the site’s (including rooftop) potential. Stevenson praises Lattanzi as a “creative thinker,” citing initiatives like same-day worker pay. Catallo humbly sums it up: “She created the culture.” “For the record, I would have never gotten into Michigan,” Catallo offers jovially. “My only talent is finding talent. So I’m behind the curtains, and Ann’s building the curtains.” Union Rec, 545 S. Main St., (734) 636–9999. Opening expected Nov. 30, Wed.–Sat. hours TBD. unionjoints.com Share: Rate: 1 Comment Jeri lynn lasich on December 30, 2022 at 9:35 am I love being a manager at Union Rec! We are so excited to open to the public November 30th! Come visit us for dinner at 5pm or our coffee shop at 7am! Reply Leave a reply Cancel reply Your email address will not be published. Required fields are marked * COMMENT Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Δ Previous Basketball prospects Next Tea and Cocktails Upcoming Events September 11, 2025 U-M Museum of Natural History Planetarium & Dome Theater Various Times September 11, 2025 Dressage Shows: Waterloo Hunt Club 8:00  am September 11, 2025 “Fall Migration in Nichols Arboretum”: Washtenaw Bird & Nature Alliance 8:00  am September 11, 2025 “Cavanaugh Lake Ride”: Ann Arbor Bicycle Touring Society 10:00  am September 11, 2025 “India Unveiled”: U-M Osher Lifelong Learning Institute Thursday Morning Lecture Series 11:00  am View All Events Upcoming Nightspots View Upcoming Nightspots Twitter Facebook Instagram Mailing address: PO Box 1187 Ann Arbor, Michigan 48106 Phone: (734) 769-3175 About Us a2view Issues Contact Privacy Policy News Marketplace Events Community Guides Books Advertise Contribute Subscribe © 2025 Ann Arbor Observer. Michigan web development by Boxcar Studio ."
    },
    {
      "url": "https://uniontaproomwh.com/contact/",
      "text": "Contact - Union Taproom Search for: MENU MENU What’s On Tap The Experience THE KITCHEN Events Contact GIFT CARDS Contact Us Contact Info 245 West Central Avenue, Suite 102 Winter Haven, Florida 33880 (863) 268-4921 info@uniontaproomwh.com Taproom Hours Monday – Thursday : 11:30 AM – 10 PM Friday – Saturday: 11:30 AM -11 PM Sunday : 11:30 AM- 8 PM Union Taproom We have 40 self pour taps filled with an ever-changing variety of craft beer, ciders, wine, cold brew coffee & kombucha. \r\n Bring along your family, friends, and even your pooch!  At Union Taproom, we bring people together..one brew at a time. Contact 245 West Central Avenue, Suite 102 Winter Haven, Florida (863) 268-4921 info@uniontaproomwh.com Taproom Hours Mon - Thurs:  11:30 AM - 10 PM Fri and Sat:  11:30 AM - 11 PM Sunday:  11:30 AM - 8 PM Copyright 2023 Union Taproom | All Rights Reserved | Designed and Maintained by Cohen Creek"
    },
    {
      "url": "https://www.unionpiepizza.com/about-1",
      "text": "About Us — UNION PIE ORDER Locations Menu About Us Contact ORDER Locations Menu About Us Contact Scroll WELCOME About Us My family and I have always been obsessed with music…and pizza. We grew up in New Jersey and moved to the D.C. area in 2001 to open Jammin Java, a music club in Vienna, VA. We missed the pizza in New Jersey. In 2017, we opened Union Stage, a music club at The Wharf in Washington, D.C. We were under such pressure to get Union Stage open in time that we opened with a “pizza only” menu, planning to add more items soon. The pizza was such a hit that we never added anything else! Word spread quickly about the delicious and unique pizza at Union Stage and The Wharf asked us to open the stand-alone kiosk in September 2018. We named it “Union Pie” - a name that connects the pizza’s origins at Union Stage and the “bar pie” style pizza we serve. We now serve Union Pie pizza at the kiosk, Union Stage, and Jammin Java and have plans to open more locations. Union Pie serves a unique style of pizza called a “bar pie” or “bar pizza”. It is common in New Jersey and New  York. It has a very thin crust with very high-quality toppings that go all the way to the edge of the pizza. - Luke Brindley About - Header luke@unionpiepizza.com Hours Locations Menu About Contact"
    },
    {
      "url": "https://www.tapandkitchen.com/",
      "text": "Tap & Kitchen | Home | Waterside Restaurant & Bar in Oundle, Northamptonshire Oundle Wharf, Station Road, Oundle, PE8 4DE Call: 01832 275 069 Click for Map Menu About Contact Our Food Menus Private Hire FAQ Social Oundle Wharf ***SATURDAY 20TH SEPTEMBER, WE ARE CLOSED FROM 5PM FOR A PRIVATE FUNCTION, LUNCH AND BAR AS NORMAL*** Christmas day bookings now open, get in touch!!! We open 7 days a week serving lunch & dinner. the bar is open all day every day. for all bookings please call 01832 275 069 or email info@tapandkitchen.com About Tap and Kitchen is a waterside restaurant and bar at Oundle Wharf, Northamptonshire. Unfussy, honest dishes comprise simply cooked ingredients sourced locally, where possible. Always prepped and cooked passionately,  with attention to details that matter. We make pretty much everything ourselves from pasta to puddings through to chutneys and sauces and even home cured bacon, sausages and smoked meat & fish. Daily service covers coffee, lunch, bar food and dinner, we cater for group dining bookings also. A friendly bar serves an extensive range of drinks including beers from our Nene Valley Brewery. Menus are uploaded daily with seasonal variety.  Get in touch with any enquiries, we love talking… Dan & the team Contact Contact Tap & Kitchen Oundle Wharf, Station Road, Oundle, Northamptonshire PE8 4DE The Bar Is Open... Monday to Saturday 11.30am - 11pm Sunday & Bank Holiday Monday 11.30am - 9pm The Kitchen Is Open... Monday to Sunday Lunch 12 - 3pm Monday to Thursday Dinner 6 - 8.30pm Friday & Saturday Dinner 5.30 - 9pm Sunday & Bank Holiday Monday Dinner 6 - 8pm We are dog friendly in the bar areas and outside benches Dogs must be well behaved (quiet) and kept on a lead All weekend bookings of 8+ require a deposit, all bookings of 10+ must be requested via the email address below For all other enquiries: Tel: 01832 275 069 Email: info@tapandkitchen.com Sign up for T&K news Sign Up Our Food Tap & Kitchen is a waterside restaurant and bar at Oundle Wharf, Northamptonshire. Unpretentious, honest dishes comprise simply cooked ingredients sourced locally wherever possible and presented with neither pomp nor fuss. Our bar showcases beers from our sister company Nene Valley Brewery. In addition to the expected wide range of beer, we have an extensive wine list, many of which are available by the glass. Our cocktail selection will not leave you disappointed. We were previously awarded Best Restaurant, at the Northamptonshire Food & Drink awards, a recognition that we are very proud of and dedicate to our hard working team. We have also been runner up twice. For larger groups and those with time to work with Head Chef Chris to select food in advance, we have a feasting menu that allows customers to select the dishes that they would most like to share with their friends. Not only are we open for lunch and dinner but we also serve coffee in the bar which is open all day. We cook with the best produce which varies seasonally and with the market, we change our lunch and dinner menus daily and post these online before each service. Since we opened in 2014, we have deepened our supply chain to focus on food heroes who are really committed to bringing the best ingredients that we can source.  Daily delivered fish from Stickleback, Wing of St Mawes and AO Seafoods, the best Hereford Beef from Johnsons, and everything in between. In addition, our own farm in Wigsthorpe delivers well hung hogget in season and Tamworth/Oxford Sandy Black cross pork as well as providing a steady supply of seasonal game, vegetables and fruit. A Swaps’ Board enables us to take the freshest, seasonal produce from private individuals and small local suppliers in exchange for credit in the restaurant or behind the bar. We butcher and cure our own meat, stuff our own sausages, bake our own bread, make fresh pasta, sauces, jams, chutneys, cakes and pickles. We will always try to accommodate requests and amendments where possible, taking in to account personal taste as well as dietary needs. We have particular personal experience of gluten allergies, the majority of our NVB beer being gluten free and many of our coeliac guests come time and time again for a great choice of food & drink. Read more Menus dining updated daily View/Download Lunch 10th September View/Download Set Lunch 8th - 12th September View/Download Dinner 10th September View/Download Friday & Saturday Dinner View/Download Sunday Lunch 7th September View/Download Children beer wine cocktails View/Download Draught Beer & Cider View/Download Wines View/Download Cellar Wines View/Download Cocktails Feasting - Pre Booked Only View/Download Feasting Sample 2025 Festive Menus View/Download Christmas 1st to 23rd Dec View/Download Christmas Day Lunch View/Download Festive Opening Times Social instagram tapandkitchen When you’re committed to simple striking flavour ***SATURDAY EVENING 20th SEPTEMBER*** \n\nWe are clo We have a new cellar wine with us today…. The ce The new kid on Tap 8. With the import issues affec The tomato gazpacho had been very popular this sum We bake in house all our brioche buns, sandwich br Load More... Follow on Instagram facebook /tapandkitchen Work With Us We are always on the lookout for fresh talent to join our growing team. Whether you love cooking the best produce with the best ingredients, the challenge of creating innovative cocktails, or providing service with a smile, you’ll find like minded people at the Tap & Kitchen. If that sounds like you, drop us an email: info@tapandkitchen.com or call us on 01832 275 069, or better still drop in and say hi! Have a genuine passion for food & people? GET IN TOUCH Oundle Wharf Oundle is a historic market town in Northamptonshire famous for its Georgian streetscapes and impressive limestone buildings. There is much to discover whether you are on the history trail, attending one of the many cultural events or want to enjoying active country pursuits. Located in Oundle Wharf, we are especially fortunate to have great neighbours that we are proud to call friends of Tap and Kitchen. With an extensive cookware collection in-store, you’ll be sure to ﬁnd everything you need to create the perfect AGA kitchen. Visit website Opened In September 2008, Hambleton Bakery produces top quality traditionally made bread for various shops, outlets, cafes and restaurants including Tap & Kitchen. Visit website Amps Fine Wines is a 4th generation independent wine merchant based in Oundle, boasting shelves bursting with an exciting range of wines from around the world. Visit website Buy packaging free foods (inc pulses, fruits, nuts, spices, herbs, pastas etc), toiletries and household cleaning liquid refills as well as other essential reusable items to help you reduce waste. The Refill popup is here every Tuesday Visit website Authentic local brewery offering a quality range of beer and ales. The Brewery Shop is open Fridays 11.30am-5.30pm and Saturdays 12-4pm. You can also order online. Visit website Stocking entry level to state-of-the-art competition bikes as well as totally bespoke built bikes. We also regularly hold organised rides. Visit website Tap & Kitchen, Oundle Wharf, Station Road, Oundle PE8 4DE. Tel: 01832 275 069 . Email: info@tapandkitchen.com © 2014-2024 Tap & Kitchen. All Rights Reserved. Website designed by Nephew Media"
    },
    {
      "url": "https://unioncraftbrewing.com/well-crafted/",
      "text": "UNION Craft Brewing Well Crafted Kitchen is Cookin' at UNION Collective - UNION Craft Brewing Visit Us UNION Hall & Beer Garden Take A Tour! Beers Find Our Beer News & Events Latest News Upcoming Events Host Your Event Store Beer Unites About Union Write Us Donations Distributor Portal Visit Us UNION Hall & Beer Garden Take A Tour! Beers Find Our Beer News & Events Latest News Upcoming Events Host Your Event Store Beer Unites About Union Write Us Donations Distributor Portal Well Crafted Kitchen is Cookin’ at UNION Collective Well Crafted Kitchen to Open at Union Collective From Mobile to Mortar, Wood Fired Pizza Catering Business Expands Baltimore, March 12, 2018 —Baltimore-based wood fired mobile pizza catering business Well Crafted Pizza is opening Well Crafted Kitchen ( www.wellcraftedkitchen.com ) adjacent to the Union Craft Brewing taproom at Union Collective this summer, coinciding with the brewery’s opening. The new 920-sq.-ft.-kitchen will serve locally-sourced foods to enhance the guest’s brewery experience. With a commitment to working with local farmers and producers, Well Crafted Kitchen will feature a seasonally inspired menu of creative, unique, and traditional wood fired small plates, snacks and pizzas. Sample menu items include Well Crafted’s signature wood fired pizzas, as well as wood fired kabobs, sausages, stuffed spuds, and soft pretzel dippers. The menu will feature items that pair well with Union’s beers, and will vary seasonally, based on the availability of local ingredients. In addition, Well Crafted plans to host regular collaborations, pairings, and “kitchen takeovers” with Union Craft Brewing and various Baltimore-based makers to create a one-of-a-kind offering that enhances Baltimorean’s and visitor’s experiences at the Union Craft Brewing taproom. Well Crafted’s current mobile wood fired pizza kitchen will continue to operate as a catering vehicle, serving private events in the Baltimore area. “We are so excited to share a permanent space with our friends, and talented brewers, at Union Craft Brewing. Having a space to celebrate the everyday, surrounded by so many incredible Baltimore makers within the Union Collective, is truly an honor. Opening Well Crafted Kitchen provides an opportunity for us to not only share our love of genuine local food, but to celebrate and showcase all of the farmers, growers, makers, artists, and creative thinkers we have the honor of working with in Baltimore and the surrounding area. We are grateful for the community support we’ve received over the past two years and couldn’t imagine this new adventure in any other place,” said co-owner, Liz Bower. “To create a better experience in our new taproom, we felt the need to add a food partner to serve our visitors. The decision to approach Well Crafted to take over the space was an easy one. They are fantastic, honest people dedicated to making a fantastic, honest product while showcasing local farmers and their products. They’ve done an outstanding job with their truck, and care deeply for how their ingredients are sourced.  Through this collaboration we can provide them with both a space and an audience for them to expand on that success. We know that their food and brand will be the perfect complement to our tap room, and I think we’re going to have a lot of fun together,” said Jon Zerivitz, co-owner of Union Craft Brewing. ABOUT WELL CRAFTED: Well Crafted was established in April 2016 by four co-owners – Laura Wagner, Tom Wagner, Liz Bower, and Ryan Bower – who are on a mission to bring people together through a shared local food experience. The mobile wood fired pizza catering business is built onto the back of a 1949 Dodge truck. Well Crafted aims to facilitate a unique and quality food experience that creates an opportunity for all people to share, engage, and connect with their food, each other, and their place in the world. Stay connected at www.wellcraftedkitchen.com , on Instagram and on Facebook . About UNION Collective: UNION Collective will transform 10.5 acres and 138,000 square feet of warehouse space located at 1700 W. 41st Street in Baltimore’s neighborhood of Hampden-Medfield into an interactive and collaborative assembly of several of Baltimore’s growing independent businesses. With 87,000 square feet adjacent to UNION Craft Brewing’s new headquarters, brewery and taproom, the project will be home to eight other commercial tenants. Local makers, non-profits, and other businesses will produce and sell their wares on site, share resources, collaborate, and connect with the community at large. For more information, visit www.union-collective.com . ### Share: Share Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to email a link to a friend (Opens in new window) Email Categories Select Category Beer Release Events Jobs News Press Progress Update Special Tap Room Uncategorized Get Social Upcoming Events Current Month Date august UNION Craft Brewing at UNION Collective 1700 W 41st Ste 420 Baltimore, MD 21211 tue 05 aug 6:30 pm tue 6:00 pm Game Watch: O's @ Phillies UNION Craft Brewing at UNION Collective 1700 W 41st Ste 420 Baltimore, MD 21211 tue 05 aug 8:00 pm tue 10:00 pm Greg's Shitty Trivia Night Stay in touch Leave this field empty if you're human: © 2025 UNION Craft Brewing All Rights Reserved. (410) 467-0290 • 1700 W 41st St, Suite 420 Baltimore, MD 21211 X"
    },
    {
      "url": "https://uniontaproomwh.com/",
      "text": "Union Taproom | Self Pour Taproom for Craft Beer, Ciders, Wine & More Search for: MENU MENU What’s On Tap The Experience THE KITCHEN Events Contact GIFT CARDS Slide Union Taproom & Pizza Kitchen Union Taproom & Pizza Kitchen A Self-Pour Taproom featuring craft beer, cider, and wine. Try our pizza, sandwiches, and salads. A Self-Pour Taproom featuring craft beer, cider, and wine. Try our pizza, sandwiches, and salads. Sign up for our mailing list to stay updated with all things Union Taproom Sign up for our mailing list to stay updated with all things Union Taproom JOIN OUR TAPROOM COMMUNITY JOIN OUR TAPROOM COMMUNITY What's On Tap? Check out what we currently have on tap. VIEW WHAT'S ON TAP Welcome To Union Taproom Pour and Pay by the Ounce Bringing folks together, one brew at a time. We have 40 self pour taps filled with an ever-changing variety of craft beer, ciders, wine, cold brew coffee & kombucha. Bring along your family, friends, and even your pooch! At Union Taproom, we bring people together..one brew at a time. #PYOB Pour Your Own Beer What's Happening at the Taproom? BOOK YOUR EVENT BOOK NOW! EMAIL US WEEKLY TRIVIA LIVE Trivia Wednesday! Pizza Special Monday All Day How It Works The in's and out's of the self pour taproom! 1. Check In Easily start a tab by presenting a driver's license and credit card to one of our friendly and knowledgeable staff members. You will be given an RFID bracelet to unlock the taps and begin your self pour adventure. 2. Head to the Tap Wall Head on over to the tap wall, grab a glass and explore. Here you will find 32 craft beers, four wines, two domestic beers, kombucha and cold brew coffee. All our beverages are priced per ounce. You can sample as much as you’d like or pour a full glass. Your bracelet keeps track of ounces poured. (Tap to Tab) Each tablet displays all the info you need; ABV, IBU, Brewery Info and price per ounce. Need help choosing? Not to worry! Our Taproom Crew are here to help! We can walk you through all of our different options! 3. Enjoy! Sit back, sip, & enjoy your pour! 4. Close Your Tab When it's time to leave, simply bring your bracelet back to our front counter. Our staff will scan and present you with an itemized receipt. 5. Tell a Friend! Tell a friend about Union Taproom & come back soon! You never know what you'll find on tap, next time. Our tap selections are always changing! Taproom Hours Monday – Thursday : 11:30 AM – 10 PM Friday – Saturday: 11:30 AM -11 PM Sunday : 11:30 AM- 8 PM FOLLOW US! @UnionTaproom This error message is only visible to WordPress admins There has been a problem with your Instagram Feed. Union Taproom We have 40 self pour taps filled with an ever-changing variety of craft beer, ciders, wine, cold brew coffee & kombucha. \r\n Bring along your family, friends, and even your pooch!  At Union Taproom, we bring people together..one brew at a time. Contact 245 West Central Avenue, Suite 102 Winter Haven, Florida (863) 268-4921 info@uniontaproomwh.com Taproom Hours Mon - Thurs:  11:30 AM - 10 PM Fri and Sat:  11:30 AM - 11 PM Sunday:  11:30 AM - 8 PM Copyright 2023 Union Taproom | All Rights Reserved | Designed and Maintained by Cohen Creek"
    },
    {
      "url": "https://visitcentralflorida.org/featured/union-taproom/",
      "text": "Union Taproom - Polk County - Visit Central Florida Skip to content Go to VISIT CENTRAL FLORIDA SPORTS Open main menu Close main menu Deals & Specials Welcome Center Meetings & Conventions Travel Guide Blog Search Search for submit Events See & Do Eat & Drink Stay Cities & Towns Meetings Deals & Specials Facebook Twitter Pinterest Instagram YouTube Union Taproom Union Taproom in downtown Winter Haven features 40 self pour taps filled with an ever-changing variety of craft brews, ciders, wine, cold brew coffee & kombucha. This is a bar, minus the bartenders. At Union Taproom craft brews, ciders, wine and more are self-serve. With more than 40 different taps to choose from, you can’t say you couldn’t find anything to try. Kids and dogs are welcome. Union Taproom: Self-Pour Brewery No more are the days of ordering that pint of a new craft beer only to find out it doesn’t necessarily tickle your taste buds fancy.  Just try a few ounces, then try something else. At Union Taproom, they give you the opportunity to find what you like most or to enjoy a good variety while you’re out with friends or family. Here’s How it Works: 1. Check-In Easily start a tab & get your RFID bracelet to unlock the taps and begin your self pour adventure. 2. Head to the Tap Wall Here’s where the fun begins! Head on over to the tap wall, grab a glass and explore. All beverages are priced per ounce. You can sample as much as you’d like or pour a full glass. Your bracelet keeps track of ounces poured (Tap to Tab). Each tablet displays all the info you need; ABV, IBU, Brewery Info and price per ounce. Need help choosing? The Taproom Crew is always willing to help! 3. Enjoy! Sit back, sip, & enjoy your pour! 4. Close your Tab When it’s time to leave, simply bring your bracelet back to our front counter to close out your tab. 5. Tell a Friend! Tell a friend about Union Taproom! You never know what you’ll find on tap, next time. Their tap selections are always changing! Food Offerings Hungry after trying Union Taproom’s various beer selections? Make sure to grab a bite to eat! Their full menu features appetizers, sandwiches, and brick oven pizzas with offerings like Pepperoni Blast, Margarita, or Truffle Mushroom. Looking for beer savings? Check out our Adventure on Tap: Central Florida Craft Beer Pass ! Follow us on Instagram for more local favorites! ADDRESS 245 W Central Ave #102 Winter Haven,  33881 CONTACT INFO info@uniontaproomwh.com 863-268-4921 Visit Website LEARN & DISCOVER Staff Picks – Our Favorite Places for Coffee and Beer Local brews, both cold and hot, are what we love and our staff compiled a list of favorite coffee shops,... See Details Guide to Local Breweries in Central Florida What’s better than a cold beer on a hot Central Florida day? In our opinion, nothing! There are some amazing... See Details Adventure On Tap See Details A-Z Guide to Dining in Central Florida Central Florida is home to some of the most unique variety of dining options. From delicious cruffins to some of... See Details Subscribe to EMAIL LIST Join our email list and stay up to date with all the great things happening in Central Florida. Notice: JavaScript is required for this content. Facebook Twitter Pinterest Instagram YouTube Central Florida Visitors & Convention Bureau 101 Adventure Court Davenport, FL 33837 1-800-828-7655 © 2025  Central Florida Visitors & Convention Bureau Polk County Savings Polk CVB Where Is Polk County, FL? Contact Us Film & TV Resources Travel Guide Media Professionals Privacy & Accessibility Travel Professionals Asset 2"
    },
    {
      "url": "https://unioncraftbrewing.com/",
      "text": "UNION Craft Brewing Home - UNION Craft Brewing Visit Us UNION Hall & Beer Garden Take A Tour! Beers Find Our Beer News & Events Latest News Upcoming Events Host Your Event Store Beer Unites About Union Write Us Donations Distributor Portal Visit Us UNION Hall & Beer Garden Take A Tour! Beers Find Our Beer News & Events Latest News Upcoming Events Host Your Event Store Beer Unites About Union Write Us Donations Distributor Portal GET YOUR TICKETS! VISIT UNION! Come see us Meet The Core Available all year long. Duckpin Pale Ale Divine IPA Skipjack Pilsner Lil’ Dipper Zadie’s Lager Hopwater Springs Thirsty yet? Here’s what we’ve got and where to get it. Beer Finder See where Union is on tap and on shelves! Beers Take a look through our past and present brews. UNION Hall & Beer Garden Come out and have a pint, grab some merch and take a tour. News What’s on our minds and up our sleeves 21 Aug 2025 WE’RE HIRING A Part Time Packaging Technician! Posted \t\t\t\t\t\n\t\t\t\t \n\t\tin Uncategorized UNION Craft Brewing was created around the idea that great beer has the power to unite diverse communities and invigorate neighborhoods and cities. Beer Unites! is not just a tagline, it’s the underlying philosophy of everything we believe in as a business. Good beer brings good people together for good times—and good works. Reports To:Packaging […] Read More 22 Jul 2025 WE ARE HIRING FOR TEAM TENT! Posted \t\t\t\t\t\n\t\t\t\t \n\t\tin Uncategorized Job summary:Team members will support and represent our UNION brand at in-store tastings and off-site events. Team Tent  facilitates UNION events in the Baltimore, DC, Delaware, and NoVA area, including but not limited to, set up and breakdown for events, providing education about UNION, the beers, and other products we carry, serving drinks and samples, […] Read More Get Social Upcoming Events Current Month Date september UNION Craft Brewing at UNION Collective 1700 W 41st Ste 420 Baltimore, MD 21211 wed 10 sep 6:30 pm wed 10:00 pm Game Watch: O's vs Pirates UNION Craft Brewing at UNION Collective 1700 W 41st Ste 420 Baltimore, MD 21211 fri 12 sep 7:00 pm fri 10:00 pm Game Watch: O's @ Blue Jays Stay in touch Leave this field empty if you're human: © 2025 UNION Craft Brewing All Rights Reserved. (410) 467-0290 • 1700 W 41st St, Suite 420 Baltimore, MD 21211 UNION Craft Brewing is committed to responsible drinking. You must be of the legal purchase age for alcohol (21 or over) to enter this site. X"
    }
  ]
}