{
  "fuentes": [
    {
      "url": "https://www.hydeparkbookclub.co.uk/contactus",
      "email": "contact@hydeparkbookclub.co.uk"
    },
    {
      "url": "https://www.nstowers.com/about-us/",
      "email": "lrappaport@nstowers.com"
    },
    {
      "url": "https://www.whittlebury.com/contact-us/",
      "email": "reception@whittlebury.com"
    },
    {
      "url": "https://www.sarasellssarasota.com/university-park.php",
      "email": "marker--hover--listing-stack@2x.png"
    },
    {
      "url": "https://www.sarasellssarasota.com/university-park.php",
      "email": "marker--listing-stack@2x.png"
    },
    {
      "url": "https://countryclubtrentpark.co.uk/contact/",
      "email": "enquiries@countryclubtrentpark.co.uk"
    },
    {
      "url": "https://upcai-fl.com/",
      "email": "pbm@upcai-fl.com"
    },
    {
      "url": "https://universityparkrd.com/about-us/",
      "email": "estoppels@pfm.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/university-park/",
      "email": "matt@naplesgolfguy.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/university-park/",
      "email": "info@naplesgolfguy.com"
    },
    {
      "url": "https://liveupark.com/",
      "email": "info@liveupark.com"
    },
    {
      "url": "https://www.bduedu.in/contact-us",
      "email": "eadmission@bdu.ac.in"
    },
    {
      "url": "https://www.bduedu.in/contact-us",
      "email": "u003eeadmission@bdu.ac.in"
    }
  ],
  "mails": [
    "contact@hydeparkbookclub.co.uk",
    "eadmission@bdu.ac.in",
    "enquiries@countryclubtrentpark.co.uk",
    "estoppels@pfm.com",
    "info@liveupark.com",
    "info@naplesgolfguy.com",
    "lrappaport@nstowers.com",
    "marker--hover--listing-stack@2x.png",
    "marker--listing-stack@2x.png",
    "matt@naplesgolfguy.com",
    "pbm@upcai-fl.com",
    "reception@whittlebury.com",
    "u003eeadmission@bdu.ac.in"
  ],
  "nombre_sitio": "universitypark-fl.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.hydeparkbookclub.co.uk/contactus",
      "text": "Contact Us — Hyde Park Book Club Events Music Comedy Arts, Literature & Yoga HPAC HPAC THE WRANTHORN ENQUIRER- 09/07/2025 - 21/09/2025 Slip Across These Planes- 18.01.2025 -15.03.2025- Menu Menu Book a table SHOP SHOP HPBC Gift Cards Label Contact Contact Us Find Us About Us Events Music Comedy Arts, Literature & Yoga HPAC HPAC THE WRANTHORN ENQUIRER- 09/07/2025 - 21/09/2025 Slip Across These Planes- 18.01.2025 -15.03.2025- Menu Menu Book a table SHOP SHOP HPBC Gift Cards Label Contact Contact Us Find Us About Us Contact Us CONTACT US PHONE 01132444105 EMAIL USE THE FORM BELOW Name * First Name Last Name Email Address * Message * Thank you! Back To Top Hyde Park Book Club, 27-29 Headingley Lane, Leeds, LS6 1BL, United Kingdom contact@hydeparkbookclub.co.uk Powered by Squarespace Cart ( 0 )"
    },
    {
      "url": "https://www.nstowers.com/about-us/",
      "text": "About Us - North Shore Towers and Country Club Skip to content NS Towers Life at the Towers Amenities Golf Tennis & Pickleball Fitness Center Pools Dining Clubs Shopping & Conveniences Additional Features Listings Browse Available Units Rentals Residential Homes All Active Listings Sold Floor Plans Photo Gallery Search the Surrounding Area Resident Resources Events Calendar Transportation Schedule Important Numbers Policies & Procedures About Our Team Meet Our Team Why Linda? About Us In the News Blog Posts Media Mentions Let’s Get Social! Contact Us Menu Life at the Towers Amenities Golf Tennis & Pickleball Fitness Center Pools Dining Clubs Shopping & Conveniences Additional Features Listings Browse Available Units Rentals Sold Floor Plans Photo Gallery Search the Surrounding Area Resident Resources Events Calendar Transportation Schedule Important Numbers Policies & Procedures Our Team Meet Our Team Why Linda? About Us In the News Blog Posts Media Mentions Let’s Get Social! Contact Us About Us About Us NS Towers 2025-06-05T12:33:07-04:00 About Us We are a Full Service Real Estate Company specializing in residential, condos, co-ops, rentals, commercial and relocation services. We meet all your real estate needs from New York City to Long Island. As of January 2017, North Shore Towers become a smoke-free building. North Shore Towers is a complex of three 33-story buildings with over 1,844 units on 110 luscious acres. Among its unique amenities are an 18-hole golf course, five har tru lighted tennis courts, heated indoor and outdoor pools, a movie theater, indoor shopping arcade, restaurants, and so much more. Because we are the Only On-Site Broker at North Shore Towers – We know Better. We are seasoned and resourceful. Sit down with us for a few minutes, and ask us your questions. You will be glad you did. Why Choose Linda Meet Our Team Get in touch Office: 718.423.3130 Mobile: 516.850.3135 Fax: 718.423.1403 Email: LRappaport@NSTowers.com 27240 Grand Central Parkway Building 2 Floral Park, NY 11005 Linda D. Rappaport, Realtor® | NY License #31RA1008518 | 27240 Grand Central Parkway Building 2 Floral Park, NY 11005 © 2017-2025 Linda D Rappaport | AKAM | All Rights Reserved | Privacy Policy | DMCA | Sitemap Agent Reputation – Real Estate Website Design Page load link Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset Sitemap Sitemap Help Help Feedback Feedback Go to Top"
    },
    {
      "url": "https://www.whittlebury.com/contact-us/",
      "text": "GOT HERE\n\t\t\t\tArray\n(\n    [strictly_necessary] => Array\n        (\n        )\n\n    [functional] => Array\n        (\n        )\n\n    [performance_analytics] => Array\n        (\n        )\n\n    [advertisement_targeting] => Array\n        (\n        )\n\n    [gtm] => Array\n        (\n            [0] => Google Tag Manager (Head)\n            [1] => [2] => on\n        )\n\n) Contact Us - Whittlebury Park We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept”, you consent to the use of ALL the cookies. View Options Accept All Close Cookie Preferences This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. View More Show Less View our Cookie Policy Accept All Strictly Necessary Always Enabled We use necessary cookies to ensure our website works properly and provide essential functionalities and security features. These cookies do not collect any personal information and are always enabled. By continuing to use our website, you agree to our use of these cookies. V:2 - 2025-04-29 01:28:12pm Functional Disabled Enabled Functional cookies enable specific functionalities such as social media sharing, feedback collection, and other third-party features. These cookies may collect anonymous data to improve user experience. V:2 - 2025-04-29 01:28:12pm Performance and Analytics Disabled Enabled To enhance user experience, we use performance and analytical cookies to understand and analyze the key performance indexes of our website. Performance cookies help us deliver better user experiences by tracking metrics such as load times and response times. Analytical cookies help us understand how visitors interact with our website by providing information on metrics like the number of visitors, bounce rate, traffic source, and more. Cookie _ga_*ID* Duration 2 years Description ID used to identify users Vendor Google Analytics Privacy Policy https://policies.google.com/privacy Cookie _ga Duration 2 years Description ID used to identify users Vendor Google Analytics Privacy Policy https://policies.google.com/privacy V:2 - 2025-04-29 01:28:12pm Advertisement and Targeting Disabled Enabled To personalize your online experience, we use advertisement cookies that track your activity across websites and gather information to display relevant ads and marketing campaigns. These cookies help us tailor our advertising to your interests and preferences. Cookie _gcl_au Duration 3 months Description Used by Google AdSense for experimenting with advertisement efficiency across websites using their services. Vendor Google Privacy Policy https://policies.google.com/privacy V:2 - 2025-04-29 01:28:12pm Reject All Accept Selected Powered by UP Hotel Agency Skip to content Menu Stay Spa Packages Christmas Shop Contact Book General Contact Us If you need to contact us for any reason please use the form below Continue Contact Us Form Name (Required) First Last Email (Required) Telephone (Required) Postcode (Required) Postcode Type of enquiry (Required) Hotel Meetings & Events The Day Spa The Leisure Club Dining Press Tribute Nights & Events Lost Property Weddings Comments (Required) CAPTCHA Have you viewed our essential information pages? Spa Spa Essential Information View here The Leisure Club The Leisure Club Essential Information View here Golf Golf Essential Information View here Motorsport Camping Essential Information View here Stays Room Information View here Dining Dining Options View here Customer Service Telephone Numbers Need to get in touch? Please note our reservation hours are: Monday – Sunday, 9:00am – 10:00pm Hotel and Dining reservations: 01327 850 489 Spa reservations: 01327 850 489 Conference and Events: 01327 850 490 Silverstone Hospitality Packages: 01327 850 438 Tribute Nights: 01327 850 489 The Leisure Club: 01327 850 450 Christmas reservations: 01327 850 490 Hotel reception and Guest Relations: 01327 857857 General Where to find us Whittlebury Park is easily accessible no matter what your preferred method of transport is, whether it be road, rail, or air. Situated in the heart of the country and within minutes of the M1 and M40, perfectly placed between London and Birmingham. Plus with 650 car park spaces, parking is extensive and complimentary for guests. Find us General Newsletter sign-up Be the first to hear about our news & offers, straight to your inbox. Sign-up Follow Us Whittleburypark instagram Stay in touch for the latest News & Offers By signing up, you agree to the Terms & Conditions and would like to be added to the mailing list. Useful Links Blog Contact Us Where to find us Careers Donations Sign-up to our newsletter Hotel Rooms & Suites Hotel Breaks Spa Breaks Golf Breaks Family Breaks Spa Spa Days Spa Breaks Treatments Spa & Leisure Facilities Essential Information Golf Book a tee time TopTracer Driving Range Groups & Society Memberships Packages Courses & Facilities Essential Information Contact us Whittlebury Park Whittlebury, Near Towcester Northamptonshire NN12 8QH T: 01327 857857 E: reception@whittlebury.com Legal Cookie Control Privacy Policy Terms & Conditions Accessibility facebook instagram linkedin © Whittlebury Hall and Spa Limited, Registered Number: 7839199. V.A.T. Registration Number: 257 6855 56 The Atrium, Whittlebury Park, Whittlebury, Towcester, Northamptonshire, NN12 8WP Website by Up Hotel Agency Make a Booking Close Package Finder Breaks Spa Day Packages Gift Cards Treatments Tee Times TopTracer Driving Range Small Meeting Rooms Afternoon Tea Murrays Day & Stay Packages Whittlebury Gift Cards Sign-up to our newsletter Contact Us Stay Spa Golf Dining Meeting & Events Weddings & Occasions Package Finder Shop Christmas The Leisure Club What's On Motorsports Go Back Hotel Breaks Spa Breaks Golf Breaks Family Breaks Rooms & Suites Go Back Spa Days Spa Breaks Treatments Spa & Leisure Facilities Essential Information Go Back Book a Tee Time TopTracer Driving Range Golf Membership Groups & Society Golf Packages Courses & Facilities Go Back Afternoon Tea Murrays Astons Restaurant Silverstone Bar Sunday Lunch Atrium Clubhouse & Driving Range Go Back Book a small meeting space Our Spaces Team Building Meet the Team Go Back Dry Hire Wedding Packages Enquire about our Weddings Go Back Spa Days Spa Breaks Hotel Breaks Family Breaks Golf Breaks Autumn at the Park Go Back Whittlebury Gift Cards Afternoon Tea For Two People Murrays Tasting Menu for Two People 18 Holes of Golf for Two People 3-Course Sunday Lunch for Two People Go Back Christmas Party Nights Christmas Three-Night Stay New Year's Eve Gala Ball Winter Spa-kle Retreat Go Back Facilities Membership Classes Timetable Essential Information Refer a friend Go Back Retro Electro 80s Murder Mystery Go Back British Grand Prix MotoGP Silverstone Festival Close 01327 857857 reception@whittlebury.com Whittlebury Park Whittlebury, Near Towcester Northamptonshire NN12 8QH Day & Stay Packages Whittlebury Gift Cards Sign-up to our newsletter Contact Us facebook instagram linkedin This browser is no longer supported In order to have the best experience, please update your browser. If you choose not to update, this website may not function as expected. Clicking the button below will help you to update your browser. Update Your Browser Continue Without Updating Close"
    },
    {
      "url": "https://www.sarasellssarasota.com/university-park.php",
      "text": "University Park Country Club Homes and Villas for Sale in Sarasota, Florida - Homes for Sale in University Park Country Club Skip to main content 941-586-4790 Sarasota Keys/Islands Dropdown arrow Siesta Key Longboat Key Siesta Key Homes Longboat Key Homes Siesta Key Condos Longboat Key Condos Bird Key Lido Key Casey Key Lido Key Condos St. Armands Circle Lido Key Homes Sarasota Areas Dropdown arrow Palmer Ranch Lakewood Ranch North-Palmer Ranch Golf Course Homes Central Sarasota East of I-75 Nokomis - Osprey Venice Real Estate Manasota Key Englewood Real Estate Neighborhoods Waterfront/Downtown/ West of the Trail Dropdown arrow Downtown Sarasota West Of The Trail Waterfront Homes Waterfront Condos Golden Gate Point Land For Sale Sarasota Homes Sarasota Condos Featured Properties SEARCH THE MLS Buy/Sell Dropdown arrow Buying a Home Selling a Home Search The MLS Instant Property Valuation Mortgage Calculator Testimonials Featured Properties Contact Us Blog Sarasota Relocation Guide Learn About Us Dropdown arrow Learn About Sara Our Company Learn About Sarah Elizabeth Testimonials Blog Contact Us Information Dropdown arrow Sarasota Relocation Guide Referral Directory Sarasota Schools Instant Property Valuation Mortgage Calculator Featured Properties Sarasota's Top 10 Restaurants Blog My Dashboard My Dashboard Favorites Saved Searches Messages Preferences Sign Out Sign In Menu Close Home Golf Course Communities University Park C. C. University Park Country Club Overview Real Estate Statistics Listings Search Property Contact Agent Sidebar Open Sidebar Close Explore Golf Course Communities Azario at Lakewood Ranch Bent Tree Golf Course Homes Boca Royale Golf and C.C. Calusa Lakes Golf Course Heritage Oaks Golf and C.C. Heron Creek Country Club Laurel Oak Country Club Meridian at the Oaks Misty Creek Country Club Oak Creek Real Estate Palm Aire Country Club Pelican Pointe Golf and C.C. Plantation Golf and C.C. Rosedale Golf and Country Club Sarasota National Serenoa Golf Club Stoneybrook Golf and C. C. The Concession Golf Club The Founders Club The Meadows Country Club The Oaks Club The Oaks Bayside The Oaks Clubside The Oaks Preserve The Oaks Windsor Lodge University Park C. C. Venetian Golf and River Club Venice Golf and Country Club Waterford Wellen Park Golf and C.C. University Park Country Club Golf Course Homes For Sale All Listings $200,000 - $300,000 $300,000 - $400,000 $400,000 - $500,000 $500,000 - $600,000 $600,000 - $700,000 $700,000 - $800,000 $800,000 - $900,000 $900,000 - $1,000,000 Over $1,000,000 City Bedrooms Bathrooms Price Range Save\n                        Search Sort by: Price, high to low Dropdown arrow $1,995,000 ↓ $100,000 6641 St James Crossing, UNIVERSITY PARK UNIVERSITY PARK 4\n                                    Beds 4\n                                    Baths 3,096 SqFt 100 DOM Residential MLS® # A4654609 $1,579,000 ↓ $20,000 7303 Westminster Court, UNIVERSITY PARK UNIVERSITY PARK 3\n                                    Beds 4\n                                    Baths 3,543 SqFt 142 DOM Residential MLS® # TB8376536 $1,399,000 ↓ $26,000 7211 Marston Court, UNIVERSITY PARK UNIVERSITY PARK COUNTRY CLUB 4\n                                    Beds 3\n                                    Baths 2,821 SqFt 75 DOM Residential MLS® # A4656528 $1,375,000 7507 Ascot Court, UNIVERSITY PARK UNIVERSITY PARK COUNTRY CLUB 4\n                                    Beds 5\n                                    Baths 2,421 SqFt 99 DOM Residential MLS® # A4654207 $1,350,000 ↓ $25,000 7319 Westminster Court, UNIVERSITY PARK UNIVERSITY PARK COUNTRY CLUB 4\n                                    Beds 3\n                                    Baths 3,089 SqFt 157 DOM Residential MLS® # A4647621 $1,250,000 ↓ $100,000 7204 Saint Georges Way, UNIVERSITY PARK UNIVERSITY PARK 3\n                                    Beds 3\n                                    Baths 2,902 SqFt 54 DOM Residential MLS® # A4658215 $1,200,000 ↓ $25,000 8223 Regents Court, UNIVERSITY PARK UNIVERSITY PARK COUNTRY CLUB 4\n                                    Beds 4\n                                    Baths 3,125 SqFt 303 DOM Residential MLS® # A4627170 $999,900 ↓ $125,100 7624 Boltons Court, BRADENTON UNIVERSITY PARK COUNTRY CLUB 3\n                                    Beds 3\n                                    Baths 2,667 SqFt 96 DOM Residential MLS® # A4651033 $899,900 ↓ $49,100 6620 Saint James Crossing, UNIVERSITY PARK UNIVERSITY PARK COUNTRY CLUB 3\n                                    Beds 3\n                                    Baths 2,860 SqFt 118 DOM Residential MLS® # A4649914 $875,000 6426 Addington Place, UNIVERSITY PARK UNIVERSITY PARK 3\n                                    Beds 2\n                                    Baths 1,929 SqFt 44 DOM Residential MLS® # A4659323 $860,000 ↓ $30,000 7217 Churston Lane, UNIVERSITY PARK UNIVERSITY PARK 3\n                                    Beds 3\n                                    Baths 2,216 SqFt 344 DOM Residential MLS® # A4619705 $799,700 7016 Lennox Place, UNIVERSITY PARK UNIVERSITY PARK 2\n                                    Beds 2\n                                    Baths 2,075 SqFt 159 DOM Residential MLS® # A4647545 $799,000 7528 Ascot Court, UNIVERSITY PARK UNIVERSITY PARK COUNTRY CLUB 2\n                                    Beds 2\n                                    Baths 2,146 SqFt 107 DOM Residential MLS® # A4648641 $775,000 7615 Charleston Street, BRADENTON ASHLEY TRACE AT UNIVERSITY PLACE 3\n                                    Beds 4\n                                    Baths 2,776 SqFt 85 DOM Residential MLS® # A4655908 $775,000 ↓ $24,900 7727 Heyward Circle, UNIVERSITY PARK UNIVERSITY PLACE 4\n                                    Beds 4\n                                    Baths 3,304 SqFt 75 DOM Residential MLS® # A4656385 New $759,000 7914 Edmonston Circle, BRADENTON HAMPTON TERRACE AT UNIVERSITY PLACE 4\n                                    Beds 3\n                                    Baths 2,452 SqFt 6 DOM Residential MLS® # A4660992 $749,000 6935 Lennox Place, UNIVERSITY PARK UNIVERSITY PARK COUNTRY CLUB / LENNOX GARDENS 3\n                                    Beds 2\n                                    Baths 2,048 SqFt 40 DOM Residential MLS® # A4660605 $729,900 ↓ $20,000 7804 Edmonston Circle, UNIVERSITY PARK UNIVERSITY PLACE 4\n                                    Beds 3\n                                    Baths 2,352 SqFt 131 DOM Residential MLS® # A4649870 $724,900 8307 Planters Knoll Terrace, UNIVERSITY PARK UNIVERSITY PLACE 4\n                                    Beds 3\n                                    Baths 2,450 SqFt 13 DOM Residential MLS® # A4663197 $650,000 ↓ $49,900 7904 Hampton Court, UNIVERSITY PARK UNIVERSITY PARK COUNTRY CLUB 3\n                                    Beds 2\n                                    Baths 1,930 SqFt 70 DOM Residential MLS® # A4657741 New $625,000 7906 Ashley Circle, UNIVERSITY PARK ASHLEY TRACE AT UNIVERSITY PLACE 3\n                                    Beds 2\n                                    Baths 2,135 SqFt 5 DOM Residential MLS® # A4663749 $619,000 6435 Berkshire Place, UNIVERSITY PARK UNIVERSITY PARK 3\n                                    Beds 3\n                                    Baths 2,339 SqFt 64 DOM Residential MLS® # A4658023 $615,000 ↓ $14,000 8019 Indigo Ridge Terrace, BRADENTON INDIGO RIDGE AT UNIVERSITY PLACE 3\n                                    Beds 2\n                                    Baths 2,073 SqFt 141 DOM Residential MLS® # A4649765 $595,000 7960 Hampton Court, UNIVERSITY PARK UNIVERSITY PARK 3\n                                    Beds 2\n                                    Baths 2,266 SqFt 64 DOM Residential MLS® # A4658201 $550,000 7138 Kensington Court, UNIVERSITY PARK UNIVERSITY PARK 2\n                                    Beds 2\n                                    Baths 1,543 SqFt 69 DOM Residential MLS® # A4655520 $550,000 ↓ $75,000 7330 Kensington Court, UNIVERSITY PARK UNIVERSITY PARK 2\n                                    Beds 2\n                                    Baths 1,707 SqFt 124 DOM Residential MLS® # A4651942 New $525,000 8134 Coates Row Place, BRADENTON UNIVERSITY PLACE 3\n                                    Beds 2\n                                    Baths 1,830 SqFt 1 DOM Residential MLS® # A4664292 $449,990 ↓ $25,010 7703 Whitebridge Glen, UNIVERSITY PARK UNIVERSITY PARK 2\n                                    Beds 2\n                                    Baths 1,609 SqFt 215 DOM Residential MLS® # A4637097 $395,000 ↓ $24,900 8073 Tybee Court, UNIVERSITY PARK SAVANNAH PRESERVE AT UNIVERSITY PLACE 2\n                                    Beds 2\n                                    Baths 1,512 SqFt 126 DOM Residential MLS® # A4651529 $310,000 ↓ $9,000 7560 Plantation Circle, BRADENTON CAROLINA LANDINGS AT UNIVERSITY PLACE A 3\n                                    Beds 3\n                                    Baths 1,282 SqFt 212 DOM Residential MLS® # A4637873 1 2 Next Arrow right University Park Country Club Homes and Villas for Sale University Park Country Club is one of the premier master planned golf course communities in the Sarasota area.  University Park Country Club has been ranked as one of the top Florida golf courses with 27 holes of championship golf.  University Park Country Club and Homes for Sale University Park Country Club has been awarded \"The Best Development in the Region\" by the Tampa Bay Regional Planning Council and has been awarded \"Best Community Design in America\" by the National Association of Homebuilders.  Designed by golf course architect, Ron Garl, University Park offers a semi-private membership for its 27 holes of championship golf,  as well as 11 har-tru lighted tennis courts, fitness center and outstanding clubhouse.  Learn more by visiting their website at University Park Country Club . Interested in learning more about Sarasota Golf Course Real Estate? Contact us online or call 941-586-4790 for more information about buying and selling a home on a Sarasota golf course and other communities in the Sarasota area. Sarasota Golf Course Neighborhoods Azario Esplanade at Lakewood Ranch Bent Tree Country Club Boca Royale Country Club Calusa Lakes Golf Club Country Club East Lakewood Ranch Country Club of Sarasota Esplanade Golf and Country Club at LWR Founders Club Gator Creek Heritage Oaks Golf and Country Club Heron Creek Golf and Country Club Lakewood National Golf Club Lakewood Ranch Country Club Laurel Oak Country Club Misty Creek Country Club Palm Aire Country Club Pelican Pointe Golf and Country Club Plantation Golf and Country Club Prestancia TPC River Club River Strand Rosedale Golf and Country Club Sarasota National Serenoa Golf Club Stoneybrook Golf and Country Club The Concession Golf Club The Meadows Country Club The Oaks Club University Park Country Club Venetian Golf and River Club Venice Golf and Country Club Waterford Wellen Park Golf and Country Club Golf Course Communities Back to the Top of this Page Start searching for your dream home now. When it comes to convenience, our site is unparalleled. Whether you're in the comfort of your home, or on the go. Our site works flawlessly on multiple devices so you can find the information you need. Start Search Sarasota Areas Palmer Ranch Lakewood Ranch North-Palmer Ranch Golf Course Homes Central Sarasota East of I-75 Nokomis - Osprey Venice Real Estate Neighborhoods Engelwood Real Estate Manasota Key Buyers Buying a Home Search The MLS Mortgage Calculator Featured Properties Sarasota Relocation Guide Sellers Selling a Home Instant Property Valuation Testimonials Contact Us Our Company About Us Read our blog Contact Us SaraSellsSarasota.com, PLLC 8685 Potter Park Drive, Suite 125 Sarasota, FL 34238 Phone: 941-586-4790 Twitter Facebook LinkedIn © 2025 Real Estate Webmasters All Rights Reserved. Sitemap Privacy Policy Real Estate Webmasters will open a new window All listing information is deemed reliable but not guaranteed and should be independently verified through personal inspection by appropriate professionals. Listings displayed on this website may be subject to prior sale or removal from sale; availability of any listing should always be independently verified. Listing information is provided for consumer personal, non-commercial use, solely to identify potential properties for potential purchase; all other use is strictly prohibited and may violate relevant federal and state law. Listing data comes from My Florida Regional MLS DBA Stellar MLS. Listing information last updated on September 10th, 2025 at 11:34pm EDT."
    },
    {
      "url": "https://countryclubtrentpark.co.uk/contact/",
      "text": "Contact - Country Club Trent Park Skip to content Menu Events Club Policy FAQ’s Contact Menu Menu Events Club Policy FAQ’s Contact Menu Events Club Policy FAQ’s Contact Menu Menu Events Club Policy FAQ’s Contact Contact us ADDRESS Country Club Trent Park, Bramley Rd, London N14 4UW CONTACT NUMBER 020 8363 8800 EMAIL enquiries@countryclubtrentpark.co.uk CLUB OPENING HOURS Monday to Thursday: 10am – 1am Friday & Saturday: 10am – 3am Sunday: 10am – 1am enquiries FEEDBACK We’re keen to hear about your experience, good or bad. GIVE YOUR FEEDBACK CAREERS Get in touch to find out more about joining the Country Club team. enquire now GENERAL ENQUIRIES Have a general question about the club? Get in touch. enquire now Country Club Opening Hours Monday to Thursday 10am - 1am Friday & Saturday: 10am - 3am Sunday: 10am - 1am SIGN UP FOR EXCLUSIVE UPDATES Phone-alt Facebook Instagram Menu Events Club Policy FAQ’s Contact Menu Events Club Policy FAQ’s Contact SIGN UP! receive EXCLUSIVE UPDATES, FREE TICKETS AND MUCH MORE. PHONE Email SIGN UP NOW Careers at the country club Full NAME EMAIL Contact Number Upload your cv Cover Letter Send ENQUIRY"
    },
    {
      "url": "https://upcai-fl.com/",
      "text": "Welcome to University Park - University Park Community Association • Country Club • Recreation District • Homeowner Login Home History Governance Assn Mgmt Info Arch & Landscape Lifestyle Real Estate & Renter Info Contact Us Select Page University Park Community Association University Park is a gated, master-planned residential community with 1,202 single family lots in thirty-two (32) distinct neighborhoods. We are recognized as one of the pre-eminent mature communities in our area, offering one of the most unique and sought-after locations in southwest Florida. The scenic natural beauty covers over 1,200 acres filled with tranquil ponds, soaring moss-covered oaks and lush landscaping creating a park-like setting. Homeowners feel removed from the bustling activity just outside the gates while enjoying a vibrant and active recreational and social lifestyle. Whether you are new to University Park or one of our long-standing homeowners, the information contained on this site will provide valuable knowledge that will enrich your life in this extraordinary community. Search for: Up to Date NEW! Issue 2 ALC Regulations Revised regulations approved by the Board of Directors on April 17, 2025! Electronic Notice Authorization Blue Consent Form Online Voting Authorization Pink Opt-in form We proudly invite you to Experience University Park! Beyond the stunning beauty, premier location and outstanding amenities that come with home ownership, residents enjoy lifestyle experiences and opportunities to engage socially that set us uniquely apart and offer significant benefits to our homeowners. University Park is a private, residential community and recognized as one of the pre-eminent mature communities in the Bradenton/Sarasota area.  It is gated with limited access, in addition to being manned 24/7 by on-site staff.  There is also a back exit/entrance gate at Honoré Avenue activated by a radio frequency identification (RFID) decal affixed to vehicles for the convenience of our residents and Country Club members only. Our community is governed by two volunteer resident boards who oversee the planning and operation of the community and the Country Club.  Our community association boasts a strong balance sheet with substantial audited reserves and focused management of ongoing infrastructure improvements and upgrades that include a recent complete overhaul of our gate operating systems with easier access for our residents and visitors!  In 2023, the Country Club added to its dining facilities with a three million dollar ($3,000,000) expansion which includes a new outdoor bar and café.  The twenty-seven (27) hole golf course, the crown jewel of University Park, will shortly undergo major enhancement to ensure its continued rating among the best in southwest Florida. WELCOME!  And enjoy the on-site EXPERIENCE of University Park! Thirty-two (32)    Unique Neighborhoods Our award-winning, planned and gated community features 1,202 lots located in thirty-two (32) unique, enclave neighborhoods, each carefully planned with most home settings featuring either golf course, water or conservation area views with privacy a priority. Lush, tropical landscapes abound featuring “green” and open spaces. Eaton Place Eaton Place is at the center of the Park with easy access to the Club. There are eighty-six (86) homes in the neighborhood from 2,700 to 3,200 square feet. … Grosvenor Gardens Located near the entrance of University Park, Grosvenor Gardens features twenty-nine (29) custom homes in one and two-story designs, ranging in size from 3,000 to 4,500 square feet on footprints of one-third acre or more. … Chelsea The Chelsea neighborhood is an intimate enclave of nine (9) spacious, custom homes located near the rear entrance of University Park.  Home sizes range from 4,000 to nearly 6,000 square feet, all having pools under large lanais with water views. … – View all neighborhoods Community Information Booklet Perhaps our most requested document for real estate professionals and those considering purchasing in University Park is our expansive Community Information Booklet.  This comprehensive guide to University Park includes valuable information on our community, country club and recreation district in one comprehensive publication which is easy to access and print. View Community Information Booklet Updated 2021 Rich History In late 1980 local developer, Pat Neal, and international entrepreneurs, Rolf and Barbara Pasold, purchased three hundred (300) acres of pristine low pine flatwoods owned by State Farm insurance agents that was used as a hunting preserve.  Painstaking planning of this 1,202 lot master-planned community took nearly five (5) years and the developers’ commitment to the preservation of the natural beauty of the property is still evident today and a tribute to the founding fathers. Learn More Exceptional Lifestyle University Park residents enjoy a vibrant and socially engaging lifestyle just minutes from the arts and dining in downtown Sarasota and world class beaches and recreation including Nathan Benderson Park.  Club membership brings residents together on the golf course, tennis and pickleball courts and dining at our soon to be completed, fully renovated Clubhouse. Explore Lifestyle 8301 The Park Boulevard University Park, FL  34201 Get Directions Office Hours Monday - Friday:  9am - 4pm Office closed weekends Contact Us 941.355.3888 pbm@upcai-fl.com For Realtors Community Information Booklet HOA Documents Homeowner Links Country Club Recreation District HOA Login Get Social Follow Follow Follow © University Park Community Association, Inc."
    },
    {
      "url": "https://universityparkrd.com/about-us/",
      "text": "About Us – University Park RD Skip to content About Us Calendar Meetings Financials Archives Connect About Us Calendar Meetings Financials Archives Connect About Us About Us Board Members District Staff Finance Committee Strategic Planning Committee Explore UPCC About Us Board Members District Staff Finance Committee Strategic Planning Committee Explore UPCC The University Park Recreation District was formed by Manatee County on August 2, 2018 to purchase, operate and maintain the University Park Country Club and its related facilities along with +/- 100 acres of conservation and open space land in the District. Establishment Manatee County formed the University Park Recreation District via Ordinance 18-29 pursuant to Chapter 418, F.S. based on a petition signed by over 80% of District residents requesting the formation of the District. Ordinance 18-29, amended by Ordinance 23-95 PDF | RTF Legal Description PDF | RTF District Boundaries Map PDF | RTF Mission, Vision, Values Our Mission: Deliver to members and guests ever evolving lifestyle experiences that are engaging and inclusive by providing exemplary service, facilities and amenities. Our Vision: To be the preeminent gathering place for members and guests to meet, socialize and enjoy lifestyle  opportunities that exceed their expectations in a modern club environment, that also enhances our residential community. Our Core Values: Values that are truly important direct the decision we make, define our character, and preserve what is special about our Club. They are: Integrity, Trust & Mutual Respect – Acting ethically in the best interests of our members, staff and community. Quality – Striving to be the best that can be in all that we do. Fiscal Responsibility and Transparency – Openly communicating our financial position and ensuring that operating budgets and reserves are sufficient to meet the current and future needs of the Club. Environmental stewardship – Commitment to preserving our natural landscape and considering the environmental impact of our decisions. Stay Informed on All The\nDistrict News: Receive Timely Updates, Board Meeting Reminders & Essential Community News Sign Up Here Contact Information Please feel free to contact the District Office in writing, via email or fax, or by phone, whichever is most convenient for you. See CONNECT for further details on contacting the District Office. For estoppel and payoff requests, please email: estoppels@pfm.com Orlando East Office 3501 Quadrangle Blvd., Suite 270 Orlando, FL 32817 Phone: 407.723.5900 Fax:  407.723.5901 Community Resources Hurricane Center Manatee County Property Appraiser Manatee County Tax Collector’s office National Hurricane Center, provided through the National Weather Service and NOAA Florida Fish and Wildlife Conservation Commission Explore University Park University Park Country Club University Park Community Association University Park Women’s Club Privacy Policy* Under Florida law, e-mail addresses provided to local governments, including the University Park RD, are public records. If you do not want your e-mail address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing at http://universityparkrd.com/district-staff"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/university-park/",
      "text": "University Park - Naples Golf Homes | Naples Golf Guy Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog 239.370.0892 info@naplesgolfguy.com Back to Greater Sarasota Golf Communities University Park University Park Country Club is a private golf club located in Florida. This private Sarasota area golf community features 27 holes of championship golf designed by Ron Garl. In addition to the course, the club offers excellent practice facilities. As such, there is a driving range, short game practice area with putting and chipping greens practice bunker. Additionally, this fabulous Florida country club has been rated four stars by Golf Digest since 1996. While open to the public, members are able to book tee times 10 days in advance compared to 3 days for the general public. In addition to golf, members have access to 11 Har-Tru Tennis Courts, Pickleball, Croquet and State-of-the-Art Fitness Center. Finally, members will enjoy a wide variety of social activities, a full-service restaurant, and bar via The Park Grille & Cafe, perfect for a leisurely lunch or elegant dinner. The community offers a wide array of properties, in all there are 1200 villas and homes spread throughout 32 distinct neighborhoods. The Naples Golf Guy Team specializes in helping buyers and sellers with their real estate needs in Southwest Florida Golf Communities, contact us today for more information. Location: Sarasota Area (University Park) Club Type: Semi-Private Membership Type: One-time upfront initiation fee Real Estate University Park Homes: $270,000 – $3,950,000 View Homes for Sale The Naples Golf Guy Team has 20 years of experience helping Buyers and Sellers with their real estate needs in Southwest Florida. Call, text or email us today for more information. Stay informed with automatic property alerts… Learn what your home is worth… Sign up for our monthly market report. Membership Information Maximum Number of Golf Memberships Not Available Is a Golf Membership Required? No Is a Social Membership Required? Yes Non-Resident Memberships Available? Yes Membership Fees Golf Membership Initiation Fee: $20,000 Annual Golf Dues: $8,350 Social Membership Initiation Fee: $2,500 Annual Social Membership Dues: $1,000 Please be aware, other membership options may be available. Additional fees such as capital assessments, a food and beverage minimum, trail fee or taxes may apply. Please feel free to contact us for additional information. Golf Course Information Number of Courses 1.5 (27 Holes) Caddies Available No Practice Range Yes Own your own cart Yes Course Ratings / Scorecards Holes 1-18 Opened 1991 Architect Ron Garl Par: 72 Holes: 18 Yards Rating Slope Diamond 7001 74.0 138 Emerald 6446 71.7 132 Platinum 6095 70.0 130 Platinum/Gold 5828 68.9 126 Gold 5567 67.6 121 Bronze 4848 64.4 111 Ladies Tees: Ruby 5333 71.8 125 Ruby/Bronze 5110 70.3 123 Bronze 4848 68.9 121 Holes 10-27 Opened 1991 Architect Ron Garl Par: 72 Holes: 18 Yards Rating Slope Diamond 7152 74.6 137 Emerald 6612 72.2 131 Platinum 6223 70.3 130 Platinum/Gold 5942 68.9 125 Gold 5705 67.9 120 Bronze 4922 64.4 111 Ladies Tees: Ruby 5448 72.0 126 Ruby/Bronze 5187 70.1 122 Bronze 4922 68.7 119 Holes 1-9 and 19-27 Opened 1991 Architect Ron Garl Par: 72 Holes: 18 Yards Rating Slope Diamond 7247 75.0 138 Emerald 6716 72.5 131 Platinum 6174 70.1 128 Platinum/Gold 5900 68.8 126 Gold 5696 67.7 122 Bronze 4862 63.7 110 Ladies Tees: Ruby 5429 71.6 125 Ruby/Bronze 5155 69.8 121 Bronze 4862 68.2 116 Amenities Gated community 27 holes of golf Club house Tennis Pickleball Fitness center Croquet Where is University Park Country Club Located University Park Country Club 7671 The Park Blvd. University Park, FL 34201, Pro Shop: 941-359-9999 941.355.3888 Visit Club Website Back to Greater Sarasota Golf Communities Note: We make every effort to make sure our information for this golf club is current and accurate. Information about the tees and membership change over time. Please feel free to email us at info@naplesgolfguy.com if you see any information that needs to be corrected. Stay in the know by subscribing to our newsletter Enter your email address 239.370.0892 info@naplesgolfguy.com ©2025 Naples Golf Guy Privacy Policy Accessiblity made by exploritech We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://liveupark.com/",
      "text": "University Park | Boca Raton, FL Student Apartments near FAU Floorplans Gallery Amenities Neighborhood 135 NW 20th St Boca Raton, FL 33431 (561) 203-1613 Apply Now Home Floorplans Gallery Amenities Neighborhood FAQs Chat with us now 135 NW 20th St Boca Raton, FL 33431 (561) 203-1613 info@liveupark.com Contact Us residents Chat with a Resident We Live Where You Vacation Tucked away in paradise, our 2, 3, and 4-bedroom apartments in Boca Raton are the best place to live your best life surrounded by indulgent, resort-style amenities. Now Leasing Fall 2026 Find your space Resort-Style Living near FAU Welcome to paradise in your own backyard, just steps from Florida Atlantic University and moments from the excitement of downtown. Apartments filled with luxe features and community spaces designed to help you live better, relax deeper, and study harder. Apply Now Resident Apartment Reviews Made great friends here, will definitely live at UPark next year! EH Emily H. Resident Amazing place to live, right next to FAU and PBSC so easy access to school! BA Bia A. Resident This place has great spaces, great staff, and great accommodations! JB Jordan B. Resident I liked my roommates a lot, we were happy with our match! MS Matthew S. Resident Apartment Features University Park is designed to complement your lifestyle with modern, comfortable features to help you balance your school and social life. Fully-Furnished w/ TV Private Bedrooms Stylish Bathrooms Full Kitchen Blazing Fast WiFi Incredible Views Find Your Floor-plan Be the best version of you at University Park with two, three, and four bedroom apartments in Boca Raton, Florida. CHECK AVAILABILITY 2 Bedroom 2 2 803 SQFT. 3 Bedroom 3 3 1,242 SQFT. 4 Bedroom 4 4 1,288 SQFT. Beachy Vibes Our unexpected amenities set you up to create lifelong memories, including a stunning, luxury swimming pool, swinging hammocks, and plush lounge areas See the amenities Resident Amenity Reviews Love the state of the art gym, pool, and fun community events! KH Kelly H. Resident Awesome facilities and the apartments are perfect sized! BA Bia A. Resident The pool is my favorite part. I have never had a single problem here! CC Catherine C. Resident A once and in a lifetime experience for anyone fortunate enough! JR Joseph R. Resident Perks and Amenities High-energy social spaces to gather with friends, stay ahead of schoolwork, unplug, unwind, and stay connected. 2-Story Fitness Center Luxury Swimming Pool Outdoor Green Space Wet Bar Movie & Game Room 24-Hour Study Labs Every Day, A Vacation Live surrounded by connected amenities offering a lifestyle unlike any other in Boca Raton. By Day By Night Mornings done right Start your days in our 2-story fitness center, with all the cardio and strength training gear you can imagine. We have it all. Get to class University Park is only 1-mile from Florida Atlantic University. Even those early morning lectures will feel convenient. Grab a bite Las Fajitas, Boba Street Cafe, Jimmy John's... all within 5 minutes of your front door. Eating well comes easy here. Hit the books Grab a spot in the study lab and work on a group project, or reserve a focus room and knock out some schoolwork solo. Open the group chat Take your mind off today's lecture, invite your friends over to relax on the outdoor lounge. Take a dip Post up in a lounge chair around the pool, jump in and let loose, or grab a seat around the bar. Play a round Get a group together for a round of pool in the movie room and finish the night at the wet bar. Hit the beach The Spanish River Beach is only a 15-minute bike ride away. Take a ride and make memories. Drop a Pin Nothing says “the good life” like living in Boca Raton, Florida. Shimmering in year-round sunshine, University Park places you in the best location this neighborhood has to offer. FILTER Food Coffee Entertainment Recreation Shops Barber/Salon Step Up Your Feed University Park is the perfect backdrop to step up your social content game. Live life viral. Schedule a Tour Day 2 Is in the books, This is how we roll at UPARK Literally‼️🍣😂 Teamwork, Good Vibes, & Friendship! U + Me = UPARK 💪🏽✅ University Park @liveupark UPALOOZA Kicked off today with MAT CHECK 101 ‼️✅🌴 Who do you think had the best door mat 👀 ? Comment who you seeee 😂💪🏽🌴 See ya tomorrow at U+Me= SUSHI ‼️ University Park @liveupark Puppy Yoga 🐶🧘‍♀️  Unwind and recharge with the ultimate stress reliever yoga with puppies! Flow through a light, beginner-friendly yoga session while playful pups roam around bringing joy, cuddles, and plenty of photo worthy moments. It's the perfect mix of wellness and fun. University Park @liveupark U + Me = Sushi 🍣✨  Meet  Us At The Wet Bar 3PM - 4PM   Roll into mid-week fun with our hands-on sushi-making class! Residents will learn how to create their own sushi rolls with guidance from a chef. It's interactive, delicious, and a perfect way to meet new friends while enjoying a one-of-a-kind experience. University Park @liveupark Mat Check 101 🏡✨  Kick off Welcome Week by putting your own style at the front door! At Mat Check 101, you'll design and decorate your very own custom welcome mat—perfect for personalizing your space and making it feel like home from day one. All supplies are provided, just bring your creativity. University Park @liveupark Can't live with them, can't live without them, But they are my MY Team and they're the Best 😂‼️🌴 University Park @liveupark It's Official ‼️ Football season is finally back and what better place to watch it then at UPARK ! Calling all football fans, NFL, NCAA, Sports Bettors The place to be this season is the clubhouse at UPARK ✅💪🏽‼️🏈 University Park @liveupark The only way to settle in after move in is with loved ones, good eats & vibes ❤️🌴 University Park @liveupark Get In Touch Verification Code: Can't read text? Try another Apply Now Phone (561) 203-1613 Location 135 NW 20th St Boca Raton, FL 33431 Text Chat with us Privacy Policy Accessibility Copyright © 2022 University Park - All Rights Reserved Residents Site Credit Reset Powered by Highform Accessibility options Content adjustments Content scaling 100 Highlight headers Text Magnifier Highlight links Readable font Adjust font sizing 0 Align left Align center Adjust letter spacing 0 color adjustments Light contrast Dark contrast High saturation Low saturation Contrast mode Monochrome Custom color Backgrounds Contents Navigation adjustments Stop animations In Development Voice commands Mute sounds Text reader Cursor size Highlight focus 🎉 Explore Our Availability! Contact the leasing office for details. Floorplans This website uses cookies 🍪 to improve your experience. Learn more"
    },
    {
      "url": "https://www.bduedu.in/contact-us",
      "text": "Contact Us - Bharathidasan University Home About Programmes Student Corner Admission Recognition Contact Us Apply Home About Programmes Student Corner Admission Recognition Contact Us Apply Apply Contact Us Questions, comments, or suggestions? Simply fill in the form and we’ll be in touch shortly. Questions, comments, or suggestions? Simply fill in the form and we’ll be in touch shortly. For Student Admission eadmission@bdu.ac.in +91-8956667205 Centre for Distance and Online Education Bharathidasan University Tiruchirappalli - 620 024 Tamil Nadu, India For Student Support eadmission@bdu.ac.in +91-8956667205 Centre for Distance and Online Education Bharathidasan University Tiruchirappalli - 620 024 Tamil Nadu, India Share your details and we will get in touch with you. Enter Name * Phone Number * Email ID * Select Course * Select your area of interest Select Highest Qualification * Select your qualification Enroll Now By clicking on submit I allow Bharathidasan University to send program communication on email/SMS/WhatsApp etc. Explore Our Programs Online BA Bachelor of Arts Duration: 3 Years Know more Online MBA Master of Business Administration Duration: 2 Years Know more Online BBA Bachelor of Business Administration Duration: 3 Years Know more Bachelor of Arts English English Bachelor of Arts in English Duration: 3 Years Know more About Us About Us Contact  Us Recognition Mandatory Disclosure Bachelor Programmes BBA BA(English) Admission Pay Fees Admission Policy Registration Process Admission Form Course Discontinuation Form Refund Policy Student Corner LMS Examination Guidelines Course Conduction Live Session MyAccount Master Programmes MBA MA(English) MA(Political Science) MA(History) MA(Public Administration) MA(Economics) Contact Us +91-8956667205 eadmission@bdu.ac.in Copyright 2025 of Bharathidasan University | All Rights Reserved privacy policy"
    }
  ]
}