{
  "fuentes": [
    {
      "url": "https://explorepuntagorda.com/contact/",
      "email": "mreichert@cityofpuntagorda.com"
    },
    {
      "url": "https://explorepuntagorda.com/contact/",
      "email": "mreichert@cityofpuntagordafl.com"
    },
    {
      "url": "https://explorepuntagorda.com/contact/",
      "email": "cmadmin@pgorda.us"
    },
    {
      "url": "https://www.joinvisionrealty.com/contact-us/",
      "email": "savannah@joinvisionrealty.com"
    },
    {
      "url": "https://www.nolanagency.com/contact/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://conandaily.com/2021/07/06/david-moerschel-biography-13-things-about-us-capitol-riot-suspect-from-punta-gorda-florida/",
      "email": "conandaily.com@conandaily.com"
    }
  ],
  "mails": [
    "chosen-sprite@2x.png",
    "cmadmin@pgorda.us",
    "conandaily.com@conandaily.com",
    "mreichert@cityofpuntagorda.com",
    "mreichert@cityofpuntagordafl.com",
    "savannah@joinvisionrealty.com"
  ],
  "nombre_sitio": "unwinedpg.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://explorepuntagorda.com/contact/",
      "text": "Contact | City of Punta Gorda HOME WORK HERE Doing Business Available Workforce Incentives & Tax Advantages Transportation Business Amenities Available Parcels Living Here Cost of Living Arts & Culture Outdoor Living Education Easy Travel Safety Pro-Business Annexation Tax Rebates Flexible Impact Fees Utility Fee Reductions Pro-Business Leadership LIVE HERE Why Punta Gorda Our History Why Relocate Cost of Living Low Property Taxes Quality of Life Restaurants & Nightlife Outdoor Living Education Easy Travel Safety Volunteer Culture Arts & Culture Music & Fine Art Historic Neighborhoods Real Estate Information VISIT HERE Arts, Culture & History Our Great Outdoors Restaurants & Nightlife Shopping Surrounding Area NEWS CONTACT We'd love to help you! For information about moving your business, living here or taking a Punta Gorda vacation, please get in touch. Call us, email us, or fill out the form below. Even better, if you’re already here, stop in and say hello! Melissa Reichert Communications Manager Phone: (941) 575-3394 Email: MReichert@cityofpuntagorda.com ADDRESS 326 W. Marion Avenue, Punta Gorda, FL 33950 CONTACT US Telephone: (941) 575-3394 EMAIL MReichert@cityofpuntagorda.com Punta Gorda FEEDBACK FORM We look forward to hearing from you. Your Name (required) Your Email (required) Your Message Work Here Live Here Visit Here Send Contact Us Melissa Reichert Communications Manager City of Punta Gorda t: 941-575-3394 MReichert@cityofpuntagordafl.com Copyright © 2025 Punta Gorda, FL. All Rights Reserved Looking for the city website? Click here."
    },
    {
      "url": "https://www.joinvisionrealty.com/contact-us/",
      "text": "Contact Sellstate Vision Realty | Punta Gorda & Lakewood, FL | Get in Touch with Us Skip to main content Close Search Menu Home Business Plan Sphere of Influence Schedule Appointment About Us Revenue Sharing Referral Program Licensing Process Contact Us Contact Us Punta Gorda 2705 Tamiami Trail, Unit 313 Punta Gorda, FL 33950 Office – 941-336-5400 Lakewood 9188 Town Center Pkwy Unit 101 Lakewood Ranch, Fl 34202 Savannah Sheppard Broker/ Owner Cell – 941-807-4304 Direct – 941-807-4304 Email – savannah@joinvisionrealty.com What Are Our Agents Saying About Us “ “ From the moment I walked through the door, I knew this would be my Real Estate home! I had worked in the business for 16 years in SC, and never had that feeling! This is a company that prides itself on Agent Training, a real community, and most importantly making you feel like family! Amazing Broker, and support staff - come aboard - you will love it! :) ” Beth LeClaire Realtor “ “ When you make the decision to join Sellstate Vision Realty you are not only joining a brokerage, you are joining a family. Never in my wildest dreams would I have thought that a business could provide this much support not only in my professional life but also in my personal life. By Joining Sellstate Vision Realty you better be prepared to grow. They provide an unlimited amount of education and opportunity. Being provided with weekly training sessions provides me the tools to constantly grow, we collaborate on weekly meetings and we have fun while doing so. Sellstate Vision Realty are my co-workers, friends, family, and biggest cheerleaders in real estate and life. ” Jeorgia Sutton Realtor “ “ I've had the privilege of working with Sellstate Vision Really for several months but even during my short time here, I can honestly say Vision Realty stands out in more ways than one. First and foremost, the support and mentorship I've received here have been invaluable to my career. The experienced team of agents and brokers at SVR welcomed me with open arms and provided me with the guidance I needed to excel in this competitive industry. Their willingness to share their knowledge, insights, and strategies has been instrumental in my professional growth. In addition to the supportive atmosphere, SVR offers cutting-edge tools and technology that empower me to serve my clients better. From advanced CRM systems to in-house marketing resources, I've had access to everything necessary to stay ahead in a rapidly evolving real estate market. What truly sets SVR apart, though, is the culture! SVR’s atmosphere is one of collaboration and camaraderie. Despite the competitive nature of our industry, I've found that my colleagues are always willing to lend a helping hand or share their expertise when needed. It's a true team effort, and I genuinely look forward to coming to work every day. I can confidently say that my journey with SVR has been nothing short of exceptional. I've found the support, resources, and innovation I was seeking to thrive in this industry. If you're considering a career in real estate or are looking for a brokerage that truly cares about your success, I wholeheartedly recommend Sellstate Vision Realty! It's been a game-changer for me, and I'm excited about the bright future it continues to offer. ” Courtney Jones Realtor Unlock Your Potential with Free Training Tips: Elevate Your Skills, Without Breaking the Bank! Full Name (Required) Email Phone Consent (Required) I agree to receive email and text communication. (Required) Fields marked with * are mandatory. We Believe in Quality, Not Quantity: Rest Assured, We'll Never Spam. Your Inbox is Safe with Us! Verify you are human Supercharge Your Skills with Our Exclusive Free Training Tips: Sign Up and Level Up! Reach Us Punta Gorda 2705 Tamiami Trail, Unit 313 Punta Gorda, FL 33950 Office – 941-336-5400 Lakewood 9188 Town Center Pkwy Unit 101 Lakewood Ranch, Fl 34202 Contact Us Savannah Sheppard Broker/ Owner Cell – 941-807-4304 Direct – 941-807-4304 Email – savannah@joinvisionrealty.com © 2025 Sellstate Vision Realty. All Rights Reserved. x-twitter facebook youtube instagram Close Menu Home Business Plan Sphere of Influence Schedule Appointment About Us Revenue Sharing Referral Program Licensing Process Contact Us"
    },
    {
      "url": "https://www.nolanagency.com/contact/",
      "text": "Contact Nolan Agency - Insurance Agency In Punta Gorda, FL Visit our Facebook Visit our Twitter Visit our LinkedIn Blogs nolanins@hotmail.com (941) 639-1122 About Meet Our Team Insurance Carriers Testimonial Blogs Refer A Friend Location Personal Insurance Auto Insurance Home Insurance Renters Insurance Condo Insurance See All Business Insurance Business Owner's Insurance Commercial Umbrella Insurance Workers' Compensation Insurance General Liability Insurance See All Get Quote Auto Insurance Quote Business Insurance Quote Condo Insurance Quote Flood Insurance Quote Homeowners Insurance Motorcycle Insurance Quote Recreational Vehicle Renters Insurance Quote Umbrella Quote Workers Compensation Contact Us Our Location Punta Gorda, FL 33950 Quick Contact nolanins@hotmail.com Call us Now (941) 639-1122 Opening Hours Monday - Thursday 9:00am to 5:00pm Friday - 9:00am to 4:30pm Closed daily between - 1:00pm to 2:00pm Visit our Facebook Visit our Twitter Visit our LinkedIn Get In Touch With us Finding the right insurance can be a daunting and confusing process. Reach out to us for help! We will review your unique risks in order to find coverage that’s perfect just for you. Name (Required) First Last Phone (Required) Email (Required) How  can we help you? Get a quote Auto Insurance Quote Business Insurance Quote Commercial Auto Insurance Quote Comprehensive Auto Insurance Quote Flood Insurance Quote General Liability Quote Form Homeowners Insurance Quote Hurricane Insurance Quote Form Motorcycle Insurance Quote Recreational Vehicle Insurance Quote Renters Insurance Quote Umbrella Quote Workers Compensation Quote By checking this box, you agree to receive an SMS from Nolan Family Insurance Agency. You may reply Stop to opt-out at any time! CAPTCHA Email This field is for validation purposes and should be left unchanged. Insurance Quote Request Finding the right insurance can be a daunting and confusing process. Reach out to us for help! We will review your unique risks in order to find coverage that’s perfect just for you. Homeowner's insurance Get Quote Renters insurance Get Quote Auto insurance Get Quote Umbrella Quote Form Get Quote Flood Insurance Get Quote Condo Insurance Get Quote Motorcyle Insurance Get Quote Business Insurance Get Quote Recreational Vehicle Get Quote Workers Compensation Get Quote Nolan Family Insurance Agency We extend coverage to individuals and businesses in Punta Gorda, FL and surrounding areas. nolanins@hotmail.com (941) 639-1122 Visit our Facebook Visit our Twitter Visit our LinkedIn Personal Insurance Home Insurance Condo Insurance Individual Life RV Insurance See All Business Insurance Workers' Compensation Commercial Umbrella Business Owner's General Liability See All Know More Meet Our Team Insurance Carriers Testimonial Blogs © 2025 Nolan Family Insurance Agency Designed by Amplispot Privacy Policy Terms and Conditions envelope-o phone envelope phone-handset map-marker clock individual-retirement rv-2 Flood-insurance Workers-compensation format_list_bulleted house-2 motorbike real-estate-1 Condo Commercial-umbrella car 22 linkedin facebook pinterest youtube rss twitter instagram facebook-blank rss-blank linkedin-blank pinterest youtube twitter instagram Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://conandaily.com/2021/07/06/david-moerschel-biography-13-things-about-us-capitol-riot-suspect-from-punta-gorda-florida/",
      "text": "David Moerschel biography: 13 things about US Capitol riot suspect from Punta Gorda, Florida – CONAN Daily Skip to content Search for: CONAN Daily Menu Home About CONAN Daily Contact CONAN Daily NEWS Entertainment Lifestyle Business LISTS Beautiful People Biographical Data Contest Results July 6, 2021 December 26, 2023 Abdel Jibri Omar law & money , North America , politicians , United States David Moerschel biography: 13 things about US Capitol riot suspect from Punta Gorda, Florida Advertisements David Jonathan Moerschel is an American man from Florida, United States. Here are 13 more things about him: He lives in Punta Gorda, Charlotte County, Florida . Aside from Punta Gorda, he has lived in other parts of Florida including Lake Mary. He has lived in different parts of Georgia, USA including Kennesaw and Woodstock. He previously lived in Cary, North Carolina, USA, in Beaumont, Texas, USA, in Maryville, Tennessee, USA and in Louisville, Kentucky, USA. He is a member of the Oath Keepers . He is a Republican. On August 26, 2014, he registered to vote in Seminole County, Florida . On September 7, 2019, he participated in the Remember The Fallen 5K 10K 2019 memorial run in North Port, Sarasota County, Florida and ranked eighth. From January 5-7, 2021, he and other individuals stored firearms at the Comfort Inn Ballston in Arlington, Virginia, USA. Wearing a long sleeve black jacket and backwards green baseball cap with an Oath Keepers insignia, he went to the U.S. Capitol building in Washington, D.C., USA on January 6, 2021. That day, Donald Trump supporters breached the building while a joint session of Congress was certifying the vote of the Electoral College and affirming Joe Biden ‘s victory in the 2020 presidential election. In May 2021, Federal Bureau of Investigation agents met him in person. On June 14, 2021, FBI agents recovered from his attorney a black flak vest that appears to be consistent with the one he wore at the U.S. Capitol on January 6, 2021 and black jacket and a black duffel-type bag that appears to be consistent with the ones he wore or carried in the Comfort Inn Ballston on January 7, 2021. An FBI agent filed a criminal complaint against him, which was signed by U.S. Magistrate Judge Robin M. Meriweather on July 1, 2021. He was 43 years old when he was arrested on July 6, 2021. For his participation in the U.S. Capitol riot on January 6, 2021, he was charged with obstruction of Justice/Congress and unlawful entry into restricted buildings or grounds. (This is a developing story. More details are being added.) Advertisements #CapitolRiot : The DOJ has now charged a 17th alleged #OathKeeper in a purported conspiracy to disrupt Congress on January 6. David Moerschel, of Florida, is charged with conspiracy, obstruction of Congress and unlawful entry into a restricted building. @wusa9 @EricFlackTV pic.twitter.com/WftS8MfbEQ — Jordan Fischer (@JordanOnRecord) July 6, 2021 Advertisements If you have information about someone who participated in the U.S. Capitol riot on January 6, 2021, call 1-800-CALL-FBI. You may also submit relevant photos and videos to the FBI . Rate this: Share this: Click to share on Reddit (Opens in new window) Reddit Post Share on Tumblr Click to share on WhatsApp (Opens in new window) WhatsApp Click to share on Telegram (Opens in new window) Telegram Click to share on Mastodon (Opens in new window) Mastodon Click to share on Nextdoor (Opens in new window) Nextdoor Like Loading... Related Tagged Florida , Punta Gorda , US Capitol , Virginia Published by Abdel Jibri Omar Abdel Jibri Omar has been a member of the CONAN Daily team since 2020. He writes about social issues including crimes and politics. View all posts by Abdel Jibri Omar One thought on “ David Moerschel biography: 13 things about US Capitol riot suspect from Punta Gorda, Florida ” johntcl009993 says: July 22, 2021 at 5:48 am Florida & an Oath Keeper.  Say no more. A fine state full of GQP members of right wing militia groups. Like Like Reply Leave a comment Cancel reply Δ This site uses Akismet to reduce spam. Learn how your comment data is processed. Post navigation Keegan Gregory Casteel biography: 13 things about Ankeny, Iowa man Complete list of Miss Northern Ireland 2021 candidates Follow CONAN Daily on WordPress.com Advertisements 13 things about Arlington Heights, Illinois native Charlie Kirk Miss Universe Malaysia 2025 could be Chloe Chin, Ranmeet Jassal, Malveen Kaur 5 most beautiful Miss Universe Malaysia 2025 candidates 16 Miss Universe Malaysia 2025 candidates competing in Kuala Lumpur 10 things about Miss Universe Malaysia 2024 Sandra Lim Advertisements Alabama Bangkok BRAVE CF California Colorado Florida Georgia Illinois Kentucky Las Vegas Los Angeles Maryland Massachusetts Michigan Minnesota Miss Earth Miss Supranational Miss Universe Miss Universe Philippines Miss USA Miss World Nevada New Jersey New York New York City North Carolina Ohio ONE Championship Pennsylvania PFL Tennessee Texas Tokyo UFC US Capitol Virginia Washington Washington DC Advertisements Advertisements Advertisements Advertisements Advertisements Create a website or blog at WordPress.com Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy Comment Reblog Subscribe Subscribed CONAN Daily Join 1,631 other subscribers Sign me up Already have a WordPress.com account? Log in now. CONAN Daily Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar %d"
    }
  ]
}