{
  "fuentes": [
    {
      "url": "https://www.adctheatre.com/about-us/administration/",
      "email": "boxoffice@adctheatre.com"
    },
    {
      "url": "https://www.discovercrystalriverfl.com/directory/valerie-theatre-performing-arts/",
      "email": "info@discovercrystalriverfl.com"
    },
    {
      "url": "https://www.discovercrystalriverfl.com/directory/valerie-theatre-performing-arts/",
      "email": "info@visitcitrus.com"
    },
    {
      "url": "https://www.discovercrystalriverfl.com/directory/valerie-theatre-performing-arts/",
      "email": "valerietheatre@inverness.gov"
    },
    {
      "url": "https://contactmcr.com/visit/get-in-touch",
      "email": "boxoffice@contactmcr.com"
    },
    {
      "url": "https://contactmcr.com/visit/get-in-touch",
      "email": "boxoffice@contactmcr.com"
    },
    {
      "url": "https://contactmcr.com/visit/get-in-touch",
      "email": "marketing@contactmcr.com"
    },
    {
      "url": "https://valerieconfections.com/pages/contact",
      "email": "flags@2x.png"
    },
    {
      "url": "https://valerieconfections.com/pages/contact",
      "email": "globe@2x.png"
    },
    {
      "url": "https://valerieconfections.com/pages/contact",
      "email": "recipient@giftnote.com"
    },
    {
      "url": "https://valerieconfections.com/pages/contact",
      "email": "shop@valerieconfections.com"
    },
    {
      "url": "https://concrete-theatre.com/contact-us",
      "email": "20valerie@concrete-theatre.com"
    },
    {
      "url": "https://concrete-theatre.com/contact-us",
      "email": "info@concrete-theatre.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.discovercrystalriverfl.com/directory/valerie-theatre/",
      "email": "info@discovercrystalriverfl.com"
    },
    {
      "url": "https://www.discovercrystalriverfl.com/directory/valerie-theatre/",
      "email": "info@visitcitrus.com"
    },
    {
      "url": "https://www.discovercrystalriverfl.com/directory/valerie-theatre/",
      "email": "valerietheatre@inverness.gov"
    },
    {
      "url": "https://www.ensemblestudiotheatre.org/staff",
      "email": "borzellino@ensemblestudiotheatre.org"
    },
    {
      "url": "https://www.ensemblestudiotheatre.org/staff",
      "email": "firman@estnyc.org"
    },
    {
      "url": "https://www.ensemblestudiotheatre.org/staff",
      "email": "lugo@estnyc.org"
    },
    {
      "url": "https://www.ensemblestudiotheatre.org/staff",
      "email": "manos@ensemblestudiotheatre.or"
    },
    {
      "url": "https://www.ensemblestudiotheatre.org/staff",
      "email": "mayer@ensemblestudiotheatre.org"
    },
    {
      "url": "https://www.ensemblestudiotheatre.org/staff",
      "email": "mckenzie@estnyc.org"
    },
    {
      "url": "https://www.ensemblestudiotheatre.org/staff",
      "email": "sablon@estnyc.org"
    },
    {
      "url": "https://www.ensemblestudiotheatre.org/staff",
      "email": "sembler@estnyc.org"
    },
    {
      "url": "https://www.ensemblestudiotheatre.org/staff",
      "email": "youngblood@estnyc.org"
    },
    {
      "url": "https://www.harristheaterchicago.org/staff-board",
      "email": "info@harristheaterchicago.org"
    },
    {
      "url": "https://gvtheatre.org/staff-and-board/",
      "email": "will@gvtheatre.org"
    },
    {
      "url": "https://gvtheatre.org/staff-and-board/",
      "email": "boxoffice@gvtheatre.org"
    },
    {
      "url": "https://gvtheatre.org/staff-and-board/",
      "email": "business@gvtheatre.org"
    },
    {
      "url": "https://gvtheatre.org/staff-and-board/",
      "email": "companymanager@gvtheatre.org"
    },
    {
      "url": "https://gvtheatre.org/staff-and-board/",
      "email": "courtney@gvtheatre.org"
    },
    {
      "url": "https://gvtheatre.org/staff-and-board/",
      "email": "education@gvtheatre.org"
    },
    {
      "url": "https://gvtheatre.org/staff-and-board/",
      "email": "elizabeth@gvtheatre.org"
    },
    {
      "url": "https://gvtheatre.org/staff-and-board/",
      "email": "jenna@gvtheatre.org"
    },
    {
      "url": "https://gvtheatre.org/staff-and-board/",
      "email": "patronservices@gvtheatre.org"
    },
    {
      "url": "https://gvtheatre.org/staff-and-board/",
      "email": "sound@gvtheatre.org"
    },
    {
      "url": "https://gvtheatre.org/staff-and-board/",
      "email": "technicaldirector@gvtheatre.org"
    }
  ],
  "mails": [
    "20valerie@concrete-theatre.com",
    "borzellino@ensemblestudiotheatre.org",
    "boxoffice@adctheatre.com",
    "boxoffice@contactmcr.com",
    "boxoffice@gvtheatre.org",
    "business@gvtheatre.org",
    "companymanager@gvtheatre.org",
    "courtney@gvtheatre.org",
    "education@gvtheatre.org",
    "elizabeth@gvtheatre.org",
    "firman@estnyc.org",
    "flags@2x.png",
    "globe@2x.png",
    "info@concrete-theatre.com",
    "info@discovercrystalriverfl.com",
    "info@harristheaterchicago.org",
    "info@reception-plus.de",
    "info@visitcitrus.com",
    "jenna@gvtheatre.org",
    "lugo@estnyc.org",
    "manos@ensemblestudiotheatre.or",
    "marketing@contactmcr.com",
    "mayer@ensemblestudiotheatre.org",
    "mckenzie@estnyc.org",
    "patronservices@gvtheatre.org",
    "recipient@giftnote.com",
    "sablon@estnyc.org",
    "sembler@estnyc.org",
    "shop@valerieconfections.com",
    "sound@gvtheatre.org",
    "technicaldirector@gvtheatre.org",
    "valerietheatre@inverness.gov",
    "will@gvtheatre.org",
    "youngblood@estnyc.org"
  ],
  "nombre_sitio": "valerietheatre.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.adctheatre.com/about-us/administration/",
      "text": "Administration Staff | ADC Theatre, Cambridge Site search Go Donate What's On Menu What's On About us Administration History Vacancies Alumni Support us Resident Companies Corpus Playroom ADC Membership Gift Membership and Vouchers Get involved Get Involved Student Applications Involvement in Non-Student Theatre Non-Student Applications Stewarding Technical Acting Directing Producing Comedy Set Design Costume Design Graphic Design New Writing Work Experience Panto 2025 applications Production Consumables Technical Information Equipment Hire Production Resources Report Harassment or Discrimination Theatre Welfare Resources Your visit Booking Information Access ADC Bar Finding the ADC Theatre Finding the Corpus Playroom Education Gift vouchers Help The CUADC/Footlights Pantomime Blog Contact us Brochure Account ( Log In ) Basket ( ) Site search Go Donate What's On Facebook Instagram Twitter LinkedIn Administration The ADC Theatre is one of the smallest departments of the University of Cambridge. We have no academic objective; our main aim is to provide opportunities to learn about and experience theatre. Pravda, Spring 2015 (Photo: Johannes Hjorth) We are a department of the University of Cambridge and the oldest University playhouse in the country. The ADC Theatre is the centre of University drama in Cambridge, led almost entirely by students with no Faculty involvement. We aim to provide opportunities to experience and learn about all aspects of theatre, while presenting professional standard productions. The ADC Theatre has helped to launch the careers of many theatre luminaries, including Sir Ian McKellen, Rachel Weisz and Emma Thompson. We also present shows by local drama groups and touring companies outside of University Term, and are proud to be at the heart of Cambridge's busy amateur dramatic scene. During University Term, we usually present two shows a night: a mainshow at 7.45pm Tuesday to Saturday, followed by a lateshow at 11.00pm. Productions are completely student run, from actors and directors to set designers and carpenters. Members of the CUADC and Fletcher Players sit on the Executive Committee and coordinate and encourage the majority of student activity at the Theatre. The are six permanent staff who provide support and advice as well as running the Theatre day-to-day. To contact a member of the management team, you can email using the format: firstname@adctheatre.com . Alternatively, you can phone the administration line at 01223 359547 during office hours between 11am and 6pm. Photo by Paul Ashley Photography Staff University Theatre Committee Theatre Manager Olivia Wheeler Operations Manager Patrick Nielsen Technical Manager Hugh Bowers Production Manager Stanley Alice Hunt Theatre Administrator Grace Morris Maintenance Technician Darren Thomas-Carr The University Theatre Committee is responsible for overseeing the management of the Theatre and University drama in general (it has taken on the responsibilities of the former University Theatre Syndicate). The Committee approves the Theatre's programme, reviews financial performance, appoints the staff, and sets long term Theatre policy. The Committee is responsible for annually reporting to the University on the financial and material status of the ADC Theatre. Patron HRH The Duke of Edinburgh Chairman of the University Theatre Committee Dr Mark Billinge Executive Committee Members Dr Richard Barnes Dr Sarah Fine Anna Gungaloo Patrick Nielsen Gemma Stapleton Dr Rachelle Stretch Robin Walker Olivia Wheeler Chris Wordsworth Annual Report 2022-23 Records Annual Report 2021-22.pdf 972.9KB Annual Report 2020-21.pdf 981.6KB Annual Report 2019-20 web.pdf 949.0KB 2018-19 Annual Report.pdf 782.0KB 2017-18 Annual Report.pdf 901.3KB 2016-17 Annual Report.pdf 837.4KB 2015-2016 Annual Report inc Accounts.pdf 5.8MB 2014-15 Annual Report and Accounts.pdf 902.3KB 2013-14 Annual Report and Accounts.pdf 1.9MB 2012-13 Annual Report and Accounts.pdf 619.3KB 2011-12 Annual Report and Accounts.pdf 614.5KB 2010-11 Annual Report and Accounts.pdf 85.0KB 2009-10 Annual Report and Accounts.pdf 155.1KB 2008-9 Annual Report and Accounts.pdf 104.0KB 2007-8 Annual Report and Accounts.pdf 118.7KB 2006-7 Annual Report and Accounts.pdf 60.1KB 2005-6 Annual Report and Accounts.pdf 74.2KB 2004-5 Annual Report and Accounts.pdf 307.9KB ADC Theatre, Park Street, Cambridge, CB5 8AS Box office 01223 300085 boxoffice@adctheatre.com Opening times: Monday - Saturday 1 - 6pm Administrative enquiries 01223 359547 hello@adctheatre.com Newsletter sign up Sign up to our mailing list First name Last name Email Sign up Terms and Conditions Audience Code of Conduct Privacy, Security & Cookies Contact us ADC Theatre © All rights reserved 2024"
    },
    {
      "url": "https://www.discovercrystalriverfl.com/directory/valerie-theatre-performing-arts/",
      "text": "Valerie Theatre | Discover Crystal River Skip to content CRYSTAL RIVER HOMOSASSA INVERNESS FLORAL CITY 85 ° MENU Search Term Search CRYSTAL RIVER HOMOSASSA INVERNESS FLORAL CITY Things to Do Events Where to Stay Dining Cities & Neighborhoods Plan Your Visit AR Experience Meeting Planners Citrus County Partners In Tourism Media Contact Us Visitors Guide Blog Email Signup Deals Facebook Instagram Twitter YouTube Pinterest Save Valerie Theatre This beautifully restored theatre on Courthouse Square was built in 1926 and named for the owners daughter. Elvis Presley and the crew of the movie \"Follow That Dream\" viewed daily takes of filming here while shooting the film here in 1961. Live Theatre, Music, Community Events and Classic Films on Sunday at 3. Reviews Valerie Theatre Gallery 207 Courthouse Square Inverness, \n                                Florida\n                                34450 (352) 341-7850 Website Email Home Tourist Information Center 915\n\t\t\t\t\t\tNorth Suncoast Boulevard Crystal River,\n\t\t\t\t\t\tFlorida\n\t\t\t\t\t\t34429 800.587.6667 | 352.794.5506 info@discovercrystalriverfl.com Things to Do Events Where to Stay Dining Cities & Neighborhoods Plan Your Visit AR Experience Meeting Planners Citrus County Partners In Tourism Blog Media Video Gallery Live River Cams Contact Us COVID-19 Privacy Policy Sitemap Facebook Instagram Twitter YouTube Pinterest Ⓒ 2025 Discover Crystal River Florida.  All Rights Reserved."
    },
    {
      "url": "https://contactmcr.com/visit/get-in-touch",
      "text": "Get in Touch | Contact Theatre Skip to main content Contact Theatre What's on Get Involved Your Visit About Us Support us Hire Us Basket item count: Site Menu. What's on Get Involved Your Visit About Us Support us Hire Us Return to main Get in Touch Get in Touch Get in Touch Your visit More info Access Get in Touch Getting Here Food & Drink Get in Touch There are a few different ways to get in touch with the Contact team! Image gallery See below for more information on our opening hours. For marketing enquires please contact marketing@contactmcr.com Booking is available 24/7 online, but please email us if you need further information on booking your tickets at Contact: boxoffice@contactmcr.com Please be aware, if you have a digital ticket, you do not need to attend our box office. You can also find us on all social channels at @ContactMCR Meet members of our team! Our People Keep in Contact Sign up to our mailing list to get the latest news, offers and events, straight to your inbox Site footer More Site Pages Work With Us News Support Our Charity Full Building Opening Times Legal Pages Terms & Conditions Privacy Policy Cookie Policy Site Map Web Accessibility Twitter Facebook YouTube Instagram TikTok The University of Manchester Manchester City Council GMCA Supported using public funding by Arts Council England Registered with Fundraising Regulator Please be aware that Contact will not tolerate abusive language or threatening behaviour towards our staff. If you are deemed to be behaving inappropriately you will be asked to leave the premises and reported to the police. Small Print Contact Theatre ©2023. Registered Charity number 501953. VAT Registration number 380 8689 50. Website by Supercool ."
    },
    {
      "url": "https://valerieconfections.com/pages/contact",
      "text": "Contact Us – Get in Touch with Valerie Confections Named Best in America by the NYT—3 Years in a Row. Meet Our Baby Grand. Menu Home Shop Events Wholesale About Us Our Story About Valerie Locations Chocolate Shop & Bakery Echo Park Cafe Stockists Gifting & Favors Corporate Gifting Wedding & Event Favors Contact Us Track Order 213-739-8149 Login 0 Named Best in America by the NYT—3 Years in a Row. Meet Our Baby Grand. 213-739-8149 Contact Us Track Order Login 0 Your Cart is Empty Continue Shopping $ 0.00 Subtotal Taxes and shipping calculated at checkout Go to cart Home Shop Events Wholesale About Us Our Story About Valerie Locations Chocolate Shop & Bakery Echo Park Cafe Stockists Gifting & Favors Corporate Gifting Wedding & Event Favors Contact Us Thank you for visiting Valerie Confections. Whether you have a question, feedback, or need assistance, we’re here to help! You can reach us by phone at 213-739-8149 , or simply fill out the form below, and we'll get back to you as quickly as possible. We look forward to connecting with you! Name * Email * Message * Help FAQs Shipping Privacy Policy Terms of Service Accessibility Commitment More Search Wholesale Join Our Team Contact Us *free shipping Free shipping applies automatically to standard shipping on orders over $100 placed on www.valerieconfections.com — no code required. This offer is not retroactive and cannot be combined with any other promotion. If shipping to multiple recipients, each shipment is calculated individually. Subscribe today! We respect your privacy. Unsubscribe anytime. Currency United States (USD $) Canada (CAD $) United States (USD $) © 2025 Valerie Confections . Powered by Shopify ```html {\"statementLink\":\"https://valerieconfections.com/pages/accessibility\",\"footerHtml\":\"\",\"hideMobile\":false,\"hideTrigger\":false,\"disableBgProcess\":false,\"language\":\"en\",\"position\":\"left\",\"leadColor\":\"#1f1212\",\"triggerColor\":\"#1f1212\",\"triggerRadius\":\"50%\",\"triggerPositionX\":\"right\",\"triggerPositionY\":\"center\",\"triggerIcon\":\"people\",\"triggerSize\":\"medium\",\"triggerOffsetX\":20,\"triggerOffsetY\":20,\"mobile\":{\"triggerSize\":\"small\",\"triggerPositionX\":\"right\",\"triggerPositionY\":\"center\",\"triggerOffsetX\":10,\"triggerOffsetY\":10,\"triggerRadius\":\"50%\"}} ```"
    },
    {
      "url": "https://concrete-theatre.com/contact-us",
      "text": "Contact Us - Concrete Theatre (360) 941-0403 info@concrete-theatre.com Home Movies Ice Cream Events Downton Abbey Hank Williams Festivals Youth Theatre Fitness Archives Art Community Ghosts About Blog Contact Select Page Get in touch We appreciate your ideas, feedback, and comments. Contact Valerie Stafford, Co-owner of the Concrete Theatre & Act One Ice Cream Parlor: Email Subscribe to Our Updates Be the first to hear about movies, events, ice cream flavors and more! Subscribe to our email updates, it's easy! Success! We're happy to have you as a new subscriber. First Name Last Name Email Subscribe Address 45920 Main Street PO Box 954 Concrete, WA 98237 24 hour Movieline: (360) 941-0403 Gift Cards Find us on Facebook © Concrete Theatre 2025"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * Datenschutz Nachricht Surname Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.discovercrystalriverfl.com/directory/valerie-theatre/",
      "text": "Valerie Theatre | Discover Crystal River Skip to content CRYSTAL RIVER HOMOSASSA INVERNESS FLORAL CITY 85 ° MENU Search Term Search CRYSTAL RIVER HOMOSASSA INVERNESS FLORAL CITY Things to Do Events Where to Stay Dining Cities & Neighborhoods Plan Your Visit AR Experience Meeting Planners Citrus County Partners In Tourism Media Contact Us Visitors Guide Blog Email Signup Deals Facebook Instagram Twitter YouTube Pinterest Save Valerie Theatre This beautifully restored theatre on Courthouse Square was built in 1926 and named for the owners daughter. Elvis Presley and the crew of the movie \"Follow That Dream\" viewed daily takes of filming here while shooting the film here in 1961. Live Theatre, Music, Community Events and Classic Films on Sunday at 3. Reviews Blogs The Ultimate Friends Getaway in Inverness, Florida If you're looking for a fun and relaxing destination for a girls' getaway, Inverness, Florida is a great choice! Tabitha Blue and her gals have crafted the perfect guide for your next trip. Learn More Elvis is Everywhere Sixty years later, Elvis Fans still come to Citrus County to \"Follow That Dream\" Learn More Valerie Theatre Gallery 207 Courthouse Square Inverness, \n                                Florida\n                                34450 (352) 341-7850 Website Email Home Tourist Information Center 915\n\t\t\t\t\t\tNorth Suncoast Boulevard Crystal River,\n\t\t\t\t\t\tFlorida\n\t\t\t\t\t\t34429 800.587.6667 | 352.794.5506 info@discovercrystalriverfl.com Things to Do Events Where to Stay Dining Cities & Neighborhoods Plan Your Visit AR Experience Meeting Planners Citrus County Partners In Tourism Blog Media Video Gallery Live River Cams Contact Us COVID-19 Privacy Policy Sitemap Facebook Instagram Twitter YouTube Pinterest Ⓒ 2025 Discover Crystal River Florida.  All Rights Reserved."
    },
    {
      "url": "https://www.ensemblestudiotheatre.org/staff",
      "text": "Staff & Board — Ensemble Studio Theatre On Stage Current Season Calendar Past Seasons EST Re:Members Podcast Programs Overview Marathon of One-Act Plays Youngblood Youngblood Monday Lunch Apply MEMBERS & ALUMNI EST / Sloan Project First Light Festival PLAY SUBMISSIONS Sloan Blog Ensemble About EST Re:Members Podcast Member Artists Playwrights Unit Member Login Calendar Get Involved Mailing List Jobs Play Submissions Support Make a Gift Legacy Giving Corporate Giving Supporters About Mission Visit Accessibility Equity & Justice Work Staff & Board History FAQ SEARCH TICKETS On Stage Current Season Calendar Past Seasons EST Re:Members Podcast Programs Overview Marathon of One-Act Plays Youngblood Youngblood Monday Lunch Apply MEMBERS & ALUMNI EST / Sloan Project First Light Festival PLAY SUBMISSIONS Sloan Blog Ensemble About EST Re:Members Podcast Member Artists Playwrights Unit Member Login Calendar Get Involved Mailing List Jobs Play Submissions Support Make a Gift Legacy Giving Corporate Giving Supporters About Mission Visit Accessibility Equity & Justice Work Staff & Board History FAQ SEARCH TICKETS About Mission Visit Accessibility Equity & Justice Work Staff & Board History FAQ ADMINISTRATIVE OFFICES Phone: 212.247.4982 Offices: 545 West 52nd Street, 2nd Floor Mailing Address: Ensemble Studio Theatre P.O. Box 1584 New York, NY 10101 Ensemble Studio Theatre STAFF CO-ARTISTIC DIRECTORS Estefanía Fadul Graeme Gillis* MANAGING DIRECTOR Adriana Borzellino DIRECTOR OF PLAY DEVELOPMENT, PROGRAM DIRECTOR OF EST/SLOAN PROJECT Linsay Firman * PROGRAM DIRECTOR OF YOUNGBLOOD RJ Tolan * DEVELOPMENT DIRECTOR Richard Mayer GENERAL MANAGER MJ Lugo COMMUNICATIONS & DEVELOPMENT MANAGER Samantha Sembler COMMUNITY ENGAGEMENT MANAGER Francesca McKenzie ARTISTIC PROGRAMS ASSISTANT Thalia Sablon COMPANY ASSISTANT Stacey Manos ENSEMBLE STUDIO THEATRE BOARD OFFICERS CHAIR Donna R. Ward ASSOCIATE CHAIR Russell G. Jones SECRETARY Eddie Boroevich * MEMBERS COUNCIL CO-CHAIR Jamie Richards * Akyiaa Wilson * DIRECTORS Danielle Covington Chau Haber Lou Liberatore * Dee Dee Perry Shawn Randall * Jacqueline F. Strayer Janet Zarish * G.H. Denniston Jr.* , Chair Emeritus Jerry Zaks * , Director Emeritus EST Members Council Council Co-Chairs: Lisa Pelikan * Jamie Richards * Akyiaa Wilson * David Zellnik * Council Members: Holli Harms * Susan Kim * Jared McGuire* Sean McIntyre * Tuck Milligan * Jay Patterson * Lilli Stein * Emily Chadick Weiss * Chris Wight * Margot Avery * Eliza Beckwith * Franceluce Benson * Abigail K. Zealey Bess Alice Eve Cohen * Eric Conger * Helen Coxe * Christine Farrell * Julie Fitzpatrick * Alex J. Gould * *denotes EST Member Artist WANT TO STAY UP-TO-DATE ON THE LATEST EST NEWS? CLICK HERE TO SIGN UP FOR OUR EMAIL LIST! Back to Top Ensemble Studio Theatre, 549 W 52nd St, New York, NY 10019, USA ENSEMBLE STUDIO THEATRE, 545 W 52ND ST, NEW YORK, NY 10019, USA Office Hours: 10AM to 6PM, Monday through Friday Site by Radish Lab . Ensemble Studio Theatre is a Designated 501(c)(3) Organization, EIN: 23-7150345"
    },
    {
      "url": "https://www.harristheaterchicago.org/staff-board",
      "text": "Staff + Board | Harris Theater Skip to main content Close Search Search Harris Theater Virtual Stage Display Search Field Donate Discover Harris Theater Presents Resident Companies Engagement + Education HT Virtual Stage Our Space Learn About Our Space Specifications + Rates Support Donate Now Ways to Give Creative Future Fund Planned Giving Sponsor a Seat Events + Tickets Subscribe + Save Subscribe to any of the Harris Theater Presents series for the deepest discount. Learn More Subscribe to HTP 25/26 Upcoming Events Box Office Digital Ticket Login Digital Ticket FAQ Student Discounts Seating Chart Toggle Side Navigation Close Search Search Discover Toggle Menu Harris Theater Presents Resident Companies Engagement + Education HT Virtual Stage Our Space Toggle Menu Learn About Our Space Specifications + Rates Support Toggle Menu Donate Now Ways to Give Creative Future Fund Planned Giving Sponsor a Seat Events + Tickets Toggle Menu Subscribe to HTP 25/26 Upcoming Events Box Office Digital Ticket Login Digital Ticket FAQ Student Discounts Seating Chart Our Story Toggle Menu Mission + Vision Commitment to Equity + Core Values Our History Employment Staff + Board HT Associate Board Plan Your Visit Toggle Menu Directions + Parking Digital Ticket Login Digital Ticket FAQ Seating Chart Code of Conduct Hotel + Restaurant Partners Accessibility Our Neighborhood FAQs Close Search Search Harris Theater Virtual Stage Display Search Field Donate For Press Contact Do Not Sell or Share My Data 205 E. Randolph Chicago, IL, 60601 Box Office: 312.334.7777 info@harristheaterchicago.org Non-Performance Day Phone Hours Monday – Friday: Noon to 5PM Saturday – Sunday: Closed Performance Day Phone Hours Monday – Friday: Noon to Curtain Saturday – Sunday: Two hours prior to performance until Curtain Walk-Up Box Office Hours The box office opens 60 minutes prior to every performance. Facebook Twitter Instagram Staff + Board Share Share on Facebook Share on Twitter Share with Email STAFF Leadership Team Lori Dimun, Alexandra C. and John D. Nichols President and Chief Executive Officer Laura Hanssel, Chief Financial Officer Susan Lape, Vice President of Development Emily Macaluso, Vice President of Operations and Production / General Manager Kari Shaffer, Vice President of Marketing and Sales Finance and Administration Pragnesh Gandhi, Director of Finance Danielle Pender, Director of Human Resources Development Cate Mascari, Director of Donor Relations Nathaniel Davis, Director of Institutional Giving Madison R. Jones, Manager of Donor Events and Communications Emma Lawrence, Board and Donor Relations Coordinator Marketing Adriana Prieto, Director of Marketing Amelia Thelen, Marketing Manager Maria Orozco, Digital Marketing Manager Programming and Engagement Laura Stellwagon, Director of Programming and Engagement Ticketing Codashti McAllister, Tessitura Administrator Juanita Smith, Box Office Treasurer Naomi Clark, Marley Doakes, Kylie Stone, Tadhg Mitchell Ticketing Services Representatives Production Ben Jones, Director of Production Clare Roche, Production Manager Anthony Montuori, Head Carpenter and IATSE Steward Sam Begich, Head Electrician Laura Hamernick, Head of Audio Richard Hoyle, Head of Props Morgan Wright, Head Fly Operations and Front of House Jennifer Martin, Director of Operations Craig McNabb, Audience and Access Services Manager Bridget Savage, Concessions and Special Events Manager Josie Moore , Theater Administration Coordinator Ezra Brown, Juwan Harris, Jorge Castaneda, Christian Nix, Manson Scurlock Security Staff Dillon Zamora, RyAnne Galowich, Amber Johnson House Managers Melany Reed, Saints Coordinator The Saints, Volunteer Usher Corps Facilities and Venue Services Ed Mlakar, Facilities Engineer Leticia Cisneros, Venue Services Manager Berto Rivera, Facility Operations Manager Juan Medina, Facility Operations Assistant Delia Ochoa, Venue Services Associate Victor Orozco, Venue Services Associate BOARD OF TRUSTEES Officers Peter M. Ellis, Chairman Claire O’Grady, Vice Chair Nancy Santi, Vice Chair Lori Dimun**, President and CEO Sara Albrecht, Secretary Robert J. Gauch, Treasurer Trustees Alaina Anderson Kathryn Kovitz Arnold Bernard Bartilad Kori Coleman** Michelle N. Durpetti Louise Frank Ted Grady Sandra P. Guthman*, Past Chairman Caryn Harris*, Past Vice Chair Joan W. Harris*, Past Chairman Terell Johnson** Sherry Jursa Christine N. Evans Kelly Merrillyn J. Kosier*, Past Chairman Franco La Marca D'Andrae Larry Michael McStraw Sarah Solotaroff Mirkin Alexandra C. Nichols*, Past Chairman Kenneth R. Norgan † Gregory J. O’Leary Abby McCormick O’Neil*, Past Chairman Scott Rafferty Jai Shekhawat John Q Smith David Snyder, Past Chairman Sunitha Thomas Marilyn Fatt Vitale Maria Zec Life Trustees Peter M. Ascoli Cameron S. Avery John W. Ballantine Marshall Field V Robin S. Tryloff As of July 2025 *member of Executive Committee **ex-officio † fondly remembered ASSOCIATE BOARD The Harris Theater Associate Board supports the Harris Theater by expanding audiences and strengthening efforts to connect art, artists, and communities through the Mix at Six series and events throughout the season. Learn more . Stay connected! Sign up or update your email preferences. Manage Account Image Credits Image taken by Kyle Fluback For Press Contact Do Not Sell or Share My Data 205 E. Randolph Chicago, IL, 60601 Box Office: 312.334.7777 info@harristheaterchicago.org Non-Performance Day Phone Hours Monday – Friday: Noon to 5PM Saturday – Sunday: Closed Performance Day Phone Hours Monday – Friday: Noon to Curtain Saturday – Sunday: Two hours prior to performance until Curtain Walk-Up Box Office Hours The box office opens 60 minutes prior to every performance. FAQ My Account Our Story Our Space © 2025 Harris Theater at Millennium Park Site By Interactive Strategies Facebook Twitter Instagram"
    },
    {
      "url": "https://gvtheatre.org/staff-and-board/",
      "text": "Staff & Board - Greenbrier Valley Theatre Skip to content Shows & Events 2025 Season BUY TICKETS Box Office Hours The Met: Live in HD Al Jeter Series Visit Directions FAQs Group Bookings Visit Lewisburg Support Us Volunteer A Beautiful Legacy Artistic Director’s Circle Naming Opportunities Marquee Society Other Opportunities Education Youth Musical After-School Classes Summer Drama Camp Student Matinees Educational Touring Initiative About About GVT Staff & Board Rent GVT Auditions Contact BUY TICKETS BUY TICKETS Shows & Events 2025 Season BUY TICKETS Box Office Hours The Met: Live in HD Al Jeter Series Visit Directions FAQs Group Bookings Visit Lewisburg Support Us Volunteer A Beautiful Legacy Artistic Director’s Circle Naming Opportunities Marquee Society Other Opportunities Education Youth Musical After-School Classes Summer Drama Camp Student Matinees Educational Touring Initiative About About GVT Staff & Board Rent GVT Auditions Contact Shows & Events 2025 Season BUY TICKETS Box Office Hours The Met: Live in HD Al Jeter Series Visit Directions FAQs Group Bookings Visit Lewisburg Support Us Volunteer A Beautiful Legacy Artistic Director’s Circle Naming Opportunities Marquee Society Other Opportunities Education Youth Musical After-School Classes Summer Drama Camp Student Matinees Educational Touring Initiative About About GVT Staff & Board Rent GVT Auditions Contact LEADERSHIp COURTNEY SUSMAN-FRYE Producing Artistic Director email team members Jason Dow Technical Director Production Manager email ext. 102 Elizabeth Salisch Resident Production Stage Manager Assistant Production Manager email ext. 105 MEGAN RADDANT Company Manager email ext. 110 Jenna Fawn Brown Costume Shop Manager Resident Costume Designer email ext. 116 Arron Seams Resident Sound Engineer email Will Proud General Technician email dennis ott Patron Services Coordinator email ext. 113 DOrothy Jo Oberfoell Education Director email ext. 111 Jessica Hiner Box Office Manager/Office Manager email ext. 114 Sadie Fraley Business Manager email ext. 103 Carly Juarez Facilities Associate CLAYTON MADDOX Assistant Technical Director LEWIS BETHUNE General Technician/Props Head Olivia halle General Technician/Scenic Painter BOARD OF Trustees David Dillon President Leigh Ann Trippett 1st Vice President Susan Sharp Campbell 2nd Vice President Jann Holwick Secretary Brian Belcher Treasurer Brian Hajjar Member at Large LESLey HARDIMAN Member at Large Micheline Johnson Member at Large Amy Meadows Member at Large Sky Olt Member at Large Carolanne Roberts Member at Large Sarah Skelding Member at Large Emil Stalis Member at Large Meg Taylor Member at Large Betsy Walker Member at Large 2025 SEASON Check out the exciting 2025 season at Greenbrier Valley Theatre, featuring captivating performances, talented artists, and unforgettable storytelling! LEARN MORE GET IN TOUCH Contact us to learn more, get tickets, or support Greenbrier Valley Theatre in bringing live, professional performances to our community. CONTACT US 2025 SEASON BUY TICKETS ABOUT GVT CONTACT Sign Up For Our Newsletter! Shows Buy Tickets 2025 Season Box Office Hours The Met: Live in HD Al Jeter Series Photo Credits Visit Directions FAQs Group Bookings Visit Lewisburg Support Volunteer Sponsorship Campaign Annual Campaign Artistic Director's Circle Naming Opportunities Marquee Society Other Opportunities Contact 1038 Washington St. E Lewisburg, WV 24901 (304) 645-3838 © 2025 Greenbrier Valley Theatre. All Rights Reserved. Web Design by Havenbrook Media, INC."
    }
  ]
}