{
  "fuentes": [
    {
      "url": "https://www.valiantaircommand.com/contact",
      "email": "warbirds@valiantaircommand.com"
    },
    {
      "url": "https://www.valiantaircommand.com/volunteer",
      "email": "warbirds@valiantaircommand.com"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/northeast-coast/things-to-do/sights/reviews/valiant-air-command-warbird-museum-tico-airshow-182378",
      "email": "facebook-white@2x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/northeast-coast/things-to-do/sights/reviews/valiant-air-command-warbird-museum-tico-airshow-182378",
      "email": "facebook-white@3x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/northeast-coast/things-to-do/sights/reviews/valiant-air-command-warbird-museum-tico-airshow-182378",
      "email": "instagram-white@2x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/northeast-coast/things-to-do/sights/reviews/valiant-air-command-warbird-museum-tico-airshow-182378",
      "email": "instagram-white@3x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/northeast-coast/things-to-do/sights/reviews/valiant-air-command-warbird-museum-tico-airshow-182378",
      "email": "pinterest-white@2x.png"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/northeast-coast/things-to-do/sights/reviews/valiant-air-command-warbird-museum-tico-airshow-182378",
      "email": "pinterest-white@3x.png"
    },
    {
      "url": "https://www.321area.com/florida/titusville/recreation/valiant-air-command-_-tico-warbird-airshow.htm",
      "email": "warbirds@valiantaircommand.com"
    },
    {
      "url": "https://nbbd.com/festivals/warbird/press/index.html",
      "email": "vacinfo1@bellsouth.net"
    },
    {
      "url": "https://www.warbirds-eaa.org/upcoming-warbird-events/page/15/?tribe_event_display=past&tribe_paged=15",
      "email": "rsalant123@outlook.com"
    },
    {
      "url": "https://www.warbirds-eaa.org/upcoming-warbird-events/page/15/?tribe_event_display=past&tribe_paged=15",
      "email": "warbirds@eaa.org"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/titusville/things-to-do/valiant-air-command-warbird-museum/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://www.valiantaircommand.com/rack-card",
      "email": "warbirds@valiantaircommand.com"
    }
  ],
  "mails": [
    "chosen-sprite@2x.png",
    "facebook-white@2x.png",
    "facebook-white@3x.png",
    "instagram-white@2x.png",
    "instagram-white@3x.png",
    "pinterest-white@2x.png",
    "pinterest-white@3x.png",
    "rsalant123@outlook.com",
    "vacinfo1@bellsouth.net",
    "warbirds@eaa.org",
    "warbirds@valiantaircommand.com"
  ],
  "nombre_sitio": "valiantaircommand.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.valiantaircommand.com/contact",
      "text": "About us | Valiant Air Command, Inc. top of page Web Shop Help Center Call Us (321) 268-1941 Home About us Blog Group Tours Events Monthly Fly In Breakfast Upcoming Events 2025 Titusville Mayors Ball Collection All Aircraft Flying Aircraft Pre War – WWI Post War – WWI / WWII Korean War Vietnam & Cold War Modern Era Restoration Area Artifacts Donation Page Get Involved Commemorative Bricks Memberships Events Volunteer Archive & Form Downloads Social Media Stem Program More Use tab to navigate through the menu items. Hours of Operation Cost of Admission Adult Admission: $22.00 Senior/Military Admission: $20.00 Student Admission (Ages 13–18): $10.00 Children’s Admission (Ages 5–12): $5.00 Group Rates Available: Contact Us for Scheduling and Pricing How to get here Address 6600 Tico Road, Titusville, Florida 32780 321-268-1941 Notice about pets In light of the Valiant Air Command Museum's positioning within an operational airport, safety and environmental considerations are paramount, necessitating a restriction of any and all pet animals on site. However, we warmly accommodate certified service animals, with the condition that they are kept on a leash at all times to safeguard their own  well-being as well as that of their owners, and to maintain the safety of our environment. Notice about the 2025 Airshow Thank you for your interest in the 2025 Space Coast Warbird AirShow. Please be advised that our 2025 airshow has been rescheduled to March 2026, as announced on October 3rd on our Facebook page. This decision was made by our Board of Directors due to Titusville Airport’s planned runway resurfacing project, scheduled to begin in February 2025 and anticipated to last approximately four months. For the latest updates, please refer to the pinned post on our Facebook page Valiant Air Command Facebook . Thank you for your continued support and understanding. We look forward to welcoming you to an even bigger and better event in 2026. Contact Us Please note we do have an FAQ for most questions available - Located Here: - FAQ Center First name Last name Email Write a message I have read the FAQ - View FAQ Submit Thanks for submitting! Our website team will be in contact with you. Museum Location 6600 Tico Road, Titusville, Florida 32780 warbirds@valiantaircommand.com (321) 268-1941 Navigation Home About us Blog Group Tours Events Monthly Fly In Breakfast Upcoming Events 2025 Titusville Mayors Ball Collection All Aircraft Flying Aircraft Pre War – WWI Post War – WWI / WWII Korean War Vietnam & Cold War Modern Era Restoration Area Artifacts Donation Page Get Involved Commemorative Bricks Memberships Events Volunteer Archive & Form Downloads Social Media Stem Program Opening Hours Mon - Sun 9:00 am – 5:00 pm (ET) ​ Closed Thanksgiving Day, Christmas Day New Year's Day More Details Help Contact Us About Us ​ Connect with us! Sponsors and Supporters As a private, 501(c)(3) non-profit, the Valiant Air Command, Inc. would not exist without the support of donors and volunteers. It is because of the generosity of individuals, corporations and the public sector that we can continue to maintain the ongoing restoration, preservation and educational programs that take place. bottom of page"
    },
    {
      "url": "https://www.valiantaircommand.com/volunteer",
      "text": "Volunteer | Valiant Air Command, Inc. top of page Web Shop Help Center Call Us (321) 268-1941 Home About us Blog Group Tours Events Monthly Fly In Breakfast Upcoming Events 2025 Titusville Mayors Ball Collection All Aircraft Flying Aircraft Pre War – WWI Post War – WWI / WWII Korean War Vietnam & Cold War Modern Era Restoration Area Artifacts Donation Page Get Involved Commemorative Bricks Memberships Events Volunteer Archive & Form Downloads Social Media Stem Program More Use tab to navigate through the menu items. Volunteer with Us! Volunteers are the backbone of the Valiant Air Command. We operate with a minimum of paid staff and our community of Volunteers is responsible for most of the major activities in the museum – from maintaining and flying aircraft, to educating and guiding our visitors or to organizing our social and special events – we are always looking for good people to join the VAC family. Many volunteers start out as Tour Guides in our museum, then move into an area that interests them. We ask for a minimum commitment of 4 hours a week, but most people do much more. Our volunteers are from a cross-section – some have spent years in aviation, some have no prior experience with warbirds but are interested in finding a rewarding opportunity to support the community. The minimum age for volunteer applications is 18 – there is no upper age requirement! Current Volunteer Login Volunteer Today! Museum Location 6600 Tico Road, Titusville, Florida 32780 warbirds@valiantaircommand.com (321) 268-1941 Navigation Home About us Blog Group Tours Events Monthly Fly In Breakfast Upcoming Events 2025 Titusville Mayors Ball Collection All Aircraft Flying Aircraft Pre War – WWI Post War – WWI / WWII Korean War Vietnam & Cold War Modern Era Restoration Area Artifacts Donation Page Get Involved Commemorative Bricks Memberships Events Volunteer Archive & Form Downloads Social Media Stem Program Opening Hours Mon - Sun 9:00 am – 5:00 pm (ET) ​ Closed Thanksgiving Day, Christmas Day New Year's Day More Details Help Contact Us About Us ​ Connect with us! Sponsors and Supporters As a private, 501(c)(3) non-profit, the Valiant Air Command, Inc. would not exist without the support of donors and volunteers. It is because of the generosity of individuals, corporations and the public sector that we can continue to maintain the ongoing restoration, preservation and educational programs that take place. bottom of page"
    },
    {
      "url": "https://www.fodors.com/world/north-america/usa/florida/northeast-coast/things-to-do/sights/reviews/valiant-air-command-warbird-museum-tico-airshow-182378",
      "text": "Valiant Air Command Warbird Museum & Tico Airshow Review - Northeast Coast Florida - Sights | Fodor’s Travel Go Destinations Hotels Travel News Cruises Forums Trip Ideas More Forums Trip Ideas Subscribe Login Subscribe Login USA Europe Africa & The Middle\n                        East Asia Australia & The\n                        Pacific Canada Caribbean Mexico &\n                        Central America South America Cruise Overview Cruise News Cruising 101 Line & Ship Directory Guidebooks Africa & the Middle East Asia Australia & the Pacific Canada Caribbean Europe Mexico & Central America South America United States Air Travel Cruises Travel Tips & Trip Ideas Forums Help View All Forums National Parks Best Road Trips in America Ultimate Guides for the ultimate trip Love to travel? Get FREE email communications from Fodor's Travel, covering must-see travel destinations, expert\n                        trip planning advice, and travel inspiration to fuel your passion. By signing up for the newsletter, I agree to the Privacy Policy. You must check the box to subscribe Home Destinations USA Europe Africa & The Middle East Asia Australia & The Pacific Canada Caribbean Mexico & Central America South America View All Destinations Hotels Travel News Cruises Cruise Overview Cruise News Cruising 101 Cruise Directory Forums Africa & the Middle East Asia Australia & the Pacific Canada Caribbean Europe Mexico & Central America South America United States Air Travel Cruises Travel Tips & Trip Ideas Forums Help View All Forums Trip Ideas National Parks Best Road Trips in America Ultimate Guides Login Subscribe Northeast Coast Overview Hotels Restaurants Sights Top Places Shopping Nightlife Performing Arts Gallery More Northeast Coast Things to Do Northeast Coast Travel Guide Overview Hotels Restaurants See Top Places Shopping Nightlife Arts Gallery Sights Shopping Nightlife Performing Arts Fodor's Expert Review Valiant Air Command Warbird Museum & Tico Airshow Titusville Family Don't judge a book by its cover: what's inside this very ordinary-looking building is extraordinary. Operated mostly through the efforts of an enthusiastic team of volunteers, the museum has an impressive collection of memorabilia and aircraft from World Wars I and II, Korea, Vietnam and more recent conflicts, as well as extensive displays of vintage military flying gear and uniforms. There are posters that were used to help identify Japanese planes, plus a Huey helicopter and the cockpit of an F-106 that you can sit in. In the north hangar a group of dedicated aviation volunteers busily restores old planes. It's an inspiring sight, and a good place to hear some war stories. In the spring the museum puts on the Tico Warbird Airshow, featuring fighter and bomber aircraft that formerly flew in combat around the world. The lobby gift shop sells real flight suits, old flight magazines, bomber jackets, books, models, and T-shirts. Family History Museum Quick Facts 6600 Tico Rd. Titusville, Florida 32780, USA 321-268–1941 www.warbirdairmuseum.com Sight Details: Rate Includes: $22 Related Stories Trip Ideas Family Vacation Planner: Daytona Beach and the International Speedway Elissa Garay VIEW ALL What’s Nearby Related Stories Trip Ideas Family Vacation Planner: Daytona Beach and the International Speedway Elissa Garay VIEW ALL Related Forum Posts Trip Report: Outback Adventure by RalphR on\n                                    Sep 01, 2025 A Mother-Daughter Trip to South Korea by memejs on\n                                    Jun 01, 2025 Scotland Most Memorable by Dukey1 on\n                                    Nov 29, 2024 Planning 2025 by kelsey22 on\n                                    Aug 11, 2024 VIEW ALL Related Forum Posts Trip Report: Outback Adventure by RalphR on\n                                    Sep 01, 2025 A Mother-Daughter Trip to South Korea by memejs on\n                                    Jun 01, 2025 Scotland Most Memorable by Dukey1 on\n                                    Nov 29, 2024 Planning 2025 by kelsey22 on\n                                    Aug 11, 2024 VIEW ALL Destinations USA Florida Northeast Coast Things to Do Sights Valiant Air Command Warbird Museum & Tico Airshow About Us Contact Us Our Team Press Room FAQs Award Licensing Advertising Content Licensing Site Map About Us Contact Us Our Team Press Room FAQs Award Licensing Site Map Advertising Content Licensing Follow Us Fodor’s Travel Use of this site indicates your consent to the Terms of Use. Copyright © 2025 by MH\n                Sub I, LLC dba Internet Brands. Fodor’s is a registered trademark of MH Sub I, LLC dba Internet Brands. All rights reserved. Terms of Use | Privacy Policy | Cookie Policy | Manage Preferences | Your Privacy Choices Subscribe to Newsletter Sign up for Travel Tips & News Please Enter a Valid Email Address Subscribe I want emails from Fodor's Travel with travel information and promotions. I can unsubscribe\n            any time using the unsubscribe link at the end of all emails. Thank you for your interest! Look out for our newsletters with travel tips and special offers. Sign up for Travel Tips & News By signing up for the\n                newsletter, I agree to the Privacy Policy . You must check the box to subscribe Thank you for your interest! Look out for our newsletters with travel tips and special offers."
    },
    {
      "url": "https://www.321area.com/florida/titusville/recreation/valiant-air-command-_-tico-warbird-airshow.htm",
      "text": "Valiant Air Command & Tico Warbird Airshow - Recreation - Titusville - Titusville Explore More Areas Near By Lakeland, FL Orlando, FL Daytona Beach, FL Treasure Coast, FL Tampa, FL Trending Austin,TX Denver,CO Atlanta,GA Fort Lauderdale,FL Dallas,TX Find More Locations Claim My Business Login Sign Me Up Valiant Air\r\n\t\t\t\t\t\t\t\t\t\t\tCommand & Tico Warbird Airshow Recreation $ Call Us Get There Get Local Deals 6600 Tico Rd Titusville, FL 32780 Titusville Rate and review â â â â â Is This Your Listing? Are you the owner of\r\n\t\t\t\t\t\t\t\t\t\t\tValiant Air Command & Tico Warbird Airshow in Brevard County Florida? Send\r\n\t\t\t\t\t\t\t\t\t\t\tus more details! Claim Your Business Or Contact Us Description The Valiant Air Command Warbird\r\n\t\t\t\t\t\t\t\t\t\t\t\tAir Museum and Airshow Inc., The City of Titusville & Space Coast\r\n\t\t\t\t\t\t\t\t\t\t\t\tRegional Airport are pleased to present one of Florida's most celebrated\r\n\t\t\t\t\t\t\t\t\t\t\t\taviation event's. 2018 marks the 41st year for the Warbird Airshow and\r\n\t\t\t\t\t\t\t\t\t\t\t\tas always we aim to present spectators a superb lineup of military,\r\n\t\t\t\t\t\t\t\t\t\t\t\tcivilian performers, aerobatics, and plenty of warbirds. We'll be\r\n\t\t\t\t\t\t\t\t\t\t\t\tcelebrating and commemorating the Pacifc Thearter of Operations during\r\n\t\t\t\t\t\t\t\t\t\t\t\tWorld War 2 for the 2018 airshow including special tributes for those\r\n\t\t\t\t\t\t\t\t\t\t\t\twho served during the conflict. Be sure to check both the official Valiant Air Command Website:\r\n\t\t\t\t\t\t\t\t\t\t\t\thttp://www.valiantaircommand.com and here on the official Tico Warbird\r\n\t\t\t\t\t\t\t\t\t\t\t\tAirshow Facebook Page for timely updates on performers as well as ticket\r\n\t\t\t\t\t\t\t\t\t\t\t\tinformation as they become available for sale. Mark your calendar's and\r\n\t\t\t\t\t\t\t\t\t\t\t\tprepare to become a part of history! What to expect, here are some incredible pictures from the 2013\r\n\t\t\t\t\t\t\t\t\t\t\t\tAirshow: https://www.facebook.com/media/set/?set=a.508761039170423.1073741825.156623611050836&type=3 Sites of interest and local partners: ICAS: http://www.airshows.aero/ Brevard Cultural Alliance: http://www.artsbrevard.org/ City of Titusville: http://www.titusville.com/ Kennedy Space Center: http://www.kennedyspacecenter.com/ Cocoa Beach.com: http://www.cocoabeach.com/index1.shtml Airshow Reviews.com: http: Upcoming\r\n\t\t\t\t\t\t\t\t\t\t\tEvents Frequently Asked Questions Places You\r\n\t\t\t\t\t\t\t\t\t\t\tShould Consider Get to know\r\n\t\t\t\t\t\t\t\t\t\t\tValiant Air Command & Tico Warbird Airshow The Valiant Air Commands 41st Annual Warbird Airshow. Dates April 6,7,\r\n\t\t\t\t\t\t\t\t\t\t\t\tand 8th 2018 Visit website:http://www.valiantaircommand.com April 6, 7,\r\n\t\t\t\t\t\t\t\t\t\t\t\t8 2018 Valiant Air Command & Tico Warbird Airshow\r\n\t\t\t\t\t\t\t\t\t\t\tPhotos People Connected Is Valiant Air Command & Tico Warbird\r\n\t\t\t\t\t\t\t\t\t\t\t\tAirshow one of your Favorite Places? Add to My Connections Plug\r\n\t\t\t\t\t\t\t\t\t\t\tUpdates Say Something or Ask a Question about Valiant Air Command & Tico Warbird\r\n\t\t\t\t\t\t\t\t\t\t\tAirshow Say Something Add Photos Recommended Ratings & Reviews Service Cleanliness Bang for your Buck Parking & Accessibility Rate & Review Related places Titusville Marina Dog Park 101 N Washington Ave, Titusville\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tFL, 32796 This is a place to stay involved in the Sand\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tPoint Park Dog Park. Please post any pictures you have to share! Titusville Playalinda CrossFit 3550 S Washington Ave, Ste 7,\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tTitusville FL, 32780 Playalinda CrossFit focuses on group exercise\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tclasses that perform constantly varied functional movements to help\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tanyone improve their fitness level. CrossFit... Titusville Brevard County Manatee Hammock Campground 7275 S. US Highway 1, Titusville\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tFL, 32780 Manatee Hammock Campground offers a secluded\r\n\t\t\t\t\t\t\t\t\t\t\t\t\toasis with easy access to urban amenities. Close to Space Coast\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tparks and attractions, and to Central Floirda. Titusville Fox Lake Park 4400 Fox Lake Rd, Titusville FL,\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t32796 Fox Lake Park is a popular getaway ideal for\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tlarge community events or family time. Facilities at the park\r\n\t\t\t\t\t\t\t\t\t\t\t\t\tinclude 32 usable acres with 7-miles of hiking... Titusville Home Add My\r\n\t\t\t\t\t\t\t\t\t\tEvent Add My\r\n\t\t\t\t\t\t\t\t\t\tBusiness Valentine's Day 2021 Super Bowl 2021 Restaurants Nightlife Events Things to\r\n\t\t\t\t\t\t\t\t\t\tDo Sports Family Recreation Travel Real Estate Jobs Directory × Eat Things to Do Save Vote Nightlife Events Family Shop Real Estate Sports Travel Jobs Join My Community 321area.com would like to send you latest updates Join Now Remind me\r\n\t\t\t\tlater Sections Nightlife Restaurants Events Travel Recreation Photographers Live Music & Bands Jobs Real Estate The Loop Things to do Community Business Toolbox Add Your Business Post Your Event Advertise with Us Business Directory Connect with MyArea Network Sign Up Now About Contact Us Partners Privacy Policy Sitemap Careers Popular Areas Cape Canaveral Cocoa Cocoa Beach Downtown Melbourne Eau Gallie Arts District Melbourne Merritt Island Palm Bay Rockledge Titusville Communities eSports Fitness Family & Parenting EDM Health & Beauty Breweries Business & Finance Arts & Theater Golf Vegetarian Foodie Fashion All logos and trademarks in this site are property of their respective owner.\r\n\t\t\t\t\t\tThe comments and listings are property of their posters. All the rest Copyright © 2021 by MyArea Network, Inc . All Rights Reserved. Powered by Terms and conditions ."
    },
    {
      "url": "https://nbbd.com/festivals/warbird/press/index.html",
      "text": "Titusville Florida - TICO Warbird Airshow - Press Releases Warbird Airshow March 14, 15, and 16, 2014 Valiant Air Command 6600 Tico Road, Titusville, FL 32780 321-268-1941 — vacinfo1@bellsouth.net Valiant Air Command Warbird Museum website Press Releases This information may be used freely by magazines, newspapers, newsletters, etc. to let your readers know about our airshow. It will be updated periodically as new information comes available. If you need larger pictures, please contact us. If you could send us a copy of the publication, it would be greatly appreciated. Press TICO Airshow Hold Harmless Agreement February 27, 2014 -- PRESS RELEASE VALIANT AIR COMMAND PRESENTS THE 37th ANNUAL TICO WARBIRD AIR SHOW Titusville, FL – The Valiant Air Command will host the 37th Annual TICO Warbird Airshow on Friday, March 14; Saturday, March 15 and Sunday, March 16, 2014. This year's program will be a special tribute to the Tuskegee Airmen and the missions they flew in their Red Tail P-51 Mustangs protecting U.S. bombers in Europe during WW II. Loaded with entertainment for the whole family, each day's activities will include a three-hour aerial performance by over 40 aircraft from WW I, WW II, Korean and Vietnam flying formations and demonstrations of parachute jumps and simulated dog fights. Additionally, military and civilian aircraft will be on display and military re-enactors and firepower will be demonstrated. Flight simulators, airplane and helicopter rides will be available. Other entertainment will include a car display, a midway with rides, an autograph tent and more. The TICO Warbird Airshow will be held at the Space Coast Regional Airport, 6600 Tico Road, Titusville 32780. Gates open at 8:30 a.m. each day. Advanced admission is $15.00 for adults and $5.00 for children 5 to 8 years of age. Tickets will be an additional $5.00 at the gate. Some activities require special tickets. For more information on activities, times they are scheduled and to purchase tickets online, please visit the AirShow website or call 321-268-1941. The Valiant Air Command Warbird Museum is a 501(c) 3 Educational Museum, non-profit, dedicated to the preservation of aviation history for future generations. Ron Davis Public Relations Officer Valiant Air Command 6600 Tico Road Titusville FL 32780 321-268-1941 PICK UP TICKETS LOCALLY These photos may be used in conjunction with publicity for the VAC TICO Warbird Airshows. The acrobatic Titus Tiger flys between two smoke rings blown from the ground Click for 8\" x 6\" x 300dpi photo Have your picture taken while in the cockpit of a warplane. Click for 8\" x 5.3\" x 300dpi photo You can ride in our C-47 the \"Tico Belle,\" a veteran of D-Day. Click for 8\" x 6\" x 300dpi photo Show conducted by TICO Warbird Airshow, Inc., for the Valiant Air Command Museum Fund and Aviation Scholarship Programs. VAC Warbird AirShow Home Page Festivals Directory Valiant Air Command Museum website North Brevard Business Directory In-depth community resources for the Titusville, Florida area • HOME Titusville Area Businesses Calendar/Events Festivals Places to Go Things to Do Ecotourism About the NBBD Community Organizations Government Maps Get out and go! Keeping you up-to-date with what is available and what is going on in the Titusville, FL area. Contact the webmaster for most anything by CLICKING HERE the North Brevard Area Produced by Peak Performance Co. nbbdcom@gmail.com Last updated: 2/27/14 —  © 1996 - 2014 Your Titusville area business web site, web page, or web card on this Community Directory. We can register, produce, host and market your Internet presence. LOTS TO DO in North Brevard. We challenge you to discover them! 2/11/2010"
    },
    {
      "url": "https://www.warbirds-eaa.org/upcoming-warbird-events/page/15/?tribe_event_display=past&tribe_paged=15",
      "text": "Upcoming Warbird Events | EAA Warbirds of America Search Search for: Facebook Twitter Instagram WarbirdSafety.com View Member Benefits Member Login Forms Digital Magazine Aircraft Directory Facebook Twitter Instagram About Us Who We Are Squadrons History Sponsorship Contact Us Programs Overview Hall of Fame Vintage & Experimental Aircraft Program Aerobatic Competency Evaluator Program E-PPE Small N Numbers Events Calendar AirVenture Sun ‘n Fun Aircraft Judging National Warbirds Operator Conference News Gallery Store Join Warbirds Select Page . . . Forms Digital Magazine Aircraft Directory MEMBERS ONLY Upcoming Warbirds Events Would you like your event to be added to our calendar of events?  Please send an email including your name, email address, website of the event, time, date, description, etc. to warbirds@eaa.org . You can also give us a call at 920-426-6883. We look forward to supporting your event through our website, social media and weekly e-blasts. Past Events Events Search and Views Navigation Show Events Search Events Search Events From « Previous Events Next Events » November 2023 American Heroes Air Show November 4, 2023 Hansen Dam Recreational Area, 11770 Foothill Blvd Lake View Terrace , CA 91342 United States + Google Map We’re very pleased to invite your team to join the community on Saturday, November 4, 2023 when the AMERICAN HEROES Air Show returns to the place it was born! Since 1996 when the AMERICAN HEROES Air Show first deployed to Hansen Dam Sports Complex in Los Angeles, this unique aviation experience has grown … both in scope and mission. Over the years rotary-wing enthusiasts who journeyed to Los Angeles to see what our event was all about returned home and worked to… Find out more » Florida International Air Show November 4, 2023 - November 5, 2023 Charlotte County Airport, 28000 A-1, Airport Road Punta Gorda , FL 33982 United States + Google Map Florida International Airshow 2023 November 4th & 5th Gates open at 9 AM and the show begins at 12 PM *Tickets  INCLUDE free parking* NO REFUNDS WILL BE GIVEN. This is a rain or shine event. IF the entire Air Show is Canceled on Saturday, November 4th; ticket will be Honored on Sunday, November 5th or the next Air Show depending upon ticket selection. If the Entire Air Show is Cancelled, Ticket will be honored at the next Air Show.  USAF Thunderbirds… Find out more » Stuart Air Show 2023 November 10, 2023 - November 12, 2023 Witham Field Airport, 1895 Flying Fortress Ln Stuart , FL 34996 United States + Google Map Gates open: Friday 4:30PM - 9PM                       Sat + Sun 9AM - 5PM On Friday the show starts at 5 pm. On Saturday and Sunday, the opening Ceremony begins at approximately 11:30 am. Performers: USAF F-22 \"Raptor\" Demonstration team F-16 Viper Demo Team USAF Heritage Flight Foundation USN GA-18G Growler Legacy Flight team USN Legacy Flight KC-135 Stratotanker Demonstration team and many more! Find out more » Warbirds Over Monroe Air Show November 11, 2023 - November 12, 2023 Charlotte Monroe Executive Airport, 3900 Paul J Helms Dr. Monroe , NC 28110 United States + Google Map Warbirds Over Monroe Air Show ONLINE TICKETS FOR THE 2023 AIR SHOW ARE NOW AVAILABLE! HTTPS://WWW.EVENTSPROUT.COM/EVENT/WARBIRDS-OVER-MONROE-AIR-SHOW-2023 Gates Open 9 am and Close at 5 pm Flying Starts at Noon All Flying Schedules Subject to Change GET YOUR TICKETS TO THE HANGAR DANCE - SATURDAY NIGHT ONLY Find out more » Veterans Day Program At American Airpower Museum Honors Long Island Veterans November 11, 2023 American Airpower Museum, Hangar 3, 1230 New Highway Farmingdale , NY 11735 United States + Google Map Veterans Day Program At American Airpower Museum Honors Long Island Veterans   Farmingdale, NY, November 6, 2023 - The American Airpower Museum (AAM) has joined forces with Honor Flight Long Island (HFLI) and Mission Margraten Plus (MMP) to host a special Veterans Day program honoring Long Island veterans, on Saturday, November 11, 2023, from 11:00 a.m. to 2:30 p.m. at the Museum, Hangar 3, 1230 New Highway, Farmingdale, New York.  Long Islanders to be honored include five World War II… Find out more » New Bern Aeroshell Team Night Show November 25, 2023 Union Point Park, 210 E Front St. New Bern , NC 28560 United States + Google Map More information to come on City of New Bern website! Find out more » December 2023 American Airpower Museum “Dropping of the Roses” Pearl Harbor Memorial Ceremony December 7, 2023 American Airpower Museum, Hangar 3, 1230 New Highway Farmingdale , NY 11735 United States + Google Map American Airpower Museum “Dropping of the Roses” Pearl Harbor Memorial Ceremony Conducted by the Long Island Air Force Association On Thursday, December 7, 2023, American Airpower Museum hosts the annual “Dropping of the Roses” Pearl Harbor Memorial Ceremony conducted by the Long Island Air Force Association (LIAFA).  The American Airpower Museum (AAM) has provided space for this event each year ever since the Museum opened its doors in 2000.  December 7, 2023 is the 82nd Anniversary of the Japanese attack on the U.S.… Find out more » Pancake Breakfast with Santa and Mrs. Claus at the American Airpower Museum December 17, 2023 @ 8:00 am - 11:00 am American Airpower Museum, Hangar 3, 1230 New Highway Farmingdale , NY 11735 United States + Google Map Contact: Robert F. Salant, Public Affairs, (516) 328-3959, (718) 791-4758, rsalant123@outlook.com   Farmingdale, NY, December 4, 2023 -- The American Airpower Museum (AAM) will hold its annual Winter Hangar Pancake Breakfast on Sunday, December 17, 2023, from 9:00 until 11:00 a.m.  Come and participate in a fun community event for the entire family.  Hangar 3 will be decked out with Christmas decorations, plus they’ll be photo ops with Santa and Mrs. Claus all day, so bring your cameras!  Enjoy hot pancakes… Find out more » January 2024 “Hangar Talk” and Flying Demo of the Curtiss P-40N “Warhawk” January 6, 2024 Planes of Fame Air Museum, 14998 Cal Aero Drive Chino , CA 91710 United States + Google Map \"Hangar Talk\" and Flying Demo of the Curtiss P-40N \"Warhawk\" Planes of Fame Air Museum Chino, CA This Saturday – January 6, 2024 – Planes of Fame Air Museum will kick off the New Year with a great series of presentations for “Hangar Talk” and a thrilling “Flying Demo” as they fly one of the Museum’s World War II, combat veterans – the Curtiss P-40N “Warhawk.”   Doors to the Museum will open at 9:00am. \"Hangar Talk\" at 10:30am- \"Flying Demo\" at… Find out more » February 2024 Webinar “Six Big Mistakes of Aircraft Maintenance” February 7, 2024 @ 7:00 pm - 8:00 pm Six Big Mistakes of Aircraft Maintenance |  Qualifies for FAA WINGS and AMT credit. Wednesday, February 7, at 7 p.m. CST Presenter: Mike Busch In this webinar, GA maintenance expert and owner advocate Mike Busch A&P/IA discusses the six most common blunders he sees aircraft owners make in dealing with their shops and mechanics. These range from allowing mechanics to decide what maintenance needs to be done (which is the owner's job) to failing to obtain written cost estimates to allowing… Find out more » « Previous Events Next Events » + Export Events EAA Aviation Center P.O. Box 3086 Oshkosh, WI 54903-3086 920-426-4800 Quick Links Home About Us Squadrons History Sponsorship Programs Events News Media Gallery Store Contact Us Join Warbirds Facebook Twitter Instagram All content, logos, pictures, and videos are the property of EAA // Copyright © 2025 - Experimental Aircraft Association, Inc. // Privacy Policy"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/titusville/things-to-do/valiant-air-command-warbird-museum/",
      "text": "Valiant Air Command Warbird Museum - Visit Space Coast Skip to main content Item Added to Itinerary My Planner Share My Itinerary Added to Wishlist Copied to Clipbord Surf Cams Map Local Weather Explore Fall is for Foodies Kennedy Space Center Visitor Complex Port Canaveral Wildlife Viewing Cocoa Beach Brevard Zoo Things To Do Sea Turtle Season Attractions Beaches Communities Restaurants Tours Museums Stay Bed and Breakfast Campgrounds Hotels Vacation Rentals Events Blogs Launches My Itinerary Visitor Information Vacation Planner Accessibility on the Space Coast Beach Safety Transportation and Map Search for: Search Follow Us on Social Media facebook-f instagram youtube pinterest-p Search for: Search Home Things to Do Valiant Air Command Warbird Museum Add to Wishlist Valiant Air Command Warbird Museum At the Valiant Air Command Warbird Museum maintains and restores all types of aircraft indigenous to the world’s military forces, from pre-WWI to the present. See these aircrafts on display in two hangars, and if you’re lucky, you may see the team in action restoring a plane. History buffs will also love poring through the memorabilia. Join them on the second Saturday of every month at 8 a.m. for the Fly-In Breakfast. The Valiant Air Command Warbird Air Museum is happy to announce that it is now open five days a week (Wednesdays through Sundays) from 9-5. Visit our website at www.valiantaircommand.com for additional information. Hours subject to change Add to Trip Visit Website Direction 6600 Tico Rd, Titusville, FL 32780 Contact (321) 268-1941 Discover More nearTitusville All Hotels Restaurants Events Add to Wishlist Vine & Olive Titusville Celebrate the season with our Fall is for Foodies prix fixe menu. Begin with shareables like house meatballs, crispy mozzarella, or a fig out flatbread. Choose fresh salads, then savor Italian entrées from chicken parmesan with creamy rigatoni to mushroom bucatini, spicy rigatoni, or rich short rib bolognese. End with… Add to Trip Add to Wishlist Third Culture Kitchen Titusville Share a delicious 3-course meal for two! Start with a Mezze or Small Plate like veggie spring rolls, fried cheese, chips & queso, or a fresh ginger salad. Choose two entrées — burritos, hibachi bowls, Latin bowls, or street tacos — with your favorite proteins and sides. End on a… Add to Trip Add to Wishlist Bravo Taco Titusville Enjoy the ultimate taco trio: one Soft Taco (chicken or beef), one Hard Taco, and the star — a cheesy Bravo Taco, with two crispy shells wrapped in a warm flour tortilla with queso, loaded with your choice of protein and all the fresh toppings. Served with chips & salsa… Add to Trip Add to Wishlist Zero Gravity Wine Bar Titusville More than just a wine bar, Zero Gravity Wine Bar offers a tasting experience for everyone, whether you’re just getting started or already love wine. You don’t need to be an expert here. Our founders are passionate wine lovers who believe tasting should be fun, relaxed, and open to all…. Add to Trip Add to Wishlist Humpavelli’s Pizza Titusville Family-owned since 2013 to serve you the best food with the always freshest ingredients. We pride ourselves on having the friendliest customer service around as we make your food to order in an open kitchen to show you what we’re all about. We make everything in-house every morning to continuously… Add to Trip Add to Wishlist Past and Presence, Titusville’s Historic Ghost Tour Titusville Step into the mysterious and haunting history of Titusville, Florida, with our immersive ghost tours. Our guided tours offer a unique blend of history, folklore, and spine-chilling tales that will leave you captivated and intrigued. Whether you’re a skeptic or a believer, our tours provide an unforgettable experience that will… Add to Trip Add to Wishlist In the Dog House Art Studio Titusville In the Dog House Art Studio and Tiny House Art Village is a vision made reality by artist Maxine Trainer. Located on 4 acres on Florida’s Space Coast, the studio and art village comprise a venue for art classes and special events; a gallery feature work by Maxine and other… Add to Trip Add to Wishlist Comfort Suites Titusville Near Kennedy Space Center Titusville Exciting news! We’ve just launched the brand new Comfort Suites Titusville near Kennedy Space Center, offering the perfect blend of comfort, convenience, and value for your next business trip to the heart of Florida’s Space Coast. Stay in Style, Work with Ease: Spacious guest rooms featuring plush bedding, flat-screen TVs… Add to Trip Add to Wishlist Vine & Olive Titusville Vine & Olive is inspired by local fresh ingredients to make elevated dishes served in an inviting casual setting. You will see dishes on our menu that have Italian and Mediterranean influences served with a modern twist. We also have a large selection of Gluten free and vegan options. We… Add to Trip Add to Wishlist Chain of Lakes Park – Sports Venue Titusville Chain of Lakes Park is located just north of downtown Titusville and hosts playgrounds, trails, relaxing waterfront seating and: Two (2) lighted 200’ softball fields Five (5) lighted 300’ softball fields Eight (8) soccer fields ﻿ ﻿﻿ Add to Trip Add to Wishlist Space Coast Ceramics Titusville A walk in paint your own pottery studio, fun for the whole family, couples, and large groups! Come by any time to paint your own pottery in a relaxed, fun environment suitable for all ages. Groups of 6+, reservations recommended. Give us a call, we would love to tell you… Add to Trip Add to Wishlist Black Cat Coffee Titusville Black Cat Coffee is a small batch coffee roaster and coffee shop. We specialize in single origin coffee. Add to Trip Add to Wishlist The Café Paradiso Bistro and Social Club Titusville Café Paradiso Bistro and Social Club is where the vibrant flavors of the Caribbean, the soulful essence of Cajun and Creole, and the rich tastes of Cuban cuisine come together in perfect harmony. We are proud to offer you an authentic New Orleans dining experience that you will fall in… Add to Trip Add to Wishlist Springs to Sea Old Florida Eco Tours Titusville Want to get lost in the moment without getting lost in the crowd? Springs to Sea Old Florida Eco Tours provides kayak tours, paddle board tours, guided hikes, and outdoor fitness to visitors and locals! Springs to Sea Old Florida Eco Tours is permitted with USFWS to operate commercial tours… Add to Trip Add to Wishlist Blue Heron Restaurant Titusville Open to the public in The Great Outdoors. Beautiful views, delicious food and comfortable atmosphere. Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your... Add to Trip Add to Wishlist Hilton Garden Inn Cape Canaveral near Cocoa Beach Experience the perfect blend of comfort, convenience, and coastal charm at the Hilton Garden Inn Cape Canaveral. Our brand-new hotel features 156 spacious, modern guest rooms and welcomes all travelers. Planning an event? Our 775-square-foot meeting room is ideal for gatherings, and our professional culinary team is ready to make... Add to Trip Add to Wishlist Homewood Suites by Hilton Viera Melbourne Brand‑new, 4‑story, all-suite hotel with 131 spacious suites providing separate living and sleeping areas—ideal for families, business travelers, and extended stays. Nestled off Interstate 95 in the vibrant Viera/Borrows West district, it offers convenient access to the USSSA Space Coast Sports Complex, Brevard Zoo, The Avenue Viera shopping & dining, and... Add to Trip Add to Wishlist Springhill Suites by Marriott West Melbourne Palm Bay Kick back and feel your worries melt away as you settle in for a rewarding stay at SpringHill Suites West Melbourne. Our spacious hotel suites and vibrant spaces are perfect for working, playing or relaxing. Take the stress out of travel with perks like free WiFi, outdoor pool and a... Add to Trip Add to Wishlist Fairfield Inn & Suites Melbourne West/Palm Bay Get comfortable at Fairfield Inn and Suites Melbourne West Palm Bay. Our Melbourne Florida hotel has everything you need to recharge on the road. Refresh in our suites with signature plush Marriott bedding, ergonomic workspaces, and free WiFi. Start your morning with selections from our complimentary breakfast served daily. Maintain... Add to Trip Add to Wishlist Hyatt Place Cape Canaveral Explore the Space Coast from our modern rooms at Hyatt Place Cape Canaveral, from rooftop views of live rocket launches from Kennedy Space Center and the Cape Canaveral Space Force Station. Relax at our outdoor pool, enjoy a meal at The Placery or grab to-go snacks at The Market after... Add to Trip Add to Wishlist Comfort Suites Titusville Near Kennedy Space Center Exciting news! We’ve just launched the brand new Comfort Suites Titusville near Kennedy Space Center, offering the perfect blend of comfort, convenience, and value for your next business trip to the heart of Florida’s Space Coast. Stay in Style, Work with Ease: Spacious guest rooms featuring plush bedding, flat-screen TVs... Add to Trip Add to Wishlist Hotel Melby Hotel Melby celebrates the raw and the refined, where artistry dances with science and the process of discovery itself is on display. From evocative artworks and cultural diversity to alluring explorations of space and time – Hotel Melby stands as a doorway to the vibrant and distinctive essence of Melbourne.... Add to Trip Add to Wishlist Element Melbourne Oceanfront Inspired by Westin Hotels & Resorts, the Element Melbourne Oceanfront believes in providing travelers, whether on the road for work or leisure, not just a great place to stay, but a place to stay connected, feel alive, balanced and maintain their rituals and lifestyles. With stunning views of the Atlantic... Add to Trip Add to Wishlist Comfort Inn & Suites Melbourne-Viera We are family owned/operated hotel since 2007 . We treat our guests like family and offer both King and Double Room types. We offer free amenities such a fully hot breakfast, swimming pool and laundry facilities. We love to host families, sports teams, business travels and leisure guest. Add to Trip Add to Wishlist Holiday Inn Express Cape Canaveral Holiday Inn Express Cape Canaveral is ideally located next to Terminal 3 at Port Canaveral and the Jetty Park Beach & Pier. We are just minutes from a variety of restaurants, shopping destinations, and popular attractions like the Kennedy Space Center Visitor Complex. As the first choice for the increasing... Add to Trip Add to Wishlist Seascape Motels Modern amenities meet Old Florida style in this hidden oceanfront treasure — with southern charm and hospitality! Quaint and affordable, the Sea Scape has character. We take pride in our cleanliness, service and repeat business. Every day is perfect at the Sea Scape Motel & Apartments. You’ll awake to magnificent... Add to Trip Add to Wishlist Americas Best Value Inn Satellite Beach Melbourne Come and enjoy an out-of-this-world atmosphere at the America’s Best Value Inn Satellite Beach. A short walk from the beach, this pet friendly hotel is conveniently located less than 15 minutes from the Melbourne Orlando International Airport and less than 16 miles from Port Canaveral. America’s Best Value Inn Satellite Beach invites you... Add to Trip Add to Wishlist TownePlace Suites by Marriott – Cape Canaveral / Cocoa Beach Designed for longer stays, our property features fully equipped kitchens, lobby bar, poolside beverage service with covered seating. Hydro-stations throughout the hotel. 24-hr fitness and business center. Meeting space to accommodate groups up to 30. Balconies in select suites offering fantastic views of port, rocket launches and the Banana River. Add to Trip Add to Wishlist The Pineapple Estate EGAD A Beautiful Private Estate Vacation home nestled in the wonderful Eau Gallie Arts District. The Estate Sleeps 22, has direct river access, minutes to the Atlantic Ocean and boasts the best distant, unobstructed views of the Florida Sunrises, Sunsets and Rocket Launches. Walking distance to Restaurants, shopping, night life venues... Add to Trip Add to Wishlist MoonShine A Plant Based Kitchen MoonShine A Plant Based Kitchen is Cocoa Villages go to destination for fresh, flavorful, and 100% vegan cuisine. We specialize in creative plant based dishes, made from scratch and locally sourced ingredients when possible, offering a menu that’s nourishing as it is delicious. From vibrant bowls and comfort food classics... Add to Trip Add to Wishlist Hola! Cuban Kitchen Experience the vibrant flavors of Cuba at Hola! Cuban Kitchen, a casual fine dining destination where authenticity meets elegance. Savor traditional Cuban favorites like ropa vieja, picadillo, and palomilla steak, as well as house specialties like our signature Paella—all crafted with our unique Cuban flair. Enjoy hand-crafted cocktails including refreshing... Add to Trip Add to Wishlist Cuba Bistro At Cuba Bistro, we bring the heart of Cuba to every cup of coffee, plate of food and freshly baked pastelito. Family-owned and proudly rooted in tradition, we serve up flavors that feel like home. Stop by for a Cafecito and stay for the love. Add to Trip Add to Wishlist Pacha Kava Lounge Pacha Kava Lounge in Rockledge, FL, is a unique, family-friendly kava bar and social hub known for its enchanting, whimsical decor, diverse menu of house-made kava and herbal teas, and commitment to community with regular events like Bingo and open mic nights. Patrons praise the welcoming atmosphere, knowledgeable and friendly... Add to Trip Add to Wishlist Zero Gravity Wine Bar More than just a wine bar, Zero Gravity Wine Bar offers a tasting experience for everyone, whether you’re just getting started or already love wine. You don’t need to be an expert here. Our founders are passionate wine lovers who believe tasting should be fun, relaxed, and open to all.... Add to Trip Add to Wishlist Forgotten Block Butcher and Market Nestled in the heart of Historic Cocoa Village, Forgotten Block is the Space Coast’s neighborhood butcher and market with a passion for sustainability, quality, and community. We specialize in locally sourced meats, house-made charcuterie, artisanal deli offerings, and provisions. From dry-aged beef, charcuterie, and handcrafted sausages to our tallow-based soaps... Add to Trip Add to Wishlist J. Bird’s Island Eatery Nestled just steps from Port Canaveral and the Kennedy Space Center, J. Bird’s Island Eatery serves up good vibes from sunrise to tiki time. Whether you’re fueling up before a cruise, taking a midday poolside break, or winding down after a space center visit, J. Bird’s is your tropical nest.... Add to Trip Add to Wishlist Aves’ Place Located in the heart of Brevard County, Aves’ Place is a destination for families across the Space Coast, offering a variety of freshly made lunch options, hand-scooped ice cream, treats and fresh bakery items and is home to Treasures Boutique, an upscale resale boutique featuring clothing, furniture and more. A... Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Toasty Coconut Toasty Coconut is Merritt Island’s Newest stop for quick, Savory Bites, Boba, Coffee, and BLUE BELL ICE CREAM! Add to Trip Add to Wishlist Ice Cream Hut Merritt Island Located just minutes from the beach, The Ice Cream Hut of Merritt Island is your go-to destination for handcrafted ice cream, nostalgic treats, and unforgettable family fun. We offer an exciting variety of premium flavors, dairy-free options, and signature items like cookie sandwiches, waffle tacos, and banana split boats—all made... Add to Trip Add to Wishlist Evo Catering, LLC “EVO”lving with the way you eat with our dine in or take out restaurant, custom off-site catering and our meal prep service that allows you to have a taste of home or to try something exotic without needing a kitchen or sink. The restaurant has daily specials with great food... Add to Trip Add to Wishlist Kabob-a-licious Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a... Add to Trip Add to Wishlist 2 georges oceanside bar & grill 2georges oceanside bar & grill (formerly Sage Bistro) was purchased by Jeff and Jeannine George in August 2023. The married couple have an extensive background in the Food and Beverage Industry along with Hospitality, Marketing and Social Media. 2georges oceanside bar & grill was part of the rebranding which reflects... Add to Trip Add to Wishlist End of Summer Party Join us as we bid farewell to summer at Space Coast Harley-Davidson on Saturday, September 20 from 12-4p! We’ll have Live Music featuring Rising Lion, bikini bike wash, vendors and good food by Like Grandma’s Kitchen and SpaceCat’s Kitchen, plus, check out Bonehead Beard Care! Don’t miss out on the... Add to Trip Add to Wishlist Southern Kingfish Nationals The Southern Kingfish Association (SKA) will be hosting its SKA Nationals Kingfish Championships November 19 – 22, 2025 in Port Canaveral, Florida. The SKA Nationals will feature elite teams from across the Southeast and Gulf competing for the coveted SKA Nationals Championship. The event is free and open to the... Add to Trip Add to Wishlist Rock & Roll Revue: Autumn Boogie It’s Autumn? Maybe somewhere else but it’s late summer here. We have a fab lineup of the dance music that you love – from the fabulous 12-piece Rock & Roll Revue. $15.00 Add to Trip Add to Wishlist Autumn Market Join us for the Nancy Higgs Community Center’s Autumn Market! This event will take place on two separate days, so if you miss the first one, don’t be discouraged! When: October 7 and November 4 Come enjoy food trucks, fresh baked goods, local produce, and crafts made by local artisans.... Add to Trip Add to Wishlist Creatures Fest Join us at the Barrier Island Center for a free, fun, family event to celebrate animal diversity, ecology and conservation with a Halloween theme. Enjoy critteriffic games, touch tank, live animal encounters, conservation booths, scavenger hunt, eco-arts and crafts, black light not-so-scary experience, food truck, and more! Costumes encouraged and... Add to Trip Add to Wishlist St. Vincent de Paul Friends of the Poor 5K Run Walk Cocoa Beach 2nd Annual Friends of the Poor 5K Run Walk – fun for all ages. To raise awareness of the needs of our local neighbors who are working poor, homeless, disabled and veterans in the Cocoa Beach – Cape Canaveral Community. Race starts at 8:00 am. Same day registration starting at... Add to Trip Add to Wishlist Harvest Festival Harvest Fest at The Enchanted Forest is BACK! Dress up in costume or your favorite fall clothes and enjoy a day full of family fun! Dive into exciting games, hands-on crafts, and delicious bites from local food trucks. Get creative with pumpkin painting and scarecrow making. Explore the creepy-crawly building... Add to Trip Add to Wishlist 11th Annual Kidtoberfest Brevard County Parks and Recreation is proud to present Tim Burton’s The Nightmare Before Christmas at the FREE Cars Under the Stars Movie in the Park happening in Wickham Park! Audio will be available through car stereo and external speakers . The movie will begin once the sun goes down.... Add to Trip Add to Wishlist 4th Friday Starry Nights Join Brevard parks and Recreation Department and the Max K. Rodes Community Center for an artisan market under the stars! Meet talented local artisans and find one-of-a-kind gifts. Enjoy live D.J. music and peruse food from a variety of local onsite food trucks. Add to Trip Add to Wishlist 14th Annual North Brevard Fall festival and Trunk-or-Treat Join Brevard Parks and Recreation for the 14th Annual North Brevard Fall Festival and Trunk-or-Treat! This exciting three-hour event is the ultimate way to celebrate the season! Come dressed in your best costume and connect with local groups and organizations while diving into all our thrilling activities. Don’t miss out... Add to Trip Add to Wishlist Haunted Trail at Rotary Park October 17 & 18, 24 & 25 (Fridays and Saturdays) Cost: $5 for ages 12 & under | $10 for ages 13 & up Get ready for a frightful night filled with thrills and chills! Explore multiple scare zones packed with eerie creatures, jump scares, and bone-chilling surprises around every... Add to Trip Add to Wishlist Free Concert Featuring The Bella Donna Project Join the Brevard Parks and Recreation Department and experience the greatest hits of Stevie Nicks with a live music performance by the Bella Donna Project! Feel free to bring lawn chairs or peruse a variety of local on site food trucks during the show. Add to Trip Add to Wishlist Cocoa Village Sidewalk Sale “Leave it to Bargains” at the Cocoa Village Sidewalk Sale! Cocoa Village boutiques, art galleries, jewelry stores, and consignment shops are bringing their sale racks to the sidewalks at this yard-sale-style shopping event! Pick up a map at one of 3 starting locations: Bobbi’s at Parkside, Lucia Jewelry, or Village... Add to Trip Add to Wishlist North Brevard Art League Holiday Artisan Market The North Brevard Art League will hold a Holiday Artisan Market on Saturday and Sunday, November 1st and 2nd, 2025 from 10 am – 3 pm. The Market will be held in the NBAL Studio located at 1421 Draa Rd., Titusville, FL. Admission and parking are free. The show will... Add to Trip Add to Wishlist Sensory Boo at the Zoo Families of children with exceptionalities are invited to enjoy a magical evening of trick-or-treating, games, sensory exploration and more as you stroll through the Brevard Zoo’s Paws On area. As a come and go event, timed entry tickets are available. Costumes Encouraged! Members: $2 Non-members: $6 Add to Trip Things to Do The Space Coast Bucket List Experience the thrill of a rocket launch, catch a wave and much more, discover the top things you NEED to do when you visit the Space Coast. View Article Stay Connected Don’t miss out on our monthly newsletter for exciting updates on attractions, local events, and personalized itineraries. Name (Required) First Last Zipcode (Required) ZIP / Postal Code Email (Required) Phone This field is for validation purposes and should be left unchanged. Subscribe Vacation Planner Dive into the Space Coast Vacation Planner then launch into an unforgettable getaway. View Digital Planner About Contact Us Visitor Center Press Room Travel Professionals Sports Commission Film Commission Submit Your Business Submit an Event Events Calendar Follow Us on Social Media facebook-f instagram youtube pinterest-p Vacation Planner Privacy Policy © 2025 Copyright Florida’s Space Coast Office of Tourism All Rights Reserved"
    },
    {
      "url": "https://www.valiantaircommand.com/rack-card",
      "text": "Rack Card Information | Valiant Air Command, Inc. top of page Web Shop Help Center Call Us (321) 268-1941 Home About us Blog Group Tours Events Monthly Fly In Breakfast Upcoming Events 2025 Titusville Mayors Ball Collection All Aircraft Flying Aircraft Pre War – WWI Post War – WWI / WWII Korean War Vietnam & Cold War Modern Era Restoration Area Artifacts Donation Page Get Involved Commemorative Bricks Memberships Events Volunteer Archive & Form Downloads Social Media Stem Program More Use tab to navigate through the menu items. Welcome to Valiant Air Command, Inc. Step into history at the Valiant Air Command, Inc. Warbird Air Museum, where aviation comes to life! Located just 12 miles (5 minutes) from NASA’s Kennedy Space Center Visitor Complex, we feature over 50 different aircraft, from pre-WWI to modern-day jets. Our collection includes meticulously restored warbirds, offering a glimpse into aviation’s rich history. Explore our hangars, learn about aviation's role in shaping the world, and experience special events like airshows and Fly-In Breakfasts. Whether you're an aviation enthusiast or just looking for a unique experience, there's something for everyone! And don’t forget to stop by our well-stocked gift shop for a variety of aviation memorabilia and unique souvenirs to remember your visit. Pricing Valiant Air Command Warbird Museum Admission Pricing Discover aviation history at an affordable price for the whole family! ​ 🎟️ Admission Rates: Adults: $20 Seniors (Military & Veterans): $18 Children (5-12): $10 Children Under 5: Free Group Rates Available ​ See Full Pricing Details and plan your visit today! Tickets are available at the door—no online sales. Directions Visit the Valiant Air Command Warbird Museum Plan your trip and explore aviation history up close! 📍 Location: 6600 Tico Road, Titusville, FL 32780 🚗 Easy Access: Just off I-95, Exit 223 Get Directions with Google Maps and start your journey today! We look forward to seeing you soon. Hours of Operation Plan your visit and experience aviation history firsthand! 🕘 Hours: Monday - Sunday: 9:00 AM – 5:00 PM The museum is open year-round, with exceptions for major holidays. Check ahead for special events or closures. We look forward to welcoming you! Events Looking for a unique venue to make your event unforgettable? 🎉 Perfect for: Corporate Events Weddings Reunions Parties & Celebrations Surround your guests with historic aircraft and captivating exhibits for an experience they’ll never forget. Book Your Event Here and let us help you create something extraordinary! FAQ Have Questions? Visit Our FAQ Page Get quick answers to the most common questions about visiting the Valiant Air Command Warbird Museum! ❓ Find Information On: Ticket Prices & Discounts Directions & Parking Accessibility Group Tours & Events Go to Our FAQ Page and plan your visit with confidence! If you need further assistance, feel free to contact us. Contact Us Get in Touch with the Valiant Air Command Warbird Museum Have questions or need more information? We're here to help! 📧 Email Us: webmaster@valiantaircommand.com 📞 Call Us: (321) 268-1941 📍 Visit Us: 6600 Tico Road, Titusville, FL 32780 Contact Us Here to connect with our team and we'll get back to you as soon as possible! Museum Location 6600 Tico Road, Titusville, Florida 32780 warbirds@valiantaircommand.com (321) 268-1941 Navigation Home About us Blog Group Tours Events Monthly Fly In Breakfast Upcoming Events 2025 Titusville Mayors Ball Collection All Aircraft Flying Aircraft Pre War – WWI Post War – WWI / WWII Korean War Vietnam & Cold War Modern Era Restoration Area Artifacts Donation Page Get Involved Commemorative Bricks Memberships Events Volunteer Archive & Form Downloads Social Media Stem Program Opening Hours Mon - Sun 9:00 am – 5:00 pm (ET) ​ Closed Thanksgiving Day, Christmas Day New Year's Day More Details Help Contact Us About Us ​ Connect with us! Sponsors and Supporters As a private, 501(c)(3) non-profit, the Valiant Air Command, Inc. would not exist without the support of donors and volunteers. It is because of the generosity of individuals, corporations and the public sector that we can continue to maintain the ongoing restoration, preservation and educational programs that take place. bottom of page"
    }
  ]
}