{
  "fuentes": [
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://business.putnamcountychamber.com/list/member/velchoff-s-corner-5406",
      "email": "chamber@chamberpc.com"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    },
    {
      "url": "https://www.enrollwaresolutions.com/contact-us",
      "email": "info@enrollware.com"
    },
    {
      "url": "https://uk.linkedin.com/company/pets-corner",
      "email": "crowborough@petscorner.co.uk"
    },
    {
      "url": "https://www.cornerventures.com/",
      "email": "info@cornerventures.com"
    },
    {
      "url": "https://dawahwise.com/about-us/",
      "email": "info@dawahwise.com"
    }
  ],
  "mails": [
    "chamber@chamberpc.com",
    "crowborough@petscorner.co.uk",
    "info@cornerventures.com",
    "info@dawahwise.com",
    "info@enrollware.com",
    "info@inzmo.com",
    "info@scibpaints.com"
  ],
  "nombre_sitio": "velchoffscorner.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://business.putnamcountychamber.com/list/member/velchoff-s-corner-5406",
      "text": "Velchoff's Corner | RESTAURANTS Skip to content Menu Home Business Climate Community Facts Existing Industries & Companies Demographics/Statistics Quick Facts Florida Scorecard Resources Chamber Contact Velchoff's Corner Categories RESTAURANTS 105 N. 2nd St. Suite D Palatka FL 32177 (386) 385-3265 Visit Website Hours: Tuesday - Saturday 4pm-9pm About Us A Restaurant and Coffee House in downtown Palatka, Florida. Nothin' less than a Grand Ole' Time! Highlights Menu Images Gallery Image velchoffs%207.jpg × Gallery Image velchoffs%203.jpg × Gallery Image velchoffs%202.jpg × Gallery Image velchoffs%204.jpg × Gallery Image velchoffs%205.jpg × Gallery Image velchoffs%206.jpg × Gallery Image velchoffs.jpg × Share × Print Email Facebook Twitter LinkedIn Pinterest Close Tell a Friend × Send Request Cancel © 2025 Putnam County Chamber | Site by GrowthZone Get In Touch! phone 386-328-1503 location 1100 Reid St, Palatka, FL 32177 email Email Us Facebook Icon Twitter Icon YouTube Icon Instagram Icon Weather Government Partners putnam county Town of Interlachen City of Palatka Crescent City Welaka © 2025 Putnam County Chamber. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    },
    {
      "url": "https://www.enrollwaresolutions.com/contact-us",
      "text": "Contact the Team | Enrollware Skip to content Client Login All-in-One Platform Solutions Healthcare/AHA Corporate Government Continuing Education Pricing Contact Sign Up Contact Enrollware How to Reach Us To reach a representative, fill out the contact form on this page or give us a call. Phone: Support: 561-247-2432 Support Hours: Monday-Friday (8am-6pm ET) Email: Sales Inquiries: info@enrollware.com Support: support@enrollware.com Mailing Address: Fullsteam Software Holdings LLC DBA Enrollware Software 540 Devall Drive, Suite 301 Auburn, AL 36832 Password Assistance? Please contact your training center administrator. Enrollware can only issue usernames or passwords for the primary administrators of our direct clients. Online Class Registration and Management Features All-in-One Platform Pricing EnrollwarePay Solutions Healthcare Government Continuing Education Corporate Resources Contact Us Privacy Policy Terms & Conditions Responsible Disclosure Policy Client Login Follow Us © 2025 Enrollware. All rights reserved."
    },
    {
      "url": "https://uk.linkedin.com/company/pets-corner",
      "text": "Pets Corner | LinkedIn Skip to main content LinkedIn Articles People Learning Jobs Games Join now Sign in Pets Corner Retail Crawley, England 6,148 followers Family Run Pet Shop Since 1968. Follow Discover all 445 employees Report this company About us Pets Corner UK Ltd is a United Kingdom-based ethical pet care retail store chain. Its main area of business is selling specialist natural pet foods, accessories and treatments predominantly for dogs and cats, but also for small animals, reptiles, birds, wildlife, and tropical and cold water fish.\n\nThe company's headquarters is in Crawley, West Sussex, United Kingdom. It has 150 stores across the UK. Established in 1968, the organisation has continued to grow, and in April 2016 it acquired competitor retailer PamPurredPets adding an additional 51 stores to its existing portfolio, making it the second largest pet retailer in the UK by store numbers and EBITDA. Website http://www.petscorner.co.uk External link for Pets Corner Industry Retail Company size 1,001-5,000 employees Headquarters Crawley, England Type Privately Held Founded 1968 Locations Primary Spindle Way Crawley, England RH10 1TG, GB Get directions Employees at Pets Corner Hannah Lawless Store Support & Data Admin lorraine sargeant Owner, Pets corner Martin Loeber Guitar, Mandolin, Dobro.  Part-time at Pets Corner. HND music production student Sarah Williams Pawesome Pupdates See all employees Updates Pets Corner 6,148 followers 1w Report this post We’re excited to announce that our new Crowborough store has opened its doors! Swipe to take a look inside 🧡🐾\n\nCome and explore all your favourite natural pet brands -  from our fully stocked freezer section to our delicious deli treats, there’s something for every pet at your new local store!\n\n✨ Plus, there’s more to come:\n\n💙Pet Practice, our family-owned veterinary clinic, will be opening soon.\n\nWe can’t wait to welcome you and your pets through the doors!\n\n🕒 Mon–Sat: 9am–6pm | Sun: 10am–4pm\n📍 Unit 3, Feedback Factory, Crowborough Hill, Crowborough, TN6 2JL\n📞 01892 958046\n📧 crowborough@petscorner.co.uk #LocalPetStore #PetTreats #HealthyPets #PetLoversUK #Crowborough #PetWellness #PetGrooming #PetStoreOpening #NaturalPetProducts #CrowboroughPets +1 120 11 Comments Like Comment Share Pets Corner reposted this Philip Hook Account Manager and Nutritionist  at Tribal Pet Foods 2mo Report this post Today I'm at the lovely Pets Corner Haywards Heath for their Tribal Pet Foods demo day. Free samples, lots of goodies and great information for anyone who pops by. 43 1 Comment Like Comment Share Pets Corner reposted this Brad Nissen Chief Operating Officer @ DOG By Dr Lisa 4mo Report this post DOG By Dr Lisa now being sold in Pets Corner in the UK 🇬🇧. With 150 stores we are excited to grow our footprint in this retailer and continue to expand the range. #dogbydrlisa #petscorner 198 12 Comments Like Comment Share Pets Corner 6,148 followers 2mo Edited Report this post 🎉 Pets Corner Ascot Open Day – Saturday 19th July! \n\n \nWe’re gearing up to make this our busiest day yet as we near our 2-year anniversary – and you’re invited!\n\n Here’s what’s lined up for the day:\n\n 🐕 Dog Walking Club hosted by @ByTeddy\n\n📸 Professional Pet Photographer – £20 per image\n\n🩺 First Aid Demonstrations from the Pet Practice team\n\n🍦 Local Ice Cream – available to buy on-site\n\n🎁 Luxury Goodie Bags for the first customers to spend £50+\n\n🛍️ Indoor & Outdoor Brand Stalls – Gizzls, McAdams, Storey & Tails, Pawer Water Doggy Cocktail Bar, Harbour Hounds & more!\n\n Let’s pack the park with paws and make this a day to remember! 🐾💚 #PetsCornerAscot #OpenDay #DogWalkingClub #AscotDogs #PetEvent #SupportSmallBrands #LuxuryGoodyBags #PetFirstAid #DogFriendlyDaysOut 27 Like Comment Share Pets Corner reposted this Will Harman Helping businesses create value fast, with certainty, with specialist expertise and high quality data 3mo Edited Report this post Pets Corner your branch in Midhurst is my dog Spot’s favourite shop. Unfortunately we arrived after closing time today 😔 70 4 Comments Like Comment Share Pets Corner reposted this PAWD DRINKS 1,599 followers 5mo Report this post Seeing our new PAWD DRINKS boxes on the shelves was amazing! 🙌\n\nHead down to your local Pets Corner store to see them yourself! 📦 Rory H. Archie Wilson Beatrice Brampton #petscorner #pawddrinks …more 38 2 Comments Like Comment Share Pets Corner reposted this PAWD DRINKS 1,599 followers 4mo Report this post The highlight of our week was definitely seeing our BRAND NEW boxes on the shelves in Pets Corner 📦\n\nIf you see us in there be sure to snap a photo and send it to us! 🤩 Archie Wilson Rory H. Beatrice Brampton #petscorner #pawddrinks +4 82 9 Comments Like Comment Share Pets Corner reposted this Will Harman Helping businesses create value fast, with certainty, with specialist expertise and high quality data 3mo Edited Report this post Pets Corner your branch in Midhurst is my dog Spot’s favourite shop. Unfortunately we arrived after closing time today 😔 70 4 Comments Like Comment Share Pets Corner 6,148 followers 6mo Report this post We’re pleased to announce that, thanks to our amazing customers, we’ve raised a total of £12,211 through our 30p donations in-store and online throughout December! \n\nAt Pets Corner, we’re proud to match your generosity, bringing the total donation to an incredible £24,422 for Canine Partners. 44 1 Comment Like Comment Share Pets Corner 6,148 followers 9mo Edited Report this post Throughout December, we want to give back to Canine Partners We are offering our lovely customers the chance to support the incredible assistance dogs by donating 30p at our checkout in-store & online, and we will match all donations! 💜\n\nYour donations help Canine Partners to create life-changing partnerships for disabled people across the UK with highly trained assistance that specifically meet their needs. \n\nHelp make a difference this Christmas. #MakeADifference #FestiveSeason #GiveBack #DogLovers #CharityCampaign #AssistanceDogs #CaninePartners #SupportCharity #ChristmasGiving #December #Petscorneruk #Caninepartnersuk 28 Like Comment Share Join now to see what you are missing Find people you know at Pets Corner Browse recommended jobs for you View all updates, news, and articles Join now Similar pages Jollyes Pets Retail Pets at Home Retail Just for Pets Retail Redditch, Redditch Pets Choice Ltd Food and Beverage Manufacturing Blackburn, Lancashire Lily's Kitchen Manufacturing Happy Pet Products Ltd Manufacturing Leicester, Leicestershire Pooch and Mutt Manufacturing Pet Family Ltd Retail Crawley, England Vital Pet Group Wholesale Rotherham, South Yorkshire Pedigree Wholesale Limited Wholesale Nottingham, Nottinghamshire Show more similar pages Show fewer similar pages Browse jobs Head of Infrastructure jobs 1,287 open jobs Head of Ecommerce jobs 1,468 open jobs Head of Product jobs 3,774 open jobs Analyst jobs 63,799 open jobs Writer jobs 3,391 open jobs Employee Relations Specialist jobs 1,000 open jobs Account Manager jobs 20,526 open jobs Marketing Manager jobs 14,693 open jobs Recruiter jobs 20,136 open jobs Electronic Buyer jobs 1,978 open jobs Junior Buyer jobs 6,142 open jobs Senior Public Relations Manager jobs 4,495 open jobs Head of Public Relations jobs 1,235 open jobs Senior Communications Manager jobs 4,416 open jobs Public Relations Manager jobs 4,846 open jobs Publicist jobs 857 open jobs Data Analyst jobs 33,808 open jobs Director of Communications jobs 2,471 open jobs National Account Manager jobs 2,733 open jobs Legal Counsel jobs 9,038 open jobs Show more jobs like this Show fewer jobs like this More searches More searches Content Coordinator jobs Marketing Manager jobs Marketing Assistant jobs Teaching Assistant jobs Recruiter jobs Data Analyst jobs Analyst jobs Head of Human Resources jobs Human Resources Specialist jobs Product Manager jobs Ecommerce Manager jobs Marketing Specialist jobs LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at Pets Corner Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://www.cornerventures.com/",
      "text": "Corner Ventures | Venture Capital Firm top of page Home About Companies Prior Investments Team Blog News Login Menu Close Home About Companies Prior Investments Team Blog News Login Partnering with bold founders & investors Trusted Partner True Value Add More Than Just Capital Go Global Dare to Dream Building Iconic Companies Leading the growth rounds of the next great global companies Corner Ventures was founded to invest in the next generation of iconic technology companies. Since our founding in 2018, we’ve partnered with top-tier early-stage venture firms and exceptional entrepreneurs with an aim to create exceptional outcomes. Today, we continue to build upon our legacy as a trusted partner and resource to founders, seed and Series A investors, and world-class innovators by providing unique insights, strategic growth capital, and access to global investors and commercial networks. From our offices in Palo Alto, New York, Tel Aviv and Tokyo, we work closely with our partners, portfolio companies and their respective founders to help navigate the transition from promising startup to category-defining leader. Our international platform of investors and strategic partners provide companies the foundation from which to launch rapid international expansion. Throughout our history, we’ve been fortunate to work with many of the world’s most disruptive companies, visionaries, and technology leaders. We have invested in over 200 companies at and prior to Corner Ventures, with over 145 exits, including 30 IPOs, and we’re just getting started. Current Investments Team Marvin Tien Co-founder General Partner Jane Mathieu Partner Jonathan Pulitzer General Partner – Israel John Cadeddu Co-founder General Partner Tom Goodrich Co-founder General Partner Atsuo Sakurai Partner – Japan Kevin Tanaka Principal Andrew Cohen Principal Deberah Stark Administrative Controller Shab Danesh Executive Assistant Malia Pita Office Manager Prior Investments All Prior Investments OUR OFFICES CONTACT US UNITED STATES 251 Lytton Avenue, Suite 200 Palo Alto, CA 94301 ​ 809 Broadway New York, NY 10003 INTERNATIONAL 121 Menachem Begin, 61st Floor Tel Aviv, 6701203 Israel ​ W22F Shibuya Mark City, 1-12-1 Dogenzaka, Shibuya-ku, Tokyo 150-0043 Have any questions? Please don’t hesitate to call at 800.368.0698 ​ Got something to share? Email us at info@cornerventures.com © 2025 by Corner Ventures. All rights reserved. Home About Companies Prior Investments Team Blog News Login bottom of page"
    },
    {
      "url": "https://dawahwise.com/about-us/",
      "text": "About us - Speakers Corner Dawah YouTube Channel | Dawahwise.com Skip to content Home About us Our mission Our vision Contact us New Muslims Donate Donate Main Menu About DawahWise In the name of Allah, the Most Gracious, the Most Merciful. Welcome to DawahWise, the official platform of Mansur and Hashim. Our mission is to share the profound message of Islam through enlightening debates, engaging live streams, and educational videos. We strive to empower individuals globally with a deeper understanding of Islam, addressing misconceptions and fostering respectful dialogues. Our History Introduction At DawahWise, we are dedicated to empowering individuals and communities through education, outreach, and support. Our journey began in Aug 2020 with a group of passionate individuals committed to fostering mutual understanding and respect across diverse backgrounds. Today, we continue to grow and expand our reach, guided by our core values and unwavering dedication to our mission. DawahWise was founded by Hashim and Mansur, whose vision was to create a platform where knowledge could be shared freely and compassionately. Over the years, we have launched numerous programs and initiatives that have positively impacted thousands of lives. Our history is a testament to the power of community and the importance of continuous learning and support. Meet Our Founders Mansur Mansur is a renowned speaker and debater at Speakers Corner with a deep passion for Dawah and Apologetics. With a background in Islamic studies and years of experience, Mansur is dedicated to educating people about Islam and addressing misconceptions. His engaging speaking style and ability to connect with diverse audiences have made him a respected figure in the Muslim community. Areas of Expertise Islamic Theology Comparative Religion Debates and Public Speaking Vision Mansur aims to foster a better understanding of Islam through respectful dialogue and informed discussions. His commitment to spreading knowledge and promoting peace is at the core of his work at DawahWise. Hashim Hashim is a key figure at Speakers Corner, known for his articulate and thoughtful approach to Dawah. With a strong foundation in Islamic teachings and a keen interest in contemporary issues, Hashim addresses challenging questions with clarity and compassion. His ability to engage with people from all walks of life has earned him a loyal following. Areas of Expertise Islamic Apologetics Interfaith Dialogue Social Issues and Islam Vision Hashim is dedicated to empowering individuals with the knowledge of Islam, fostering mutual respect, and bridging gaps between different communities. Through DawahWise, he strives to create a platform for open, honest, and constructive conversations about Islam. Home About us Our mission Our vision Contact us New Muslims Donate Donate Donate Kindly donate generously and contribute to our ongoing expenses Connect with DawahWise. We welcome your questions, comments, and feedback!  Feel free to reach out. info@dawahwise.com Facebook X-twitter Youtube Instagram Tiktok Let's Talk Islam Please enable JavaScript in your browser to complete this form. Name * Email * Country * Comment or Message * Email Send Message Copyright © 2024 Dawahwise.com | Designed by eNgagency.no"
    }
  ]
}