{
  "fuentes": [
    {
      "url": "https://bgclubventura.org/who-we-are/history.html",
      "email": "info@bgclubventura.org"
    },
    {
      "url": "https://www.venturasecurities.com/contact-us/",
      "email": "ceo@venturasecurities.com"
    },
    {
      "url": "https://www.venturasecurities.com/contact-us/",
      "email": "complaints@venturasecurities.com"
    },
    {
      "url": "https://www.venturasecurities.com/contact-us/",
      "email": "compliance@venturasecurities.com"
    },
    {
      "url": "https://www.venturasecurities.com/contact-us/",
      "email": "newdelhi3@venturasecurities.com"
    },
    {
      "url": "https://www.venturasecurities.com/contact-us/",
      "email": "nsr@venturasecurities.com"
    },
    {
      "url": "https://www.venturaccorlando.com/",
      "email": "proshop@venturacountryclub.org"
    },
    {
      "url": "https://www.venturaccorlando.com/ventura-country-club/",
      "email": "proshop@venturacountryclub.org"
    },
    {
      "url": "https://www.venturaccorlando.com/course-info/",
      "email": "proshop@venturacountryclub.org"
    },
    {
      "url": "https://raintreeorlandovcc.com/ventura-country-club/",
      "email": "estoppels@vistacamfl.com"
    },
    {
      "url": "https://www.venturaccorlando.com/tee-times/",
      "email": "proshop@venturacountryclub.org"
    },
    {
      "url": "https://bgclubventura.org/who-we-are/board.html",
      "email": "info@bgclubventura.org"
    },
    {
      "url": "https://visitventuraca.com/contact/staff/",
      "email": "amber@visitventuraca.com"
    },
    {
      "url": "https://visitventuraca.com/contact/staff/",
      "email": "aubrey@visitventuraca.com"
    },
    {
      "url": "https://visitventuraca.com/contact/staff/",
      "email": "julie@visitventuraca.com"
    },
    {
      "url": "https://visitventuraca.com/contact/staff/",
      "email": "marlyss@visitventuraca.com"
    },
    {
      "url": "https://visitventuraca.com/contact/staff/",
      "email": "michele.foster@visitventuraca.com"
    },
    {
      "url": "https://visitventuraca.com/contact/staff/",
      "email": "mike@visitventuraca.com"
    },
    {
      "url": "https://visitventuraca.com/contact/staff/",
      "email": "nicole@visitventuraca.com"
    },
    {
      "url": "https://www.venturaenergypartners.com/contact",
      "email": "info@venturaenergypartners.com"
    },
    {
      "url": "https://www.venturaccorlando.com/course-renovation/",
      "email": "jbennett@venturacc.org"
    },
    {
      "url": "https://www.venturaccorlando.com/course-renovation/",
      "email": "proshop@venturacountryclub.org"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "email": "aramirez@vmc.net"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "email": "atarin@vmc.net"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "email": "ccutbill@vmc.net"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "email": "dbathauer@vmc.net"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "email": "doug@vmc.net"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "email": "efontaine@vmc.net"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "email": "esylvester@vmc.net"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "email": "gcampbell@vmc.net"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "email": "gpido@vmc.net"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "email": "info@vmc.net"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "email": "jlicata@vmc.net"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "email": "jnordgren@vmc.net"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "email": "karussell@vmc.net"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "email": "mworthy@vmc.net"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "email": "rbaldwin@vmc.net"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "email": "sgrabendike@vmc.net"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "email": "terri@vmc.net"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "email": "treynolds@vmc.net"
    },
    {
      "url": "https://www.venturaccorlando.com/instruction/",
      "email": "jbennett@venturacountryclub.org"
    },
    {
      "url": "https://www.venturaccorlando.com/instruction/",
      "email": "proshop@venturacountryclub.org"
    },
    {
      "url": "https://www.venturaccorlando.com/contact-us/",
      "email": "jbennett@venturacountryclub.org"
    },
    {
      "url": "https://www.venturaccorlando.com/contact-us/",
      "email": "proshop@venturacountryclub.org"
    },
    {
      "url": "https://bgclubventura.org/who-we-are/founders-society.html",
      "email": "info@bgclubventura.org"
    },
    {
      "url": "https://www.venturaccorlando.com/event-calendar/",
      "email": "proshop@venturacountryclub.org"
    },
    {
      "url": "https://www.venturaccorlando.com/contact-us/directions/",
      "email": "proshop@venturacountryclub.org"
    }
  ],
  "mails": [
    "amber@visitventuraca.com",
    "aramirez@vmc.net",
    "atarin@vmc.net",
    "aubrey@visitventuraca.com",
    "ccutbill@vmc.net",
    "ceo@venturasecurities.com",
    "complaints@venturasecurities.com",
    "compliance@venturasecurities.com",
    "dbathauer@vmc.net",
    "doug@vmc.net",
    "efontaine@vmc.net",
    "estoppels@vistacamfl.com",
    "esylvester@vmc.net",
    "gcampbell@vmc.net",
    "gpido@vmc.net",
    "info@bgclubventura.org",
    "info@venturaenergypartners.com",
    "info@vmc.net",
    "jbennett@venturacc.org",
    "jbennett@venturacountryclub.org",
    "jlicata@vmc.net",
    "jnordgren@vmc.net",
    "julie@visitventuraca.com",
    "karussell@vmc.net",
    "marlyss@visitventuraca.com",
    "michele.foster@visitventuraca.com",
    "mike@visitventuraca.com",
    "mworthy@vmc.net",
    "newdelhi3@venturasecurities.com",
    "nicole@visitventuraca.com",
    "nsr@venturasecurities.com",
    "proshop@venturacountryclub.org",
    "rbaldwin@vmc.net",
    "sgrabendike@vmc.net",
    "terri@vmc.net",
    "treynolds@vmc.net"
  ],
  "nombre_sitio": "venturaccorlando.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://bgclubventura.org/who-we-are/history.html",
      "text": "History : Who We Are : Boys & Girls Club of Greater Ventura Skip to main content Who We Are Our Mission History Board of Directors Founders' Society Leadership Club Sites Bill LeFevre Center E.J. Harrison Center Westview Center Oak View Teen Center What We Do Impact Strategies Academic Success Good Character Healthy Lifestyles Emma Nylen Scholarship Summer Program Safety Safety Report a Concern Employment Employment Opportunities Special Events Special Events Great Futures Auction Golf Classic Youth of the Year Event Registration Meet Our Youths of the Year Become a Sponsor Impact Impact Report Our Impact Through Club Stories Support the Club Give Now Amazon Wish List The Promise Club Avenue Thrift - Supporting the Boys & Girls Club Ventura Boys & Girls Club Foundation Planned Giving Contact Us Who We Are Our History Who We Are Our Mission History Board of Directors Founders' Society Leadership Club Sites Bill LeFevre Center E.J. Harrison Center Westview Center Oak View Teen Center What We Do Impact Strategies Academic Success Good Character Healthy Lifestyles Emma Nylen Scholarship Summer Program Safety Safety Report a Concern Employment Employment Opportunities Special Events Special Events Great Futures Auction Golf Classic Youth of the Year Event Registration Meet Our Youths of the Year Become a Sponsor Impact Impact Report Our Impact Through Club Stories Support the Club Give Now Amazon Wish List The Promise Club Avenue Thrift - Supporting the Boys & Girls Club Ventura Boys & Girls Club Foundation Planned Giving Contact Us Donate Boys waiting for Club to open.  circa early 1960's The roots of the Boys & Girls Club of Greater Ventura date back to 1938 when the Ortega Adobe on Main Street became the Police Boys Club, where it operated for 30 years. In 1962, the Club joined the congressionally-chartered Boys Club of America, and six years later moved to Olive Street in West Ventura where it operates today. The Ventura Girls Club was incorporated by the State of California in 1967, and merged with the Boys Club to form the Boys & Girls Club of Greater Ventura in 1980. Ventura Girl's Club Van circa late 1960's. Our first clubhouse was the Robert Addison Center on Olive Street, which opened its doors to members in 1968. A second facility, called the Bill LeFevre Centre, was opened on Johnson Drive in May 1991. Our third location began in Saticoy Park in 1996 and members were served in the nearby Jose R. Flores Community Center until a trailer was located in the park in January of 2000. That trailer stood and served as a clubhouse until May of 2012 when it was demolished to make way for the current brick and mortar building that opened its doors in October of 2013. Through a partnership with the Ventura Unified School District, Interface and the County of Ventura, the Boys & Girls Club of Greater Ventura opened its fourth center at the Oak View Park and Resource Center on Mahoney Ave. in February of 2007. There are over 4,000 Boys & Girls Clubs in the United States and throughout the world, serving over 4 million youth on a daily basis. Boys & Girls Clubs continue to be the fastest growing youth organization in the country. Volunteers contributed over 8000 hours of labor constructing the Ventura Boys Club building located on Olive Street.  July 1967 Five days a week, hundreds of youth from Ventura and its surrounding cities, stream through our doors, and are able to benefit from fun and engaging activities and programs that provide academic success, good character and citizenship and healthy lifestyle skill building. They benefit from a sense of belonging, usefulness, influence and competency and build the self-esteem that is so necessary for making good choices in life. A study completed by Dr. Damooei of Cal Luthran in 2010 revealed that 97% of our members are on track to graduate from high school, 92% are more self-confident, 83% have improved family relationships and 90% of our parents say their children talk about higher education and its importance in their lives. Aera Energy Assured Partners So Cal Gas Amgen Foundation Geene Haas Foundation Kaiser Permanente Wedgewood Weddings Administrative Office 1280 S. Victoria Avenue Suite 240 Ventura, CA 93003 (805) 641-5585 Fax (805) 639-0180 info@bgclubventura.org Facebook Instagram Twitter © 2025 Boys & Girls Club of Greater Ventura Privacy Policy Privacy Policy What Information Do We Collect? When you visit our website you may provide us with two types of information: personal information you knowingly choose to disclose that is collected on an individual basis and website use information collected on an aggregate basis as you and others browse our website. Personal Information You Choose to Provide We may request that you voluntarily supply us with personal information, including your email address, postal address, home or work telephone number and other personal information for such purposes as correspondence, placing an order, requesting an estimate, or participating in online surveys.\nIf you choose to correspond with us through email, we may retain the content of your email messages together with your email address and our responses. We provide the same protections for these electronic communications that we employ in the maintenance of information received by mail and telephone. Website Use Information Similar to other websites, our site may utilize a standard technology called \"cookies\" (see explanation below, \"What Are Cookies?\") and web server logs to collect information about how our website is used. Information gathered through cookies and server logs may include the date and time of visits, the pages viewed, time spent at our website, and the sites visited just before and just after ours. This information is collected on an aggregate basis. None of this information is associated with you as an individual. How Do We Use the Information That You Provide to Us? Broadly speaking, we use personal information for purposes of administering our business activities, providing service and support and making available other products and services to our customers and prospective customers. Occasionally, we may also use the information we collect to notify you about important changes to our website, new services and special offers we think you will find valuable. The lists used to send you product and service offers are developed and managed under our traditional standards designed to safeguard the security and privacy of all personal information provided by our users. You may at any time to notify us of your desire not to receive these offers. What Are Cookies? Cookies are a feature of web browser software that allows web servers to recognize the computer used to access a website. Cookies are small pieces of data that are stored by a user's web browser on the user's hard drive. Cookies can remember what information a user accesses on one web page to simplify subsequent interactions with that website by the same user or to use the information to streamline the user's transactions on related web pages. This makes it easier for a user to move from web page to web page and to complete commercial transactions over the Internet. Cookies should make your online experience easier and more personalized. How Do We Use Information Collected From Cookies? We use website browser software tools such as cookies and web server logs to gather information about our website users' browsing activities, in order to constantly improve our website and better serve our users. This information assists us to design and arrange our web pages in the most user-friendly manner and to continually improve our website to better meet the needs of our users and prospective users.\nCookies help us collect important business and technical statistics. The information in the cookies lets us trace the paths followed by users to our website as they move from one page to another. Web server logs allow us to count how many people visit our website and evaluate our website's visitor capacity. We do not use these technologies to capture your individual email address or any personally identifying information about you. Notice of New Services and Changes Occasionally, we may use the information we collect to notify you about important changes to our website, new services and special offers we think you will find valuable. As a user of our website, you will be given the opportunity to notify us of your desire not to receive these offers by clicking on a response box when you receive such an offer or by sending us an email request. How Do We Secure Information Transmissions? When you send confidential personal information to us on our website, a secure server software which we have licensed encrypts all information you input before it is sent to us. The information is scrambled en route and decoded once it reaches our website.\nOther email that you may send to us may not be secure unless we advise you that security measures will be in place prior to your transmitting the information. For that reason, we ask that you do not send confidential information such as Social Security, credit card, or account numbers to us through an unsecured email. How Do We Protect Your Information? Information Security -- We utilize encryption/security software to safeguard the confidentiality of personal information we collect from unauthorized access or disclosure and accidental loss, alteration or destruction.\nEvaluation of Information Protection Practices -- Periodically, our operations and business practices are reviewed for compliance with organization policies and procedures governing the security, confidentiality and quality of our information.\nEmployee Access, Training and Expectations -- Our organization values, ethical standards, policies and practices are committed to the protection of user information. In general, our business practices limit employee access to confidential information, and limit the use and disclosure of such information to authorized persons, processes and transactions. How Can You Access and Correct Your Information? You may request access to all your personally identifiable information that we collect online and maintain in our database by emailing us using the contact form provided to you within the site structure of our website. Do We Disclose Information to Outside Parties? We may provide aggregate information about our customers, sales, website traffic patterns and related website information to our affiliates or reputable third parties, but this information will not include personally identifying data, except as otherwise provided in this privacy policy. What About Legally Compelled Disclosure of Information? We may disclose information when legally compelled to do so, in other words, when we, in good faith, believe that the law requires it or for the protection of our legal rights. Permission to Use of Materials The right to download and store or output the materials in our website is granted for the user's personal use only, and materials may not be reproduced in any edited form. Any other reproduction, transmission, performance, display or editing of these materials by any means mechanical or electronic without our express written permission is strictly prohibited. Users wishing to obtain permission to reprint or reproduce any materials appearing on this site may contact us directly. Terms & Conditions Terms & Conditions Donation Refund Policy We are grateful for your donation and support of our organization. If you have made an error in making your donation or change your mind about contributing to our organization please contact us.  Refunds are returned using the original method of payment. If you made your donation by credit card, your refund will be credited to that same credit card. Automated Recurring Donation Cancellation Ongoing support is important to enabling projects to continue their work, so we encourage donors to continue to contribute to projects over time. But if you must cancel your recurring donation, please notify us. Powered by Firespring"
    },
    {
      "url": "https://www.venturasecurities.com/contact-us/",
      "text": "Contact Us - Get in Touch with Ventura To visit the old Ventura website, click here . Ventura Wealth\n Clients Login here Skip to content Refer and earn Support Menu Menu Refer and earn Support Invest Stocks Mutual Funds IPOs Fixed Deposit Trade Futures & Options Spotlight EaseAPI Pricing Platform Learn Blog News Share Market Guide Share Market Glossary Bazaar Basics Calculators Download on the App store Get it on Google Play Login Create Account Home Contact Us Get in touch for early access Leave your details to get notified of our launch and limited-period pricing Your Name* Please enter a valid name. Phone number* +91 Please enter a valid mobile number. Open Demat account Verify your mobile number We have sent an OTP to +91 9876543210 The OTP you entered is invalid. Please try again. 0:60s Resend OTP Submit Hold tight, we'll reach out to you the moment we're ready. Where you can find us Discover the branch nearest to you from our extensive network Select your city Ahmedabad Ahmednagar Bengaluru Bhubaneshwar Chandigarh Chennai Cochin Coimbatore Guwahati Hyderabad Indore Jabalpur Jaipur Kanpur Kolkata Lucknow Ludhiana Nagpur Nashik New Delhi Patna Pune Surat Thane Tirupur Trichy Warangal Prayagraj Vadodara Kochi Office No. 713 and 714, Roots Tower, 7th Floor, Plot No - 7, District Centre,  Laxmi Nagar, Near Nirman Vihar Metro Station, New Delhi 110092 011-21210343 newdelhi3@venturasecurities.com Get Direction Drop by at our office Ventura Securities Limited I-Think Techno Campus, “B” Wing, 8th Floor, Pokhran Road No. 2, Off Eastern Express Highway, Thane (West), Maharashtra - 400 607 Call us +91 22 67547000 Send us an email support@venturasecurities.com Escalation Matrix Details Contact Person Address Contact No. Email Id Operational / Working Hrs Customer care CRM Desk Ventura Securities Limited, I-Think Techno Campus, 8th floor, B wing, Pokhran Road No. 2, Off. Eastern Express Highway, Thane, Maharashtra-400607 022 61967296 support@venturasecurities.com Mon-Fri 9:30am to 6:00pm Head of customer care Mr. N. S. Ramaswamy Ventura Securities Limited, I-Think Techno Campus, 8th floor, B wing, Pokhran Road No. 2, Off. Eastern Express Highway, Thane, Maharashtra-400607 022 67547022 nsr@venturasecurities.com Mon-Fri 9:30am to 6:00pm Compliance officer Mr. D. P. Singh Ventura Securities Limited, I-Think Techno Campus, 8th floor, B wing, Pokhran Road No. 2, Off. Eastern Express Highway, Thane, Maharashtra-400607 022 67547055 compliance@venturasecurities.com Mon-Fri 9:30am to 6:00pm CEO Mr. Hemant Majethia Ventura Securities Limited, I-Think Techno Campus, 8th floor, B wing, Pokhran Road No. 2, Off. Eastern Express Highway, Thane, Maharashtra-400607 022 67547001 ceo@venturasecurities.com Mon-Fri 9:30am to 6:00pm Customer care Contact Person: CRM Desk Address: Ventura Securities Limited, I-Think Techno Campus, 8th floor, B wing, Pokhran Road No. 2, Off. Eastern Express Highway, Thane, Maharashtra-400607 Contact No: 022 61967296 Email Id: support@venturasecurities.com Operational/Working Hrs: Mon-Fri 9:30am to 6:00pm Head of customer care Contact Person: Mr. N. S. Ramaswamy Address: Ventura Securities Limited, I-Think Techno Campus, 8th floor, B wing, Pokhran Road No. 2, Off. Eastern Express Highway, Thane, Maharashtra-400607 Contact No: 022 67547022 Email Id: nsr@venturasecurities.com Operational/Working Hrs: Mon-Fri 9:30am to 6:00pm Compliance officer Contact Person: Mr. D. P. Singh Address: Ventura Securities Limited, I-Think Techno Campus, 8th floor, B wing, Pokhran Road No. 2, Off. Eastern Express Highway, Thane, Maharashtra-400607 Contact No: 022 67547055 Email Id: compliance@venturasecurities.com Operational/Working Hrs: Mon-Fri 9:30am to 6:00pm CEO Contact Person: Mr. Hemant Majethia Address: Ventura Securities Limited, I-Think Techno Campus, 8th floor, B wing, Pokhran Road No. 2, Off. Eastern Express Highway, Thane, Maharashtra-400607 Contact No: 022 67547001 Email Id: ceo@venturasecurities.com Operational/Working Hrs: Mon-Fri 9:30am to 6:00pm If you are not satisfied with our response and wish to escalate it further, you can register yourself on the SCORES portal and file a complaint with SEBI or the Exchanges. Corporate Address Ventura Securities Limited, I-Think Techno Campus, “B” Wing, 8th Floor, Pokhran Road No. 2, Off. Eastern Express Highway, Thane (West) - 400 607 Company About us Contact us Careers Refer and earn Support Associates & employee login Products Stocks Mutual Funds Futures & Options IPO Upcoming IPOs Closed IPOs Listed IPOs Fixed Deposit EaseAPI Quick Links Blog News Share Market Guide Share Market Glossary Spotlight Bazaar Basics Platform T&C Privacy Policy Downloads Tools & Calculators Retirement Calculator SWP Calculator Home Loan Calculator Personal Loan Calculator PPF Calculator FD Calculator EMI Calculator Brokerage Calculator SIP Calculator Lumpsum Calculator Top Indices All Indices Nifty 50 Sensex Nifty Bank Nifty Finance Nifty IT Nifty Pharma Nifty Next 50 Nifty 100 Nifty Midcap 50 NIFTY MIDCAP 100 NIFTY SMLCAP 50 NIFTY SMLCAP 100 Share Market Guide Online Trading IPO Demat Account Mutual Funds Stock/Share Market Taxes on Stock Market Income What is MTF Stock Sectors All Sectors IT Stocks Alcohol Sector Stocks Media Stocks Agriculture Sector Stocks Pharma Sector Stocks Private Bank Stocks Public Bank Stocks Healthcare Stocks Cement Sector Stocks Real Estate Sector Stocks Daily Market Updates Daily Market Outlook Nifty Pre Open Today – June 27 Post-Market Outlook – June 26, 2025 Trending Blogs Top Rare Earth Stocks in India Rare Earth Magnet Stocks in India 2025 Upcoming Dividends, Bonus, Stock Splits Sep 01 – Sep 04 Top Performing Defence Stocks in 2025 Top 5 Stocks with Higher YTD Returns EPFO Data Update: April 2025 SIP of Rs.10k: How many years to become a Crorepati? US 50% Tariff Impact Regulatory Disclosures Secured Creditor Meeting Notice Unsecured Creditor meeting Notice Equity Shareholder meeting Notice Attention Investors Unauthorised  Transactions in your Account Margin Pledge Advisory for Investor Depository Guidance Advisory – KYC Compliance e-voting Facility NSDL e-voting Facility CDSL Smart Online Dispute Resolution Disclosure and Disclaimer Bank A/C Key Managerial Personnel How to File a Complaint Details of Authorised Persons BSE KYC in Vernacular Languages NSE KYC in Vernacular Languages MCX KYC in Vernacular Languages NCDEX KYC in Vernacular Languages MSE KYC in Vernacular Languages Mode of Freezing/Blocking Client Collaterals details SECC Regulations Investor Charter Stock Broker Portfolio Manager Research Analyst Depository Participant Rules & Regulations Equity Commodity Disclaimer Privacy Policy Member of NSE, BSE, MCX & NCDEX, Depository Participant of NSDL & CDSL SEBI Stock Broker Registration Number: INZ000194736 | Depository Participant Registration Number: IN-DP-565-2021 INP000004094 (Portfolio Manager), INH000001634 (Research Analyst). AMFI- Registered Mutual Fund Distributor : ARN-20936 | Date of Registration :19 July 2004 | Valid Till 09th July 2026. In case of any grievances please write to complaints@venturasecurities. com Disclaimer Investments in the securities market are subject to market risks, read all the related documents carefully before investing. Brokerage will not exceed SEBI prescribed limit. Please read the SEBI prescribed Combined Risk Disclosure Document prior to investing. The securities are quoted as an example and not as a recommendation. Ventura Securities Limited is a distributor for Non-Broking Products/Services such as Mutual Funds, Mutual Funds SIP, IPO, Baskets, ETF any other Third Party Products/Services etc. These are not Exchange traded products and we are just acting as distributor. All disputes with respect to the distribution activity, would not have access to Exchange investor redressal forum or Arbritation mechanism. Kindly also refer to the detailed disclaimer for Third Party Products. Account opening – The account would be opened after all the procedures relating to IPV and client due diligence is completed. Margin Trading Facility (MTF) – The terms and conditions prescribed hereunder form part of account opening form, shall be read in conjunction with the rights and obligations as prescribed under SEBI circular no. CIR/ MIRSD/ 16/ 2011 dated August 22, 2011 and the Rules, Regulations, Bye laws, Rights and Obligation, Guidelines, circulars issued by SEBI and Exchanges from time to time. Refer terms & conditions. All the offers related to MTF are subject to provisions under SEBI circular CIR/MRD/DP/54/2017 dated June 13, 2017. Compliance officer – Mr. D . P . Singh, Email:– compliance@venturasecurities.com, Support: 022–67547000 Attention Investors “Prevent Unauthorised transactions in your account – Update your mobile number / email ID with your stock brokers. Receive information of your transactions directly from Exchange on your mobile / email at the end of the day. Issued in the interest of Investors 2025 Ventura. All rights reserved. Built with ❤️ in India. Scan QR code to download Ventura App For android only Thank you for showing interest in the all-new Ventura App. While we’re live for Android, we’ll soon be available on iOS, stay tuned. Continue browsing"
    },
    {
      "url": "https://www.venturaccorlando.com/",
      "text": "Welcome to Ventura Country Club - Ventura Country Club Skip to main content Skip to footer Ventura Country Club Orlando, FL Home Tee Times Tee Times Email Club Course Course Information Resident Rates Public Golf Rates Scorecard Golf Shop Join Email Club Instruction 2022 Course Renovation Events Local Weather Contact Us Contact Us Directions Advertisement It’s Time… An Incredible Experience Is Waiting! Book Now About Us Пін Ап казино – це онлайн платформа для гри, що пропонує різноманіття азартних ігор. В асортименті знаходяться слоти, настільні ігри та лайв-казино з реальними дилерами. Опція демонстраційної гри дозволяє ознайомитися з іграми без вкладень реальних коштів. Для гравців доступні різні методи поповнення рахунку та виведення виграшів. Важливим аспектом Пін Ап є наявність ліцензії, що забезпечує правила чесної гри. Користувачам пропонуються бонусні програми, але важливо ознайомитися з їх умовами. Казино також підтримує відповідальний гемблінг та пропонує інструменти для контролю гри. Orlando’s Best Kept Golf Course Experience the uniquely challenging golf course that Ventura has to offer.  Our Champion Bermuda greens were introduced to the course in the summer of 2012. The tour quality putting surface is maintained for a true, smooth, fast, and firm response.  Featured on the cover of Florida Golf Central , Ventura has been playing true to its slogan- “Orlando’s Best Secret”. Appreciate scenic landscapes as our course forms between the natural Florida habitats occupied with wildlife. Ventura is a must play with over 50 sand traps and 15 holes that are lined or guarded by canals and wetlands. With 3 different tee locations, Ventura can be enjoyed by any skill level. Come experience our challenging, well manicured 18 hole Mark Mahanna designed course. Located only minutes from downtown and the Orlando Airport, Ventura openly welcomes new guests looking to try one of Orlando’s best kept secrets. Our cordial staff will ensure a memorable time for any guests. Be sure to relish your surroundings as the natural Florida wetlands attract many species, including the Bald Eagle, Osprey, and many other native animals. Experience the convenience and satisfaction of fast payout online casinos in South Africa. These platforms prioritize efficiency and reliability, ensuring that your winnings are processed swiftly and securely. With fast payout casinos, you can enjoy peace of mind knowing that your funds will reach you in a timely manner, allowing you to access your winnings without delay. Say goodbye to long waiting periods and hello to instant gratification as you indulge in your favorite games and collect your rewards promptly. At these fast payout online casinos https://kennysolomon.co.za/fast-payout-casinos/ , you’ll find a diverse range of payment options, including e-wallets, bank transfers, and cryptocurrency, enabling you to choose the method that suits you best. Whether you prefer the convenience of digital wallets like PayPal and Neteller or the security of traditional bank transfers, these casinos offer seamless transactions to ensure a hassle-free gaming experience. Additionally, their commitment to customer satisfaction means that any issues or concerns regarding withdrawals are addressed promptly by their dedicated support teams. So why wait? Join the ranks of satisfied players and enjoy the benefits of fast payout online casinos today. Tee Times Tee Times are now available up to 14 days in advance! Book Now Course Events Holiday gatherings, leagues, and more! Events Calendar Membership Take your love of the game to the next level! 2023 Memberships Check Out Our State of the Art Pro Shop! Pro Shop Info Slovenské online kasína na https://slovakiaplay.sk/ ponúkajú hráčom z krajiny možnosť hrať svoje obľúbené kasínové hry z pohodlia ich domova. Tieto kasína sú špeciálne navrhnuté tak, aby spĺňali potreby slovenských hráčov a poskytovali im bezpečné a zábavné herné prostredie. Medzi najpopulárnejšie slovenské online kasína patria OlyBet, DOXXbet a KajotWin, ktoré sú známe svojou širokou ponukou hier, štedrými bonusmi a spoľahlivou službou zákazníkom. Hráči si môžu byť istí, že tieto kasína sú licencované a regulované, čo znamená, že dodržiavajú prísne normy a zabezpečujú férovosť hry. Slovenské online kasína sú ideálnou voľbou pre hráčov, ktorí hľadajú bezpečné a zábavné miesto na hranie svojich obľúbených kasínových hier. See What’s New 2022 was a year of great progress for Ventura. Check out our complete renovations! 2022 Renovations Footer Weather ORLANDO WEATHER Visit Us Ventura Country Club 3333 Woodgate Blvd. Orlando, FL 32822 Follow Us Facebook Instagram Contact Us Phone: 407-277-2640 Email: proshop@venturacountryclub.org 7Bit casino Canada Ventura Country Club | 3333 Woodgate Blvd. Orlando, FL 32822 | 407-277-2640 Copyright © 2025 Ventura Country Club All Rights Reserved. Powered by Write a review today!"
    },
    {
      "url": "https://www.venturaccorlando.com/ventura-country-club/",
      "text": "Ventura Country Club: Where Challenge and Luxury Meet - Ventura Country Club Skip to main content Skip to footer Ventura Country Club Orlando, FL Home Tee Times Tee Times Email Club Course Course Information Resident Rates Public Golf Rates Scorecard Golf Shop Join Email Club Instruction 2022 Course Renovation Events Local Weather Contact Us Contact Us Directions Advertisement Ventura Country Club: Where Challenge and Luxury Meet January 17, 2024 by ventura Ventura Country Club is a golfer’s paradise, a place where the lush greens and challenging fairways meet a sense of timeless elegance. Located in the heart of Ventura County, this prestigious club has been a haven for golf enthusiasts for decades. A Course Designed for Legends The 18-hole championship course at Ventura Country Club is both demanding and rewarding. Meticulously manicured fairways wind through rolling hills, with strategically placed bunkers and water hazards ready to test even the most skilled players. The undulating greens demand precision and a deft putting touch. This is a course that has hosted numerous professional tournaments, and its design is sure to challenge players of all levels. Beyond the Course: Amenities Galore Ventura Country Club offers a complete country club experience. After a satisfying round, members can relax in the luxurious clubhouse, where fine dining and classic cocktails await. The pro shop features top-of-the-line golf equipment and apparel, ensuring you’re always looking and playing your best. And for those days away from the course, the club boasts a state-of-the-art fitness center, glistening swimming pool, and vibrant tennis courts. A Focus on Excellence Ventura Country Club prides itself on providing exceptional service and an unmatched golf experience. The well-trained staff attends to every detail, ensuring members and their guests feel pampered and valued. The dedication to quality is evident from the first tee to the final hole and throughout the club’s facilities. Ventura: A Golfer’s Dream The course conditions at Ventura Country Club are consistently superb. Lush fairways and smooth greens provide the perfect playing surface, while the scenic vistas provide a feast for the eyes. Whether you’re battling for par or simply enjoying a leisurely round with friends, Ventura Country Club delivers an unforgettable golf experience. Community and Camaraderie Ventura Country Club is more than just a place to play golf; it’s a thriving community. Regular tournaments and social events foster a sense of camaraderie amongst members. From competitive events to relaxed gatherings, there’s always something happening at the club, creating a warm and inviting atmosphere. When It’s Time to Unwind While golf is undoubtedly the centerpiece of Ventura Country Club, sometimes you need a change of pace. For a thrilling dose of excitement, Woo casino Canada , 7Bit casino Canada and Casino Days casino offer the ideal online escape. With its wide variety of slots, table games, and live dealer options, they provide a fun and potentially rewarding experience from the comfort of your own home. The Total Package: Golf, Luxury, and Relaxation Ventura Country Club embodies the very best of the country club lifestyle. Its combination of a championship-level course, exceptional amenities, and sense of community sets it apart. Whether you’re focused on improving your handicap or simply soaking in the atmosphere, Ventura Country Club is a haven for those who cherish the game of golf and the finer things in life. Experience the Ventura Country Club Difference If you’re passionate about golf and seeking a club that caters to your every whim, Ventura Country Club might just be your perfect match. Filed Under: Uncategorized Footer Weather ORLANDO WEATHER Visit Us Ventura Country Club 3333 Woodgate Blvd. Orlando, FL 32822 Follow Us Facebook Instagram Contact Us Phone: 407-277-2640 Email: proshop@venturacountryclub.org 7Bit casino Canada Ventura Country Club | 3333 Woodgate Blvd. Orlando, FL 32822 | 407-277-2640 Copyright © 2025 Ventura Country Club All Rights Reserved. Powered by Write a review today!"
    },
    {
      "url": "https://www.venturaccorlando.com/course-info/",
      "text": "Course Info - Ventura Country Club Skip to main content Skip to footer Ventura Country Club Orlando, FL Home Tee Times Tee Times Email Club Course Course Information Resident Rates Public Golf Rates Scorecard Golf Shop Join Email Club Instruction 2022 Course Renovation Events Local Weather Contact Us Contact Us Directions Advertisement Course Info Ventura Country Club is a Semi-Private Country Club located in Downtown Orlando designed by Mark Mahannah in 1981.  Mr. Mahannah designed many courses in Florida from the 1960’s through the late 1980’s with the plan of keeping Florida’s natural landscape intact. This attention of preserving the landscape is ever present at Ventura Country Club, built on the former site of the Raper Dairy Farm, who supplied Orlando’s larger TG Lee Dairy for many years. Ventura’s lush layout weaves its way through the pines, canals and natural wetlands all located here in the City Beautiful, Orlando FL.  Although the first three holes are lined by a lucky few homeowners, the rest of the course is very player friendly with homes in sight but not easily in range of a player’s errant shot. Ventura Country Club has always been the hidden gem of Orlando.  With the addition of all new Champion Bermuda Greens, Ventura Country Club is on its way to becoming the Best Conditioned, Best Value and the Most Player Friendly golf course in the Orlando Area!  Champion Greens are known for a smoother, faster, and a firmer putting surface. More than a dozen PGA Tour Events are being held on Champion Greens, including the PGA Tour Championship held at the prestigious Atlanta Athletic Club. Josh Bennett, Director of Golf, has been part of many of the changes over the last 26 years including the recent installation of Champion Bermuda Greens and has set some lofty goals for Ventura Country Club.  “The competition is fierce with so many golf choices in the Orlando Area and we are striving to be the Best Conditioned Semi Private Golf Course in Central Florida,” says Mr. Bennett. Ventura Country Club for many years has been known as “Orlando’s Best Kept Golf Secret” primarily due to its location and the presence of the Security Gates.  “Everyone thinks that the course is private with three gated entrances.  The community is private but the golf course is open to the public.  Golfers simply need a tee time to enter and take advantage of one of the few golf courses that are owned by the Homeowners Association where all owners take pride in the facility.  It is extremely rare that a golf course is owned, managed and maintained by the Homeowners Association. We do it all In-House and we all take great pride in the golf community we have built here in Orlando.  Whether you live in Ventura or outside the gates, our goal is to make everyone feel at home.” A Ventura Country Club magas szintű kiválósággal büszkélkedhet a golfban, és ez az eredmény az online kaszinók felbecsülhetetlen támogatásának köszönhető. Ezek a digitális platformok döntő szerepet játszottak golfklubunk színvonalának emelésében. A Ventura Country Clubunk elkötelezettségét a kivételes golfélmény biztosítása iránt nagyban elősegíti az olyan online kaszinók nagylelkű támogatása, mint a https://kaszinoworld.com/lemon/ . Ezeknek a platformoknak a pénzügyi támogatása lehetővé tette számunkra, hogy a legmodernebb létesítményekbe fektessünk be, fenntartjuk a pálya kifogástalan állapotát, és elsőrangú szolgáltatásokat nyújtsunk tagjainknak és vendégeinknek. Az online kaszinókkal való együttműködés túlmutat a puszta pénzügyi támogatáson. Ezek a platformok gyakran részt vesznek promóciós tevékenységekben és szponzorációkban, amelyek nemcsak a klub sikeréhez járulnak hozzá, hanem dinamikus és vonzó környezetet teremtenek a golfrajongók számára. Versenyek, események és exkluzív ajánlatok csak néhány példa arra, hogy az online kaszinók hogyan vesznek részt aktívan a Ventura Country Club általános élményének fokozásában. You may look at the scorecard and think Ventura is going to be a push over, but once you get into the game, Ventura’s risk / reward design puts your game to the test. The plush fairways are narrow, the rough is tough and the pars 3’s are strong. From the tips the Par 3 16 th hole plays 212 yards to an elevated green guarded by water on both sides and two strategically place greenside bunkers. Ventura’s Signature 6 th hole , like many of the par 5’s isn’t extremely long, but a forced carry over water, a fairway bunker, the jail house of palms and a hard dogleg left present a real test of your course management skills. The question here isn’t “Should I, its how much should I cut off and how hard can I swing”? This is a hole where eagles can soar and bogies can double! Ventura Country Club hosts many golf events, corporate outings, fundraisers and with the golf course and the beautiful Lake Ventura as the backdrop, the Grand Ballroom and Gazebo are the perfect settings for weddings and special events. Our Ventura Country Club has a golf course that has become a favorite among online casino players. The serene ambiance and well-maintained greens offer a perfect escape for those seeking a leisurely round of golf. Moreover, the allure of the golf course has transcended the fairways and attracted online casino enthusiasts, creating a unique synergy between outdoor recreation and virtual gaming. Many online casino players find solace and enjoyment in the peaceful surroundings of our Ventura Country Club. After a round of golf, they often transition seamlessly to the excitement of online casinos, where apollo slots are a particularly popular choice. The seamless blend of outdoor activities and virtual gaming highlights the diverse interests of individuals seeking both relaxation and thrilling entertainment. Online casinos have evolved into dynamic platforms offering a wide array of games, and slots remain a staple for many players. The convenience of accessing these games from the comfort of home or on-the-go aligns perfectly with the lifestyle of those who appreciate the tranquility of a golf course but also enjoy the thrill of spinning the reels. Footer Weather ORLANDO WEATHER Visit Us Ventura Country Club 3333 Woodgate Blvd. Orlando, FL 32822 Follow Us Facebook Instagram Contact Us Phone: 407-277-2640 Email: proshop@venturacountryclub.org 7Bit casino Canada Ventura Country Club | 3333 Woodgate Blvd. Orlando, FL 32822 | 407-277-2640 Copyright © 2025 Ventura Country Club All Rights Reserved. Powered by Write a review today!"
    },
    {
      "url": "https://raintreeorlandovcc.com/ventura-country-club/",
      "text": "Ventura Country Club – Raintree Skip to content Close Menu Vista Management 407-682-3443 Search for: Search Raintree Menu Gate Access Manage your Ventura guests online. Work Orders Need something fixed? Start here. HOMEOWNER LOG-IN Access your homeowner account. Home Latest News Raintree Management Board of Directors Board Meetings Vista Management Ventura Country Club Owners HOMEOWNER LOG-IN Phase Documents Raintree Phase Map Unit Maintenance Architectural Improvements (ARB) Landscaping Improvements (LPR) Raintree Paint Colors Renting Your Unit Request a Welcome Kit Ways to Pay Your HOA Fee Renters Living in Raintree Contact Us Ventura Country Club Raintree is located within Ventura Country Club (Ventura), a gated community in East Orlando with more than 1,700 homes and condominiums. Raintree owners, renters and guests are not only subject to Raintree documents, rules and regulations, but also Ventura documents, rules and regulations. To live in Ventura, there are two association fees, one for Raintree, and the other for the Ventura Homeowners Association (VHOA). If you have any questions regarding your VHOA payment, contact the Ventura Admin Office. Ventura Country Club offers many amenities for its residents. Some of these amenities require an access card for entry. Visit the Ventura Admin Office for more information: Fitness Center Swimming Pool Tennis Courts Meetings Rooms Library The 19th Hole Restaurant located at the Clubhouse offers weekly dinner specials and events like karaoke and team trivia. Find out what’s going on a the 19th Hole . The Ventura Country Club features an 18-Hole Golf Course which welcomes outside play. Book a tee time . The Pro Shop stocks items such as golf clubs, clothing and footwear. Ventura Admin Office Mailing Address: 3333 Woodgate Blvd. Orlando, FL 32822 Ventura Country Club Contacts Access Control 407-794-1755 Rover 407-758-1132 Guest Call-In 407-380-5672 Curry Ford Gate 24 Hours Pershing Gate 6:00am–11:00pm, Daily Raper Dairy Gate (Barcode Only) 5:00am–11:00pm, Daily Admin Office 8:30am–5:00pm, Monday–Friday 407-275-7002 19th Hole Restaurant 407-380-1882 Pro Shop & Tee Times 407-277-2640 Orlando Police Non-Emergency 321-235-5300 EMERGENCY 911 Gate GPS Coordinates GPS Address – Curry Ford Gate: 2601 Woodgate Blvd., Orlando, FL 32822 GPS Address – Pershing Gate: 4211 Woodgate Blvd., Orlando, FL 32822 Estoppels For Raintree estoppels and closing documents, visit HomeWiseDocs or email estoppels@vistacamfl.com . Meeting Archives Board Meeting agendas and minutes from 2014-2020 are located in the Archives . Subscribe to Email Updates Sign up now for Raintree email updates and announcements. 2025\t\t\t\t\t\t\tRaintree Create a website or blog at WordPress.com Subscribe Subscribed Raintree Sign me up Already have a WordPress.com account? Log in now. Raintree Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar"
    },
    {
      "url": "https://www.venturaccorlando.com/tee-times/",
      "text": "Tee Times - Ventura Country Club Skip to main content Skip to footer Ventura Country Club Orlando, FL Home Tee Times Tee Times Email Club Course Course Information Resident Rates Public Golf Rates Scorecard Golf Shop Join Email Club Instruction 2022 Course Renovation Events Local Weather Contact Us Contact Us Directions Advertisement Tee Times Ventura Country Club, with its lush green fairways and challenging 18 holes, offers a tranquil retreat for golfers looking for a break from the hustle and bustle of everyday life. Set amidst a picturesque landscape, players can immerse themselves in the tranquility of the course while honing their skills and enjoying the camaraderie of other golfers. However, for those looking for a different kind of thrill, the appeal of a bitcoin casino not on Gamstop is an attractive alternative. With a diverse selection of games and the convenience of cryptocurrency transactions, these virtual gaming platforms offer an exciting experience for those looking to try their luck and potentially win big, all without the constraints of traditional banking regulations. For some, however, the excitement goes beyond the golf course and into the realm of online gambling, where non-Gamstop bitcoin casinos beckon with the promise of adventure and riches. Whether you’re looking for the tranquility of a well-played round or the excitement of high stakes, Ventura Country Club Casino and non-Gamstop bitcoin casinos offer different but equally compelling ways to spend your leisure time and entertainment. Call the Pro Shop for additional available tee times Sorry - your browser does not support iframes. Der Ventura Country Club hat in den Online-Casinos einen wertvollen finanziellen Unterstützer gefunden. Die Partnerschaft zwischen den beiden hat dem Golfclub erhebliche Vorteile gebracht und es ihm ermöglicht, zu gedeihen und seine Einrichtungen zu verbessern. Der Ventura Country Club mit seinen malerischen Grüns und erstklassigen Einrichtungen hat die Aufmerksamkeit und Unterstützung verschiedener Online-Casinos, darunter auch https://topcasinosuisse.com/de/echtgeld-casinos/ , auf sich gezogen. Die finanzielle Unterstützung durch diese Casinos hat eine entscheidende Rolle bei der Instandhaltung und Verbesserung der Infrastruktur des Golfclubs gespielt. Diese Unterstützung gewährleistet, dass Mitglieder und Gäste ein erstklassiges Golferlebnis in einer gepflegten und schönen Umgebung genießen können. Die Zusammenarbeit zwischen Online-Casinos und dem Ventura Country Club geht über finanzielle Zuwendungen hinaus. Viele Online-Casinos beteiligen sich aktiv an Sponsoring- und Werbeaktivitäten und fördern so eine positive Beziehung zum Golfclub und seiner Gemeinde. Dies erhöht nicht nur den Bekanntheitsgrad des Clubs, sondern fördert auch ein Gefühl der Partnerschaft und gegenseitigen Unterstützung. Footer Weather ORLANDO WEATHER Visit Us Ventura Country Club 3333 Woodgate Blvd. Orlando, FL 32822 Follow Us Facebook Instagram Contact Us Phone: 407-277-2640 Email: proshop@venturacountryclub.org 7Bit casino Canada Ventura Country Club | 3333 Woodgate Blvd. Orlando, FL 32822 | 407-277-2640 Copyright © 2025 Ventura Country Club All Rights Reserved. Powered by Write a review today!"
    },
    {
      "url": "https://bgclubventura.org/who-we-are/board.html",
      "text": "Board of Directors : Who We Are : Boys & Girls Club of Greater Ventura Skip to main content Who We Are Our Mission History Board of Directors Founders' Society Leadership Club Sites Bill LeFevre Center E.J. Harrison Center Westview Center Oak View Teen Center What We Do Impact Strategies Academic Success Good Character Healthy Lifestyles Emma Nylen Scholarship Summer Program Safety Safety Report a Concern Employment Employment Opportunities Special Events Special Events Great Futures Auction Golf Classic Youth of the Year Event Registration Meet Our Youths of the Year Become a Sponsor Impact Impact Report Our Impact Through Club Stories Support the Club Give Now Amazon Wish List The Promise Club Avenue Thrift - Supporting the Boys & Girls Club Ventura Boys & Girls Club Foundation Planned Giving Contact Us Who We Are Board of Directors Who We Are Our Mission History Board of Directors Founders' Society Leadership Club Sites Bill LeFevre Center E.J. Harrison Center Westview Center Oak View Teen Center What We Do Impact Strategies Academic Success Good Character Healthy Lifestyles Emma Nylen Scholarship Summer Program Safety Safety Report a Concern Employment Employment Opportunities Special Events Special Events Great Futures Auction Golf Classic Youth of the Year Event Registration Meet Our Youths of the Year Become a Sponsor Impact Impact Report Our Impact Through Club Stories Support the Club Give Now Amazon Wish List The Promise Club Avenue Thrift - Supporting the Boys & Girls Club Ventura Boys & Girls Club Foundation Planned Giving Contact Us Donate Michael Lebow Board President Slaughter, Reagan & Cole Evan Scott 1st Vice President Montecito Bank & Trust Jim Rodey 2nd Vice President Culver City Volvo/Mazda Kiki Lyon* Treasurer C.D. Lyon Inc. David Harrison* Immediate Past President E.J. Harrison & Sons Eduardo Avila Board Member Kaiser Permanente Daniela Barbar Board Member Resource Real Estate Peter Barry Board Member Advantage Telecom Christina Garza Board Member US Bank Kalpana Iyer Board Member Ventura County Credit Union Kimberly Keller Board Member Nissin Foods US, LLC Vince Mendoza Board Member Siemens Elisabeth Paniagua Board Member SoCal Gas Lourdes Solorzano Board Member County of Ventura Mereana Street Board Member Assured Partners Foundation Board Tom Hinkle* President Tony MacIsaac Vice President John Brant* Board Member Don Krause Treasurer Armando Casillas Board Member David Harrison Board Member Evan Scott Board Member Emeritus Board Saurabh Bajaj* John Brant* Sherri Drifka Spencer Garrett* Bill Hicks* Tom Hinkle* Susanne Lammot, M.D* Gary Nasalroad* Marty Robinson Leon Rousso, CFP* Honorary Board Trudy Arriaga, Ph.D. Chief Ken Corney Sheriff Geoff Dean Matthew Guasco* Myron Harrison Bill Kracht Joe Kreutz *Past President Aera Energy Assured Partners So Cal Gas Amgen Foundation Geene Haas Foundation Kaiser Permanente Wedgewood Weddings Administrative Office 1280 S. Victoria Avenue Suite 240 Ventura, CA 93003 (805) 641-5585 Fax (805) 639-0180 info@bgclubventura.org Facebook Instagram Twitter © 2025 Boys & Girls Club of Greater Ventura Privacy Policy Privacy Policy What Information Do We Collect? When you visit our website you may provide us with two types of information: personal information you knowingly choose to disclose that is collected on an individual basis and website use information collected on an aggregate basis as you and others browse our website. Personal Information You Choose to Provide We may request that you voluntarily supply us with personal information, including your email address, postal address, home or work telephone number and other personal information for such purposes as correspondence, placing an order, requesting an estimate, or participating in online surveys.\nIf you choose to correspond with us through email, we may retain the content of your email messages together with your email address and our responses. We provide the same protections for these electronic communications that we employ in the maintenance of information received by mail and telephone. Website Use Information Similar to other websites, our site may utilize a standard technology called \"cookies\" (see explanation below, \"What Are Cookies?\") and web server logs to collect information about how our website is used. Information gathered through cookies and server logs may include the date and time of visits, the pages viewed, time spent at our website, and the sites visited just before and just after ours. This information is collected on an aggregate basis. None of this information is associated with you as an individual. How Do We Use the Information That You Provide to Us? Broadly speaking, we use personal information for purposes of administering our business activities, providing service and support and making available other products and services to our customers and prospective customers. Occasionally, we may also use the information we collect to notify you about important changes to our website, new services and special offers we think you will find valuable. The lists used to send you product and service offers are developed and managed under our traditional standards designed to safeguard the security and privacy of all personal information provided by our users. You may at any time to notify us of your desire not to receive these offers. What Are Cookies? Cookies are a feature of web browser software that allows web servers to recognize the computer used to access a website. Cookies are small pieces of data that are stored by a user's web browser on the user's hard drive. Cookies can remember what information a user accesses on one web page to simplify subsequent interactions with that website by the same user or to use the information to streamline the user's transactions on related web pages. This makes it easier for a user to move from web page to web page and to complete commercial transactions over the Internet. Cookies should make your online experience easier and more personalized. How Do We Use Information Collected From Cookies? We use website browser software tools such as cookies and web server logs to gather information about our website users' browsing activities, in order to constantly improve our website and better serve our users. This information assists us to design and arrange our web pages in the most user-friendly manner and to continually improve our website to better meet the needs of our users and prospective users.\nCookies help us collect important business and technical statistics. The information in the cookies lets us trace the paths followed by users to our website as they move from one page to another. Web server logs allow us to count how many people visit our website and evaluate our website's visitor capacity. We do not use these technologies to capture your individual email address or any personally identifying information about you. Notice of New Services and Changes Occasionally, we may use the information we collect to notify you about important changes to our website, new services and special offers we think you will find valuable. As a user of our website, you will be given the opportunity to notify us of your desire not to receive these offers by clicking on a response box when you receive such an offer or by sending us an email request. How Do We Secure Information Transmissions? When you send confidential personal information to us on our website, a secure server software which we have licensed encrypts all information you input before it is sent to us. The information is scrambled en route and decoded once it reaches our website.\nOther email that you may send to us may not be secure unless we advise you that security measures will be in place prior to your transmitting the information. For that reason, we ask that you do not send confidential information such as Social Security, credit card, or account numbers to us through an unsecured email. How Do We Protect Your Information? Information Security -- We utilize encryption/security software to safeguard the confidentiality of personal information we collect from unauthorized access or disclosure and accidental loss, alteration or destruction.\nEvaluation of Information Protection Practices -- Periodically, our operations and business practices are reviewed for compliance with organization policies and procedures governing the security, confidentiality and quality of our information.\nEmployee Access, Training and Expectations -- Our organization values, ethical standards, policies and practices are committed to the protection of user information. In general, our business practices limit employee access to confidential information, and limit the use and disclosure of such information to authorized persons, processes and transactions. How Can You Access and Correct Your Information? You may request access to all your personally identifiable information that we collect online and maintain in our database by emailing us using the contact form provided to you within the site structure of our website. Do We Disclose Information to Outside Parties? We may provide aggregate information about our customers, sales, website traffic patterns and related website information to our affiliates or reputable third parties, but this information will not include personally identifying data, except as otherwise provided in this privacy policy. What About Legally Compelled Disclosure of Information? We may disclose information when legally compelled to do so, in other words, when we, in good faith, believe that the law requires it or for the protection of our legal rights. Permission to Use of Materials The right to download and store or output the materials in our website is granted for the user's personal use only, and materials may not be reproduced in any edited form. Any other reproduction, transmission, performance, display or editing of these materials by any means mechanical or electronic without our express written permission is strictly prohibited. Users wishing to obtain permission to reprint or reproduce any materials appearing on this site may contact us directly. Terms & Conditions Terms & Conditions Donation Refund Policy We are grateful for your donation and support of our organization. If you have made an error in making your donation or change your mind about contributing to our organization please contact us.  Refunds are returned using the original method of payment. If you made your donation by credit card, your refund will be credited to that same credit card. Automated Recurring Donation Cancellation Ongoing support is important to enabling projects to continue their work, so we encourage donors to continue to contribute to projects over time. But if you must cancel your recurring donation, please notify us. Powered by Firespring"
    },
    {
      "url": "https://visitventuraca.com/contact/staff/",
      "text": "Visit Ventura Staff Bios for the Ventura Tourism Team Who We Are Blog Press Groups and Meetings in Ventura Things to Do Top Things to Do Family Fun Dog Friendly Ventura Shopping Music & Nightlife Arts, Culture & History Ventura Harbor Activities Outdoor Activities Beaches and Surfing Hiking & Biking Trails Bird Watching Golf Channel Islands Santa Cruz Island Things to Do in Ventura Anacapa Island Santa Rosa Island Whale Watching Hiking Camping Kayaking Diving Stay Hotels Camping & RV Parks Weddings Neighborhoods Transportation Monthly Newsletter Food & Drink Restaurants Outdoor Dining Ventura Breweries Farmers Markets Ventura Wineries Happy Hours Events Things to Do Top Things to Do Family Fun Dog Friendly Ventura Shopping Music & Nightlife Arts, Culture & History Ventura Harbor Activities Outdoor Activities Beaches and Surfing Hiking & Biking Trails Bird Watching Golf Channel Islands Santa Cruz Island Things to Do in Ventura Anacapa Island Santa Rosa Island Whale Watching Hiking Camping Kayaking Diving Stay Hotels Camping & RV Parks Weddings Neighborhoods Transportation Monthly Newsletter Food & Drink Restaurants Outdoor Dining Ventura Breweries Farmers Markets Ventura Wineries Happy Hours Events Meet the Ventura Tourism Team Marlyss Auster | President & CEO Marlyss came back to Ventura in 2012, having left her heart behind when she moved away in 1994. She originally moved to Ventura based on a postcard her mother received while living in Houston. Now she focuses on inspiring others to discover the Ventura that stole her heart. She leads all aspects of strategic planning, brand development and stewardship, marketing, public relations, and visitor center operations. She is a mom to two boys and Snickers, a Nova Scotia Duck Tolling Retriever that she adopted after he was displaced by Hurricane Katrina. On the weekends, she enjoys being out and about with the family car-free – with a stroll-and-see-where it-takes-us kind of vibe. Mike Laan | Director of Marketing Mike has been on the team since 2014. Mike came from a strong video background and has been editing for 20 years. He also is a huge contributor to the laughs in the office and is dubbed the “drone pilot.” Big into technology, he keeps everything tech-related up to date and is always behind a camera. Michele Foster | Visitor Center Manager Michele joined the Visit Ventura team in 2015, after beginning as a volunteer. She loves managing the Visitor Center during the weekend, working with guests and supporting the team on special projects. Michele has traveled to and lived in a variety of different, wonderful places, but she has been totally charmed by Ventura and is happy to call it home. Julie Madsen | Communications & PR Manager Julie joined the Visit Ventura team in 2022. She is a Ventura native and has loved to see the city grow and expand alongside of her. Julie left Ventura to attend UC Berkeley (go bears!) where she earned an honors B.A. in Media Studies. She has an extensive journalism background and sometimes seems to think faster than she can write. Julie oversees a strategic public relations program and serves as the day-to-day media contact. She is excited to do all things writing, but most of all, she is thrilled to share with others why Ventura and its people are so special. Aubrey Zambrana | Visitors Services Representative Aubrey brings a host of talents to the table. And a big heart. Along with working at Visit Ventura, she’s studying to be a high school teacher — and she’s a huge dog and basketball lover. If you drop into the Visitor Center you might have the chance to meet her heart-melting best friend, Kobe. Nicole Taylor | Visitor Center Supervisor Nicole joined the Visit Ventura team in 2023. Working in the hospitality industry has been a part of Nicole’s life for over 10 years — a true testament to her passion for making personal connections with everyone she meets, both in the visitor center and outside. A Ventura native, Nicole loves biking along the coast, catching a movie, and is excited to raise her son in her hometown. Amber Tayo | Sales & Marketing Assistant Amber joined the team in 2025 and is excited to put to work all of the fun and unique skillsets she’s acquired during her career. From editing photos and videos to taking a deep dive into all things analytics and data, Amber is always looking for opportunities to learn more and experience new things! She’s always dreamed of living in a beach town like Ventura, so that’s why she and her husband decided to take the leap and move to town a few years ago. Since moving to Ventura, you can find her biking around town, taking photos, or at home relaxing with her cat and husband, probably watching a movie or playing a video game. Ventura Partners With Connect With Us Google Translate Visit Ventura 101 S. California Street Ventura, CA 93001 1-805-641-1400 Visitor Information Visitor Center FAQs History Transportation Accessibility Explore Things to Do Outdoor Activities Channel Islands Stay Food & Drink Events Shop Who We Are Blog Groups and Meetings in Ventura Media Center Press Request Information Inspiration Guide Monthly Newsletter"
    },
    {
      "url": "https://www.venturaenergypartners.com/contact",
      "text": "Contact Ventura Energy | Get in Touch for Renewable Energy Solutions top of page Home Landowners Community Solar Overview California Maryland Illinois About Us Contact More Use tab to navigate through the menu items. Let's Talk Contact Us Mail Email: info@venturaenergypartners.com Mail Address: 925 De La Vina Street, Ste 104, Santa Barbara, CA 93101 Mail Address: 12230 Clarksville Pike Ste C Clarksville, MD 21029 Send Us A Message Name Phone Email Subject Your message Send Thanks for submitting! Please contact us to start the process of benefitting your community and receiving lease income while doing so. Email Us About We develop and invest in renewable energy projects that meet the needs of utilities and impact communities throughout the United States. Facebook Instagram X Quick Links Privacy Policy Terms and Conditions Accessibility Statement Contact Contact Us info@venturaenergypartners.com 925 De La Vina Street, Ste 104, Santa Barbara, CA 93101 12230 Clarksville Pike Ste C Clarksville, MD 21029 © 2024 by Ventura Energy Partners LLC Designed By Name Brand Marketer bottom of page"
    },
    {
      "url": "https://www.venturaccorlando.com/course-renovation/",
      "text": "2022 Course Renovation - Ventura Country Club Skip to main content Skip to footer Ventura Country Club Orlando, FL Home Tee Times Tee Times Email Club Course Course Information Resident Rates Public Golf Rates Scorecard Golf Shop Join Email Club Instruction 2022 Course Renovation Events Local Weather Contact Us Contact Us Directions Advertisement 2022 Course Renovation A Note from our Director of Golf, As Ventura Country Club nears its next milestone with our 40 th Anniversary on September 11 th , I am celebrating my 26 th year of dedicated service.  I love this place!   The golfing relationships my staff and I have formed with our residents, golfing members and public players that all call Ventura Country Club their “home course” are stronger than ever!  We have strived to be the friendliest, best valued and best conditioned course in the area and currently we are one of the highest rated courses on Golf Advisor in Central Florida with a 93.7% rating.  We have a great reputation in one of the biggest golf markets in the country, Central Florida. Ventura is getting better each year, and our Golf Course Superintendent Steve Holley and Assistant Golf Course Superintendent Roger Bays are making daily repairs to our aging irrigation system.  While keeping the course in great condition gets more difficult by the day, we are blessed with a golf staff that takes pride in our course and works tirelessly to keep us moving forward.  While so many courses in the area failing, we have been working on plans to renovate our aging golf course for the past 3 years and we have scheduled a start date. Diving into my master’s paper was like navigating a jungle without a compass—until I stumbled upon a gem: this resource. Suddenly, the chaos of citations and structure became a walk in the park. It’s my secret weapon, guiding me through the maze of academic writing. With this masterarbeit ghostwriter agentur resource, I’m not just stringing words; I’m weaving an intellectual tapestry. Cheers to the unsung hero making this thesis adventure less of a wild goose chase! Our upcoming golf course renovation will begin on April 4 th , 2022. The golf course will be closed throughout the renovation reopening on or by November 1 st , 2022. Pro Shop Staff is working on playing relationships with area courses during our closure to ensure that our residents can find good golf at a fair price.  This project is going to be a full irrigation design and replacement and rebuild of the green’s complexes, tee boxes and bunkers.  The USGA recommends replacing irrigation systems every 10-30 years and rebuilding greens complexes every 15-20 years. To put this renovation in perspective, here is the background of the last 40 years.  The Grand Opening of Ventura Country Club Golf Course was on September 11 th , 1981.  In the early 1990’s, the cart barn was built along with the addition of the Pro Shop.  In 1999, the now 18-year-old greens complexes were rebuilt to USGA specifications.   This involved removing approximately 18 inches of material and rebuilding the drainage system beneath the green, then the green itself.  In 2012, the greens were regrassed with Champion Bermuda.  In 2022, the Greens will be 23 years old, and the irrigation system 41 years old.  Both are well beyond USGA recommendations. Since the rebuild of the irrigation system and greens complexes are occurring simultaneously, this is the perfect time to improve the course playing conditions including drainage, bunkers, tees and greens. We all know our small greens limit the number of pin locations. Concentrated foot traffic and ball marks on our small greens makes maintaining the greens health very difficult. The small greens also limit the water egress points on each green creating wet spots, often in the approach areas and bunkers, making some holes unplayable. The rebuild will have larger greens and multiple water run-off points appropriately placed to make the course more playable and more fun. Our new golf course renovation architect, Lee Marshall of Lee Marshall Golf Design, has provided an outline and plans detailing the scope of the renovation.  I am happy to meet with groups of 4 to 6 people by appointment to review the upcoming project.  The meeting will require about an hour, and I will present the project from tee to green.  To make an appointment please email me at jbennett@venturacc.org We have made it 40 years and this investment will put us in a great position for the next 40! Respectfully, Josh Bennett jbennett@venturacc.org 407-277-2640 Footer Weather ORLANDO WEATHER Visit Us Ventura Country Club 3333 Woodgate Blvd. Orlando, FL 32822 Follow Us Facebook Instagram Contact Us Phone: 407-277-2640 Email: proshop@venturacountryclub.org 7Bit casino Canada Ventura Country Club | 3333 Woodgate Blvd. Orlando, FL 32822 | 407-277-2640 Copyright © 2025 Ventura Country Club All Rights Reserved. Powered by Write a review today!"
    },
    {
      "url": "https://www.venturamissionary.com/staff",
      "text": "Ventura Missionary Church Staff Team Home About Mission and Vision What We Believe Our Story Contact Us Staff Jobs Next Steps Midweek Baptism Volunteer Global Missions Local Missions Family Life Kids Child-Dedications KidsZone Online Students Sermons Give I'm New Meet Our Staff  & Leadership Teams Doug Colby Scott Grabendike Lead Pastor Executive Pastor Pastor Doug  enjoys surfing, swimming, running, hiking, reading, and especially spending time with family and friends. When asked to share a fun fact that most people don't know about him, he revealed, \"I used to have hair!\" Referring to his life today, he says, \"The best thing about having adult children is that my wife and I don't need to try to find someone who is crazy enough to babysit six kids so we can go on date nights anymore!\" Pastor Scott spends much of his free time camping, overlanding, and off-roading with family and friends. He and his wife have been married over 30 years. When asked where he likes to eat in Ventura, he said, \"It depends on my mood...Corrales for Mexican, Rice by Mama for Thai, I Love Sushi for Japanese...and Foster Freeze Corn Burritos when I am disrespecting my temple!\" Contact Contact Weekend Services Team Josh Nordgren Worship Pastor Contact Fun fact about Josh is that he has been in break-dancing competitions! More recently he began hydro-foil surfing (\"foiling\"). His favorite Ventura food spot is Corrales. Eddie Fontaine David Bathauer Tech Director Tech Assistant Contact Contact In addition to spending time with his family, Eddie's favorite free time activity is working on and going out on his boat, and his favorite restaurant is Yolanda's by the water. David enjoys trail running.  Fun facts about David: he has summited Mt. Whitney in six hours and runs 20-40 miles each week! His favorite place to eat is Yolanda's. Next Steps Team Marci Worthy Next Steps Pastor Contact Marci enjoys running at the beach , date nights with her husband, and rooting for UCLA basketball with her family. Lure is a favorite eating place. Elizabeth Sylvester Annette Tarin Next Steps Director Next Steps Coordinator Contact Contact Elizabeth's favorite local eatery is Lalo's. She is married with two sons and jokes that they have more dogs than kids!  She has never lived outside of a six-mile radius. A fun fact about Annette is that she was in a Greek dance troupe, so it's not surprising that a favorite restaurant of hers  is \"The Greek.\" She also enjoys spending time with family. Family Life Team Gabby Pido Clara Cutbill Kris Russell Student Ministry Director Children's Ministry Director Nursery Coordinator Contact Contact Contact Gabby plays in the city rec co-ed soccer league.  The students tell her happy birthday every day so no one knows when her actual birthday is. Fun fact: She once high-fived Shaq! Clara likes to watch ice hockey (go Kings!) Fun Fact: Clara's pug, Blanche (named for a \"Golden Girl\") has her own Instagram page and is Miss April in a Pug Calendar. KristiAnne was born in Oklahoma but has lived in California longer than anywhere, so she calls herself a \"CaliforniOkie.\" It's not surprising that she's an OU Sooner fan. Communications Team Terri Nevlin Communications Director Contact Terri loves spending time with family and friends and reading in the sun. Most people don't know she speaks Spanish and used to sing oldies with her husband. Operations Team Jay Licata Operations Director Contact Jay enjoys working on old vehicles, and even describes searching for replacement parts online as an entertaining quest. Two Trees Restaurant is a go-to eating place for him. Summer Barraza HR Director Contact Summer enjoys exploring new places with her husband and toddler and eating at Taqueria Tipatitlan. Fun fact: She attended eleven elementary schools. Rochelle Baldwin Office Coordinator Contact Rochelle enjoys hiking, camping, board games and spending time with family. Cafe Nouveau is one of her favorite places to eat. Surprising fun fact: She has always wanted a pet pig! Todd Hicks Facilities Director Contact Todd and his wife enjoy hiking God's creation and often vacation near or in National Parks. He enjoys eating at Black Angus...\"you can have a conversation without shouting!\" Greg Campbell Facilities  Coordinator Contact Greg likes to play golf and watch supercross. Fun fact from the past: He used to watch the Dallas Cowboys practice in Thousand Oaks. Troyce Reynolds Safety & Security Coordinator Contact Troyce likes eating at La Cabana, riding horses and motorcycles, and playing guitar. Fun fact: Troyce traveled with a rodeo  in the circus for three years. Alex Ramirez Safety & Security Officer Contact Fun facts about Alex coming soon. Elders Dave Banks Elder Doug Colby Elder/Lead Pastor Kevin Baysinger Elder Clint Garman Elder Lynn Bova Elder Bob Naylor Elder Eddie Eberhard Elder Administrative Council Ed Eberhard AC Chairman Jay Licata AC/Operations Director Crystal Baker AC Vice Chairman Bob Cheatham AC Member Jeannie Salcido AC Secretary Pete Favero AC Member Vinse Gilliam Treasurer Linda Mehle AC Member We exist to live and share the transforming love of Jesus Our Ministry Partners Ventura Missionary Preschool Ventura Missionary School - Elementary and Middle School Sunday Service Times 9:00 am* & 10:30 am *9:00 am also livestreams KidsZone for birth-5th grade during both services Contact Info (805) 642-0550 info@vmc.net 500 High Point Drive Ventura, CA  93003 Follow Us Our Blog Jobs powered by SnapPages"
    },
    {
      "url": "https://www.venturaccorlando.com/instruction/",
      "text": "Instruction - Ventura Country Club Skip to main content Skip to footer Ventura Country Club Orlando, FL Home Tee Times Tee Times Email Club Course Course Information Resident Rates Public Golf Rates Scorecard Golf Shop Join Email Club Instruction 2022 Course Renovation Events Local Weather Contact Us Contact Us Directions Advertisement Instruction SPECIAL:  Buy 2 one hour lessons for $90.00 each and receive a 3rd one hour lesson free! Contact: Josh Bennett , Director of Golf jbennett@venturacountryclub.org Footer Weather ORLANDO WEATHER Visit Us Ventura Country Club 3333 Woodgate Blvd. Orlando, FL 32822 Follow Us Facebook Instagram Contact Us Phone: 407-277-2640 Email: proshop@venturacountryclub.org 7Bit casino Canada Ventura Country Club | 3333 Woodgate Blvd. Orlando, FL 32822 | 407-277-2640 Copyright © 2025 Ventura Country Club All Rights Reserved. Powered by Write a review today!"
    },
    {
      "url": "https://www.venturaccorlando.com/contact-us/",
      "text": "Contact Us - Ventura Country Club Skip to main content Skip to footer Ventura Country Club Orlando, FL Home Tee Times Tee Times Email Club Course Course Information Resident Rates Public Golf Rates Scorecard Golf Shop Join Email Club Instruction 2022 Course Renovation Events Local Weather Contact Us Contact Us Directions Advertisement Contact Us The presence of writing services contributes a significant aspect to the educational environment. These services, such as fertige seminararbeit kaufen play a crucial role not just in assisting students with meeting deadlines but also in imparting valuable insights into proficient writing techniques. Acting as a complement to traditional classroom learning, they provide an alternative viewpoint, thereby enriching the overall educational experience. Ventura Country Club 2601 Woodgate Blvd. Orlando, FL. 32822 Pro Shop: 407-277-2640 jbennett@venturacountryclub.org Josh Bennett Director of Golf jbennett@venturacountryclub.org HOA website www.venturacountryclub.org As online gambling is constantly evolving, new online casinos are constantly popping up to offer players innovative experiences and attractive bonuses. While enthusiasts are immersing themselves in virtual gaming realms, traditional leisure activities such as golf at venues like Ventura Country Club remain a favorite pastime. When players tee off amid the lush greenery of Ventura’s 18-hole course, they escape to a quiet oasis, far from the digital hustle and bustle of новые казино . However, the appeal of convenience attracts many golfers to explore online gaming options during their downtime, bridging the gap between traditional recreation and modern entertainment. The enduring appeal of Ventura Country Club remains, offering a tangible vacation for golf enthusiasts looking for camaraderie and the thrill of mastering each hole. While online casinos are captivating with their virtual extravagance, the tranquility and tradition of a day spent at Ventura Country Club has a unique charm that transcends the digital realm. Footer Weather ORLANDO WEATHER Visit Us Ventura Country Club 3333 Woodgate Blvd. Orlando, FL 32822 Follow Us Facebook Instagram Contact Us Phone: 407-277-2640 Email: proshop@venturacountryclub.org 7Bit casino Canada Ventura Country Club | 3333 Woodgate Blvd. Orlando, FL 32822 | 407-277-2640 Copyright © 2025 Ventura Country Club All Rights Reserved. Powered by Write a review today!"
    },
    {
      "url": "https://bgclubventura.org/who-we-are/founders-society.html",
      "text": "Founders' Society : Who We Are : Boys & Girls Club of Greater Ventura Skip to main content Who We Are Our Mission History Board of Directors Founders' Society Leadership Club Sites Bill LeFevre Center E.J. Harrison Center Westview Center Oak View Teen Center What We Do Impact Strategies Academic Success Good Character Healthy Lifestyles Emma Nylen Scholarship Summer Program Safety Safety Report a Concern Employment Employment Opportunities Special Events Special Events Great Futures Auction Golf Classic Youth of the Year Event Registration Meet Our Youths of the Year Become a Sponsor Impact Impact Report Our Impact Through Club Stories Support the Club Give Now Amazon Wish List The Promise Club Avenue Thrift - Supporting the Boys & Girls Club Ventura Boys & Girls Club Foundation Planned Giving Contact Us Who We Are The Founders' Society Who We Are Our Mission History Board of Directors Founders' Society Leadership Club Sites Bill LeFevre Center E.J. Harrison Center Westview Center Oak View Teen Center What We Do Impact Strategies Academic Success Good Character Healthy Lifestyles Emma Nylen Scholarship Summer Program Safety Safety Report a Concern Employment Employment Opportunities Special Events Special Events Great Futures Auction Golf Classic Youth of the Year Event Registration Meet Our Youths of the Year Become a Sponsor Impact Impact Report Our Impact Through Club Stories Support the Club Give Now Amazon Wish List The Promise Club Avenue Thrift - Supporting the Boys & Girls Club Ventura Boys & Girls Club Foundation Planned Giving Contact Us Donate FOUNDER’S SOCIETY The Founder’s Society was established on October 24, 2015, to give recognition and honor to those individuals who have a history of distinguished service and have made a significant contribution to the Boys & Girls Club of Greater Ventura over a sustained period of time. Recipients have made lasting contributions in one or more of the following areas: ·         20 Years or more of sustained service to the Boys & Girls Club of Greater Ventura ·         Demonstrated over a period of time, a contribution which has created sustainability or capacity building for the organization. ·         Established a new program, network or facet of the organization that has moved the organization forward for a period of 10 years or more. We hold these individuals in the highest esteem and give honor to them for their vision, dedication and unyielding efforts to provide the positive change that we seek for the future of our community’s youth. Founders' Society Inaugural Members BILL HICKS & SPENCER GARRETT BILL HICKS & SPENCER GARRETT These two men are the inaugural members of the Founders’ Society for their distinguished service to the youth of Ventura over a sustained 35 year period. In 1979, Bill Hick’s was President of the Boys Club and Spencer Garrett was the President of the Girls Club. The two were inducted together for their significant role in the 1980 merger of the Boys Club and the Girls Club into the Boys & Girls Club of Ventura and led the way for other Clubs in California do the same. Over the past 35 years and continuing long after their original membership on the Club's Board of Directors, these two have answered every call to meet every challenge threatening or otherwise facing our Club and it's life-building programs including responding to financial challenges, resource development, Board development governance challenges and personnel challenges to mention only a few. When asked, they never said, \"No\", never said, \"Maybe\", and never said, \"Sorry, I'm too busy.\"  Foremost in their minds and hearts has always been the welfare of those beautiful children that we serve, for many of whom our programs are the only positive influences in their young lives. ROBERT ADDISON ROBERT ADDISON Bob was well known for his love of Ventura and his extensive civic involvement and philanthropy.  For over 30 years he was a leader within the Boys & Girls Club of Ventura, serving on the Board of Directors since the inception of the Club and heading up major fund-raising drives. Education was very important to Bob.   For many years he reviewed scholarship requests from Club and community youth, who applied for college funding from the Emma Nylen Trust, which the Club administered.  Bob went about serving others without the need for recognition and would often financially assist Boys & Girls Club staff with their educational pursuits.  He also served on the Ventura College District Board for 12 years, another example of the work that he did to support education in Ventura. Bob had a head for business and was a no nonsense kind of guy.  If a task was assigned to him, he just got it done!  He was a man of great character and always looked out for the well-being of the Club and the youth that it served.  He faithfully attended Board and other committee meetings and in the later years, when he could no longer drive, he hired a driver to make sure that he kept his commitments. His contribution to the community he loved is marked by many awards, but none pleased him more than the naming of the Olive Street Boys & Girls Club as the Robert Addison Center. JOHN BRANT JOHN BRANT Successful non-profits must do two things: provide great programs and raise the money to provide those programs. John is an example of what many of the inductees have done. John joined the Board in 1993 and served for 15 years including a term as president in 1998. In 1995 John led the effort to create a sustaining support campaign known as the Silver Handshake Club. John’s legacy is the juggling program that he started in 1998. It’s still running and he still volunteers weekly providing instruction in juggling, uni-cycling  and acting  as a mentor.  All of us have no doubt seen John and his students perform over the years. Some of the youth he has mentored have gone on to bigger and better things. One of those kids was Stewart Sinclair, who has since graduated from Loyola University with a degree in Journalism, had articles published, is now working for a company called Vital Strategies and has become quite the world traveler. That is what the Club is all about. John has raised funds for the Club on long distance bicycle rides, through sales of his photography, through rentals of his house in Pismo Beach and inspiring others to give major gifts to the club. We are pleased to induct John into the Founders’ Society. Congratulations and thanks John. RICHARD BUCHANAN RICHARD BUCHANAN RICHARD \"DICK\" BUCHANAN Dick became a Board Member in 1963. This was a time of real change for the Club. He, along with Mel Fowler and Dave Sherrill, started the building fund campaign that led to the construction of the Olive Street Club. They raised over $175,000 to accomplish this task, which was a considerable amount of money at that time! Dick became the third president of the Club in 1967. During construction, Dick spent most of his spare time pounding nails, digging ditches, and shooting a few hoops in the new gym. Speaking of hoops, Dick started the Kiwanis Boys basketball tournament that continues to this day. He was also chair or co-chair of the Boys & Girls Club golf tournament for 15 years. Dick was in the insurance business for 40 years. His office was just around the corner from us at 63 South California Street. He now resides in Boise Idaho. Congratulations, Dick Buchanan! JOE CARMODY JOE CARMODY In 1979, Gary Nasalroad wrestled the Club Presidency away from Bill Hicks. It’s a good thing that Joe Carmody was not President at that time because there are not many people that could ever wrestle anything away from Joe. Thirty years ago, Joe Carmody joined the Board of the Boys & Girls Club of Ventura. It didn’t take him long to become fully immersed in Club activities. In 1989 Joe started a wrestling program at the Club. It began with 4 or 5 kids after school a couple days a week. At its height there were 125 to 130 kids participating and there were practices 5 nights a week. Joe ran this program for 15 years and his impact on Ventura youth was immense. If you know Joe, you would say that he certainly does not lack enthusiasm and you can bet that our Club members learned a lot of valuable life lessons from Joe. How big of an impact has Joe made on the lives of Ventura youth? In March 2016 he headed to New York to once again watch the National Wrestling Championships. In 2015 one of his former students placed third in the 179 pound division. The following year Joe was there to root him on again – and that year he was ranked #1 in the nation as a senior at Penn State.  Without Joe, would that have ever happened? We are pleased to induct Joe Carmody into the Founders’ Society. Congratulations and thanks Joe. MELVYN FOWLER MELVYN FOWLER Mel Fowler joined the Ventura Boys Club board in 1963 and it didn’t take him long to take over as President. Mel served in that capacity for three years from 1964-1966. Those early years were busy ones for the Club. Mel worked with a small group of incredibly talented and dedicated men. The Club had been serving youth for only 15 months when Mel took over the reins from another of our inductees: Dave Sherrill. He was instrumental in arranging a lease with the Ventura School District to relocate the clubhouse from a 108 year old adobe house on West Main Street to the E.P. Foster playground. Under his leadership the Board set out on a $175,000 fundraising campaign and the successful campaign led to the start of construction in 1967. His contributions to the Club were wide ranging: from establishing a strong relationship with the United Fund to serving on the Tri-Counties Area Council and working with neighboring communities to start other Boys Clubs. Mel was awarded the Boys Club Medallion Award in 1970. We are pleased to induct Mel into the Founders’ Society. Congratulations and thanks Mel. E.J. & MYRA HARRISON E.J. & MYRA HARRISON Years ago, E.J. & Myra Harrison were two hardworking parents with children to raise, not unlike many of our club parents today. Their oldest son Ralph attended our club sometime in the late 1930’s or early 1940’s when it was known as the Police Boys Club and was housed in the Ortega Adobe! E.J. & Myra had great work ethics and, in addition to building their business and good reputation, they had a charitable heart and mindset to give back to their community. This ultimately led them back to the Boys & Girls Club of Ventura in the 1980’s. E.J. was friends with another supporter of the Club and told his family that he thought it would be a good organization in which they should be involved. This spearheaded regular contributions at events and a major gift to name the Games Room at the Bill LeFevre clubhouse. Unfortunately, E.J. passed away before the ceremony, but Myra and her family continued to support the club and it’s efforts to provide services to youth. The Harrison Family became multiple year Great Auction Sponsors and it is now common for our Auction attendee list to include at least 30 or more Harrison family members! E.J. & Myra’s son Myron served as a Board member in the past and their great grandson David is continuing the tradition by serving on the Board of an organization that once provided services to his grandfather Ralph. In addition to providing volunteer and monetary support to the Club, Harrison Industries has provided trash service to all of our locations free of charge. This has been a major savings for the Club. Most recently, in 2011 Ralph, Jim & Myron committed to a major gift to name the clubhouse in Saticoy – The E.J. Harrison Family Youth Center. It was an impactful gift and a great tribute to a legacy that began more than a quarter of a century ago. It gave us great pleasure to posthumously induct E.J. & Myra Harrison into the Founders’ Society.  Myron Harrison accepted the award for his parents. JIM HARRISON JIM HARRISON Jim and his two brothers are the joint owners of Harrison Industries; Jim is in charge of contract negotiations, acquisitions, and field operations including sales, safety and personnel. He serves as government and business liaison officer and regularly attends city council and chamber of commerce meetings and he meets regularly with government and business leaders. Born and raised in Ventura County, Jim graduated from Ventura High School and attended Ventura College. He has been with Harrison Industries since 1963 and has worked his way through the ranks, filling roles ranging from driver to office worker while learning every aspect of the company’s operations. Jim is a past officer of the Ventura County Rubbish Haulers Association and has attended many seminars and conferences throughout the United States and Canada on trash hauling and recycling issues. He is currently a board member of the Economic Development Collaborative of Ventura County (EDCVC). MYRON HARRISON MYRON HARRISON Myron is responsible for putting together loan packages for projects and he oversees billing, accounts payable and receivable, and the ordering of new equipment and materials. He also oversees company investments, purchases and insurance policies. Myron was born and raised in Ventura County and has been with Harrison Industries since 1963. He has worked as a swamper, driver, driver trainer, field supervisor, dispatch supervisor and virtually all phases of the trash industry. A member of the Ventura County Rubbish Haulers Association for almost 30 years, Myron has served as its president for two years. He has attended seminars of the association for the past 20 years and is a member of other professional trash/recycling organizations. He has served on the boards of the Boys & Girls Clubs of Greater Ventura and Camarillo and remains an honorary member of the Greater Ventura board and a life member of the Camarillo board. He also was recently named a “Don” by the Camarillo Historical Society. RALPH HARRISON RALPH HARRISON Ralph and his two brothers, Jim and Myron, are the joint owners of Harrison Industries; Ralph is in charge fleet operations, the maintenance and service departments and inventory controls and he heads up an extensive research and development department. Born and raised in Ventura County, Ralph began to work for the family business in 1963. Most of Harrison Industries’ innovations are due to Ralph’s ingenuity and he holds many patents. Ralph is president of the Ventura County Rubbish Haulers Association and is a board member of the Ventura County Fair Foundation. He also is a member of the California Refuse Removal Council, the Solid Waste Management Association, the Greater Los Angeles Solid Waste Management Association, the Franchise Advisory Board and the California Association of Employers. TOM HINKLE TOM HINKLE Tom Hinkle joined the Board in 1991.  He was introduced to the organization through another Board member and then neighbor, Jim Word.   Jim asked the poignant question “what are you doing for the community Tom?”  That was followed by an introduction to the Boys & Girls Club of Ventura.  Tom said that once he knew what the Club did, he was hooked for life!! Tom’s dad passed away when he was only an infant, his mother was a school teacher and his step father had a brain disorder.  Tom understands that dynamics in family life are not always perfect, which is probably why he has such a big heart for the youth that we serve and the challenges that they face.  He loves children and knows that our kids need resources and guidance.  He appreciates the varied level of support that the Club provides to our youth and considers it a fantastic resource for those who need it most!  Tom’s mother told him, “If you take on a task, finish it!”  This is something that has been a core value for him and is evident in all that he had done for the Club and the community. Tom served in the Army for 6 years, including a year in Vietnam and one at the Pentagon.  After the Army he attended law school, served for several years as a Deputy District Attorney for Ventura County and then spent 25 years as a trial lawyer doing civil litigation\" His legal career was varied, but most of it was centered on trial law.  As a Board member, Tom has held the role of President of the Governing Board –twice; and he also served as the Club’s Foundation President.  His life experiences and his big heart for the welfare of kids, has made him an invaluable asset to the Club.  Tom has offered advice when needed, organized and put policies into place when asked and has contributed of his time, talent and treasure – freely and abundantly.  Tom has and continues to pay it forward for the benefit of other youth who need a friendly advocate. JYMMYE HITCH JYMMYE HITCH Jymmye was an enthusiastic member of the Ladies Auxiliary, a group that was instrumental to the success of most of the Boys Club events. She was a key volunteer to the Great Auction. In the beginning, the Great Auction was mostly geared around Art. In 1969 it expanded to a variety of items and resembled the format that most of us know today. Jymmye was always front and center at the Auction, making sure that both the buyer and the donor of auction items were acknowledged and thanked for their support of our kids. She was affectionately given the name of “First Lady of the Great Auction” and always requested paddle #1, in fact, she was given a license plate for her car with that title and she proudly displayed it until she passed away. Paddle #1 was forever retired in her honor. Jymmye was an active Board member for her entire life and always had tickets to sell to benefit a variety of worthy charities, including her church and the Boys & Girls Club.  She was a great asset to the club, is greatly missed and just a beautiful person inside and out. Her son Gary accepted the the Founders' Society recognition on behalf of his mother. SUSANNE LAMMOT, M.D. SUSANNE LAMMOT, M.D. Susanne joined the Board in 1994 and has been an active member of the Board and supporter ever since. It was under her tenure as President that the Club was presented the Poinsettia Award by the Ventura Chamber of Commerce as the City’s Best Non-Profit. For three year’s Susanne ran the Community Speaker’s Program inviting members of the community to come and share their experiences and ideas with Club members. This program drew rave review from both the kids and the speakers. Susanne is an incredible networker always striving to create connections for the Club as she passes out her Board Member business cards. One such connection she made was with AWS who maintains our van fleet. She has also acquired countless donations over the years for the Great Auction. Susanne has always been a fixture at the Great Auction. She is often the first to raise her paddle when people are called to Stand Up For Kids, encouraging others to follow suit. Like John and Cherie Brant she is also happy to donate a stay at her condo in Mammoth or beach house in Oxnard to the auction to help raise money. We are pleased to induct Susanne into the Founders Society. Congratulations and thanks Susanne. DAN MANDELL DAN MANDELL Dan joined the Boys’ Club of Ventura Board in 1968. One of his favorite projects was arranging a collaboration between the Ventura Yacht Club and the Boys’ Club. He was one of the Saturday instructors, taking groups of youngsters for training cruises inside the marina on his 24-foot Columbia Challenger. Dan purchased three Sabot (sailing dinghy) kits and built them with Club members. Those were the boats that were used in the Club for sailing lessons. Dan came to the club regularly to supervise the construction of the kits, and then taught sailing for many years. When Dan and his wife Johanna moved from Ventura to Ashland, Oregon, to join their own kids in 1991, they donated their sailboat, a Newport 27, to the Boys’ and Girls’ Club. Dan and Johanna were great supporters of the Club Auction, and their home was embellished with many beautiful pieces of local art that they had purchased over the years at the event.  In the latter years, Dan provided all of the ice for Boys & Girls Club events, from his store – Mandell Liquors. A profile in the March 17, 1991 issue of the Star-Free Press described Dan as “a man who lives and breathes by helping others.” He was described by Bob Addison, a past president of the Club, as “a very caring person, caring for the community and for people as individuals.” Liz Heaton-Brown, another Club past president, described Dan as the “kind of guy you can count on.” Dan was honored by the Boys & Girls Club at a “Tribute to Excellence” dinner in 1991. Dan and Johanna, along with Stewart Angus and Bruce Johnston, gave one of the founding gifts for the Ventura Boys’ Club Foundation. That endowment fund has grown over the years and now provides an annual dividend of approximately $90,000 a year to support Club programs and services. Dan left a gift to the Foundation through his estate when he died in August of 2001, and his family also made a substantial contribution at the time of his death to celebrate Dan’s long-time dedication to the kids and to the Club. GARY NASALROAD GARY NASALROAD In 1979 , Gary wrestled the Presidency of the Boys Club of Ventura away from Bill Hicks and began serving the first of three years as President. In 1981 when the Ventura Boys Club merged with the Ventura Girls Club to become the first joint club in California, Gary served as the first President of the Ventura Boys & Girls Club. Today, Gary serves on the Board of the Boys & Girls Club of Santa Clara Valley marking 40 consecutive years serving first in Ventura, and now for Santa Clara Valley. Along the way, he co-chaired the Great Auction for 10 years with another inductee, Jymmye Hitch, and then chaired or co-chaired the Golf Tournament for over 10 years. Gary is no stranger to awards honoring key volunteers for Boys & Girls Club. The Medallion Award is just one of many he has garnered and in 2009 was presented the prestigious President’s Award. We are pleased to induct Gary into the Founders' Society which makes this, of all of Gary’s awards, the most recent. Congratulations and thanks Gary. LARRY RASMUSSEN LARRY RASMUSSEN Larry joined the Board in the late 70’s, just as the Boys Club and Girls Club were about to merge. He held the office of President from 1985-1987. When asked to donate or assist the Club in any way, Larry has always been there for us. He is a highly respected architect and as such, was instrumental in the planning and construction of the Club on Johnson Drive. His efforts to secure the property from the City and the Ventura Little League made this venture possible. It should be noted that the Club had 1,200 members enrolled after being open for only 3 months. The need was great and remains great to this day. Larry also secured a $150,000 donation that helped to make building the Club a reality. He has donated many items to the Boys & Girls Club of Ventura Thrift & Vintage Store and has even donated a weekend stay at a wine vineyard he owns. We are pleased to induct Larry into the Founders’ Society. DAVID SHERRILL, M.D. DAVID SHERRILL, M.D. Dr. Dave Sherrill was the first president of the Boys Club and held that position in 1962 and 1963. He was president when the Ventura Boys Club received its charter from Boys Clubs of America. Dave was a great motivator who attracted top talent to the board, some of whom have been inducted into the Founders' Society. Dr. Sherrill was known to be fun, wear a bow tie and smile. When boys who were going to camp or participating in sports programs needed physical examinations, Dr. Sherrill would generously donate his expertise. At the1969 Annual Dinner, Dr. Sherrill was presented the Boys Clubs of America Medallion Award. The award was presented with a drum roll from the Club’s Drum Corp, and brought Dave to tears. It is our honor to posthumously induct Dr. David Sherrill into the Founders' Society. Dr. Sherrill’s wife, Regina accepted his award on his behalf. Aera Energy Assured Partners So Cal Gas Amgen Foundation Geene Haas Foundation Kaiser Permanente Wedgewood Weddings Administrative Office 1280 S. Victoria Avenue Suite 240 Ventura, CA 93003 (805) 641-5585 Fax (805) 639-0180 info@bgclubventura.org Facebook Instagram Twitter © 2025 Boys & Girls Club of Greater Ventura Privacy Policy Privacy Policy What Information Do We Collect? When you visit our website you may provide us with two types of information: personal information you knowingly choose to disclose that is collected on an individual basis and website use information collected on an aggregate basis as you and others browse our website. Personal Information You Choose to Provide We may request that you voluntarily supply us with personal information, including your email address, postal address, home or work telephone number and other personal information for such purposes as correspondence, placing an order, requesting an estimate, or participating in online surveys.\nIf you choose to correspond with us through email, we may retain the content of your email messages together with your email address and our responses. We provide the same protections for these electronic communications that we employ in the maintenance of information received by mail and telephone. Website Use Information Similar to other websites, our site may utilize a standard technology called \"cookies\" (see explanation below, \"What Are Cookies?\") and web server logs to collect information about how our website is used. Information gathered through cookies and server logs may include the date and time of visits, the pages viewed, time spent at our website, and the sites visited just before and just after ours. This information is collected on an aggregate basis. None of this information is associated with you as an individual. How Do We Use the Information That You Provide to Us? Broadly speaking, we use personal information for purposes of administering our business activities, providing service and support and making available other products and services to our customers and prospective customers. Occasionally, we may also use the information we collect to notify you about important changes to our website, new services and special offers we think you will find valuable. The lists used to send you product and service offers are developed and managed under our traditional standards designed to safeguard the security and privacy of all personal information provided by our users. You may at any time to notify us of your desire not to receive these offers. What Are Cookies? Cookies are a feature of web browser software that allows web servers to recognize the computer used to access a website. Cookies are small pieces of data that are stored by a user's web browser on the user's hard drive. Cookies can remember what information a user accesses on one web page to simplify subsequent interactions with that website by the same user or to use the information to streamline the user's transactions on related web pages. This makes it easier for a user to move from web page to web page and to complete commercial transactions over the Internet. Cookies should make your online experience easier and more personalized. How Do We Use Information Collected From Cookies? We use website browser software tools such as cookies and web server logs to gather information about our website users' browsing activities, in order to constantly improve our website and better serve our users. This information assists us to design and arrange our web pages in the most user-friendly manner and to continually improve our website to better meet the needs of our users and prospective users.\nCookies help us collect important business and technical statistics. The information in the cookies lets us trace the paths followed by users to our website as they move from one page to another. Web server logs allow us to count how many people visit our website and evaluate our website's visitor capacity. We do not use these technologies to capture your individual email address or any personally identifying information about you. Notice of New Services and Changes Occasionally, we may use the information we collect to notify you about important changes to our website, new services and special offers we think you will find valuable. As a user of our website, you will be given the opportunity to notify us of your desire not to receive these offers by clicking on a response box when you receive such an offer or by sending us an email request. How Do We Secure Information Transmissions? When you send confidential personal information to us on our website, a secure server software which we have licensed encrypts all information you input before it is sent to us. The information is scrambled en route and decoded once it reaches our website.\nOther email that you may send to us may not be secure unless we advise you that security measures will be in place prior to your transmitting the information. For that reason, we ask that you do not send confidential information such as Social Security, credit card, or account numbers to us through an unsecured email. How Do We Protect Your Information? Information Security -- We utilize encryption/security software to safeguard the confidentiality of personal information we collect from unauthorized access or disclosure and accidental loss, alteration or destruction.\nEvaluation of Information Protection Practices -- Periodically, our operations and business practices are reviewed for compliance with organization policies and procedures governing the security, confidentiality and quality of our information.\nEmployee Access, Training and Expectations -- Our organization values, ethical standards, policies and practices are committed to the protection of user information. In general, our business practices limit employee access to confidential information, and limit the use and disclosure of such information to authorized persons, processes and transactions. How Can You Access and Correct Your Information? You may request access to all your personally identifiable information that we collect online and maintain in our database by emailing us using the contact form provided to you within the site structure of our website. Do We Disclose Information to Outside Parties? We may provide aggregate information about our customers, sales, website traffic patterns and related website information to our affiliates or reputable third parties, but this information will not include personally identifying data, except as otherwise provided in this privacy policy. What About Legally Compelled Disclosure of Information? We may disclose information when legally compelled to do so, in other words, when we, in good faith, believe that the law requires it or for the protection of our legal rights. Permission to Use of Materials The right to download and store or output the materials in our website is granted for the user's personal use only, and materials may not be reproduced in any edited form. Any other reproduction, transmission, performance, display or editing of these materials by any means mechanical or electronic without our express written permission is strictly prohibited. Users wishing to obtain permission to reprint or reproduce any materials appearing on this site may contact us directly. Terms & Conditions Terms & Conditions Donation Refund Policy We are grateful for your donation and support of our organization. If you have made an error in making your donation or change your mind about contributing to our organization please contact us.  Refunds are returned using the original method of payment. If you made your donation by credit card, your refund will be credited to that same credit card. Automated Recurring Donation Cancellation Ongoing support is important to enabling projects to continue their work, so we encourage donors to continue to contribute to projects over time. But if you must cancel your recurring donation, please notify us. Powered by Firespring"
    },
    {
      "url": "https://www.venturaccorlando.com/event-calendar/",
      "text": "Event Calendar - Ventura Country Club Skip to main content Skip to footer Ventura Country Club Orlando, FL Home Tee Times Tee Times Email Club Course Course Information Resident Rates Public Golf Rates Scorecard Golf Shop Join Email Club Instruction 2022 Course Renovation Events Local Weather Contact Us Contact Us Directions Advertisement Event Calendar Event Calendar Footer Weather ORLANDO WEATHER Visit Us Ventura Country Club 3333 Woodgate Blvd. Orlando, FL 32822 Follow Us Facebook Instagram Contact Us Phone: 407-277-2640 Email: proshop@venturacountryclub.org 7Bit casino Canada Ventura Country Club | 3333 Woodgate Blvd. Orlando, FL 32822 | 407-277-2640 Copyright © 2025 Ventura Country Club All Rights Reserved. Powered by Write a review today!"
    },
    {
      "url": "https://www.venturaccorlando.com/contact-us/directions/",
      "text": "Directions - Ventura Country Club Skip to main content Skip to footer Ventura Country Club Orlando, FL Home Tee Times Tee Times Email Club Course Course Information Resident Rates Public Golf Rates Scorecard Golf Shop Join Email Club Instruction 2022 Course Renovation Events Local Weather Contact Us Contact Us Directions Advertisement Directions View Larger Map Footer Weather ORLANDO WEATHER Visit Us Ventura Country Club 3333 Woodgate Blvd. Orlando, FL 32822 Follow Us Facebook Instagram Contact Us Phone: 407-277-2640 Email: proshop@venturacountryclub.org 7Bit casino Canada Ventura Country Club | 3333 Woodgate Blvd. Orlando, FL 32822 | 407-277-2640 Copyright © 2025 Ventura Country Club All Rights Reserved. Powered by Write a review today!"
    }
  ]
}