{
  "fuentes": [
    {
      "url": "https://www.naplesgolfguy.com/verandah/",
      "email": "matt@naplesgolfguy.com"
    },
    {
      "url": "https://www.naplesgolfguy.com/verandah/",
      "email": "info@naplesgolfguy.com"
    },
    {
      "url": "https://www.kuilsriviergolfclub.co.za/contact-us/",
      "email": "info@krgc.co.za"
    },
    {
      "url": "https://clubcaddie.com/contact/",
      "email": "info@clubcaddie.com"
    },
    {
      "url": "https://www.vcalife.com/",
      "email": "james.tanigawa@realmanage.com"
    },
    {
      "url": "https://www.vcalife.com/",
      "email": "jamesb@vcalife.com"
    },
    {
      "url": "https://www.vcalife.com/",
      "email": "jamest@vcalife.com"
    },
    {
      "url": "https://www.vcalife.com/",
      "email": "office@vcalife.com"
    },
    {
      "url": "https://www.vcalife.com/",
      "email": "stephanie.burtwell@realmanage.com"
    },
    {
      "url": "https://www.vcalife.com/",
      "email": "office@vcalife.com"
    },
    {
      "url": "https://www.sevenoaksgolf.com/contact-us",
      "email": "dpylinski@sevenoaksgolf.com"
    },
    {
      "url": "https://www.thegolfcourseexperts.com/the-verandah",
      "email": "jim@thegolfcourseexperts.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/verandah-golf-club/",
      "email": "matt@naplesgolfguy.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/verandah-golf-club/",
      "email": "info@naplesgolfguy.com"
    }
  ],
  "mails": [
    "dpylinski@sevenoaksgolf.com",
    "info@clubcaddie.com",
    "info@krgc.co.za",
    "info@naplesgolfguy.com",
    "james.tanigawa@realmanage.com",
    "jamesb@vcalife.com",
    "jamest@vcalife.com",
    "jim@thegolfcourseexperts.com",
    "matt@naplesgolfguy.com",
    "office@vcalife.com",
    "stephanie.burtwell@realmanage.com"
  ],
  "nombre_sitio": "verandahgolfclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.naplesgolfguy.com/verandah/",
      "text": "Verandah Golf Club - Naples Golf Homes | Naples Golf Guy Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog 239.370.0892 info@naplesgolfguy.com Back to Fort Myers Golf Communities Verandah Golf Club Verandah Golf Club is an exclusive private golf club located in Fort Myers Florida. At Verandah, there are two luxury golf courses offering the ultimate player’s experience. The original golf course, Old Orange, was designed by Robert Cupp. The second course, Whispering Oak, was designed by Jack Nicklaus and Jack Nicklaus II. Verandah combines a laid back lifestyle with exceptional amenities. In addition to two of the best 18-hole championship golf courses, first-class practice facilities, the club offers members a full-service clubhouse with both casual and fine dining, fitness center, resort-style heated pool, five lighted har-tru tennis courts and 9 miles of walking trails. An especially unique amenity is the 2,500-square-foot River House restaurant overlooking the Orange River. The members-only restaurant includes a full-service bar and plenty of seating to sit back, relax, and enjoy lunch or dinner. Additionally, it’s one of the few golf communities with a private dog park. So if you are looking for a pet-friendly golf community, you just can’t beat Verandah. The Naples Golf Guy Team specializes in helping buyers and sellers with their real estate needs in Southwest Florida Golf Communities, contact us today for more information. Location: Fort Myers Florida Club Type: Private Country Club Membership Type: Up Front Initiation Fee Real Estate Home Price Ranges in Verandah Single Family: $470,000 – $4,950,000 View Homes for Sale Condos: $254,000 – $735,000 View Condos for Sale The Naples Golf Guy Team has more than 20 years of experience helping Buyers and Sellers with their real estate needs in Southwest Florida. Call, text, or email us today for more information. Stay informed with automatic property alerts… Learn what your home is worth… Sign up for our monthly market report Membership Information Maximum Number of Memberships 750 Golf Memberships Is Membership Required? Yes Non-Resident Memberships Available? Yes Membership Fees Golf Membership Initiation Fee: $80,000 Annual Golf Dues: $11,832 Social Membership Initiation Fee: $19,500 Annual Social Membership Dues: $2,030 Please be aware, other membership options may be available. Additional fees such as capital assessments, a food and beverage minimum, trail fee or taxes may apply. Please feel free to contact us for additional information. Golf Course Information Number of Courses 2 (36 Holes) Caddies Available No Practice Range Yes Own your own cart Yes Course Ratings / Scorecards Old Orange Opened 2003 Architect Robert Cupp Par: 72 Holes: 18 Yards Rating Slope Number 1 7083 75.0 138 Number 2 6541 72.6 132 Number 3 6166 70.9 129 Number 4 5606 68.3 120 Ladies Tees: Number 4 5606 73.2 133 Number 5 5160 71.1 123 Number 6 4903 69.9 119 Whispering Oak Opened 2007 Architect Jack Nicklaus and Jack Nicklaus II Par: 72 Holes: 18 Yards Rating Slope Number 1 7108 74.1 140 Number 2 6573 71.6 135 Number 3 6416 70.9 134 Number 4 5658 67.6 121 Ladies Tees: Number 4 5658 72.6 128 Number 5 5190 70.1 123 Number 6 4946 69.0 121 Amenities Gated Golf Community Two Golf Courses Driving Range Clubhouse Resort-Style Pool Fitness Center & Spa Tennis Courts Pickleball Where is The Verandah Club Located The Verandah Club 12201 River Village Way Fort Myers, FL 33905 239.694.7229 Visit Club Website Back to Fort Myers Golf Communities Note: We make every effort to make sure our information for this golf club is current and accurate. Information about the tees and membership change over time. Please feel free to email us at info@naplesgolfguy.com if you see any information that needs to be corrected. Stay in the know by subscribing to our newsletter Enter your email address 239.370.0892 info@naplesgolfguy.com ©2025 Naples Golf Guy Privacy Policy Accessiblity made by exploritech We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://www.kuilsriviergolfclub.co.za/contact-us/",
      "text": "Contact Us - Kuilsrivier Golf Club Skip to content Home Our Story Conferences / Events Facilities Catering Golf Greenfees Book your Tee Time Course Layout Professional Golf Lessons Junior Development Gallery Neon Photo Booth Ladies Cabernet Classic 24 Winelands classic 2021 Photobooth album classic 21 Members Zone Membership Fees Membership Benefits Greenfees Constitution Application Form Club News Letter Contact Us Home Our Story Conferences / Events Facilities Catering Golf Greenfees Book your Tee Time Course Layout Professional Golf Lessons Junior Development Gallery Neon Photo Booth Ladies Cabernet Classic 24 Winelands classic 2021 Photobooth album classic 21 Members Zone Membership Fees Membership Benefits Greenfees Constitution Application Form Club News Letter Contact Us Contact Us Contact us Get in touch and we’ll get back to you as soon as we can. We look forward to hearing from you! Have any questions? info@krgc.co.za Call us (021) 903 0222 Address Bottelary Road, Kuilsriver 7579 Interested in joining? Complete the form below Get in touch and we'll get back to you as soon as we can. We look forward to hearing from you! Name Phone Number Email Message Send Interested in hosting an Event? Complete the form below Get in touch and we'll get back to you as soon as we can. We look forward to hearing from you! Name Phone Number Email Please select Please Select Venue hire Golf day Catering can be arranged from our side… Please advise the type of meal you would like and we can quote specific. E.g. Spit Braai…. Etc. MEAL OPTIONS: Meal options 1.           Beef Lasagne, Greek Salad and cocktail roll 2.           Chicken Leg Quarter, Greek Salad and Garlic Potatoes 3.           Chicken Schnitzel served with cheese sauce and a Greek salad 4.            Other Message Send CONTACT US Email Address: info@krgc.co.za Phone: (021) 903 0222 Address: Bottelary Road Kuilsriver Cape Town Navigation Home Conferences / Events Golf Members Zone Contact Us Social media Facebook © 2019 Kuilsriver Golf Club. All Rights Reserved. This website uses cookies to ensure legal compliance on our website. Accept & Close"
    },
    {
      "url": "https://clubcaddie.com/contact/",
      "text": "Contact Club Caddie: Get In Touch for Support & Demos Skip to content About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition CHAT WITH US REQUEST A DEMO About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition CHAT REQUEST A DEMO contact We are available by chat, 24 hours a day, 7 days a week. Just click on the chat message icon in the lower corner of your screen or at the top of the menu and we can answer any question, get you login credentials, provide support, or even give you a full demo of our software. Full Name Email Phone Course or Organization Name Which Best Describes Your Role? -Select- Owner General Manager Director of Golf Head Golf Professional Other Golf Staff Food and Beverage Director Message SUBMIT testimonials What Our Clients Say see more testimonials Start Growing Revenue with Club Caddie Golf Course Solutions Today With tools to streamline every aspect of your golf facility’s operation and a 24/7 support team excited to help you out, improving your course, club or golf business management software has never been easier. Golf operations software is our forte. GET STARTED today Don’t have time right now? Send us a message and we’ll get back to you right away. send us a message Award Winning, All-In-One, Golf Facility Management Software. Menu About Features Contact Privacy Policy Terms & Conditions About Features Contact Privacy Policy Terms & Conditions Resources Services Mission Testimonials About Contact Services Mission Testimonials About Contact Support Knowledge Base Submit Tickets Chat With Us Club Caddie Holdings, Inc. info@clubcaddie.com 18720 Mack Ave, Suite 210, Grosse Pointe, MI 48236 Copyright © 2025 by Club Caddie Holdings, Inc, Powered by Club Caddie Privacy Policy Terms and Conditions Facebook Footer [main Template] Linkedin Scroll to Top We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. I agree"
    },
    {
      "url": "https://www.vcalife.com/",
      "text": "Verandah Homeowners Association All the News Calendar Announcements Communication Archive FAQs Things to Do About Verandah Fun Things to Do Volunteering Opportunities Grandma’s Closet Clubs, Cards and Games Photo Gallery Resident Input account_circle Login / Register menu Menu Contacts Resident Information Payment Information What Is the VCA? Resident Information Packet Leasing Gatehouse Bench Sponsorship Program Everyday Living Questions Community Development Districts (CDD) Hurricane Preparedness Nuisance Wildlife Design Review Helpful Documents Realtor Information Go to Club All the News Calendar Announcements Communication Archive FAQs Things to Do About Verandah Fun Things to Do Volunteering Opportunities Grandma’s Closet Clubs, Cards and Games Photo Gallery Resident Input gavel Governing Docs Let's go → Search Search Neighborhood Rep Meeting Sept 16 at 3:00 Board of Directors Meeting Sept 23 at 2:00 VCA Annual Meeting Oct 15 at 2:00 DRC Meetings Sep 17, Oct 1 at 2:00 PM Comcast/Xfinity Installation to House Residents of all VCA neighborhoods are now able to schedule in-home service installation appointments with Xfinity. Please call 1.833.501.1928 to schedule a free appointment with a technician to update your equipment at no additional cost. Our residents who are not presently in Verandah, will be able to reach out to Xfinity upon their return to coordinate in-home installation. Click to Read: Nuisance Wildlife Information View Envera FAQ receipt Financials View now → support 24/7 Support Click for Information → list_alt Forms View now → payment Make a Payment Pay now → event Events View calendar → About Our Community Verandah, located on 1,456 acres along a 1.75-mile stretch of the Orange River, is a master-planned gated community that opened in 2003 and was originally developed by The Bonita Bay Group.  In planning Verandah, care was taken to expand the wetland, uplands and conservation areas, impact as few trees as possible, and develop an easement along the Orange River to ensure the future integrity of our ecosystem. Nearly 65% of our community is reserved for open space, including lakes, preserves, parks, nine miles of walking trails, golf, and a buffer along the river. In addition to being lush with native plants and trees, Verandah is home to a diverse species of Florida wildlife including the gentle manatees, who in season swim alongside your kayak on the Orange River.  The Verandah Homeowners Association is governed by a homeowner elected Board of Directors.  Verandah is also home to the Verandah Club consisting of two golf courses, club house, tennis courts, and other amenities. Contact Us Verandah Community Association 11390 Palm Beach Blvd, First Floor Fort Myers, FL 33905 (239) 694-6358 Office@vcalife.com RealManage Customer Support 458 N. Tamiami Trail, Osprey, FL 34229 (866) 473-2573 Community Manager James Tanigawa JamesT@VCALife.com Director of CAM Operations, South/SW Florida Region James Tanigawa James.Tanigawa@RealManage.com Senior Vice President Of Operations Stephanie Burtwell Stephanie.Burtwell@RealManage.com © 2025 Verandah • All Rights Reserved"
    },
    {
      "url": "https://www.sevenoaksgolf.com/contact-us",
      "text": "Contact Us, Directions | Seven Oaks Golf Club at Colgate University COLGATE UNIVERSITY | 315-824-1432 | CONTACT US Skip to main content Golf Download Our App Book A Tee Time Golf Rates Our History The Course Practice Facility Rules & Regulations Download Our App Book A Tee Time Golf Rates Our History The Course Practice Facility Rules & Regulations Join Students Events Outings Lessons Golf Instruction & Clinics Coaches Corner Golf Instruction & Clinics Coaches Corner Store Gift Cards Merchandise Gift Cards Merchandise Search Close Search Keyword Search Search Keyword Search 52° Wed 09/10 clear sky 72°/47° Thu 09/11 clear sky 71°/50° Fri 09/12 clear sky 72°/51° Book A Tee Time Contact Us Get in touch or find driving directions to Seven Oaks Golf Club at Colgate University. X CONTACT INFORMATION ADDRESS 2 E Lake Rd (East Lake & Payne Streets) Hamilton, NY 13346 PHONE Golf: 315.824.1432 Restaurant: 315.824.4420 FEEDBACK Comments & suggestions welcome Call 1.888.986.0699 to share comments HOURS OF OPERATION Currently Closed GET IN TOUCH OR FIND US Please submit your inquiry and a member from our team will in touch or utilize the map below for directions. We hope to see you soon! CONTACT US FORM First Name Last Name Email Phone Subject Message Submit MEET THE TEAM DALLAS C. PYLINSKI, PGA Director of Golf Email Dallas TYLER COWEN Assistant Golf Professional GOLF IS CALLING YOUR NAME Designed by the Legendary Robert Trent Jones Sr. Seven Oaks is a must play. PLUS avoid booking fees when you book direct! Book A Round MANAGED BY QUICK LINKS The Course Online Store Careers at Seven Oaks Colgate University Colgate Athletics Colgate Inn CONTACT US Golf: 315.824.1432 Restaurant: 315.824.4420 Submit an Inquiry facebook instagram twitter ADDRESS 2 E Lake Road Hamilton, NY 13346 Get Driving Directions PLAY GOLF CALL 315.824.1432 OR Book A Tee Time JOIN OUR EMAIL LIST SUBSCRIBE TO GET THE LATEST NEWS AND OFFERS I consent to receive emails from Seven Oaks Golf Club. I can unsubscribe anytime. Email Thank you for subscribing. Enter Another Email Subscribe Copyright © 2025. Seven Oaks Golf Club at Colgate University. All Rights Reserved. Privacy Policy Terms of Use Accessibility Sitemap"
    },
    {
      "url": "https://www.thegolfcourseexperts.com/the-verandah",
      "text": "The Verandah | Real Estate & Homes For Sale Loading The Golf Course Experts Southwest Florida Real Estate Real Estate Websites by iHouseweb | Admin Menu"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/verandah-golf-club/",
      "text": "Verandah Golf Club - Naples Golf Homes | Naples Golf Guy Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog 239.370.0892 info@naplesgolfguy.com Back to Fort Myers Golf Communities Verandah Golf Club Verandah Golf Club is an exclusive private golf club located in Fort Myers Florida. At Verandah, there are two luxury golf courses offering the ultimate player’s experience. The original golf course, Old Orange, was designed by Robert Cupp. The second course, Whispering Oak, was designed by Jack Nicklaus and Jack Nicklaus II. Verandah combines a laid back lifestyle with exceptional amenities. In addition to two of the best 18-hole championship golf courses, first-class practice facilities, the club offers members a full-service clubhouse with both casual and fine dining, fitness center, resort-style heated pool, five lighted har-tru tennis courts and 9 miles of walking trails. An especially unique amenity is the 2,500-square-foot River House restaurant overlooking the Orange River. The members-only restaurant includes a full-service bar and plenty of seating to sit back, relax, and enjoy lunch or dinner. Additionally, it’s one of the few golf communities with a private dog park. So if you are looking for a pet-friendly golf community, you just can’t beat Verandah. The Naples Golf Guy Team specializes in helping buyers and sellers with their real estate needs in Southwest Florida Golf Communities, contact us today for more information. Location: Fort Myers Florida Club Type: Private Country Club Membership Type: Up Front Initiation Fee Real Estate Home Price Ranges in Verandah Single Family: $470,000 – $4,950,000 View Homes for Sale Condos: $254,000 – $735,000 View Condos for Sale The Naples Golf Guy Team has more than 20 years of experience helping Buyers and Sellers with their real estate needs in Southwest Florida. Call, text, or email us today for more information. Stay informed with automatic property alerts… Learn what your home is worth… Sign up for our monthly market report Membership Information Maximum Number of Memberships 750 Golf Memberships Is Membership Required? Yes Non-Resident Memberships Available? Yes Membership Fees Golf Membership Initiation Fee: $80,000 Annual Golf Dues: $11,832 Social Membership Initiation Fee: $19,500 Annual Social Membership Dues: $2,030 Please be aware, other membership options may be available. Additional fees such as capital assessments, a food and beverage minimum, trail fee or taxes may apply. Please feel free to contact us for additional information. Golf Course Information Number of Courses 2 (36 Holes) Caddies Available No Practice Range Yes Own your own cart Yes Course Ratings / Scorecards Old Orange Opened 2003 Architect Robert Cupp Par: 72 Holes: 18 Yards Rating Slope Number 1 7083 75.0 138 Number 2 6541 72.6 132 Number 3 6166 70.9 129 Number 4 5606 68.3 120 Ladies Tees: Number 4 5606 73.2 133 Number 5 5160 71.1 123 Number 6 4903 69.9 119 Whispering Oak Opened 2007 Architect Jack Nicklaus and Jack Nicklaus II Par: 72 Holes: 18 Yards Rating Slope Number 1 7108 74.1 140 Number 2 6573 71.6 135 Number 3 6416 70.9 134 Number 4 5658 67.6 121 Ladies Tees: Number 4 5658 72.6 128 Number 5 5190 70.1 123 Number 6 4946 69.0 121 Amenities Gated Golf Community Two Golf Courses Driving Range Clubhouse Resort-Style Pool Fitness Center & Spa Tennis Courts Pickleball Where is The Verandah Club Located The Verandah Club 12201 River Village Way Fort Myers, FL 33905 239.694.7229 Visit Club Website Back to Fort Myers Golf Communities Note: We make every effort to make sure our information for this golf club is current and accurate. Information about the tees and membership change over time. Please feel free to email us at info@naplesgolfguy.com if you see any information that needs to be corrected. Stay in the know by subscribing to our newsletter Enter your email address 239.370.0892 info@naplesgolfguy.com ©2025 Naples Golf Guy Privacy Policy Accessiblity made by exploritech We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    }
  ]
}