{
  "fuentes": [
    {
      "url": "https://www.verobluesfest.com/vendors",
      "email": "info@latitude88.com"
    },
    {
      "url": "https://www.verobluesfest.com/about",
      "email": "info@latitude88.com"
    },
    {
      "url": "https://www.verobluesfest.com/artist-submission",
      "email": "info@latitude88.com"
    },
    {
      "url": "https://www.verobluesfest.com/tickets",
      "email": "info@latitude88.com"
    },
    {
      "url": "https://www.verobluesfest.com/",
      "email": "info@latitude88.com"
    },
    {
      "url": "https://verobeach.com/calendar/annual-vero-beach-blues-festival-2025?idsevent=14966&lstmonth=2025-2&idscategory=4&prmday=16&flagtext=0",
      "email": "info@latitude88.com"
    },
    {
      "url": "https://www.hometownnewstc.com/arts_and_entertainment/vero-beach-blues-festival-feb-12-13/article_3e2a035c-843e-11ec-a074-bf9e0dfed2f1.html",
      "email": "classifieds@hometownnewsmediagroup.com"
    },
    {
      "url": "https://www.hometownnewstc.com/arts_and_entertainment/vero-beach-blues-festival-feb-12-13/article_3e2a035c-843e-11ec-a074-bf9e0dfed2f1.html",
      "email": "info@hometownnewsmediagroup.com"
    },
    {
      "url": "https://www.hometownnewstc.com/arts_and_entertainment/vero-beach-blues-festival-feb-12-13/article_3e2a035c-843e-11ec-a074-bf9e0dfed2f1.html",
      "email": "info@latitude88.com"
    },
    {
      "url": "https://www.verobluesfest.com/vendor-refunds",
      "email": "info@latitude88.com"
    },
    {
      "url": "https://www.verobluesfest.com/performance-schedule",
      "email": "info@latitude88.com"
    },
    {
      "url": "https://verobeach.macaronikid.com/events/673df009dcc35f0c560d4984/vero-beach-blues-festival",
      "email": "alisone@macaronikid.com"
    },
    {
      "url": "https://www.verobluesfest.com/foodvendors",
      "email": "info@latitude88.com"
    },
    {
      "url": "https://www.verobluesfest.com/hours-info",
      "email": "info@latitude88.com"
    },
    {
      "url": "https://bluesfestivalguide.com/",
      "email": "info@bluesfestivalguide.com"
    },
    {
      "url": "https://bluesfestivalguide.com/vero-beach-blues-festival-feb-25-26-2023-vero-beach-fl/",
      "email": "info@bluesfestivalguide.com"
    },
    {
      "url": "https://bluesfestivalguide.com/vero-beach-blues-festival-feb-25-26-2023-vero-beach-fl/",
      "email": "info@latitude88.com"
    },
    {
      "url": "https://www.verobluesfest.com/policies-including-bags",
      "email": "info@latitude88.com"
    }
  ],
  "mails": [
    "alisone@macaronikid.com",
    "classifieds@hometownnewsmediagroup.com",
    "info@bluesfestivalguide.com",
    "info@hometownnewsmediagroup.com",
    "info@latitude88.com"
  ],
  "nombre_sitio": "verobluesfest.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.verobluesfest.com/vendors",
      "text": "Vendor Info at the Vero Beach Blues Festival top of page Vero Beach Blues Festival! info@latitude88.com 772-492-6105 HOME Lineup Tickets Lodging ABOUT Press Sponsor Retail Vendors Guide Hours & Info Policies Including Bags Email 772-492-6105 Contact Us FAQ More Use tab to navigate through the menu items. WELCOME VENDORS! 80 Market Place Vendors in the Middle of the 5th Annual Vero Beach Blues Festival! Note: You should not consider yourself officially booked for a booth at any event until you receive the approval email. Each application is reviewed by a human and then approved, not approved or waitlisted. Feb 28th - March 1st, 2026 Vendor Application Page (Not Food) If you are an Art & Craft vendor, local or national business or anything in between and you want to be a vendor at this event to enjoy thousands of happy customers over 2 days, you are in the right spot! Latitude-88, Inc. is no stranger to vendor supported community events in Florida. Producing many large Art & Craft events, and sporting events annually, we understand your needs as vendors. Book with us for the best vendor customer service in Florida. Average demographic at this music festival is equal men and women age 40+ Vendor Application is at the Bottom of This Page! Click the image below for an example vendor booth layout (You will see this again within the application) Booth Fees: ​ 10x10 Inline: $175.00 10x10 Premium Corner (Vend from 2 sides): $200.00 $20.00 Multi-Booth Discount for each booth reserved beyond a single 10x10. For example a 10x20 is a $20.00 discount off your order, a 10x30 is $40.00 discount off your order and so on... Need Larger Space? Email or Call us: info@latitude88.com 772-492-6105 Electricity: $30.00 if you want access to electricity. (Only in select areas on the vendor floor plan). NO HEATING ELEMENTS ALLOWED! ​ This Event is Rain or Shine. Please See Our Vendor Refund Policy ​ Note #1: Gas or diesel generators are not allowed in the vendor area. Generator light towers and other lights will illuminate the vendor area all night on Saturday. ​ Electricity is available. There is a $30.00 fee if you want electric and you will choose that within the application process if you want it. Electric is for the use of lights and small electronic devices within your booth only! Lights and small electronic devices should be low wattage, low amperage such as LED lights, laptops, phones, etc. We encourage you to bring your own battery operated lighting and avoid the electric fee if possible. If you purchase electric with us, you MUST bring a 100 foot extension cord. Event management does not loan extension cords. Anything electric with a heating element is strictly prohibited. ​ Everyone must have their own pop up canopy tent. There is no color requirement. Your tent should look professional and in good working order. It must be sturdy enough to hold at least 35lbs of weight on each leg of the tent. Typical backyard, tailgating tents are not sturdy enough and often buckle and collapse with significant weight applied to them or any wind. ​ IMPORTANT* All tents MUST be weighted down after set up to withstand at least 40 MPH gusts, no exceptions. Tying to your neighbors’ tent to secure yours is not allowed. 1 Gal milk or water jugs are not allowed. An unsecured (No weights) tent is a potential liability if it flies away and hits an event goer or another exhibitor /vendor. Even if you stake in to the ground, you must have sufficient weight on each tent leg to withstand at least 40 MPH gusts. You must have at least 35lbs of weigh on each leg of the tent. We will be checking every single tent once set up to ensure all are secure with a weighting system. If yours is un-secure you will be asked to lower your tent until you can secure it with weights, please comply and thank you for adhering to this important tent safety matter. We are saying all this from experience, it’s not fun watching a tent roll through a crowd of people! Remember, you are responsible for what your tent does at an event, i.e injuring people or property. Latitude-88, Inc. assumes no responsibility for your tent causing injury or harm due to your negligence of not securing your tent in the manner discussed above. Click Here for a good example of tent weights that hold at least 35lbs of weight. We will be checking every tent on Friday and Saturday morning. If you do not have your tent weighted, you will be advised to go get them at a local store or break down your tent. NO REFUNDS will be given for unsecured tents that are told to break down. ​ IMPORTANT:* We encourage you to obtain vendor liability insurance for your products and equipment while at this event but it is not required. Note: Latitude-88, Inc. is not responsible for loss of vendor products or equipment and does not provide liability insurance to cover your products and equipment. For example, If weather damages or destroys your products or equipment, your own event liability insurance can help you recover. Here is an example option for vendor liability insurance: https://www.rvnuccio.com/ CLICK HERE FOR THE EASY ONLINE APPLICATION! We are closed for the following products: Hats © 2025 by Latitude-88, Inc. All Rights Reserved bottom of page"
    },
    {
      "url": "https://www.verobluesfest.com/about",
      "text": "ABOUT | Vero Beach Blues & BBQ Festival top of page Vero Beach Blues Festival! info@latitude88.com 772-492-6105 HOME Lineup Tickets Lodging ABOUT Press Sponsor Retail Vendors Guide Hours & Info Policies Including Bags Email 772-492-6105 Contact Us FAQ More Use tab to navigate through the menu items. About the Vero Beach Blues Festival EMAIL: info@latitude88.com PHONE: 772-492-6105 Company : Latitude-88, Inc. Mailing address: P.O. Box 691205 Vero Beach, FL 32969 ​ The Vero Beach Blues Festival is a brand that host's an annual Blues Festival at the Indian River County Fairgrounds 7955 58th Ave Vero Beach. ​ A unique 2 day music festival experience combining the love of Blues & Blues Rock music talent on stage along with delicious foods, beer & full liquor bars and an amazing weekend to remember with friends and family. 10 bands on the blues stage with professional sound and lighting. ​ More Incredible  Food, Adult Beverages and Outstanding Live Music Than Should Be Allowed on the Treasure & Space Coast! ​ Plus 100 Marketplace Vendors in the Middle of the Event! Stroll through the isle-ways of arts & crafts and local business vendors with a cold beer or cocktail! Expect the unexpected in the Vendor Marketplace! Open Day and Night at the festival. © 2025 by Latitude-88, Inc. All Rights Reserved bottom of page"
    },
    {
      "url": "https://www.verobluesfest.com/artist-submission",
      "text": "Artist Submission | Vero Blues Festival top of page Vero Beach Blues Festival! info@latitude88.com 772-492-6105 HOME Lineup Tickets Lodging ABOUT Press Sponsor Retail Vendors Guide Hours & Info Policies Including Bags Email 772-492-6105 Contact Us FAQ More Use tab to navigate through the menu items. ARTISTS & BANDS Interested in performing at the Vero Beach Blues Festival? Please email us here: info@latitude88.com and provide the following i nformation to be considered (Based on Current Availability) If we do not have availability, you will not get a reply First & Last Name ​ ​ Phone Number ​ ​ Email if different than the one you are emailing us from ​ ​ Artist Name/Band Name ​ ​ Size of Your Band (We are most interested in 4 piece + bands) ​ ​ Type of music (We are only hiring Blues and Blues/Rock, Blues/Jazz, Blues/R&B bands) ​ ​ Attach your EPK (Electronic Press Kit) if you have one. If not, you must include photos and video of the band. We must clearly hear your vocals and see you on stage or in a club, etc. Do not ask us to search for you on YouTube or Facebook, send us direct links, we will not search for you. ​ Thank You and We Look Forward to Hearing From You! ​ © 2025 by Latitude-88, Inc. All Rights Reserved bottom of page"
    },
    {
      "url": "https://www.verobluesfest.com/tickets",
      "text": "Tickets to the Vero Beach Blues Festival top of page Vero Beach Blues Festival! info@latitude88.com 772-492-6105 HOME Lineup Tickets Lodging ABOUT Press Sponsor Retail Vendors Guide Hours & Info Policies Including Bags Email 772-492-6105 Contact Us FAQ More Use tab to navigate through the menu items. CLICK HERE for Tickets All Tickets Include Free Re-Entry the Same Day. Come and Go All Day and Night! General Admission Tickets are $25.00/Day at the gates, cash or credit card. Take Advantage of the Early Bird Pre-Sale Discount for Only $15.00 per day! G.A. is Considered non-assigned lawn seating with access to seating inside the big Blues Lounge tent as well as the large Dining Tent (First Come First Serve) The Blues Lounge has seating for approx 600 at any given moment with tables, chairs and a large full liquor bar! Umbrellas are allowed behind the umbrella line. Blankets, and chairs are welcome! VIP Tickets Are $135.00 Per Day. CLICK HERE to Purchase VIP tickets for the event are limited and in high demand! This exclusive ticket provides entry to the VIP tent, which offers a conveniently close and secure location near the stage with tables, chairs & ample space for your comfort. You will benefit from an excellent vantage point of the stage. The area features a private, climate-controlled restroom trailer & private full liqour bar. Your VIP experience will also include a complimentary hot catered light meal daily to be served under the VIP Tent from 2:30pm - 5:30pm, along with an unlimited supply of bottled water. A variety of complimentary pre-packaged snacks will be replenished throughout the day. Each ticket holder will receive a complimentary festival t-shirt upon arrival on your first day along with a complimentary drink ticket for each day purchased to be redeemed at the dedicated VIP Bar Only. Go explore the festival grounds, sit directly in front of the stage with your personal chair, go party with friends and when you are ready to chill in the shade, come on back to the comfort of VIP. Make it a group party in the VIP! Gates open at 10:30 AM both days, First Band starts at 11:30 AM! REFUND/CANCELLATION/RETURN POLICY Your use of online services to buy General Admission and VIP passes constitutes your waiver of all rights to cancel or reverse credit card charges. no exceptions. All tickets are nontransferable and refunds or refund claims are only possible if you purchased the \"purchase protection\" from the ticket platform at the time of your ticket(s) purchase. This festival presents multiple artists over a two day event, and some artists may cancel due to medical or other hardships beyond the control of the festival. ARTISTS MAY BE SUBJECT TO CHANGE, and buyers agree to accept replacement artists and waive all rights to seek refunds, credit card chargebacks or any other compensation if artists must be changed due to no fault of promoter or the company Latitude-88, Inc. © 2025 by Latitude-88, Inc. All Rights Reserved bottom of page"
    },
    {
      "url": "https://www.verobluesfest.com/",
      "text": "Vero Beach, FL Blues Festival! top of page Vero Beach Blues Festival! info@latitude88.com 772-492-6105 HOME Lineup Tickets Lodging ABOUT Press Sponsor Retail Vendors Guide Hours & Info Policies Including Bags Email 772-492-6105 Contact Us FAQ More Use tab to navigate through the menu items. 12 BANDS! Vero Beach Blues Festival! Vero Beach Blues Festival! Vero Beach Blues Festival! Vero Beach Blues Festival! 1/28 VERO BEACH BLUES FESTIVAL! CLICK HERE for the List of prohibited items, bag policy, security, etc. February 28th - March 1st, 2026! Indian River County Fairgrounds 7955 58th Ave Vero Beach, FL 32967 Directions Here CLICK HERE for the festival map! FREE Reentry the same day for the ultimate music festival experience! Early Bird Discount Tickets Click here Presale General Admission Tickets are $15.00/day, get em early and save! General Admission Tickets At the gate are $25/day cash or credit. VIP Tickets are Presale Only, Click Here! ​ See the lineup here! LODGING INFO HERE! A Music Festival For Nothing But the Blues and a Celebration Of the Human Spirit SAT & SUN 10:30 AM to 9:30 PM First Band Starts 11:30 AM Both Days! ​ Multiple Full Liquor Bars and Amazing Food Vendors for Your Enjoyment! ​ Bring Lawn Chairs & Blankets and Enjoy Your Journey With Us... ​ *No Pop Up Tents Allowed *No Coolers Allowed *No outside alcohol or food (Food for diabetics or other medical issues okay) *No large beach umbrellas or shade canopies may be set up in front of the main stage area. An area designated towards the rear of the fest is available if you intend to bring small umbrellas. No large tents may be set up under any circumstances. ( Umbrellas must stay in designated umbrella area) ​ Wagons or Carts are permitted but they must be the collapsible kind. When you make your claim in the grass, all carts and wagons must be collapsed to minimize your footprint. ​ Plus 80 Marketplace Vendors in the Middle of the Event! Stroll through the isle-ways of arts & crafts and local business vendors with a cold beer or cocktail! Expect the unexpected in the Vendor Marketplace! Open Day and Night at the festival. We encourage you to support local talent, you can take purchases to your vehicle with your re-entry wristband. Experience the BIG Blues Lounge Tent Where the Party Ramps Up! Seating for 650 at any given time, big full liquor bar and near the stage! It's free to enter. First come first serve but it's very fluid all day and night with people coming and going! THE BLUES IS A STATE OF MIND FIND YOURS AT THE VERO BEACH BLUES FESTIVAL © 2025 by Latitude-88, Inc. All Rights Reserved bottom of page"
    },
    {
      "url": "https://verobeach.com/calendar/annual-vero-beach-blues-festival-2025?idsevent=14966&lstmonth=2025-2&idscategory=4&prmday=16&flagtext=0",
      "text": "Annual VERO BEACH BLUES FESTIVAL 2025 at Indian River County Fairgrounds skip to main content Connect with us! facebook twitter instagram rss What can we help you find today? Advertise with us Toggle navigation Home Explore Explore On The Water On Land & In The Air Arts & Culture Nightlife Beaches & Parks Shop Shop Cars, Trucks, Motorcycles Specialty Shops Clothing Gift Shops Consignment and Thrift Shops Groceries, Citrus, Meats and Vegetables Dine Stay Stay Hotels / Motels Directories Directories Medical Directory Health and Beauty Home Services Real Estate Professional Services Pets and Animals Wedding Services Community Info Community Area Information Municipalities Clubs & Non-Profit Organizations Schools and Education Senior Services Emergency, Police & Sheriff Recreation Departments Trash and Recycling Post Office Information Kids Sports, Camps & After School Programs Travel & Transportation Other Information Blog Calendar Real Estate What can we help you find today? Home >> Calendar Annual VERO BEACH BLUES FESTIVAL 2025 Sunday, Feb 16, 2025 10:30 AM\n- 9:00 PM Location: Indian River County Fairgrounds Category: Festivals / Family Fun Fabulous two-day music festival experience featuring top Blues & Blues Rock music talent. 10 bands on the blues stage with professional sound and lighting Delicious food, 100 marketplace vendors, beer & full liquor bars. Bring lawn chairs & blankets. No coolers or pets. General admission tickets are $20 Saturday & $15 Sunday. Save money with pre-sale tickets online.  Cool VIP package available online only. Children 16 Free with adult. Parking is Free. EVENT DAYS Sat, Feb 15, 2025 from 10:30am to 9pm Sun, Feb 16, 2025 from 10:30am to 9pm Full details, purchase discounted tickets online at link below. E-Mail: info@latitude88.com Phone: (772) 492-6105 More Info: https://www.verobluesfest.com/ Location Details Indian River County Fairgrounds 7955 58th Avenue Vero Beach, FL 32967 Return to: Calendar Explore Shop Dine Stay Blog Calendar Directories Community Info Medical Directory Steals & Deals Real Estate Client Sign In Contact VeroBeach.com Advertise Site Map Stay On Top OF All Things Vero JOIN OUR EMAIL LIST Connect With Us facebook twitter instagram blog GROW YOUR BUSINESS! Advertise on Verobeach.com Find out how! Can't get enough of VeroBeach.com? Share the love! 6001 HIGHWAY A1A, #8122, VERO BEACH, FL 32963 Contact Info VeroBeach.com is a Member of: Cultural Council of Indian River County - Main Street Vero Beach (MSVB) - Vero Beach Chamber of Commerce - Indian River County Real Estate Association - National Association of Real Estate Editors (NAREE) © COPYRIGHT 2025 VeroBeach.com • TERMS & CONDITIONS • PRIVACY POLICY • ACCESSIBILITY • SITEMAP Top × VeroBeach.com We are processing your request. Please be patient as this may take a few seconds. Close"
    },
    {
      "url": "https://www.hometownnewstc.com/arts_and_entertainment/vero-beach-blues-festival-feb-12-13/article_3e2a035c-843e-11ec-a074-bf9e0dfed2f1.html",
      "text": "Vero Beach Blues Festival Feb. 12-13 | Arts & Entertainment | hometownnewstc.com Skip to main content You have permission to edit this article. Edit Close 82° Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout Home Advertise About Us Contact Us Term of Use Subscription Services Gift Certificates Submission Forms Submit News Weather Search Rack Locations Indian River Martin County St. Lucie News Indian River County St. Lucie County Martin County Sports Arts & Entertainment Out and About - Indian River County Out and About - St. Lucie County Out and About - Martin County Event Features Dining Reviews Business Business Profiles Business News Business Briefs Stock Market Community Page Calendar Adopt a Pet Pet of the week Catch of the week Touring with the Townies Photo Submission Opinion Rants & Raves Police Report Arrest Reports Martin County Indian River County St. Lucie County Columns Chef's Corner Compute This Earl Stewart Financial Garden Nook Golf Horoscopes Senior Strategically Speaking Weather Wise Weekend Wanderer Obituaries Multimedia Headlines and Highlights Podcast Photos of the Week Video Gallery Announcements Anniversaries Births Engagements Weddings e-Edition Special Sections Special Sections Archive Marketplace Classifieds Place a Classified Ad Featured Advertisers Legal Ads Legal Notices © Copyright 2025 Hometown News Treasure Coast 5059 Turnpike Feeder Road, Fort Pierce, FL | Terms of Use | Privacy Policy Site search Search Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout SUBSCRIBE Join our VIP Club Menu Search 82° Home Advertise About Us Contact Us Term of Use Subscription Services Submit News Local Weather Rack Locations - Indian River Rack Locations - Martin County Rack Locations - St. Lucie Gift Certs Search News Indian River County St. Lucie County Martin County Sports Police Report Arrest Reports Indian River County Martin County St. Lucie County Business Business Briefs Business News Business Profiles Stock Market A & E Out and About Indian River County Out and About St. Lucie County Out and About Martin County Event Features Dining Community Adopt a Pet Calendar Catch of the Week Pet of the Week Photo Submission Touring with the Townies Opinion Rants and Raves Columns Chef's Corner Compute This Earl Stewart Financial Garden Nook Golf Horoscopes Senior Strategically Speaking Weather Wise Weekend Wanderer Your_health Obits Multimedia Headlines and Highlights Photo Galleries Indian River County Photo Galleries St. Lucie County Photo Galleries Martin County Photos of the Week Video Gallery Business Directory Classifieds Real Estate Property For Rent Cars & Vehicles Jobs Items For Sale Pets Auctions, Estate & Garage Sales Services Community Personals Featured Advertisers Legal Ads e-Edition Special Sections Special Section Archives Legal Notices Close Vero Beach Blues Festival Feb. 12-13 Mike Winikoff Feb 3, 2022 Feb 3, 2022 0 Facebook Twitter WhatsApp SMS Email +1 Dave Scott Photo courtesy of Rick D. Leonard +1 Selwyn Birchwood Photo courtesy of Selwyn Birchwood Facebook Twitter WhatsApp SMS Email Print Copy article link Save VERO BEACH ― The inaugural Vero Beach Blues & BBQ Festival takes place Feb. 12-13, at the Indian River County Fairgrounds in Vero Beach. Admission is only $5 per person, per day, with children under 13 free, and free parking. Bring chairs and blankets. The two-day festival combines a love of blues music with BBQ and other food, beer, and full liquor bars. Rising superstar Selwyn Birchwood closes the first day with a set at 8:15 p.m. Saturday night. Vero Beach artist The Dave Scott Band closes the festival Sunday at 3:30 p.m. As we went to press, the full schedule for Sat., Feb. 12 is: 11:30 a.m., David Julia; 12:30 p.m., Z-Tones Band; 2 p.m., Ellie Lee Band; 3:30 p.m., J.P. Soars; 5 p.m., The Joel DaSilva Band; 6:30 p.m., Eric Culberson Band; and 8:15 p.m., Selwyn Birchwood. The schedule for Sun., Feb. 13: 11:15 a.m.: Front Porch Blues Band; 12:30 p.m., The Blues Crusaders; 2 p.m., Joe Survival Caruso; 3:30 p.m., The Dave Scott Band. Browse the vendor marketplace to visit 180 vendors selling arts & crafts, beer, and cocktails from multiple full liquor bars. Don't miss the Classic Car Show on Saturday, which you can’t miss as you walk through the gates. Car owners who sign up in advance may attend with your classic car, hot rod, or antique car. There is no fee to enter a car and it comes with two free general admission passes to the festival. Call or text (772) 633-4812 to sign up for the car show. For more information, visit www.verobluesfest.com , email info@latitude88.com , or call (772) 492-6105. The Indian River County Fairgrounds is located at 7955 58th Ave., Vero Beach. Facebook Twitter WhatsApp SMS Email Print Copy article link Save +1 Dave Scott Photo courtesy of Rick D. Leonard +1 Selwyn Birchwood Photo courtesy of Selwyn Birchwood Tags Vero Beach, Florida Dave Scott Band Selwyn Birchwood Vero Beach Blues Festival × Post a comment as anonymous Emoticons [smile] [beam] [wink] [sad] [cool] [innocent] [rolleyes] [whistling] [lol] [huh] [tongue] [love] [sleeping] [yawn] [unsure] [angry] [blink] [crying] [ohmy] [scared] [sleep] [sneaky] [tongue_smile] [thumbdown] [thumbup] [censored] [happybirthday] [ban] [spam] [offtopic] [batman] [ninja] [pirate] [alien] Comment Text Cancel Post comment × Report Cancel Report Abuse × Watch this discussion. Stop watching this discussion. Watch this discussion Get an email notification whenever someone contributes to the discussion Notifications from this discussion will be disabled. Cancel Start watching Stop watching (0) comments Welcome to the discussion. Log In Keep it Clean. Please avoid obscene, vulgar, lewd,\nracist or sexually-oriented language. PLEASE TURN OFF YOUR CAPS LOCK. Don't Threaten. Threats of harming another\nperson will not be tolerated. Be Truthful. Don't knowingly lie about anyone\nor anything. Be Nice. No racism, sexism or any sort of -ism\nthat is degrading to another person. Be Proactive. Use the 'Report' link on\neach comment to let us know of abusive posts. Share with Us. We'd love to hear eyewitness\naccounts, the history behind an article. Post a comment Watch this discussion. Stop watching this discussion. Florida Lottery Winning Numbers Legal Notices Ownership TC CVC HTNMG Bulletin Featured Advertisers Billys Drywall Bulletin Contact Information hometownnewstc.com 5059 Turnpike Feeder Road Fort Pierce, FL 34951 Phone: 772-465-5656 Email: info@hometownnewsmediagroup.com Sections Home News Sports A & E Business Opinion Crime Columns Obituaries Multimedia Announcements Local Events Online Features Services Subscription Services Forms Join our VIP Club Subscription_services Classifieds Place an ad Business Directory Search Weather Media Kit Rack Locations - Indian River Rack Locations - Martin County Rack Locations - St. Lucie Advertise with Us To advertise your business, call (772) 465-5656. Agencies | National | Regional: Call Amanda Tucker at (772) 467-4352. Place a Legal Ad Call: 772-465-5551 or 1-800-823-0466 Email: classifieds@hometownnewsmediagroup.com Follow Us: Martin County Facebook Twitter Follow Us: Indian River County Facebook Follow Us: St. Lucie County Facebook × Browser Compatibility Your browser is out of date and potentially vulnerable to security risks. We recommend switching to one of the following browsers: Microsoft Edge Google Chrome Firefox © Copyright 2025 Hometown News Treasure Coast 5059 Turnpike Feeder Road, Fort Pierce, FL | Terms of Use | Privacy Policy Powered by BLOX Content Management System from BLOX Digital ."
    },
    {
      "url": "https://www.verobluesfest.com/vendor-refunds",
      "text": "Vendor Refunds | Vero Blues Festival top of page Vero Beach Blues Festival! info@latitude88.com 772-492-6105 HOME Lineup Tickets Lodging ABOUT Press Sponsor Retail Vendors Guide Hours & Info Policies Including Bags Email 772-492-6105 Contact Us FAQ More Use tab to navigate through the menu items. Exhibitor Refund Policy and Hold Harmless Agreement. ​ Any cancellation must be made in writing, either postal mail or email. Phone cancellations are not valid for refund purposes. Our refund policy is non-negotiable. ​ Please note: If you book our events and then cancel the booking greater than two times within a calendar year, your booth deposits will be non-refundable and non-transferable going forward for all events in the future. ​ 30 days or greater. If you cancel your reservation 30 days or greater from the Friday of the event set up date you will get a 100% refund including deposits and paid in full amounts. 29 Days or less. If you cancel 29 days or less from the Friday of the event set up date, no refunds will be given including deposits or paid in full amounts. ​ NOTE: New Cancellation Policy as of Jan. 1, 2023 - there will be a $10.00 cancellation fee for every canceled booking that has been approved & processed. ​ If an event is canceled AFTER logistical and advertising arrangements have been made and paid by Latitude-88, Inc., refunds will be issued to the Vendor/Exhibitor totaling 50% of their total investment. ​ If an event is canceled BEFORE logistical and advertising arrangements have been made and paid by Latitude-88, Inc., refunds will be issued to the Vendor/Exhibitor totaling 100% of their total investment. Adverse Weather and the Assumption of Risk: For any event there is an inherent risk of adverse weather. There is an assumed risk of being a vendor / exhibitor, especially at outside events for both the vendor / exhibitor and Latitude-88, Inc.. All events go on rain or shine, indoor and outdoor events. No credits or refunds will be issued if the show is affected by forces of nature beyond our control during the event taking place. Please check our website or contact the office for updates on cancellations resulting from severe weather such as hurricanes, tornado's, flooding, etc. Please note, we will not cancel a show unless informed by state, city or local officials that it will be in the best interest of safety for all or a collaborative decision by Latitude-88, Inc.. If it looks like it is going to rain, unfortunately, we will not call a show prior to the event. It will be at the show coordinator’s discretion on site at the time. HOLD HARMLESS & INDEMNIFICATION AGREEMENT BETWEEN Latitude-88, Inc. AND Vendor/Exhibitor submitting this application. This Agreement shall be in place between Latitude-88, Inc. and Vendor/Exhibitor submitting this application and said terms shall apply to shows Vendor/Exhibitor is participating in with Latitude-88, Inc. indefinably, regardless of how many events the Vendor/Exhibitor attends with Latitude-88, Inc. or until and edit or revised edition is submitted. This agreement is effective from the date of submitting this application and it's acceptance. (“Vendor”) agrees to the following: Vendor shall be responsible for all damages to persons or property, theft of property, adverse weather such as rain, wind, heat, cold, lightening, thunderstorms including their vehicles that occur as a result of Vendor’s or its officers, agents, employees and/or servants fault or negligence in connection with Vendor’s participation in all Events. Further, Vendor shall indemnify and hold harmless Latitude-88, Inc., its officers, agents, employees and servants from any and all claims, damages, liabilities, costs and expenses, including reasonable counsel fees, arising out of any breach of this agreement, any suits or actions of every name, kind, description, brought for, or on account of, injuries to or death of any person or damage to property resulting from the fault or negligence of Vendor, its officers, agents, employees and/or servants in connection with all Events. The vendor/exhibitor will also hold harmless Latitude-88, Inc. from any financial loss, injury, death due to an act of God scenario resulting in cancellation of the event, i.e. but not limited to hurricane, tornado, earthquake, flooding, cold front resulting in extreme rain, lightening. **Securing tents is MANDATORY, retail products, tables, personal products, food vendor equipment & products etc. from wind and adverse weather is sole responsibility of the vendor. Failure to secure these products and/or weighing them down is the risk of the vendor and Latitude-88, Inc. assumes no responsibility or liability for damages to the vendor, its employees & volunteers, and event patrons or equipment as a result of vendor not properly securing tents or any other equipment or products. The vendor will be responsible for damages to other vendors or Latitude-88, Inc. for failure to properly secure tents and equipment. This extends to inside and outside events. The vendor holds Latitude-88, Inc. harmless for these damages. We inspect all tents on Friday and Saturday. If your tent is not secured you will be notified to get weights to secure your tent or leave the event. A minimum of 30 pounds of weight per tent leg must be utilized. If you don’t secure your tent you will be asked to take your tent down. No refunds given if you are told to break down your tent due to you not having it secured. ​ You will be required to either sign the hold harmless agreement or agree to it during the application process in order to participate in any event. ​ © 2025 by Latitude-88, Inc. All Rights Reserved bottom of page"
    },
    {
      "url": "https://www.verobluesfest.com/performance-schedule",
      "text": "Performance Schedule | Vero Blues Festival top of page Vero Beach Blues Festival! info@latitude88.com 772-492-6105 HOME Lineup Tickets Lodging ABOUT Press Sponsor Retail Vendors Guide Hours & Info Policies Including Bags Email 772-492-6105 Contact Us FAQ More Use tab to navigate through the menu items. Artist Performance Schedule. *Artists and Times Subject to Change Click Here For a Printable Version Saturday Feb 15th, 2025 11:30 AM: Chris O’Leary ​ 1:30 PM: Toronzo Cannon ​ 3:30 PM: Vanessa Collier ​ 5:30 PM: Selwyn Birchwood ​ 7:30 PM: The Fabulous Thunderbirds Sunday Feb 16th, 2025 11:30 AM: The Backtrack Blues Band ​ 1:30 PM: D.K. Harrell ​ 3:30 PM: Gypsy Blue Revue. Feat. J.P. Soars and Anne Harris ​ 5:30 PM: Victor Wainwright & the Train ​ 7:30 PM: Shemekia Copeland © 2025 by Latitude-88, Inc. All Rights Reserved bottom of page"
    },
    {
      "url": "https://verobeach.macaronikid.com/events/673df009dcc35f0c560d4984/vero-beach-blues-festival",
      "text": "Vero Beach Blues Festival | Macaroni KID Vero Beach Vero Beach, FL Subscribe Articles Guides Events Directory Become a Publisher Save on Local Family Fun Exclusive savings on theme parks, shows, museums and more Explore Communities Macaroni Kid National Explore Local Communities events Vero Beach Blues Festival Saturday February 15, 2025 10:30 am - 9:00 pm Indian River County Fairgrounds 7955 58th Ave Vero Beach FL 32967 (772) 226-1035 Google Map Notes regarding time First band starts at 11:30 AM Description A Music Festival For Nothing But the Blues and a Celebration Of the Human Spirit Plus vendor marketplace Please visit website linked below for list of prohibited items, bands scheduled, etc. Cost $15 - $30 How Purchase tickets online HERE More Info Click Here + Add to Google Calendar + Add to Apple Calendar ADVERTISEMENTS Meet Your Publisher Alison Ellis Searching for family-friendly events and activities in Indian River County? Look no further! I'll keep you in the loop with local happenings. Contact me at alisone@macaronikid.com Read More » © 2025 Macaroni KID All Rights Reserved. Explore Events Articles Guides Business Directory Press Publisher Login Find my Town More Macaroni KID National About Us About CertifiKID Terms and Conditions Privacy and Editorial Policy Advertising Jobs FAQ Contact Us Stay Informed Subscribe to our newsletter Subscribe Stay Connected"
    },
    {
      "url": "https://www.verobluesfest.com/foodvendors",
      "text": "Food at the Vero Beach Blues Festival top of page Vero Beach Blues Festival! info@latitude88.com 772-492-6105 HOME Lineup Tickets Lodging ABOUT Press Sponsor Retail Vendors Guide Hours & Info Policies Including Bags Email 772-492-6105 Contact Us FAQ More Use tab to navigate through the menu items. Welcome Feb 15-16, 2025 Food Vendors! ​ Thank you for your interest in becoming a vendor at the Vero Beach Blues Festival! Initial applications will be reviewed and submissions will be accepted until all spaces are filled. ​ Filling out an application does not guarantee participation, so please do not send in any money with your application. At this event you must be prepared to work in volume with 15,0 00+ people for the weekend (With good weather). Your wait times for food should not be longer than 30 min at max. It will be your responsibility to limit your menu at this festival to handle the volume of customers you will be dealing with. We highly suggest you limit your main course items to 4 choices on your menu to reach the goal of 30 min or less serving the public. You must be self sufficient with your own generator power, we do not provide electric. Water will be behind you and Ice will be available. We do not book competing food vendors, we want you to be successful. ​ PLEASE READ THROUGH CAREFULLY ​ INFORMATION REQUIRED FOR APPLICATION: This is for info purposes only, we will ask for it later. - Contact/Business Information -Tax ID                 - Menu/Product List With Initial Pricing Per Item - Complete footprint requested (including hitch) - Photos (Required) ​ ADDITIONAL REQUIREMENTS IF/WHEN CONTRACT IS EXTENDED (For informational purposes only) - Proof of Liability Insurance - Certificate of Insurance listing Latitude-88, Inc. as additionally insured. - Proper State of FL Approved Temporary Health Permit/ Paperwork for the event period. ​ ​ Please take a moment to review pertinent rules and regulations for all vendors before continuing on to the application. If you feel you cannot commit to/comply with the following rules, please do not continue the application process. ​ FESTIVAL HOURS: On event days, vendors are expected to be open, staffed and ready for business when the gates open and are required to operate continuously until 10:00pm Saturday and 6 PM Sunday. Closing early is not permitted and if your stand is found un-staffed, it will be grounds for dismissal and not welcome back to any event we produce in the future anywhere in the Untied States. ​ LOCATION RESPONSIBILITY: You are responsible for the cleanliness of your vending location during the festival and clean-up following the end of the festival. If your vending site is found with items or trash remaining following load-out, your security deposit will be forfeited. (Putting your trash beside the closest garbage can it not acceptable, Please use the Supplied Dumpsters) It is your responsibility to remoive and dispose of your own trash at the end of each day. You must provide a fire extinguisher for each concession site. ​ ALCOHOL: Vendors are not allowed to sell, give away or consume alcoholic beverages while \"on the clock.\" NO alcohol is permitted at vending site at any time. Operating your booth space while consuming alcohol, or while intoxicated is grounds for immediate dismissal and security deposit forfeiture. ​ MENU BOARDS/RETAIL PRICES: All prices must include sales tax and be visible to the public at all times during business hours. Your pricing must be easily seen while standing in line. All pricing will be approved by festival management prior to acceptance.  You are only approved to sell the products listed within your contract. Once the festival is 30 days away, menu edits/requests cannot not be considered. ​ PARTICIPATION FEES: THIS IS FOR INFORMATIONAL PURPOSES ONLY, PLEASE DO NOT SEND IN ANY MONEY AT THIS TIME WITH YOUR APPLICATION. ​ PARTICIPATION FEES MAIN COURSE: (based on a maximum of 30' frontage) $1,200 .00 Flat Fee. No other fees ​ PARTICIPATION FEES SIDE ITEM / SNACK FOOD: (based on a maximum of 20' frontage) $500.00 Flat Fee. No other fees ​ No sales of canned or bottled soda or bottled water is allowed ​ DEPOSITS: A $250.00 deposit will be required at time of acceptance. Deposits are refundable up to 60 days before the event. If you cancel 59 days or less there are no refunds. All balances must be paid in full 45 days from the event. Running out of food and closing your doors is not an option. If this happens, you will not be welcome back to a future event with Latitude-88, Inc. If your wait times are longer than 30 min max, you will not be welcome back. Please be prepared to work in volume with staff and product. Have a local backup plan to restock if needed. SAMS Club and major grocery stores are nearby. We are currently fully booked for all food vendors for this event but you are welcome to still submit to join our waitlist. Note: once you click \"submit application now\" it will add you to the waitlist with no confirmation response needed Please fill out the food vendor application below and you will be contacted, thanks for your interest! Initial Food Vendor Application We will contact you for other required items if you are offered a spot First Name Last Name Email Phone Street Address City State Zip code Company What Food Are You? Select What Applies to You Below * Required Food Truck Tent Trailer Please List Prior Event(s) That You Have Worked as a Food Vendor That Required You to Work in Volume. Such as Music Festivals, Concerts, Other Large Community Events, Etc... Upload a Picture of Your Food Rig Set Up Upload File Upload supported file (Max 15MB) Submit Application Now! Thanks for applying! We will respond to you with an acceptance status as soon as possible. Submiting this application does not mean you have been accepted to the event. © 2025 by Latitude-88, Inc. All Rights Reserved bottom of page"
    },
    {
      "url": "https://www.verobluesfest.com/hours-info",
      "text": "Hours & Info to the Vero Beach Blues Festival top of page Vero Beach Blues Festival! info@latitude88.com 772-492-6105 HOME Lineup Tickets Lodging ABOUT Press Sponsor Retail Vendors Guide Hours & Info Policies Including Bags Email 772-492-6105 Contact Us FAQ More Use tab to navigate through the menu items. DATES & TIMES : ​ February 15-16 , 2025 Saturday 10:30 AM to 9 PM. Sunday 10:30 AM to 9 PM. ​ VENUE: ​ Indian River County Fairgrounds 7955 58th Ave Vero Beach, FL 32967 ​ WEATHER: ​ ​ The festival will take place rain or shine. Please keep up-to-date on weather reports and plan your attire and preparations accordingly. ​ ZERO TOLERANCE: ​ We have a zero-tolerance policy for drug use and possession. Police officers will be working inside and outside of the event, and all narcotics laws will be strictly enforced. Be responsible, and make smart choices. ​ SECURITY & ENTRY: ​ By purchasing entry, you agree to submit to a thorough search, including emptying your pockets and a bag inspection by security. We reserve the right to refuse entry to anyone. ​ AGES & ID: ​ The Vero Beach Blues Festival is an all-ages event. Those wishing to purchase or consume alcohol must be 21+ and present a valid photo ID. Anyone under 18 must be accompanied by a parent or legal guardian. ​ BAG POLICY: Click Here ​ ​ ​ ​ CLICK HERE to Download and/or Print the Festival Map! © 2025 by Latitude-88, Inc. All Rights Reserved bottom of page"
    },
    {
      "url": "https://bluesfestivalguide.com/",
      "text": "Home - Blues Festival Guide Magazine and Online Directory of Blues Festivals Skip to content New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more Home News Videos Music Calendar SUBMIT FESTIVAL/EVENT 2025 Festivals/Events Upcoming Festival/Event Search Festival/Event Festival/Event Archives Links SUBMIT BAND/BUSINESS LINKS Agents-Promoters Art-Photography Band/Artist Site Books Club/Cafe Cruise Festival Producer Hotel Magazines & Newsletters Management Media Services Museums Organizations Production Radio Station Record Label-Agency Schools-Education-Scholarships Societies Travel Vendor/Shop Venue-Promoter-Calendar The Magazine 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 Archive Newsletter Advertising Media Kit Print Magazine Rate Card Website Advertising Rate Card e-Guide Rate Card Highlighted Festival Posting Digital Edition Rate Card Social Media Rate Card Featured Video Rate Card Custom E-Blast Rate Card MP3 Rate Card Sponsorship Publicity Services About Our Story Team Shout Outs Link Us Up Contact Us Privacy and Legal Info Menu Close Home News Videos Music Calendar SUBMIT FESTIVAL/EVENT 2025 Festivals/Events Upcoming Festival/Event Search Festival/Event Festival/Event Archives Links SUBMIT BAND/BUSINESS LINKS Agents-Promoters Art-Photography Band/Artist Site Books Club/Cafe Cruise Festival Producer Hotel Magazines & Newsletters Management Media Services Museums Organizations Production Radio Station Record Label-Agency Schools-Education-Scholarships Societies Travel Vendor/Shop Venue-Promoter-Calendar The Magazine 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 Archive Newsletter Advertising Media Kit Print Magazine Rate Card Website Advertising Rate Card e-Guide Rate Card Highlighted Festival Posting Digital Edition Rate Card Social Media Rate Card Featured Video Rate Card Custom E-Blast Rate Card MP3 Rate Card Sponsorship Publicity Services About Our Story Team Shout Outs Link Us Up Contact Us Privacy and Legal Info Click here to read the 2025 issue of the Blues Festival Guide magazine in digital format! Turn the pages with a simple click on the arrows at bottom of page. Clicking on your favorite advertiser will bring you to their website. Turn up the volume to enjoy Lil’ Ed & The Blues Imperials: “Whiskey-Flavored Tears”. Use SEARCH field to find exactly what you are looking for. The toolbar at the bottom of the digital magazine has fun features: download, share, etc. CLICK HERE Click button below to order a copy of the 2025 Blues Festival Guide print magazine — It will be shipped to you directly . This once-a-year publication is chock-full of blues history, lifestyle, entertaining and educational features, and dozens of festivals! CLICK HERE TO ORDER (Although the magazine is free, there is a small shipping and handling charge.) Up the River Blues Festival Sep-13-2025 Regional and International Blues Musicians Ossining, New York, USA , Louis Engel Waterfront Park - Headliners : King Solomon Hicks, Willa and Company, The Traveling Riverside Blues Band, more BB King's 100th Birthday Celebration Sep-14-2025 - Sep-16-2025 Birthday Celebration for Mr. King's 100th Birthday Memphis, Tennessee, USA , BB King's Blues Club - 901-351-1181 Blue Ridge Blues & BBQ Festival Sep-20-2025 14th Annual Blue Ridge, Georgia, USA , Downtown City Park - Headliners : Blackcat Zydeco, Tullie Brae, The Crossroads Band, The Garrett Collins Project, more Blues Heaven Denmark Oct-03-2025 - Oct-04-2025 Ready for another unforgettable festival experience!! Frederikshavn, , Denmark , Arena Nord - Headliners : Canned Heat, Mud Morganfield, John Primer + more Crescent City Blues & BBQ Festival Oct-10-2025 - Oct-12-2025 Get ready to savor the soul of the south at the Crescent City Blues & BBQ Festival,  a FREE 3-day celebration of Blues, BBQ, and New Orleans spirit! New Orleans, Louisiana, USA , Lafayette Square Park - Headliners : Bobby Rush, Devon Allman’s Blues Summit, Little Freddie King, Leo Nocentelli of the Meters, more... Reading Blues Fest Nov-20-2025 - Nov-23-2025 Reading, Pennsylvania, USA , Doubletree by Hilton - Sandy Beaches Cruise Jan-11-2026 - Jan-18-2026 Ft Lauderdale, Florida, USA , Headliners : Paul Thorn, Little Feat, The Mavericks + many more Big Easy Cruise Jan-18-2026 - Jan-25-2026 Ft Lauderdale, Florida, USA , Headliners : Little Feat, Samantha Fish, Anders Osborne + more #44 Legendary Rhythm & Blues Cruise Jan-24-2026 - Jan-31-2026 Ft. Lauderdale, Florida, USA , Holland America Nieuw Statendam - Headliners : Dumpstaphunk, Tommy Castro & the Painkillers, Ronnie Baker Brooks + many more VERO BEACH BLUES FESTIVAL Feb-28-2026 - Mar-01-2026 A Music Festival For Nothing But the Blues and a Celebration Of the Human Spirit Vero Beach, Florida, USA ,  Indian River County Fairgrounds & Expo Center - Headliners : Eric Gales, Bobby Rush, Sue Foley, Mud Morganfield, Solomon Hicks, more Tampa Blues Festival Apr-10-2026 - Apr-12-2026 30th Anniversary St. Petersburg, Florida, USA , Headliners : Taj Mahal, Los Lobos, Tommy Castro, Jackie Venson, Yates McKendree Leave a Reply Comment Enter your name or username to comment Enter your email address to comment Enter your website URL (optional) Email Us 775-846-8238 Click here for Advertising Rates Sign Up for weekly BLUES FESTIVAL E-GUIDE newsletter! Easy & Free. Packed full of blues news, blues society updates, band tours, \nand of course, dozens of blues festivals, and more.\nExpect to see it in your inbox each Thursday.\nPlease enter your email address below: Subscribe to our Newsletter Email Address Follow Us Latest Blues News Latest Blues News New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more BLACK MOUNTAIN Blues Festival on September 26-28, 2025 in Black Mountain, North Carolina Celebrates Music, Community, and Resilience Blues Rock has a new name…DENNIS JONES! Copyright ©2025 - Blues Festival Guide"
    },
    {
      "url": "https://bluesfestivalguide.com/vero-beach-blues-festival-feb-25-26-2023-vero-beach-fl/",
      "text": "VERO BEACH BLUES FESTIVAL Feb 25-26, 2023 Vero Beach, FL - Blues Festival Guide Magazine and Online Directory of Blues Festivals Skip to content New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more — New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more Home News Videos Music Calendar SUBMIT FESTIVAL/EVENT 2025 Festivals/Events Upcoming Festival/Event Search Festival/Event Festival/Event Archives Links SUBMIT BAND/BUSINESS LINKS Agents-Promoters Art-Photography Band/Artist Site Books Club/Cafe Cruise Festival Producer Hotel Magazines & Newsletters Management Media Services Museums Organizations Production Radio Station Record Label-Agency Schools-Education-Scholarships Societies Travel Vendor/Shop Venue-Promoter-Calendar The Magazine 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 Archive Newsletter Advertising Media Kit Print Magazine Rate Card Website Advertising Rate Card e-Guide Rate Card Highlighted Festival Posting Digital Edition Rate Card Social Media Rate Card Featured Video Rate Card Custom E-Blast Rate Card MP3 Rate Card Sponsorship Publicity Services About Our Story Team Shout Outs Link Us Up Contact Us Privacy and Legal Info Menu Close Home News Videos Music Calendar SUBMIT FESTIVAL/EVENT 2025 Festivals/Events Upcoming Festival/Event Search Festival/Event Festival/Event Archives Links SUBMIT BAND/BUSINESS LINKS Agents-Promoters Art-Photography Band/Artist Site Books Club/Cafe Cruise Festival Producer Hotel Magazines & Newsletters Management Media Services Museums Organizations Production Radio Station Record Label-Agency Schools-Education-Scholarships Societies Travel Vendor/Shop Venue-Promoter-Calendar The Magazine 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 2012 Archive Newsletter Advertising Media Kit Print Magazine Rate Card Website Advertising Rate Card e-Guide Rate Card Highlighted Festival Posting Digital Edition Rate Card Social Media Rate Card Featured Video Rate Card Custom E-Blast Rate Card MP3 Rate Card Sponsorship Publicity Services About Our Story Team Shout Outs Link Us Up Contact Us Privacy and Legal Info VERO BEACH BLUES FESTIVAL Feb 25-26, 2023 Vero Beach, FL VERO BEACH BLUES FESTIVAL Feb 25-26, 2023 Vero Beach, FL Indian River County Fairgrounds 7955 58th Ave., Vero Beach, FL Headlining Sat Night: MR. SIPP The Mississippi Blues Child Headlining Sun Night: JOHN PRIMER You Can’t Paint the Blues Without the Primer! Other highlights include Selwyn Birchwood, Annika Chambers, JP Soars, Gabe Stillman and more. A music festival on 40 acres! Camping available Admission is Only $5.00! (under 13 is Free) Parking is Free Enjoy the huge BLUES LOUNGE tent, hand-rolled cigar lounge, 180 booth vendor marketplace, yummy food, endless full liquor beverages and fun! An escape from normal — nothin’ but the blues Click Video below to check out the Vero Beach Blues Festival Website & Directions info@latitude88.com 772-492-6105 You Might Also Like 20th Annual Prairie Dog Blues Festival July 28 & 29, 2017 2 Days – 2 Stages – 12 Bands April 27, 2017 Meet The BluesMobile’s C.C. Rider at the Chicago Blues Festival! June 4, 2015 Generation Blues Experience :: PRIVATE ANGEL October 30, 2014 Email Us 775-846-8238 Click here for Advertising Rates Sign Up for weekly BLUES FESTIVAL E-GUIDE newsletter! Easy & Free. Packed full of blues news, blues society updates, band tours, \nand of course, dozens of blues festivals, and more.\nExpect to see it in your inbox each Thursday.\nPlease enter your email address below: Subscribe to our Newsletter Email Address Follow Us Latest Blues News Latest Blues News New Orleans 2025 Crescent City Blues & BBQ Festival October 10-12, 2025 with Devon Allman’s Blues Summit, Bobby Rush, Tab Benoit, and more BLACK MOUNTAIN Blues Festival on September 26-28, 2025 in Black Mountain, North Carolina Celebrates Music, Community, and Resilience Blues Rock has a new name…DENNIS JONES! Copyright ©2025 - Blues Festival Guide"
    },
    {
      "url": "https://www.verobluesfest.com/policies-including-bags",
      "text": "Policies at the Vero Beach Blues Festival top of page Vero Beach Blues Festival! info@latitude88.com 772-492-6105 HOME Lineup Tickets Lodging ABOUT Press Sponsor Retail Vendors Guide Hours & Info Policies Including Bags Email 772-492-6105 Contact Us FAQ More Use tab to navigate through the menu items. BAG POLICY | CODE OF CONDUCT | TICKET TERMS & CONDITIONS | LIKENESS POLICY Festival House Rules and Bag Policy ​ Safety and security is our #1 priority to keep everyone happy and enjoy a safe environment. ​ Note: All Bags Will Be Inspected Upon Entry to This Event. ​ NO BACKPACKS OR COOLERS OF ANY SIZE ARE ALLOWED! ​ All bags are subject to inspection prior to entering the event grounds. No backpacks or bags larger than 9x10x12 will be allowed on the grounds. Anyone refusing to have a bag inspected by security will be denied entry Please leave any unnecessary articles secured within your vehicle or at home to expedite your entry. Firearms are not allowed. Pocket knives are okay Diaper bags are allowed for mothers (following visual inspection) Medically Necessary Bags (following visual inspection) Wagons or carts are allowed but must be the folding soft sided kind. Used to transport chairs, blankets and personal items to the field, then break down the cart for a small footprint. ​ Beach Umbrella's, pop up tents or other large shade devices are not allowed. Smaller shade umbrella's are allowed but must stay behind the designated umbrella line on the festival grounds (See signs on the field) ​ Click Image to Enlarge Click The Prohibited Items Sign to Download or Print! THE VERO BEACH BLUES FESTIVAL CODE OF CONDUCT ​ As we look forward to a fantastic festival season, we would like to remind everyone to be safe and have fun. ​ The Vero Beach Blues Festival and Latitude-88, Inc. are committed to providing a comfortable and relaxing entertainment experience in which you can always expect to be treated in a consistent, professional and courteous manner by all venue, security and operations personnel. The safety of our fans will always be our number one priority! Vero Beach Blues Festival staff and performers have the same rights, and fans are responsible for their own behavior.  With that in mind, please remember to include this basic common-sense approach to your own festival code of fan conduct: ​ You are entitled to enjoy the festival experience free from disruptive or inconsiderate behaviors or unruly actions. Fans may not interfere with the event and/or performers in any manner. Please refrain from using abusive language or obscene gestures. Fighting, throwing objects or other behavior deemed detrimental to the experience of other guests will result in you going home early or possibly going to jail. For those of you who choose to consume alcohol, please do so in a safe and responsible manner. Intervention with an intoxicated or impaired fan will be handled in a prompt and efficient manner. Please comply with requests from festival staff regarding venue operational and emergency procedures. Fans may not engage in unauthorized commercial activity while on venue property. In helping to maintain these high standards, we encourage you to report inappropriate behavior to festival staff. Remember: SEE SOMETHING, SAY SOMETHING. Violation of the Fan Code of Conduct may result in eviction from the venue without a ticket refund. ​ Once again, and most importantly, be safe and have fun! ​ ​ TICKET TERMS & CONDITIONS ​ Please read the following Terms and Conditions carefully. These rules apply to all ticket purchases in person at the gate. Vero Beach Blues Festival is a rain or shine event. (Subject to severe weather that may close the festival) No ticket refunds if this happens during the festival. ​ You are purchasing a ticket for Vero Beach Blues Festival, not for a specific artist. Artists and schedule subject to change without notice. Artist cancellation is not grounds for refund. The ticket is a revocable license for the date at which you purchased it. ​ “Management” means Vero Beach Blues Festival Management reserves the right, without the refund of any portion of the ticket purchase price, to refuse admission or to eject any person who fails to comply with the rules of the venue, local, state/provincial or federal law or whose conduct is deemed illegal, disorderly, or offensive by Management. Persons entering the facility are subject to search for contraband. Ticket user bears all risks of personal injury incidental to the event, whether occurring before, during or after the event. Ticket user bears all risks, including cancellation of the event and of inclement weather. The ticket may not be used for advertising promotion (including contests and sweepstakes), or other trade purposes without the express written consent of Management. ​ Vero Beach Blues Festival LIKENESS POLICY ​ This event may be broadcast, recorded and publicized, and you may be filmed and/or photographed as part of the audience. By your attendance as an attendee, employee, volunteer or 1099 contractor, you are granting your permission to be recorded for commercial purposes and agree to the following: being filmed, videotaped or photographed by any means; full use of your name, likeness, voice and words without compensation; specifically waiving all rights of privacy and/or publicity during the videotaping or filming and release Vero Beach Blues Festival and Latitude-88, Inc. and all of their respective agents, officers, directors, owners, parents, partners, affiliates, employees and consultants from liability for loss, damage or compensation for the use of your name, likeness, voice and words; and compliance with all rules and regulations of the event. © 2025 by Latitude-88, Inc. All Rights Reserved bottom of page"
    }
  ]
}