{
  "fuentes": [
    {
      "url": "https://www.ireland-guide.com/establishment/no-3-wine-bar-and-restaurant.3857.html",
      "email": "info@3collon.com"
    },
    {
      "url": "https://verrewinebar.com/",
      "email": "jerry@icewingcc.com"
    },
    {
      "url": "https://6abc.com/post/philadelphias-bayou-bar-grill-labeled-commanders-friendly-owner-says-not-fast-bleed-green-here/15831516/",
      "email": "mickey@disney.com"
    },
    {
      "url": "https://verovino.com/our-story",
      "email": "info@verovino.com"
    }
  ],
  "mails": [
    "info@3collon.com",
    "info@verovino.com",
    "jerry@icewingcc.com",
    "mickey@disney.com"
  ],
  "nombre_sitio": "verowinebar.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.ireland-guide.com/establishment/no-3-wine-bar-and-restaurant.3857.html",
      "text": "No. 3 Wine Bar & Restaurant | Collon Georgina Campbell Guides About About Us Assessment Process Contact Us Quotes & Testimonials Award Winners » Awards Presented Awards Received Info for Owners » Info for Owners Industry Register/Login Awards Eat Drink Stay Buy Learn Producers 10 of the Best Eat Drink Stay Buy Learn Producers Articles Blog Recipes By Georgina Campbell Special Offers Competitions Shop Recipe Cards Buy Guidebooks Buy Cookbooks GPS POIs for Garmin « Ireland Apps iPhone App Blackberry App Samsung App Nokia App Ireland for Food Lovers App « Cooking Apps iCook - Recipes & Cooking with Neven APPetiser - Recipes & Cooking with Derry Clarke For the Love of Food â Kevin Dundon More+ Gardens Golf Self Catering What's On Tourist Attractions Wedding Venues LANGUAGE: EN ES FR DE IT ZH JA PT - ireland - Graphics Version | Irelandâs Leading Independent Food & Hospitality Guide LOGIN/SIGNUP My Ireland Guide Industry Home > Drink & Eat > No. 3 Wine Bar & Restaurant Drink & Eat Comments(0) Add Comment No. 3 Wine Bar & Restaurant Restaurant Dislike Like 9 votes ( 91% ) No. 3 Wine Bar & Restaurant In the space that housed The Forge in Collon for many years, No. 3 Wine Bar & Restaurant was opened in 2016 by mother-and-son team, Martina and Wayne Fitzpatrick, after a stylish facelift Seats 60. Open daily 12.30pm-9pm (Sat o 9.30pm). L 12.30pm–4pm, D 4.30pm–10pm, set 2/3 course €27/€33.  Early D 4.30pm-7pm; 2/3 courses €19/€25. House wine from €24.50, glass from €6.50. Children's menu. Also à la carte. Private parking (9); air conditioning. Bar. Closed Mon & Tue. Amex, MasterCard, Visa Georgina Campbell Formerly The Forge  - a landmark dining destination Collon for many years -  the characterful premises was given a stylish face lift and opened in 2016 as No. 3 Wine Bar & Restaurant by mother-and-son team Martina and Wayne Fitzpatrick, who will give you a warm welcome. The ground floor is now a snazzy small bar with white metro tiles, a few cosy tables and a walled-off snug with a booth in the middle of the room that’s ideal for a big group. The main seating is upstairs, which has been transformed by atmospheric slate grey paint - and Martina and Wayne are following The Forge’s long history of exhibiting art, which is once again an especially attractive feature of the restaurant. For lunch, you might find such offerings as a spicy lentil and carrot soup with the house brown bread, a Cajun marinated breast of chicken with smoked applewood cheese and chipotle aioli, prawn and chorizo linguine with red pesto ciabatta, or a sloppy Joe of pulled pork with apple and cabbage slaw, crispy onions and a homemade bap. The lunch portions are hearty, so bring a big appetite. All tastes are catered for here, which means that the dinner menu could feature dishes such as a slow-braised pork belly with creamy chorizo and potato mash, pan-seared hake on a bed of lavender and lemongrass risotto with a smoked paprika sauce, steak with crispy tobacco onions and hand-cut chips or a pumpkin and black bean burger with kataifi pastry for vegetarians. But before that, for starters, don’t miss the honey and bourbon chicken wings, which are a house specialty. For dessert, you could choose from a selection of the homemade ice cream or maybe a tiramisu, but the lemon, lime and avocado mousse tart is definitely worth a try. It’s so zingy, creamy and luscious that you’d never guess it’s actually a vegan recipe. An early bird menu is served daily from 4.30pm and is great value at two courses for €19 or three courses for €25. A separate children’s menu is available too. No. 3 had big shoes to fill, following on in the site where the area's leading restaurant had been for so long, but - although regular fans might sometimes wish for a casual and inexpensive option for that quick bite - it has proved a hit with the locals, who love the atmosphere, the food and the friendly staff and wish Martina and Wayne success for many years to come. Less Read More Facilities/Features Restaurant/Dining/Pub Banqueting Children - Not Suitable Conference Venue Open New Year Outdoor Dining Avail. (summer) Smoking Area Covered Smoking Area Heated Smoking Area Seated Wedding Venue Wheelchair Friendly Contemporary International Contemporary Irish European Classic Traditional Irish Budget Meals (€21-35/£14-23 pp 3-courses, not inc. dr Coeliac Friendly Formal Vegetarian Friendly (always at least 1 starter & 1 main course) Vegetarian Menu Last Updated: 07-04-2020 Click here if you are the owner or marketing manager array(13) {\n  [\"numpages\"]=>\n  float(2)\n  [\"firstpage\"]=>\n  int(1)\n  [\"lastpage\"]=>\n  float(2)\n  [\"pages\"]=>\n  array(2) {\n    [1]=>\n    int(0)\n    [2]=>\n    int(6)\n  }\n  [\"current\"]=>\n  int(1)\n  [\"maxpages\"]=>\n  NULL\n  [\"prev\"]=>\n  NULL\n  [\"next\"]=>\n  int(6)\n  [\"remain\"]=>\n  float(6)\n  [\"to\"]=>\n  int(6)\n  [\"numrows\"]=>\n  int(12)\n  [\"from\"]=>\n  int(1)\n  [\"limit\"]=>\n  int(6)\n} Might also like Drink & Eat Virginia Park Lodge Virginia, Co. Cavan Classes/Courses / Country House / Historic House / Restaurant Beautifully located overlooking Lough Ramor and the rolling Cavan countryside, this eighteenth century sporting lodge  is on the edge of Virginia town and at the heart of a 150 acre estate. It was built by Thomas Taylour, Lord Headfort, as a summer escape from the family ... Read more Drink & Eat The Washerwoman Dublin  9, Dublin City Restaurant With a reputation for excellence that includes the successful Winding Stair and Woollen Mills restaurants on Dublin’s quays, Elaine Murphy brought some of her magic to leafy Glasnevin, adding yet another ‘W’ to her portfolio.\r\nAnd, at The Washerwoman, s ... Read more Drink & Eat The Legal Eagle Dublin  7, Dublin City Pub The Legal Eagle pub has been part of the life of the legal community around the Four Courts for many years, with barristers, solicitors and appellants all to be found within. It was shuttered for a long time until  Dublin restaurateur Elaine Murphy and her partner Brian  ... Read more Buy & Drink & Eat & Producer The Woollen Mills and The Yarn Dublin  1, Dublin City Baking/Bakery / Restaurant Sad as Dubliners were to see the 2012 closure of one of the city’s most iconic businesses, the Dublin Woollen Mills (where James Joyce, no less, once worked), it is cheering to see Elaine Murphy and the team from the equally iconic Winding Stair next door serving u ... Read more Drink & Eat & Stay The Merrion Hotel and The Garden Room Restaurant Dublin  2, Dublin City Hotel / Restaurant Right in the heart of Georgian Dublin, opposite Government Buildings, this luxurious hotel comprises four meticulously restored Grade 1 listed townhouses built in the 1760s and, behind them, a contemporary garden wing overlooks formal landscaped gardens.\r\nLuxurious publi ... Read more Drink & Eat The Old Spot Dublin  4, Dublin City Pub Sitting at the Beggar's Bush end of Bath Avenue, The Old Spot cuts a dash in this leafy neighbourhood, its trendy teal country pub exterior festooned with a spectacular collection of hanging baskets. In many ways the Instagram-friendly exterior conveys exactly what you'l ... Read more Contact details +353 41 981 9547 EMAIL PLEASE MENTION IRELANDGUIDE.COM WHEN ENQUIRING Address No. 3 Wine Bar & Restaurant Church Street, Collon Co Louth Directions About Collon Trip Planning Tools On N2, 56km (35 m) from Dublin due north, midway between Slane and Ardee, in centre of village. Add to my Favourites + Name: Comment: View my Favourites Local Recommendations Hospitality By Distance All Eat Drink Stay Buy Learn Producer By Category Comments There are currently no comments Leave a comment You must be logged in to leave a comment Not a member? Register for your free membership now! Or leave a comment by logging in with: Sign up with Facebook Sign up with Twitter Sign up with OpenID Sign In Georgina Campbell's ireland-guide.com Tweets by IrelandGuide © Copyright Georgina Campbell Guides 2025 Disclaimer T & C Privacy Policy Site Map Links Advertise Ireland Hotels | Northern Ireland Hotels | B&B Ireland | Accommodation Ireland | Dublin Airport Hotels | Dublin Hotels | Dublin Restaurants | Belfast Hotels | Belfast Restaurants | Cork Hotels | Cork Restaurants | Galway Hotels | Galway Restaurants | Killarney Hotels | Killarney Restaurants | Kilkenny Hotels | Kilkenny Restaurants | Limerick Hotels | Limerick Restaurants | Sligo Hotels | Waterford Hotels | Westport Hotels LANGUAGE: EN ES FR DE IT ZH JA PT My Ireland Guide - Log in My Favourites My Itineraries My Comments Special Offers Hire Cars Ferry Tickets Competition This website uses cookies to help provide you with a better online experience. By continuing to browse this site, you are agreeing to our use of cookies. Cookie Policy I agree"
    },
    {
      "url": "https://verrewinebar.com/",
      "text": "Verre Wine Bar Welcome Are you 21 years or older? Yes No Home Menus Lunch Brunch Dinner Wine Bottle & Board Happy Hour Wine Wonderland Package Wine Club Reservations Events Calendar Private & Corporate Events Order Online Takeout Postmates UberEats DoorDash GrubHub Wines To Go Red Wine White Wine Sparkling Wine Rose Wine Dessert Wine Shop All Wines Wine Delivery Private Dining COVID Safety About Us Log in Search Contact (703) 253- 3878 service@verrewinebar.com Facebook Twitter Instagram Menu Search Cart Home Menus Lunch Brunch Dinner Wine Bottle & Board Happy Hour Wine Wonderland Package Wine Club Reservations Events Calendar Private & Corporate Events Order Online Takeout Postmates UberEats DoorDash GrubHub Wines To Go Red Wine White Wine Sparkling Wine Rose Wine Dessert Wine Shop All Wines Wine Delivery Private Dining COVID Safety About Us Log in Cart ( 0 ) Search THELEMA WINE TASTING Join Thomas Webb on Sunday, September 21st for an exclusive tasting event! Purchase Tickets Verre Wine Club Join our NEW AND IMPROVED Wine Club to get the royal treatment: exclusive event access, discounted wines, complementary gifts cards, and so much more! Read More Welcome to Verre We offer a relaxed and fun space to experience The Wine Life. Whether it's date night, Happy Hour with coworkers, drinks with the girls, or just a bottle of wine to enjoy at home, we've got you covered. Join us for Patio or Indoor Dining! Make a Reservation Wine Shop Browse our spectacular selection of boutique wines at unbeatable prices! VIP Members get an additional discount on all purchases. Shop Now Food menus Start with a board of our delicious handmade bruschetta. Grab some cheese & charcuterie to pair with your wine. And don't forget to add on a few of our mouth-watering small plates! View Menus Wine List The area's best selection of expertly selected wines by the glass, starting at just $9. We focus on small-production, family-run wineries that wildly overdeliver for the price! View Menu Happy Hour We now offer Happy Hour EVERY DAY from 4pm-7pm. Join us for specially priced food and wines by the glass! View Menu What our guests say The wine list has great range and the quality is excellent... Great for a date or a classy girls night! Alicia P Yelp The patio has a perfect breeze even on the hottest days. The waiters know their wine list thoroughly. Join their wine club. Jim E Google The biggest surprise about this place was that it was affordable! Highly recommend! Audrey R Yelp Looking for a nice glass of wine, a good pairing, a nice patio or a place to slow down? I'd definitely recommend this place. Jordan B Yelp Just had dinner here and it's my new favorite restaurant. The atmosphere was so fun and casual. The food was delicious, and they really know their wines. Hana K Google Super friendly service and interesting outside-of-the-box wines. Mitch L Google Join our Wine Club It starts with a premium wine each month, hand-selected by our team of expert sommeliers. But the benefits go so much further! Read More Wine Shop Our team of expert sommeliers tastes thousands of wine a year. Only the very best make it onto our shelves. We offer more than 150 unique bottles of Wine To Go that represent unbeatable value and quality for the money. Plus, VIP Members get an additional 15% off regular prices! Shop All Wines Red Cabernet Sauvignon, Pinot Noir, Tempranillo, Malbec, and everything in between! White From crisp Sauvignon Blancs to rich, oaky Chardonnays, we have a white to please every palate. Rose Not just for summer anymore! Shop our collections of pretty pinks from all over the world. Sparkling Prosecco for Mimosas? Value-driven Brut Cava? Grower Champagne? We've got it all! Hidden gems under $15 Add to Cart iLauri 'Tavo' Pinot Grigio $12.00 Add to Cart Raywood Chardonnay $13.00 Add to Cart Encostas da Lima 'Granite' Vinho Verde $13.00 Add to Cart iLauri 'Salto' Sangiovese $13.00 View all Good Food. Good Vibes. And Crazy Good Wines. Make a Reservation Visit Us 2415 Wilson Boulevard Arlington, VA 22201 (703) 253-3878 service@verrewinebar.com Monday to Friday Lunch: 11:30am-3:00pm Dinner: 4pm-10pm Saturday + Sunday Brunch: 11:30am-3:00pm Dinner: 4pm-10pm Keep in Touch Sign up and be the first to be notified of new menu releases, wine features, promotions, and much more! Email Subscribe © 2025, Verre Wine Bar Close (esc) Let's keep in touch! Sign up now to stay up-to-date on all of our promotions, events, and wine tastings. Subscribe Age verification By clicking enter you are verifying that you are old enough to consume alcohol. Enter Search Search Main menu Home Menus Wine Club Reservations Events Calendar Private & Corporate Events Order Online Wines To Go Private Dining COVID Safety About Us Shopping Cart Your cart is currently empty. Shop now"
    },
    {
      "url": "https://6abc.com/post/philadelphias-bayou-bar-grill-labeled-commanders-friendly-owner-says-not-fast-bleed-green-here/15831516/",
      "text": "Philadelphia's Bayou Bar & Grill labeled as Commanders friendly, owner says not so fast: 'We bleed green here' - 6abc Philadelphia Breaking LIVE: Charlie Kirk is dead after being shot in Utah, Trump says 24/7 Live Philadelphia Pennsylvania New Jersey Delaware Welcome, Mickey mickey@disney.com Manage MyDisney Account Log Out Philadelphia Eagles 'We bleed green here': Manayunk bar labeled as Commanders friendly, owner says not so fast By Caroline Goggin Friday, January 24, 2025 'We bleed green here': Manayunk bar labeled as Commanders friendly, owner says not so fast PHILADELPHIA (WPVI) -- One Philadelphia bar in the city's Manayunk neighborhood is getting a little fired up after being listed as a \"Commanders bar\" on the team's website . The business in question is the Bayou Bar & Grill on Main Street, and they bleed green for the Eagles . \"At first we thought it was a joke because people started calling,\" said Joe Abruzzo, the bar's owner. \"We like bleed green here. As a matter of fact, my dad's probably rolling around in his grave thinking that they're calling a guy who's from Fairmount a Washington Redskins fan.\" READ MORE: City officials warn Eagles fans: 'Please don't climb the poles' Abruzzo says his bar was one of the first to have NFL Ticket, so they've played a lot of games there. But for him, Sundays, especially this weekends NFC Championship game , are for the Birds. \"No Commanders fans are even allowed in. As a matter of fact, don't come by. You're not allowed in,\" added Abruzzo. The loyalty in this city is never in question. But a question does remain: will the city grease the poles in anticipation of a win? \"Grease or not grease, please don't climb the poles because if you break the poles, that cost money and that's money we could spend on other things,\" said Managing Director Adam Thiel. Report a correction or typo Copyright © 2025 WPVI-TV. All Rights Reserved. Related Topics SPORTS PHILADELPHIA PHILADELPHIA EAGLES BUSINESS NFL PLAYOFFS COMMUNITY Philadelphia Eagles Jalen Carter fined $57K for spitting on Cowboys' Dak Prescott Eagles fan reunited with lost wallet thanks to worker's kindness Eagles fan falls victim to scam trying to buy tickets to home opener Sirianni: Any possible Jalen Carter discipline will remain private Watch Live ON NOW Top Stories LIVE: Charlie Kirk is dead after being shot in Utah, Trump says 11 minutes ago At least 3 critically injured in CO high school shooting: officials 10 minutes ago AccuWeather: Back in the bright Thursday 1 hour ago Iron Hill Brewery closing 3 locations in the region 30 minutes ago What to know about how to buy 2026 FIFA World Cup tickets NJ health department expands access to COVID-19 vaccines AA flight returns to PHL shortly after takeoff due to bird strike 'Recklessness': Kamala Harris turns on Joe Biden in new book Topics Home Weather Traffic Watch Photos Apps Regions Philadelphia Pennsylvania New Jersey Delaware More Content Investigation Troubleshooters Consumer Healthcheck Overheard Links from Action News Art of Aging 6abc About 6abc/Contact Us! Action News Biographies 6abc Contests & Promotions TV Listings Jobs & Internships at 6abc Community Help With An Antenna Privacy Policy Do Not Sell My Personal Information Children's Privacy Policy Your US State Privacy Rights Terms of Use Interest-Based Ads Public Inspection File FCC Applications Copyright © 2025 ABC, Inc., WPVI-TV Philadelphia. All Rights Reserved."
    },
    {
      "url": "https://verovino.com/our-story",
      "text": "About Us | The Vero Story of Connecting Passion to Discover Wines & Foods — Vero Skip to Content Open Menu Close Menu Join the VeroClub Shop Gift Wine and Food Gifts Corporate Gifting Sell Our Wines Discover Join Our Newsletter Read the Blog Get In Touch Events and Tastings Somm at Your Service Vero Producers Our Story Vero News Search Login Account 0 0 Join the VeroClub Shop Gift Wine and Food Gifts Corporate Gifting Sell Our Wines Discover Join Our Newsletter Read the Blog Get In Touch Events and Tastings Somm at Your Service Vero Producers Our Story Vero News Search Login Account 0 0 Open Menu Close Menu Join the VeroClub Shop Folder: Gift Back Wine and Food Gifts Corporate Gifting Sell Our Wines Folder: Discover Back Join Our Newsletter Read the Blog Get In Touch Events and Tastings Somm at Your Service Vero Producers Our Story Vero News Search Login Account Our Story We, at Vero, which means real , have taken the opposite approach than most wine merchants and specialty food purveyors: instead of big, we look for small; instead of ordinary, we look for obscure; we find perfection in imperfection . Vero is a farmers’ market for wine and olive oil serving consumers & business across the US: where you get to know the farmers who made each product, learn all about the cultivation and nurturing that went into a wine and olive oil, including the painstaking efforts they took to be sustainable, discover and enjoy their unique product of nature that is worth every penny. Get to know our community of small producers, businesses, and wine and food lovers where passion is the common denominator . Vero Team Sheila Donohue Founder, CEO, and Sommelier “I'm a New Yorker living in Italy for over 20 years. After becoming a sommelier and getting to know hundreds of smaller producers with great tasting authentic products, but mainly unknown around the US, I decided to start 'spreading the love' by bringing these hidden gems from anywhere in the world direct to people who want to explore and experience more out of wine, food and life. ” In this video ,  Vero founder, Sheila Donohue, reflects on her transition from a full time job in Fintech to following her entrepreneurial passion in food and wine by starting Vero. Vero seeks out artisan farmers’ small production wines and foods from around the world, where they are just a click away for wine lovers and foodies across America. Helen Gallo Bryan Vero Ambassador Emeritus - New England A big supporter of Vero, Helen Gallo Bryan sadly passed away on August 9 2024.  Here is how she described herself: “ I’m a native Bostonian who is a passionate wine professional with broad experience in sales leadership and development roles at leading wine and spirits companies, especially super-premium and luxury wines. I’m constantly working to expand my knowledge of all facets of the wine industry, especially when it comes to regenerative farming, sustainable agriculture and  the natural wine movement, and helping to educate and ‘spread the love’ of wines made by these technique s.” Burley Tuggle Vero Ambassador - New Jersey “I’m from Atlanta originally and have been living in the NY/NJ metro area for more than 25 years, which is where I cultivated a passion for wine as an extension of my love for gourmet food. I have studied every aspect of wine at top culinary schools and at prestigious wine institutions, such as the Court of Master Sommeliers and the Wine and Spirits Education Trust (Level 2 & 3 certifications). I am also the sole proprietor of the Divino Tasting Room, Eatery and Lounge in downtown Newark, NJ, and I'm involved in several business initiatives that focus on demystifying traditional wine culture and making it accessible, including my collaboration with Vero as an Ambassador.” Margie Dilivio - @TheTipsySomm Vero Ambassador - California “Currently living is Los Angeles, I’m a professional dancer turned sommelier! Not something you hear often, but during the pandemic I decided to refocus my energy into receiving my WSET Level 3 diploma. Although dance will forever be apart of me, my interest in wine has sparked a new excitement. As a second generation Italian, my passion for Italian wines has connected me to my heritage in ways that fill my soul. I’m looking forward to furthering my career in wine and meeting people that share my same love and interest.” Become a Vero Ambassador In the #VeroCommunity and Loving It! Vero Producers Antonella Manuli started La Maliosa Farm & Winery in Maremma Tuscany to bring back old traditions that were being lost for making natural wine and organic extra virgin olive oil. Along with Lorenzo Corino of Case Corini , Antonella established the Metodo Corino, a patented set of procedures for regenerative farming and creating biodynamic wine with a 00 approach, meaning nothing added except grapes. After retiring as a school teacher, Hilde Petrussa took over Vigna Petrussa from her mother in the vineyard and the cellar. She, along with her daughter Francesca, make gorgeous wines with a personal touch in the north east italian region, Friuli Venezia Giulia. Davide Castagnoli and Vincenzo Vernocchi took over Braschi estate winery , keeping to long-standing wine making traditions of Romagna, just north of Tuscany. Meet all Vero Producers Read All News and Articles Vero Food & Wine Explorers As a VeroCommunity we embrace adventure and new experiences and flavors ! Our events spread the love for all things genuine from coast to coast & country to country. Browse through our past experiences and keep an eye out for our upcoming events and join us! Chris and Vanessa at the LA Westside Food & Wine Festival are trying different types of wines they never had before. Heidi and Mr. Kevin are taking a break from an afternoon wine tasting in Sonoma wine county. Join a vero event interested in hosting your own event? Join the Vero Business Community We provide services to both businesses and consumers who appreciate craft wines and foods and the value that gets created in providing  memorable experiences. Vero Corporate Clients We believe in authenticity and passion and working with businesses, whether big or small , who share the same values as us and seek highly curated wines, foods and experiences that they can offer their own clients - such as for gifting or parties. Marco and Giulia manage high-end interior design shops and seek sparklers that you can’t find anywhere else for special client occasions. Arleen is a real estate agent who loves to entertain; she called on VeroVino to organize a sommelier-guided wine tasting for her clients. Request wine or services for client engagements Vero Shops & Restaurants When Sahar is not out-and-about wine judging, she is scouring for wines which are great tasting but also a bit unique for her wine enthusiast clientele. Brendan has a new wine shop in Brooklyn and is looking for out-of-the-ordinary, small production wines that you can’t find anywhere else. find out about our Wholesale pricing Vero Distributors and Sales People Vero is casting its net over all of the US and is seeking distributors in most states. Wine and food lovers sharing our passion who are interested in selling our products. Distribute our wines Become a vero ambassador Testimonials “Feedback from my sister is that the wines they have tasted so far was really good !!! …  this was not the average wine in stores .” - Lene Steinum “ Love this company they did a fantastic presentation to my clients for work on boutique wines and olive oils in Italy!” - Kim Beluzo “I love the wines offered at Vero and that you are committed to small producers of integrity .” - Instagram follower Vero is more than special wines; it’s the stories and so much more. “ I’m fortunate to have met [Vero Founder] Sheila.  I love the wines she is ambitiously importing, and I say that because it’s very difficult to do what she’s doing…  Sheila brings us these beautiful wines.  And if it wasn’t for her, we wouldn’t get to meet [the producers] and get to know these wines.  So, thank you, Sheila, these are very special wines. ” — Jeff Bonafede of Uncorked in Hermosa Beach in a VeroTalk. “ I met Sheila Donohue at Vinitaly’s Italian Wine Ambassador course, learned she’s importing wine from Italy with a business based out of my town of Ventura, AND she had a few BIODYNAMIC wines made by a woman making it perfect for Women’s History Month, I was sure once again I was set. ” “ Very educational. I enjoy feeling smart when I drink wine; all the information helps me learn what I like about the wine. ” “ The guests at the resort are enjoying your wine tremendously. ” Join our #VeroCommunity From our producers to clients, the VeroCommunity is all about connecting people and their passions for delicious, farm-to-glass food and wine: Get to know our producers and our products Join our events Engage with us directly by contacting us Follow us on social media @verovinogusto . Journey with us as we continue our forage for new farm-crafted wines and olive oils. Get on our newsletter and start the discovery! Sign up for our newsletter Footer Newsletter Signup Name * First Name Last Name Email * How are you interested in Vero? * I’m a fun loving wine and food explorer. I work in the wine/food industry. I’m a wine/food writer or work in media. We respect your privacy. Thank You!  You have successfully joined our subscriber list.  Use the code VERONEWSLETTER for 10% off your next order with us. Vero Would Love Your Feedback Post a review on Google Vero Offices Ventura, CA 93003 USA info@verovino.com © Copyright 2024 VeroVino, Inc. All Rights Reserved. Terms & Conditions Privacy Policy Wine Industry Pledge"
    }
  ]
}