{
  "fuentes": [
    {
      "url": "https://www.tampabay.com/news/business/tourism/the-vinoy-renaissance-st-petersburg-resort--golf-club-to-get-new-owner/2330069/",
      "email": "jgriffin@tampabay.com"
    },
    {
      "url": "https://thevinoy.com/experiences/golf-club/",
      "email": "vinoy.info@thevinoy.com"
    },
    {
      "url": "https://thevinoy.com/experiences/golf-club/",
      "email": "vinoy.info@thevinoy.com"
    },
    {
      "url": "https://thevinoy.com/",
      "email": "vinoy.info@thevinoy.com"
    },
    {
      "url": "https://thevinoy.com/",
      "email": "vinoy.info@thevinoy.com"
    },
    {
      "url": "https://www.tampabay.com/news/business/realestate/Tampa-Bay-Bucs-owner-paid-188-5-million-for-St-Pete-s-Vinoy-hotel_171513683/",
      "email": "smartin@tampabay.com"
    },
    {
      "url": "https://playbycourt.com/f/the-vinoy-club",
      "email": "ab3697c86cfee424c79bdb37a8edda90@selfhostedsentry.playbypoint.dev"
    },
    {
      "url": "https://thevinoy.com/meetings-and-events/",
      "email": "vinoy.info@thevinoy.com"
    },
    {
      "url": "https://thevinoy.com/meetings-and-events/",
      "email": "vinoy.info@thevinoy.com"
    },
    {
      "url": "https://thegolfwire.com/vinoy-resort-chris-major-gm/",
      "email": "vinoy@quinn.pr"
    },
    {
      "url": "https://www.stpetecountryclub.com/membership/",
      "email": "agrimaldi@stpetecountryclub.com"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "email": "tstuder@astrosecuritymonitoring.com"
    }
  ],
  "mails": [
    "ab3697c86cfee424c79bdb37a8edda90@selfhostedsentry.playbypoint.dev",
    "agrimaldi@stpetecountryclub.com",
    "jgriffin@tampabay.com",
    "smartin@tampabay.com",
    "tstuder@astrosecuritymonitoring.com",
    "vinoy.info@thevinoy.com",
    "vinoy@quinn.pr"
  ],
  "nombre_sitio": "vinoyclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.tampabay.com/news/business/tourism/the-vinoy-renaissance-st-petersburg-resort--golf-club-to-get-new-owner/2330069/",
      "text": "The Vinoy Renaissance St. Petersburg Resort & Golf Club to get new owner Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement Business The Vinoy Renaissance St. Petersburg Resort & Golf Club to get new owner The Vinoy Renaissance St. Petersburg Resort & Golf Club will soon have a new owner. FelCor Lodging Trust, the owner of the historic Vinoy resort in downtown St. Petersburg, is being acquired by RLJ Lodging Trust, the publicly traded real estate investment trust owned by BET founder Robert Johnson. [Tampa Bay Times photo] By Justine Griffin Times staff Published Justine Griffin Economy and Health Editor MORE FOR YOU British pub The Moon Under Water finally has a new home • Food Chassahowitzka River campground will likely stay in public hands • Environment Advertisement Dick’s Sporting Goods completes multibillion-dollar deal to acquire Foot Locker • Business Florida is threatening local transportation like never before, leaders say • Business Former Water Street CEO will now head up Tampa’s Gasworx • Real Estate Florida launches its tax break on guns and ammo Monday • The Buzz on Florida Politics Should more Florida businesses have at-work daycare and other parent perks? • Florida Property insurance companies are thriving now. Are Floridians owed a refund? • Florida A Tampa Brightline could make me a Disney adult | Column • Viewpoints Lucky Tigre has moved to a new restaurant space in Old West Tampa • Food Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    },
    {
      "url": "https://thevinoy.com/experiences/golf-club/",
      "text": "Vinoy Golf Club - The Vinoy Skip to content The Vinoy Show Menu History Accommodations Resort Amenities In – Room Amenities Children’s Amenities Dining Elliott Aster Veranda Lottie Paul’s Landing Parasol In-Room Dining Vinoy Club Grill VINOY SPA Weddings Meetings & Events Experiences Resort Pool History Tour & High Tea Seasonal Gatherings Vinoy Golf Club Fitness Tennis Marina SUNNI SPENCER The Fifth Avenue Club Resort Offers Discover More Gallery Sustainability Accolades St. Petersburg Reserve History Accommodations Resort Amenities In – Room Amenities Children’s Amenities Dining Elliott Aster Veranda Lottie Paul’s Landing Parasol In-Room Dining Vinoy Club Grill VINOY SPA Weddings Meetings & Events Experiences Resort Pool History Tour & High Tea Seasonal Gatherings Vinoy Golf Club Fitness Tennis Marina SUNNI SPENCER The Fifth Avenue Club Resort Offers Discover More Gallery Sustainability Accolades St. Petersburg Connect With Us Instagram Facebook Vinoy Golf Club Check In Check Out Rooms 1 2 3 4-9 10-25 26+ Special Rates None Military & Government AAA/CAA Senior Discount Corporate / Promo / SET# Group Make a Reservation An Incomparable Green Tee off from one of Tampa Bay’s most historic and picturesque courses, at The Vinoy Golf Club. Originally opening in 1920, and later designed by the renowned architect Ron Garl, the award-winning 18-hole championship golf course offers a delightful challenge for golfers of all skill levels. Our Facilities Reopened in 1992 and redesigned by famed architect Ron Garl, our course presents 6,626 yards of golf for a par 71. Driving Range Practice facilities Bunker and chipping area TrackMan golf simulator Rentals Clubs and shoe rentals are available year-round for men and women. Private Lessons and Tee Times Private instruction is available through PGA teaching professionals. Please contact the Vinoy golf club to schedule a lesson or tee time. Contact the Vinoy golf club directly at 727.896.8000 Hours 7 days a week 7am – Sunset Fees There is a daily range fee for resort guests not playing golf. Range balls are included with greens fees. Attire Proper attire for the driving range includes collared shirts, slacks or shorts, and golf or tennis shoes. Amenities Vinoy Club Grill Golf Pro Shop Sunset Pool Clark’s Snack Bar Exclusive Golf Offerings Escape for a weekend on the golf course with our Golf Packages at The Vinoy Resort & Golf Club, Autograph Collection. Golf Getaway Enjoy a round of golf for up to two players daily at our Ron Garl-designed, championship course two miles away from the waterfront resort. After your swing, relax at the spa, lounge by the pool or explore downtown St. Pete. Kids Play Free With our “Kids Play Free” program, kids 15 years old and younger, accompanied by a full paying adult, play free after 3 p.m. Kids’ rental clubs are free with this program. Amenities Sunset Pool Lounge and unwind while taking in the views of the beautiful grounds of the Vinoy Golf Course. Clark's Snack Bar Relax and enjoy pool side service with selections from the Vinoy Club Grill Menu. Vinoy Club Grill The perfect place to unwind after a round of golf or simply retreat, this restaurant serves a mix of American clubhouse favorites and Florida fare at the picturesque setting of our golf clubhouse. Learn More The Vinoy Club The Vinoy Club provides non-guests an opportunity to enjoy the resort’s exceptional amenities and services. Learn More Access unparalleled offers and enchanted happenings by joining our email list. Sign Up for Exclusive Offers Here Vinoy - Autograph Collection Hotels Connect With Us Instagram Facebook Contact Us The Vinoy Resort & Golf Club, Autograph Collection +1 727-894-1000 Vinoy.Info@TheVinoy.com Sign Up for Exclusive Offers Here Information Accommodations Dining Discover More Experiences Gallery Getting Here History Home Meetings & Events Resort Map Resort Offers Seasonal Gatherings Weddings Privacy Policy Terms of Use Connect With Us Instagram Facebook © 2025 The Vinoy Resort & Golf Club, Autograph Collection, 501 5th Ave NE, St. Petersburg, FL 33701 We use cookies to help us offer you the best online experience. By continuing to use our website and/or clicking OK, you agree to our use of cookies in accordance with our Privacy Policy . OK Close Close Modal Book a Room Check In Check Out Rooms 1 Room 2 Rooms 3 Rooms 4-9 Rooms 10-25 Rooms 26+ Rooms Guests 1 Guest 2 Guests 3 Guests 4 Guests 5 Guests 6 Guests 7 Guests 8 Guests Special Rates None Military & Government AAA/CAA Senior Discount Corporate / Promo / SET# Group Promo Code Check Availability"
    },
    {
      "url": "https://thevinoy.com/",
      "text": "The Vinoy - St. Petersburg, Florida Skip to content The Vinoy Show Menu History Accommodations Resort Amenities In – Room Amenities Children’s Amenities Dining Elliott Aster Veranda Lottie Paul’s Landing Parasol In-Room Dining Vinoy Club Grill VINOY SPA Weddings Meetings & Events Experiences Resort Pool History Tour & High Tea Seasonal Gatherings Vinoy Golf Club Fitness Tennis Marina SUNNI SPENCER The Fifth Avenue Club Resort Offers Discover More Gallery Sustainability Accolades St. Petersburg Reserve History Accommodations Resort Amenities In – Room Amenities Children’s Amenities Dining Elliott Aster Veranda Lottie Paul’s Landing Parasol In-Room Dining Vinoy Club Grill VINOY SPA Weddings Meetings & Events Experiences Resort Pool History Tour & High Tea Seasonal Gatherings Vinoy Golf Club Fitness Tennis Marina SUNNI SPENCER The Fifth Avenue Club Resort Offers Discover More Gallery Sustainability Accolades St. Petersburg Connect With Us Instagram Facebook Check In Check Out Rooms 1 2 3 4-9 10-25 26+ Special Rates None Military & Government AAA/CAA Senior Discount Corporate / Promo / SET# Group Make a Reservation Occupying an enviable spot along the water’s edge of downtown St. Petersburg, since 1925, this legendary hotel has been a symbol of timeless elegance, combining nuanced nostalgia with modern sophistication. Welcome to The Vinoy Resort & Golf Club. Rooms & Suites Calming hues from the marina welcome you to your own slice of waterfront bliss. Enjoy the carefree elegance of our Tampa Bay accommodations with views overlooking the shoreline and the bay. Learn More Dining at The Vinoy The Vinoy is the vibrant social hub of the St. Petersburg community, inviting guests and locals alike to share in its seven distinctive dining experiences. Relax with a crafted cocktail, marina side views, or lose yourself in a delectable meal. Learn More Vinoy Experiences The Vinoy is a haven for sophisticated pleasures and elevated experiences, offering rich itineraries full of new discoveries. Relax with a massage at the spa, tee off from our picturesque golf course, and unwind poolside with a refreshing cocktail in a private cabana. Learn More Retail at The Vinoy The Fifth Avenue Club We welcome you to experience the by-appointment personal styling, shopping and luxury fashion services of The Fifth Avenue Club St. Petersburg, located here at The Vinoy Resort & Golf Club. Learn More Sunni Spencer Shop luxury at The Vinoy. Located in the Lobby, Sunni Spencer offers a unique selection of beach travel, home, and fashion products perfectly suited for the high-end ocean-inspired lifestyle. Learn More Vinoy Spa In soothing spaces composed of marble, wood, fluted glass, and a natural color palette, indulge in holistic therapies inspired by the healing properties of the ocean, plants, and minerals. Immerse yourself in personalized wellness experiences that refresh and rejuvenate. Learn More Gatherings & Events The Vinoy has over 69,000 square feet of indoor and outdoor event space. Come celebrate your next milestone with us. Weddings A beautiful curation of timeless glamour and elevated experiences, The Vinoy features an exquisite array of spaces creating an incomparable setting for your picturesque wedding. Learn More Meetings & Events Any meeting at The Vinoy is elevated into a truly unique experience. Gather in historic spaces that seamlessly blend timeless elegance with modern technology, creating an unrivaled setting for your event. Learn More Special Occasions Create lasting memories with friends and family in venues from intimate to grand. Every detail is thoughtfully curated, ensuring an exceptional and unforgettable experience for any event. Learn More Previous Next Discover St. Pete A city rich in culture, art, and history. St. Petersburg’s vibrant downtown is steps away from The Vinoy and home to museums, galleries, restaurants, and shops. Explore the endless activities on your Gulf Coast escape. Learn More Previous Next Historic Icon From the time it opened in 1925, to its current incarnation as one of St. Petersburg’s most spectacular waterfront resorts, The Vinoy has been – and always will be – a place to relax, play, and indulge. Learn More We are pleased to share that The Vinoy is a fully cashless resort. For your convenience, all purchases may be seamlessly settled with a credit or debit card, ensuring a smooth and effortless experience throughout your stay. Follow us @vinoyresort Access unparalleled offers and enchanted happenings by joining our email list. Sign Up for Exclusive Offers Here Vinoy - Autograph Collection Hotels Connect With Us Instagram Facebook Contact Us The Vinoy Resort & Golf Club, Autograph Collection +1 727-894-1000 Vinoy.Info@TheVinoy.com Sign Up for Exclusive Offers Here Information Accommodations Dining Discover More Experiences Gallery Getting Here History Home Meetings & Events Resort Map Resort Offers Seasonal Gatherings Weddings Privacy Policy Terms of Use Connect With Us Instagram Facebook © 2025 The Vinoy Resort & Golf Club, Autograph Collection, 501 5th Ave NE, St. Petersburg, FL 33701 We use cookies to help us offer you the best online experience. By continuing to use our website and/or clicking OK, you agree to our use of cookies in accordance with our Privacy Policy . OK Close Close Modal Book a Room Check In Check Out Rooms 1 Room 2 Rooms 3 Rooms 4-9 Rooms 10-25 Rooms 26+ Rooms Guests 1 Guest 2 Guests 3 Guests 4 Guests 5 Guests 6 Guests 7 Guests 8 Guests Special Rates None Military & Government AAA/CAA Senior Discount Corporate / Promo / SET# Group Promo Code Check Availability"
    },
    {
      "url": "https://www.tampabay.com/news/business/realestate/Tampa-Bay-Bucs-owner-paid-188-5-million-for-St-Pete-s-Vinoy-hotel_171513683/",
      "text": "Tampa Bay Bucs owner paid $188.5 million for St. Pete's Vinoy hotel Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement Real Estate Tampa Bay Bucs owner paid $188.5 million for St. Pete's Vinoy hotel SCG Hospitality, whose principal is Tampa Bay Buccaneeers owner Bryan Glazer, has bought the venerable Vinoy Renaissance Resort & Golf Club in downtown St. Petersburg.  [SCOTT KEELER   |   Times] By Susan Taylor Martin Times staff Published Susan Taylor Martin Bay Magazine Correspondent MORE FOR YOU British pub The Moon Under Water finally has a new home • Food How much were the 10 most expensive reported home sales in Hernando and Citrus last week? • Real Estate Advertisement Let’s turn Florida’s vacant schools into housing for teachers | Column • Viewpoints What were the 10 most expensive homes sold in Pasco last week? • Real Estate Former Water Street CEO will now head up Tampa’s Gasworx • Real Estate $6.5 million home sells in South Tampa • Real Estate In downtown St. Petersburg, a proposed $134M tower hits height hurdles • St. Petersburg Lucky Tigre has moved to a new restaurant space in Old West Tampa • Food Jackson House Foundation selects firm to restore historic building • Tampa Manatee’s housing market becomes more ‘balanced,’ report says. What does it mean? • Real Estate Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    },
    {
      "url": "https://playbycourt.com/f/the-vinoy-club",
      "text": "The Vinoy Club (727) 894-1000 All Courts Playable Programs Professionals Login Book Now Programs Professionals Login Book Now Book Now The Vinoy Club 501 5th Ave N, St. Petersburg, FL 33701, USA (727) 894-1000 Each game, set and match is one to remember on The Vinoy Tennis Club's 10 championship HarTru green clay surface courts. Complemented by tropical surroundings, the courts are being renovated with state-of-the-art lighting for shadow-free play. Exclusive to Vinoy Club Members and Resort Guests, you’ll have access to daily morning and evening clinics, as well as private or group lessons. If you’re looking for the latest equipment, tennis fashions or even a partner match, our expert staff at the Pro Shop will gladly help you look and play your best. See more Each game, set and match is one to remember on The Vinoy Tennis Club's 10 championship HarTru green clay surface courts. Complemented by tropical surroundings, the courts are being renovated with state-of-the-art lighting for shadow-free play. Exclusive to Vinoy Club Members and Resort Guests, you’ll have access to daily morning and evening clinics, as well as private or group lessons. If you’re looking for the latest equipment, tennis fashions or even a partner match, our expert staff at the Pro Shop will gladly help you look and play your best."
    },
    {
      "url": "https://thevinoy.com/meetings-and-events/",
      "text": "Meetings & Events - The Vinoy Skip to content The Vinoy Show Menu History Accommodations Resort Amenities In – Room Amenities Children’s Amenities Dining Elliott Aster Veranda Lottie Paul’s Landing Parasol In-Room Dining Vinoy Club Grill VINOY SPA Weddings Meetings & Events Experiences Resort Pool History Tour & High Tea Seasonal Gatherings Vinoy Golf Club Fitness Tennis Marina SUNNI SPENCER The Fifth Avenue Club Resort Offers Discover More Gallery Sustainability Accolades St. Petersburg Reserve History Accommodations Resort Amenities In – Room Amenities Children’s Amenities Dining Elliott Aster Veranda Lottie Paul’s Landing Parasol In-Room Dining Vinoy Club Grill VINOY SPA Weddings Meetings & Events Experiences Resort Pool History Tour & High Tea Seasonal Gatherings Vinoy Golf Club Fitness Tennis Marina SUNNI SPENCER The Fifth Avenue Club Resort Offers Discover More Gallery Sustainability Accolades St. Petersburg Connect With Us Instagram Facebook Find Success at The Vinoy Our indoor and outdoor event spaces come with the flexibility to create memorable business gatherings, large and small. Check In Check Out Rooms 1 2 3 4-9 10-25 26+ Special Rates None Military & Government AAA/CAA Senior Discount Corporate / Promo / SET# Group Make a Reservation Meetings & Events For over a century, The Vinoy has set the stage for unforgettable gatherings, blending timeless elegance with modern sophistication. Whether hosting a grand gala beneath sparkling chandeliers, an exclusive executive summit in an intimate setting, or a large-scale corporate convention designed to inspire, every detail is elevated by The Vinoy’s legacy of excellence. Our Ballrooms The beautifully restored Vinoy Grand Ballroom combines modern aesthetics with state-of-the-art technology, creating the perfect setting for conferences and exhibitions. For large-scale gatherings, the Palm Court Ballroom can accommodate up to 1,000 guests, while our collection of versatile ballrooms offers the flexibility to host everything from intimate meetings to expansive corporate conventions. Virtual Tour Unique Outdoor Gatherings From the Marina Terrace and Tea Garden to the Bayview Terrace, Fred’s Patio, and our poolside bar and restaurant, The Vinoy offers an array of distinctive outdoor venues that capture the beauty of St. Petersburg. These one-of-a-kind spaces provide the perfect backdrop for corporate retreats, networking receptions, and open-air events, where colleagues can connect and collaborate under the Florida sky. Virtual Tour Special Events With seven distinctive on-site restaurants, groups can savor a variety of exceptional dining experiences, while a wealth of team-building activities—from golf tournaments and lawn-game challenges to mixology classes and fishing excursions—ensure engagement and camaraderie. For those seeking balance, our relaxation and wellness programs offer the perfect way to recharge, making every event not just productive, but truly memorable. Meeting Capabilities With 21 event rooms spanning nearly 75,000 square feet of versatile space, including four magnificent ballrooms, spectacular outdoor venues, and 24 breakout rooms, we can seamlessly accommodate everything from intimate groups to events of up to 1,000 guests. Paired with unrivaled expertise and world-class service, The Vinoy ensures every occasion becomes an extraordinary memory. Capacity Chart Services & Technology State-of-the-art A/V capabilities accompanied by customized services and support to make your event a success. Gather Formal and casual rooms of all sizes to accommodate your team’s needs throughout the day. Food & Beverage Catering packages for three meals a day, light bites, and corporate happy hours. Plan Your Meeting Explore all the possibilities at our Downtown St. Petersburg meeting rooms. We invite you to host an extraordinary event with us. Contact Us Access unparalleled offers and enchanted happenings by joining our email list. Sign Up for Exclusive Offers Here Vinoy - Autograph Collection Hotels Connect With Us Instagram Facebook Contact Us The Vinoy Resort & Golf Club, Autograph Collection +1 727-894-1000 Vinoy.Info@TheVinoy.com Sign Up for Exclusive Offers Here Information Accommodations Dining Discover More Experiences Gallery Getting Here History Home Meetings & Events Resort Map Resort Offers Seasonal Gatherings Weddings Privacy Policy Terms of Use Connect With Us Instagram Facebook © 2025 The Vinoy Resort & Golf Club, Autograph Collection, 501 5th Ave NE, St. Petersburg, FL 33701 We use cookies to help us offer you the best online experience. By continuing to use our website and/or clicking OK, you agree to our use of cookies in accordance with our Privacy Policy . OK Close Close Modal Book a Room Check In Check Out Rooms 1 Room 2 Rooms 3 Rooms 4-9 Rooms 10-25 Rooms 26+ Rooms Guests 1 Guest 2 Guests 3 Guests 4 Guests 5 Guests 6 Guests 7 Guests 8 Guests Special Rates None Military & Government AAA/CAA Senior Discount Corporate / Promo / SET# Group Promo Code Check Availability"
    },
    {
      "url": "https://thegolfwire.com/vinoy-resort-chris-major-gm/",
      "text": "THE VINOY RESORT AND GOLF CLUB NAMES CHRIS MAJOR AS GOLF AND CLUB OPERATIONS GENERAL MANAGER - The Golf Wire Skip to primary navigation Skip to main content Skip to primary sidebar Skip to footer Advertise â¢ Subscribe â¢ Contact The Golf Wire Covering the business of golf! MENU MENU Apparel Business Courses Equipment People Podcasts Jobs Search Close THE VINOY RESORT AND GOLF CLUB NAMES CHRIS MAJOR AS GOLF AND CLUB OPERATIONS GENERAL MANAGER May 17, 2024 Twitter Facebook Email Former General Manger of Black Diamond Ranch to Join the Iconic Florida Resort ST. PETERSBURG, FL: The Vinoy Resort and Golf Club, Autograph Collection today proudly announces the appointment of Chris Major as the new golf and club operations general manager. In his new position, Major will oversee all operations at Snell Isle, including Golf Grounds, Golf, Clarkâs Snack Bar, Vinoy Club Grill, as well as Vinoy Club, Marina, Recreation, Spa, and Tennis. With a remarkable track record of driving revenue, profit, and ensuring exceptional guest satisfaction, Major brings a wealth of experience to his new position. His leadership style emphasizes building strong, cohesive teams dedicated to achieving strategic goals. The appointment marks a renewed dedication to excellence at The Vinoy, demonstrating a steadfast commitment to unparalleled service, best in-class offerings and The Vinoyâs ongoing cultivation of top talent in the industry. Prior to joining The Vinoy, Major held key leadership positions at prestigious resorts, including Director of Golf at Marriottâs Mountain Shadows Resort in Paradise Valley, Arizona, and JW Marco Island Beach Resort. Notably, Major was promoted to Golf General Manager at JW Marco Island in 2010, where he was responsible for overseeing Club and Golf Operations with 500 golf memberships and 175 social memberships. In 2023, Major was recruited to serve as the General Manager of Black Diamond Ranch, a prestigious 1,200-acre private gated golf community in Lecanto, Florida. His leadership played a pivotal role in enhancing the overall guest experience and driving operational excellence at the esteemed property. Major eagerly anticipates rejoining the Marriott family and embarking on a new chapter at The Vinoy Resort and Golf Club. He and his wife Paige look forward to relocating to the vibrant Tampa Bay area. About The Vinoy Resort and Golf Club, Autograph Collection The Vinoy Resort and Golf Club, Autograph Collection is a classic and beloved downtown St. Petersburg landmark standing as a pillar of the community and a beacon for travelers since its New Yearâs Eve opening in 1925. Known for its signature pink faÃ§ade, Mediterranean Revival style and old-Florida hospitality, the 354-room resort recently emerged from a thoughtful renovation and rebrand, joining Autograph Collection Hotels, part of Marriott Bonvoyâs portfolio of 30 extraordinary brands The new, sophisticated aesthetic reflects The Vinoyâs timeless glamour and tips its hat to a longstanding legacy. The Vinoy is the only luxurious resort on Floridaâs west coast with a combination of elegant rooms and suites; a lush poolscape with private cabanas; an on-site marina; diverse on-site dining experiences, including a French inspired patisserie, Latin American poolside eatery, and marina-facing indoor/outdoor restaurant; an 18-hole championship golf course; a tennis complex; a brand new holistic spa and wellness center; a high-end boutique from Tampa Bay local Sunni Spencer; and over 60,000 square feet of spectacular indoor and outdoor event space â all within walking distance to diverse cultural attractions. If walls could talk, The Vinoyâs would have endless stories to share thanks to a rich history that includes hosting U.S. presidents, celebrities and athletes, and even serving as military housing in the 1940s. Media Contact QUINN PR vinoy@quinn.pr Tweet Share Pin Related Posts SRIXON CELEBRATES KEEGAN BRADLEYâS CAPTAINCY WITH SIGNATU... SUPERSTROKE RELEASES LIMITED-EDITION PAC-MAN PUTTER GRIP ... INRANGE EXPANDS INTO BENELUX Primary Sidebar Search Footer THE GOLF WIRE Facebook Instagram Twitter FAQ | Privacy Policy |   Turnstile Media Group Â© 2025, All rights reserved. Sign Up For Free Notice: JavaScript is required for this content. Join us to receive the Wire with the latest golf industry Â news, product announcements, media interactions, golf travel deals and fashion releases. ×"
    },
    {
      "url": "https://www.stpetecountryclub.com/membership/",
      "text": "Membership - St. Petersburg Country Club Skip to main content facebook youtube instagram Menu Membership Membership Tampa Bay Community Golf Golf Pro Shop & Lessons Golf Professional Staff Golf Tournament Calendar League Play Registration New Year’s Invitational Home of the 98th New Year’s Invitational Rich In History Skip Alexander Pool & Fitness Swim Team Racquet Membership Kids Programs Kids Class Swim Team Swim Lessons Events Members Member Services Daily Menu Contact Contact Us Management Directions Press enter to begin your search Search Close Search OUR MEMBERSHIPS CURRENT MEMBERSHIPS OFFERED GOLF RACQUET SOCIAL Year Round Golf Membership We welcome you to learn more about our Golf Membership. Please call us for rates and details. If you would like to schedule a tour at the club, please call our membership office to set up an appointment on weekdays at your convenience. Thank you for your interest in membership at St. Petersburg Country Club. Unlimited Golf with No Green Fees Full Tennis Access Swimming Pool Fitness Center Clubhouse Privileges Reciprocal Social and Dining Access at a Local Private Yacht Club APPLY NOW Full Golf This membership category is available to those that qualify at 45 years of age and above. It provides access to golf, tennis, swimming, fitness, dining, and clubhouse privileges throughout the year. Single and family memberships are available. Please note that family memberships are extended to one’s spouse and dependent children under the age of 25 living at home. The membership must be in the name of the senior spouse. Intermediate Golf One would quality for entry into this category at age 44 or younger. Privileges include access to golf, tennis, swimming, fitness, dining, and clubhouse privileges throughout the year. Single and family memberships are available. An intermediate members will pay into a full golf initiation cost when they age up into the next category. Taxes will apply to initiation and monthly dues. Annual driving range fees apply. YEAR ROUND TENNIS MEMBERSHIP Unlimited tennis access on our 9 Har-Tru courts Unlimited Pickleball access on our 6 new courts Weekly Clinics Golf privileges once monthly at guest rate Clubhouse Privileges Dining Privileges Swimming Pool Access Initiation Fee Full Racquet: $1000 CONTACT US SINGLE MONTHLY DUES Full Single Tennis: $185 FAMILY MONTHLY DUES Full Family Tennis: $225 $600 Annual Food and Beverage Minimum INFORMATION YEAR ROUND SOCIAL MEMBERSHIP Clubhouse Privileges Social and Dining Privileges Swimming Pool Access Golf and Tennis once monthly at the Prevailing Guest Rate Initiation Fee Social Initiation: $500 CONTACT US MONTHLY DUES Social Monthly: $125 $600 Annual Food and Beverage Minimum All social memberships are extended to spouse and dependent children under 25 years of age that are living at home. Fitness center, and Tampa Bay Community access may be added individually to tennis and social memberships. Please note that Social Membership does not provide access to our practice golf and tennis facilities. CONTACT US FOR MORE INFORMATION OR A TOUR OF OUR FACILITIES Ashley Grimaldi SPCC Membership Director 727-867-2111 extension 317 Click Here for Membership Inquiries Email St. Petersburg Country Club 2000 COUNTRY CLUB WAY S ST. PETERSBURG, FL 33712 (727) 867-2111 FRONT DESK (727) 867-2111 PRO SHOP (727) 864-1595 © 2025 St. Petersburg Country Club. twitter facebook instagram Close Menu Membership Membership Tampa Bay Community Golf Golf Pro Shop & Lessons Golf Professional Staff Golf Tournament Calendar League Play Registration New Year’s Invitational Home of the 98th New Year’s Invitational Rich In History Skip Alexander Pool & Fitness Swim Team Racquet Membership Kids Programs Kids Class Swim Team Swim Lessons Events Members Member Services Daily Menu Contact Contact Us Management Directions facebook youtube instagram"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "text": "Contact | Reach Us Today — Astro Security Monitoring 0 Skip to Content Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu About Services Videos Contact PAY INVOICE Get in Touch Looking to schedule a service call or an estimate, call or email Troy at: (916) 252-9121 tstuder@astrosecuritymonitoring.com or fill out the form below. Name * First Name Last Name Phone * (###) ### #### Email * Message * Thank you! Astro Security Monitoring 4799 24th Street Sacramento , CA 95822 Sales & Service (916) 252-9121 tstuder@astrosecuritymonitoring.com To Cancel an Alarm Activation Call: (888) 610-4366 The monitoring center is available 24 hrs a day 365 days a year! Make sure you have your account # ready. ACO License 5779 & Contractors License C7 804676"
    }
  ]
}