{
  "fuentes": [
    {
      "url": "https://www.news4jax.com/news/local/2022/08/31/save-the-dates-vintage-market-days-coming-to-clay-county-in-december/",
      "email": "cluter@wjxt.com"
    },
    {
      "url": "https://jacksonville.beyondthenest.com/content/vintage-market-days-presents-let-good-times-roll",
      "email": "jacksonville@vintagemarketdays.com"
    },
    {
      "url": "https://jacksonville.beyondthenest.com/content/vintage-market-days-presents-let-good-times-roll",
      "email": "mindy@kidsoutandabout.com"
    },
    {
      "url": "https://www.groupon.com/biz/fruit-cove-fl/vintage-market-days-of-jacksonville",
      "email": "verify@r.groupon.com"
    },
    {
      "url": "https://www.seattlelocalmarkets.com/team",
      "email": "info@seattlelocalmarkets.com"
    },
    {
      "url": "https://www.jacksonville.com/story/news/2010/03/05/riverside-arts-market-tries-to-build-on-success/15954519007/",
      "email": "charlie.patton@jacksonville.com"
    },
    {
      "url": "http://rustedavintagemarket.com/who-we-are/",
      "email": "info@rustedavintagemarket.com"
    }
  ],
  "mails": [
    "charlie.patton@jacksonville.com",
    "cluter@wjxt.com",
    "info@rustedavintagemarket.com",
    "info@seattlelocalmarkets.com",
    "jacksonville@vintagemarketdays.com",
    "mindy@kidsoutandabout.com",
    "verify@r.groupon.com"
  ],
  "nombre_sitio": "vintagemarketdays.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.news4jax.com/news/local/2022/08/31/save-the-dates-vintage-market-days-coming-to-clay-county-in-december/",
      "text": "Save the dates! Vintage market days coming to Clay County in December Skip to main content Open Main Menu Navigation Open Search Partly Cloudy icon 83 º Go to the WJXT homepage Join Insider Sign In Open the WJXT News4JAX Help Desk Search News Watch Live Local News Florida Georgia National Politics & Power Politics I-Team Trust Index Community Health Money Education Consumer Entertainment Weird News Weather Weather News Traffic SnapJAX Skycams Alerts Hurricanes Plan and Prepare Georgia St. Augustine Environment Forecasting Change News4JAX+ Watch Live News4JAX Insider How To Watch News4JAX+ Download News4JAX Apps The Morning Show River City Live Podcasts This Week In Jacksonville Business Edition NEXTGEN TV TV Listings Florida Justice Sports Sports Videos Jaguars Jaguars Stats News4JAGS Podcast Gators Breakdown Gators Stats High School Sports Varsity 4 Going Ringside Podcast V4rsity Podcast All Star Athlete Olympics Features News4JAX Insider JAXBest Florida Justice 4 Your Neighborhood Events Calendar Positively JAX River City Live News4JAX+ Look Local Travel Voices of the 904 Jacksonville Image Awards Food & Recipes Live Healthy Contests & Rules Talking Health Pets uSay Voting Branded Content River City Live Watch River City Live River City+ Eats & Treats Beats Wellness Local Spotlight Pets Shopping SnapJAX SnapJAX Stories Breaking News Photos Weather Photos Newsletters Sign Up For Newsletters WJXT Contact Us Help Center Careers at WJXT/WCWJ SnapJAX Meet the Team Advertise with us CW17 CW Program Guide Bounce News Weather News4JAX+ Sports Features River City Live SnapJAX Newsletters WJXT CW17 News Weather News4JAX+ Sports Features River City Live SnapJAX Newsletters WJXT CW17 BREAKING NEWS BREAKING NEWS The Latest: FBI releases photos of a person of interest in Kirk assassination Select breaking news story 1 of 2 Select breaking news story 2 of 2 Show Breaking News Bar Close Local News Carianne Luter , Digital Media & Engagement Manager Kara Pound , Old City Public Relations Published: August 31, 2022 at 12:55 PM Tags: December , Vintage market , events , Clay County , Green Cove Springs Sign up for our Newsletters Sign Up LATEST NEWS Jacksonville’s most vulnerable forced to choose between affordable rent and safe living conditions 15 minutes ago ‘Slumlord problem’: Jacksonville’s most vulnerable forced to choose between affordable rent and safe living conditions Read full article: ‘Slumlord problem’: Jacksonville’s most vulnerable forced to choose between affordable rent and safe living conditions File photo 11 minutes ago JSO joins other Northeast Florida agencies in instructing officers not to enforce open carry ban Read full article: JSO joins other Northeast Florida agencies in instructing officers not to enforce open carry ban MORNING LOWS 43 minutes ago Fall-Like Temperatures Arrive as Coastal Flooding Persists Read full article: Fall-Like Temperatures Arrive as Coastal Flooding Persists NHC FORECAST 57 minutes ago Tracking a Tropical Wave for possible development Read full article: Tracking a Tropical Wave for possible development Recommended Videos Local News Save the dates! Vintage market days coming to Clay County in December Events to feature antique dealers, vintage-inspired artisans, local artists and more Carianne Luter , Digital Media & Engagement Manager Kara Pound , Old City Public Relations Published: August 31, 2022 at 12:55 PM Tags: December , Vintage market , events , Clay County , Green Cove Springs Vintage market in Clay County (YANITZA NINETT ,  YANITZA NINETT PHOTOGRAPHY) CLAY COUNTY, Fla. – Just in time for holiday shopping, Vintage Market Days Jacksonville is coming to our area! The three-day event will bring more than 120 unique, vintage-inspired vendors to one place. Shoppers will be able to purchase anything from homemade candles and home décor to vintage furniture, original artwork, clothing, and much more. Recommended Videos The events will be held Friday, Dec. 2 through Sunday, Dec. 4 at the Clay County Fairgrounds in Green Cove Springs. “Just over six years ago, I was a healthcare director in Richmond, Indiana and recently diagnosed with breast cancer,” explained Tonya Ross, the owner of Vintage Market Days (VMD) Jacksonville, a franchise under the VMD umbrella. “I was sitting in chemo treatment and saw an article about Vintage Market Days. I didn’t hesitate and joined VMD in 2016. A year ago, I moved to St. Augustine and now manage the Jacksonville and Dayton-Cincinnati markets. Sometimes we endure hardships to find the direction our life is supposed to take.” The events will provide a special holiday time shopping experience complete with visits from Santa Claus! The three-day event will provide a special holiday time shopping experience complete with visits from Santa Claus! Dates and times: Friday, Dec. 2 from 10 a.m. to 4 p.m., Saturday, Dec. 3 from 10 a.m. to 4 p.m., and Sunday, Dec. 4 from 10 a.m. to 4 p.m. Admission: Children under 12 will get in free. Cash and credit cards are accepted at the gate. Once purchased, tickets are good for re-entry into the event all weekend. Learn more about early shopping opportunities and ticket purchases here. “There will also be live music, food trucks and more family-friendly attractions on-hand at this year’s market,” said Ross. “It’s a fun community event that really showcases the talented artisans and makers this region has to offer. We can’t wait to see everyone there!” Click here for more information. Vintage Market Days Jacksonville presents \"Celebrate With Us\" December 2-4 Copyright 2022 by WJXT News4JAX - All rights reserved. About the Authors Carianne Luter headshot Carianne Luter email facebook twitter instagram Click here to take a moment and familiarize yourself with our Community Guidelines. Loading... Recommended Videos BACK TO TOP TV Listings Email Newsletters RSS Feeds Contests and Rules Contact Us Careers at WJXT / WCWJ Closed Captioning / Audio Description WJXT Public File WJXT EEO Report WCWJ Public File WCWJ EEO Report Terms of Use Privacy Policy Do Not Sell My Info FCC Applications Cookie Preferences Follow Us Visit our YouTube page (opens in a new tab) Visit our Facebook page (opens in a new tab) Visit our Instagram page (opens in a new tab) Visit our X page (opens in a new tab) Visit our RSS Feed page (opens in a new tab) Get Results With Omne If you need help with the Public File, call (904) 393-9801 At WJXT, we are committed to informing and delighting our audience. In our commitment to covering our communities with innovation and excellence, we incorporate Artificial Intelligence (AI) technologies to enhance our news gathering, reporting, and presentation processes. Read our article to see how we are using Artificial Intelligence. Copyright © 2025 News4JAX.com is managed by Graham Digital and published by Graham Media Group, a division of Graham Holdings."
    },
    {
      "url": "https://jacksonville.beyondthenest.com/content/vintage-market-days-presents-let-good-times-roll",
      "text": "Vintage Market Days presents \"Let the Good Times Roll\" | What’s happening in Jacksonville Home Change Region FOR ORGANIZATIONS Secondary menu Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout Jacksonville's online guide to arts, culture, & recreation! Menu Home Do Today's events Events this weekend Events next weekend Free events Free events this weekend Free events next weekend Take a Class Take a Hike See Theater Concerts Festivals Exhibits Museums Farms & agri-tourism Vineyards / Wineries / Breweries Learn Hands-On Classes Visual Arts Classes Performing Arts Classes Sports & Fitness classes Classes that make you think Dine Restaurants Vineyards / Wineries / Breweries Dairy / Creamery Shop Food & Beverages Clothing & Shoes Home & Garden Gifts, Jewelry, & Accessories Travel Local Travel & Day Trips 8 Tips for Picking a Cruise Multigenerational travel reviews Family Top 20 Places to Take Kids in Jacksonville Check out our sister site KidsOutAndAbout.com Resources & Reviews 101 Day Trips from Jacksonville Lifestyle articles Sign Up! Advertise in our e-newsletter Search form Search Secondary menu 101 Family Day Trips Around Jacksonville Farmers Markets Festivals in the Jacksonville area Vintage Market Days presents \"Let the Good Times Roll\" *The event has already taken place on this date: Sun, 05/05/2024 Vintage Market Days is an upscale vintage-inspired market featuring original art, antiques, clothing, jewelry, handmade treasures, home décor, outdoor furnishings consumable yummies, seasonal plantings and a little more. The Market is a three day event held several times a year in various communities. Each Vintage Market Days event is a unique opportunity for vendors to display their talents and passions in different venues throughout the country. The Market will also provide the customer with a very special shopping experience.  We absolutely love the thought of bringing the Vintage experience to both vendors and customers throughout the country! Please help us keep this calendar up to date! If this activity is sold out, canceled, or otherwise needs alteration, email mindy@kidsoutandabout.com so we can update it immediately. If you have a question about the activity itself, please contact the organization administrator listed below. Event Hours & Admissions Friday, May 3, 2024 Early Buying Event 10:00 am to 4:00 pm Saturday, May 4, 2024 General Admission 10:00 am to 4:00 pm Sunday, May 5, 2024 General Admission 10:00 am to 4:00 pm Admission for children under 12 is free. Cash and credit card are accepted at the gate. Once purchased, your ticket is good for re-entry into the event all weekend. *Times, dates, and prices of any activity posted to our calendars are subject to change. Please be sure to click through directly to the organization’s website to verify. Organization: Vintage Market Days of Jacksonville Location: 2497 Florida-16 W Clay County Fairgrounds Green Cove Springs , FL , 32043 United States See map: Google Maps Phone: (765) 576-0042 Contact name: . Email address: jacksonville@vintagemarketdays.com Click for more information The event has already taken place on this date: 05/05/2024 Time: 10AM - 4PM Price: $5 - $15 USD Ages All Ages Adults & kids together Adults without kids Tags: Event Craft sale / bazaar Food event Outdoors Event Concert Outdoors Web Service Pinterest Share on Facebook Tweet Widget Featured in Jacksonville Celebrating local experiences across North America To provide parents with all of the information they need to help them and their kids get \"out and about\" to fantastic opportunities for fun, education, and cultural enrichment in our area. To celebrate and share information on the many splendid artistic, cultural and recreational activities available to residents of cities across the US and Canada. How to post - organization listing (it's free!) Create an organization User ID / account Log in - organizations Create a parent bulletin board User ID COVID-19 Policies Editorial submissions Advertising Contact Us Request for takedown of images About Us Contact Us Advertising locally on KOAA Privacy Policy Terms of Service © Copyright 2018 EntertainmentCalendar.com. All rights reserved. Terms of Service Privacy Policy Contact Us Home Do Today's events Events this weekend Events next weekend Free events Free events this weekend Free events next weekend Take a Class Take a Hike See Theater Concerts Festivals Exhibits Museums Farms & agri-tourism Vineyards / Wineries / Breweries Learn Hands-On Classes Visual Arts Classes Performing Arts Classes Sports & Fitness classes Classes that make you think Dine Restaurants Vineyards / Wineries / Breweries Dairy / Creamery Shop Food & Beverages Clothing & Shoes Home & Garden Gifts, Jewelry, & Accessories Travel Local Travel & Day Trips 8 Tips for Picking a Cruise Multigenerational travel reviews Family Top 20 Places to Take Kids in Jacksonville Check out our sister site KidsOutAndAbout.com Resources & Reviews 101 Day Trips from Jacksonville Lifestyle articles Sign Up! Advertise in our e-newsletter Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout"
    },
    {
      "url": "https://www.groupon.com/biz/fruit-cove-fl/vintage-market-days-of-jacksonville",
      "text": "Vintage Market Days of Jacksonville, 2497 Florida 16, Green Cove Springs, FL - Groupon The Great Savings Event. Use code: SAVENOW & save up to 30%. Shop Now! Download our app for exclusive deals Sell on Groupon English Chicago Sign In Beauty & Spas Beauty & Spas Massage Hair Removal Face & Skin Care Cosmetic Procedures Spas Hair & Styling Health & Fitness Weight Loss Nail Salons Dental Brows & Lashes Tanning Beauty & Spas Things To Do Things To Do Fun & Leisure Tickets & Events Kids Activities Sightseeing & Tours Sports & Outdoors Museums & Galleries Photography Amusement Parks Bowling Trampoline & Bounce Houses Boat Tours Classes Escape Games Arcades Things To Do Auto & Home Auto & Home Oil Change Auto Repair & Maintenance Car Wash Parking Home Services Cleaning Services Bedding Furniture Patio, Lawn & Garden Kitchen & Dining Auto & Home Food & Drink Food & Drink Restaurants Cafes & Treats Bakeries Bars Breweries, Wineries & Distilleries Groceries & Markets American Restaurants Asian Restaurants Latin American Restaurants Pizza Seafood Restaurants Steakhouse Food & Drink Gifts Gifts Recipient For Her For Him For Couples For Kids Occasion Birthday Anniversary Wedding Graduation Interest Foodies Relaxing Care Sports Fun Leisure Housewarming Travelers Learning Price Under $10 Under $20 Under $50 Under $100 $100+ More Trending gifts Personalized gifts Flowers, Sweets & Baskets Gift cards Gifts Local Local Beauty & Spas Personal Services Health & Fitness Retail Things To Do Food & Drink Auto & Home Improvement Home Services Gift Cards Local Travel Travel Air-Inclusive Waterparks Casinos Family Romantic Beach Destinations City Outdoor Activities All-Inclusive Cruises Culinary Luxury Spa & Wellness Unique Lodging Travel Goods Goods Health & Beauty Products Fragrance Hair Care Vitamins & Supplements Sexual Wellness Personal Care Skin Care Oral Care Health Care Cosmetics Bath & Body Men's Health & Beauty Massage Aromatherapy Shaving & Grooming For the Home Bedding Furniture Kitchen & Dining Luggage Outdoor Décor Patio, Lawn & Garden Mattresses & Accessories Storage & Organization Bath Home Appliances Floor Care & Cleaning Home Decor Office & School Supplies Seasonal Decor Women's Fashion Women's Clothing Women's Accessories Intimates Women's Shoes Maternity Clothing Personalized Gifts Photo Books Cards, Invitations & Stationery Canvas & Photo Art Custom Gifts & Gadgets Jewelry Clothing & Accessories Home Decor Kitchen Accessories Baby & Kids Pets Bags More Flowers, Sweets & Baskets CBD Cell Phones & Accessories Software Electronics Video Games Jewelry & Watches Men's Fashion Grocery & Household Auto & Home Improvement Sports & Outdoors Pet Supplies Baby & Kids Toys Goods Coupons Coupons Popular Brands Amazon Costco eBay Expedia Great Clips Hotels.com Macy's Nike Pizza Hut The Home Depot TurboTax Viator VistaPrint Walmart Wayfair Trending Betterhelp Booking.com Budget Cabela's Dick's Sporting Goods HBO Max Macy's Old Navy Paramount+ ProFlowers Sam's Club Shutterfly Sunglass Hut TaxSlayer Wayfair Coupons Blog Best 4th of July Sales & Promo Codes Sephora Sales Calendar 2024 Hobby Lobby 2024 Sales Calendar Amazon Prime Day Deals on July 16 & 17 Amazon Prime Discount: Do You Qualify? Amazon Music Unlimited Free 3-Month Trial Ulta 2024 Sales Calendar Back to School: Shop Tax-Free Weekends Nike Factory Outlet Stores Lowe's 2024 Sales Calendar Home Depot 2024 Seasonal Sales Guide Nordstrom Anniversary Sale Calendar Walmart Vision Center Price Guide Cheapest Diaper Deals this Week Macy's 2024 Sales Calendar Coupons Home Vintage Market Days of Jacksonville, Green Cove Springs Vintage Market Days of Jacksonville, Green Cove Springs 2497 Florida 16, Green Cove Springs, FL 32043 Deals at this location No deals are currently available at this location. This merchant doesn't have any deals and is not affiliated with Groupon. Please contact them directly for services. Is this your business? Similar deals Book Online Trans-Siberian Orchestra - The Ghosts Of Christmas Eve Trans-Siberian Orchestra 6920 North Mannheim Road, Schiller Park 14.4 mi $50 /tk Keller's Farmstand Weekend Activity Wristbands at Keller's Farmstand 2500 Johnson Rd., Oswego 39.4 mi $31.90 $24 -25% $19.20 Sign in to apply discount 4.7 (4,667) Book Online Chicago White Sox 2025 Chicago White Sox - Up to 60% Off 333 West 35th Street, Chicago 3.5 mi $28.13 $11.20 /tk -60% Book Online WNDR Museum Chicago Admission to the Immersive Art Experience at WNDR Museum Chicago 1130 West Monroe Street, Chicago 1.6 mi $28.99 4.4 (23) American Aid Society of German Descendants Oktoberfest Celebration at American Aid Society of German Descendants 259 West Grand Avenue, Lake Villa 44.0 mi $33 $22 -33% 4.8 (723) AMC Theatres ( 443 Locations ) AMC: Yellow Tickets & Snacks – Experience big-screen magic Anytime! 1820 Town Center Boulevard, Fleming Island 878.0 mi $19.49 $12.82 -34% $12.18 Sign in to apply discount 4.7 (4,408) Six Flags Great America EXCLUSIVE: Six Flags Great America - Up to 43% Off 1 Great America Pkwy, Gurnee 37.5 mi $114.11 $64.99 -43% Book Online Universal Orlando Resort Universal Orlando Resort: Save Big on Tickets - Buy Now! Southwest Orlando, Orlando 988.7 mi $273.99 $268.99 -2% Medieval Torture Museum Explore the Medieval Torture Museum with the Admission Tickets 177 North State Street, Chicago 0.4 mi $45.07 $36.27 -20% 4.7 (636) How to reach us © MapTiler © OpenStreetMap contributors Vintage Market Days of Jacksonville 884.9 mi 2497 Florida 16, Green Cove Springs, FL 32043 Closed Directions About Vintage Market Days of Jacksonville Vintage Market Days organizers Amy Scott and Dianna Brown discovered an interest in vintage bazaars at a young age. As a child, Dianna frequented neighborhood garage sales to find items that she repurposed into decorations for her \"pretend house.\" Meanwhile, Amy visited the Tulsa Flea Market with her mother and great-aunt, who collected Depression glassware and helped her start her own vintage collections. As adults, Amy and Dianna organize upscale vintage events several times a year at indoor and outdoor locations throughout Oklahoma. In turn, franchisees have brought these shopping extravaganzas to at least eight other states. Shoppers can examine architectural salvage, peruse vintage home-decor items, or drape themselves in clothing and jewelry from yesteryear so they won't stand out as a tourist on time-traveling trips. And to complement the vintage wares, vendors also sell original art and handmade jewelry. Customer Reviews 100% Verified Reviews All Groupon reviews are from people who have redeemed deals with this merchant. Review requests are sent by email to customers who purchased the deal. | | | | | | Trending in Groupon Groupon is your place for savings and discovery while exploring fun activities in your city and around the country. Explore categories Popular Things Nearby Things To Do In Popular Cities By Cities Coupons and Promo Codes Beauty & Spas Deep Tissue Massage Near You Full Body Massage Near You Teeth Cleaning Near You Lash Extensions Near You Keratin Treatment Near You Reflexology Near You Eyebrow Threading Near You Brazilian Wax Near You Pedicure Near You Day Spa Near You Lip Fillers Near You Tanning Near You Massage Near You Laser Hair Removal Near You Nail Salon Near You Couples Massage Near You Salon Near You Barber Shops Near You Hair Salons Near You Spa Near You Haircut Near You Botox Near You Facials Near You Waxing Near You Food & Drink Food Near You American Restaurants Near You Bars Near You Chinese Food Near You Indian Food Near You Italian Restaurants Near You Mexican Food Near You Pizza Near You Steakhouses Near You Sushi Near You Things To Do Fun Activities Near You Cheap Movie Tickets Events Near You Photography Classes Near You Kids Shows Near You Cheap Concert Tickets Things to Do Near You Amusement Parks Near You Arcade Near You Bowling Near You Escape Room Near You Kids Activities Near You Mini Golf Near You Museums Near You Trampoline Park Near You Zoos Near You Health & Fitness Eye Exam Near You Dentist Near You Teeth Whitening Near You B12 Shots Near You Pilates Near You Chiropractor Near You Dance Classes Near You Dermatologist Near You Fitness Classes Near You Colon Cleanse Near You Invisalign Near You Golf Near You Gyms Near You Weight Loss Clinic Near You Yoga Near You Automotive Oil Change Near You Car Detailing Near You Car Wash Near You Mechanic Near You Wheel Alignment Near You Personal Services Classes Near You Hobbies Near You Cooking Classes Near You Photographers Near You Home Services Air Duct Clening Near You Carpet Cleaning Near You Things To Do In Atlanta Things To Do In Austin Things To Do In Baltimore Things To Do In Boston Things To Do In Calgary Things To Do In Charleston Things To Do In Charlotte Things To Do In Chicago Things To Do In Dallas Things To Do In Denver Things To Do In Edmonton Things To Do In Houston Things To Do In Las Vegas Things To Do In Los Angeles Things To Do In Miami Things To Do In New York City Things To Do In Orlando Things To Do In Ottawa Things To Do In Philadelphia Things To Do In Phoenix Things To Do In Portland Things To Do In San Antonio Things To Do In San Diego Things To Do In San Francisco Things To Do In San Jose Things To Do In Seattle Things To Do In Tampa Things To Do In Toronto Things To Do In Vancouver Things To Do In Washington D.C. Things To Do In Indianapolis Atlanta Austin Baltimore Boston Calgary Charleston Charlotte Chicago Dallas Denver Edmonton Houston Las Vegas Los Angeles Miami New York City Orlando Ottawa Philadelphia Phoenix Portland San Antonio San Diego San Francisco San Jose Seattle Tampa Toronto Vancouver Washington D.C. 1-800-Flowers Coupons Adidas Promo Codes Amazon Promo Codes American Eagle Promo Codes Ancestry DNA Coupons ASOS Promo Codes Bed Bath & Beyond Coupons Boohoo Promo Codes eBay Coupons Edible Arrangements Coupons Forever 21 Coupons H&R Block Coupons Home Depot Coupons Kohl's Coupons L.L.Bean Coupons Lowe's Coupons Macy's Coupons Michaels Coupons Old Navy Coupons Quickbooks Coupons Samsung Coupons Sephora Coupons Target Coupons TJ Maxx Coupons Turbotax Service Codes Udemy Coupons Verizon Wireless Promo Codes Walmart Coupons Weight Watchers Coupons Zales Promo Codes Get the Groupon App Unlock up to 90% discounts on the go with the Groupon app! Exclusive deals, push notifications, and digital vouchers at your fingertips. Get the App 100M+ downloads Groupon Sites USA United Kingdom France Deutschland Italia España Polska Nederland Ireland UAE België Canada Australia Sign up for the latest deals By subscribing, I agree to the Terms of Use and have read the Privacy Statement . Follow Us Support Customer Support Report Infringement Refund Policies Merchant Class Action Settlement Notice Sell on Groupon Join Groupon Marketplace Run a Groupon Campaign How does Groupon work for Merchants Sponsor your Campaign Affiliate Program Vendor Code of Conduct Company About Groupon Jobs Press Investor Relations Management Team Quick Links Treat Yourself Things To Do Coupons Gifts for Occasions © 2025 Groupon, Inc. All Rights Reserved. Terms and Conditions Privacy Statement Do Not Sell or Share My Personal Information Accessibility Sitemap Customer Support Licenses"
    },
    {
      "url": "https://www.seattlelocalmarkets.com/team",
      "text": "Team — Seattle Local Markets 0 Skip to Content Home Vend With Us Team Vendor Hub Booth Pricing Market Sign Up Vendor FAQ + Market Venues Login Account Open Menu Close Menu Open Menu Close Menu Home Vend With Us Team Vendor Hub Booth Pricing Market Sign Up Vendor FAQ + Market Venues Login Account Home Vend With Us Team Folder: Vendor Hub Back Booth Pricing Market Sign Up Vendor FAQ + Market Venues Login Account Seattle Local Markets Team Jamie Hoffman he/him Owner, Founder, Fremont Vintage Mall Kail Azadi she/her Flea Market Manager & Social Media John Weaver he/him Warehouse Manager Laura Weaver she/her Social Media & Website Design Sign up for the Flea-Mail! Sign up with your email address to receive news and updates. We send newsletters maximum bi-monthly! Email Address Sign Up Thank you! Seattle Local Markets 4257 24th Ave W, Seattle WA 98199 info@seattlelocalmarkets.com Shoutout @lifewithhxi on IG for the website photos. Featuring snapshots of our lovely vendors @PassengerPoet, @ErinMurphyCeramics & @HighBridgeCollection210"
    },
    {
      "url": "https://www.jacksonville.com/story/news/2010/03/05/riverside-arts-market-tries-to-build-on-success/15954519007/",
      "text": "Riverside Arts Market tries to build on success News Sports Entertainment Lifestyle Opinion Advertise Obituaries eNewspaper Legals NEWS Riverside Arts Market tries to build on success After a big first year, organizers are looking for how to improve. Charlie Patton When the Riverside Arts Market opened for business last April 4, everybody was amazed as an estimated 40,000 people came together under the Fuller Warren Bridge. \"It was pretty stunning,\" said Tony Allegretti, the market's executive director. He called the success a \"perfect storm\" of talent, a great riverfront venue and free admission. Equally surprising to many was that people kept coming every Saturday for nine months. More than half-a-million people - an average of 15,000 a week - visited during the 38 weeks of operation, he estimated. Now the question people are asking is: Will those crowds be back when the market reopens Saturday after a two-month hiatus? Plenty of effort is going into accomplishing that. For one thing, the market has become much more selective about which vendors it will accept, Allegretti said. The emphasis is on local handmade arts and crafts when choosing who can rent the 158 vendor booths, about 100 of which will be occupied by artists. \"The art committee has been very stringent,\" Allegretti said. Meanwhile, Wayne Wood, a member of the market's steering committee, has planned what he calls the world's Shortest Big Parade to open Saturday's market. Wood promises the parade will include jugglers, clowns, belly dancers, dogs in costume and the Raines High School marching band. City Councilman Michael Corrigan will be grand marshal. The parade will arrive in the market shortly after 10 a.m. Visitors will find a mix of vendors, as well as an assortment of street entertainers. There will be traditional artists like Gloria Danvers, who returns for a second year selling handmade jewelry. \"It's a first-class venue,\" she said. \"It was perfectly planned.\" About 40 vendors will be selling food products. \"The thing that's so exciting is the move toward buying local,\" said Jay Burnett, owner of Bold Bean Coffee Roasters, who is also a returning vendor. \"... You get to know the people who are producing your food.\" There also will be a new section known as the Fringe. Among the off-beat vendors Allegretti has lined up are surfboard shapers, a bicycle-maker and a man who builds made-to-order stereos. The Jacksonville Public Library's Zine collection will be featured in the Fringe section. A year ago, the nearby Cummer Museum supported the market but didn't really appreciate the impact it would have, said Hope McMath, the Cummer's executive director. This year, the Cummer is not only actively involved in the market but plans to take advantage of the presence of so many art lovers in the neighborhood, she said. Directional signs will be placed prominently so visitors are aware the Cummer is just a block away. Meanwhile, Cummer reps will be in the crowd, handing out coupons good for $4 off the $10 admission fee to the museum. The market's success has been \"really thrilling,\" McMath said. \"It's made the arts accessible for everyone ... It breaks down the elitist barrier around art.\" The market makes money off booth rentals and sponsorships, Allegretti said. Last year it had a $250,000 budget and finished the year with a $40,000 net profit. As a result, they've lowered booth rentals slightly this year, he said. charlie.patton@jacksonville.com, (904) 359-4413 Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Promote your Event Buy and Sell Licensing & Reprints Legal Notices Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Facebook X Instagram eNewspaper NIE Jobs Real Estate Classifieds Pay Your Ad Bill Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.jacksonville.com. All rights reserved."
    },
    {
      "url": "http://rustedavintagemarket.com/who-we-are/",
      "text": "About Us — Rusted a Vintage Market (904) 398-1523 info@rustedavintagemarket.com Facebook Instagram Facebook Instagram About Us Contact Us Select Page About Us Learn more about Rusted A Vintage Market. Rusted: A Vintage Market came about when a group of people got together to sell old things.  As time has progressed, we at Rusted have become friends and in many ways function as a large family. We genuinely care for one another and try to work as one unit.  Each vendor brings their own particular style to our vintage store.  We enjoy reusing, reinventing, and restoring older items to make them usable in the 21 century home. Our store brings items that fit into the farmhouse, boho, garden, primitive and industrial styles of today’s homes. We are a one stop shopping experience for those looking for a special accent piece of furniture to smaller decorative items such as baskets, dishes and one of a kind antique pieces. At Rusted: A Vintage Market , we strive to create a comfortable shopping atmosphere where the coffee is always hot and the wine is often flowing!  We are open Monday through Saturday 10-6 and Sunday 1-5. Location & Store Hours 1523 San Marco Blvd. Jacksonville, FL 32207 (904) 398-1523 Store Hours: Monday – Saturday 10 – 6 Sunday 1 – 5 Connect On Facebook Get Updates First Name Last Name Email address: Leave this field empty if you're human: About Us Contact Us Facebook Instagram Copyright © 2019 Rusted a Vintage Market"
    }
  ]
}