{
  "fuentes": [
    {
      "url": "https://www.vispl.co.in/",
      "email": "reachus@vispl.co.in"
    },
    {
      "url": "https://www.olcdesigns.com/about-us/donaldo-visani/",
      "email": "webcontact@olcdesigns.com"
    }
  ],
  "mails": [
    "reachus@vispl.co.in",
    "webcontact@olcdesigns.com"
  ],
  "nombre_sitio": "visani.net",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.vispl.co.in/",
      "text": "Staffing Services | Skill Development | Advisory Services - Vision India Home Staffing » Permanent Staffing » Temporary Staffing » Just Portal: JustJob » Digital Campus Hiring » Payroll Services » EoR + Offshoring Solutions » Managed Services Solution Skilling » Our Projects » Our Courses » e-Skilling Advisory Services » Management Development Technology About Us CSR Contact More » Awards » Employ India Campaign » News Gallery » Knowledge Center » Life @ Vision India » Governance » Our Blog Previous Next Vision India : Trusted Global Partner for  Staffing, Skilling & Advisory Services A Decade of Delivering Customized People Solutions with Unwavering Quality and Trust Vision India Services Pvt Ltd is a leading provider of staffing and Human Resources Management solutions that cater to the \r\ndynamic and diverse needs of businesses across the world. We offer a comprehensive bouquet of services that include \r\nStaffing Solutions, Payroll Management, Human Resource Consulting, Compliance Management, Capability Building, and \r\nTraining and Development, woven around employee management. Our technology-driven approach ensures seamless integration of our solutions & platforms with the existing systems and processes \r\nof our clients, delivering a seamless integration, empowering clients to streamline their operations and optimize productivity \r\nand profitability. We take pride in being the preferred staffing partner for a diverse range of industry segments, including IT, \r\nhealthcare, finance, engineering, hospitality, and many more. Vision India's Quality Management certifications are a testament to our commitment to quality and excellence in all that we \r\ndo and deliver for our clients. We strive to continuously enhance the value we offer to our clients and are dedicated to \r\nproviding exceptional customer service. Under the staffing business vertical, We offer Staffing Services to the businesses seeking flexible and dynamic workforce solutions. \r\nWe specialize in temporary staffing & headcount outsourcing, which allows companies to scale up & drive initiatives with a committed \r\nworkforce segment without long-term commitments. We also nurture skill development initiatives and projects to align with the national \r\nagenda for relevant skill augmentation. By providing client-centric solutions and maintaining high ethical standards in our operations, \r\nVision India helps businesses find the right talent for their needs and enhance workplace productivity. Vision India is one of the highest rated Staffing Company that provide managed staffing services, payroll processing, advisory services, \r\nskill development, dynamic staffing services and manpower outsourcing. We are committed to empowering our clients to achieve their \r\nbusiness goals through optimized investments in their workforce and provide innovative and bespoke people solutions that cater to \r\nthe dynamic and diverse needs of our clients. Know more about us Hiring of General Manager / Advisor – SBM G View Details » Make an enquiry Please enter company name Invalid company name Please enter mobile number Invalid Mobile Number. Please enter email id Invalid email address Select Services Staffing / Temporary Staffing Services Permanent Staffing Services Talent Acquisition Services Flexi Manning Services Digital Campus / Mass hiring Services Job Portal Services Outplacement Services International Staffing Services EoR + Offshoring Services Manpower Outsourcing Executive Search Advisory Services HRIS & Payroll Management Services NAPS Services NATS Services Corporate Social Responsibility Job / Career Please select services ! Please enter your requirements TJQIWC Captcha ! Call us: +91 - 880 200 3333 Write to us: reachus@vispl.co.in Making Bharat Employable + Skill Centers + + People Skilled + Industry Sectors + Placement Tie ups + L&D Specialists + Placed Candidates Our Services Staffing Services Delivering Staffing & Manpower Solutions Globally Know More Permanent Staffing Trusted Partner in Permanent Recruitment & Executive Search Know More Temp staffing Solutions Solution for Businesses in Today's Ever-Changing Know More Flexi Staffing True Flexibility in Workforce Deployment of Organizations Know More Mass / Bulk Hiring We Offers Digital Campus Solution Through Justjob Know More Outplacement Services Providing Essential Support to Displaced Employees Know More International Staffing Partner in International Staffing for Business Growth Know More Advisory Services Your Trusted Advisory Services Partner in India Know More Payroll Services End to end payroll services that reduce your payroll overheads Know More Digital Campus Hiring Revolutionizing Recruitment Process for India Know More Offshoring Solutions Strategic Offshoring Solutions for Global Business Excellence. Know More Talent Acquisition Elevate Hiring with Comprehensive Talent Acquisition Solutions. Know More Manpower Outsourcing Effective, efficient manpower outsourcing solutions globally. Know More Executive Search Discover Exceptional Talent: Executive Search Services Know More NAPS Revolutionizing Skill Development : NAPS & NATS Know More NATS Revolutionizing Skill Development : NATS Know More Enabling Performance, Enhancing Potential! Vision India is one of the leading with leading Staffing Companies that provide managed staffing services, payroll processing, \r\nadvisory services, skill development, dynamic staffing services, dynamic staffing agency, and manpower outsourcing. \r\nWe are committed to empowering our clients to achieve their business goals through optimized investments in their workforce and\r\nprovide innovative and bespoke people solutions that cater to the dynamic and diverse needs of our clients. Vision India, with a decade of credence has evolved into a boutique organization with the complete spectrum of People Solutions, \r\noffering differentiated solutions to the vibrant & dynamic business needs of the corporates. We draw our strength from the ability \r\nto dimension holistic solutions, having a bouquet of products & services integrated on seamless technology & backed by our ability \r\nto customize the solutions according to the Client needs. In this decade long journey, we have earned & sustained the Trust of organizations, as their Preferred Staffing Partner, across\r\nIndustry segments and a complete geographic spread across the country, South East Asia, Middle East and across Europe and the United States. Our customer centricity is further ensured by ISO 14001-2015, ISO 9001-2015, ISO 10002-2018, ISO/IEC 20000 and ISO 27001-2013 Certifications. \r\nWe sustain unwavering focus on consistently delivering quality services to our Clients enabling them to achieve Business Goals \r\nthrough Productivity & Rationalized investments in the workforce. Read More » Government Projects DDUGKY Ministry of Rural Development Partnering Bihar Rural Livelihood Promotion Society we cater to the occupational aspirations of Youth of Bihar, \r\ntrain and make them employable. PMKVY Ministry of Skill Development Entrepreneurship Vision India is affiliated with PMKVY for its successful implementation \r\nwith an objective to enable and mobilize a large number of Indian youth and make India Employable. Vocational Training Program Rashtriya Madhyamik Shiksha Abhiyan Vision India is affiliated with PMKVY for its successful implementation \r\nwith an objective to enable and mobilize a large number of Indian youth and make India Employable. View All Projects + Our Progressive Clientele Quick Links My Vision India Company Profile Goverment Projects Awards & Recognitions News & Updates Labour Documents Career Vision India - CSR Knowledge Center Services Offered Staffing Services Permanent Staffing Temp Staffing Solutions Flexi Staffing Services International Staffing Manpower Outsourcing Executive Search Mass / Bulk Hiring Outplacement Services Talent Acquisition Offshoring Solutions Product and Platform Advisory Services Digital Campus Hiring Payroll Services NAPS NATS Live Skills Rural BPO Management Development Disaster Management Program Mobilization LearnCertify Hub Connect With Us A-11, Sector- 67, Noida, Gautam Budh Nagar - 201301 Uttar Pradesh, India reachus@vispl.co.in +91 - 880 200 3333 Copyright 2023 Vision India Services Pvt. Ltd. - All Rights Reserved. Terms & Conditions | Disclaimer Policy | Return Policy"
    },
    {
      "url": "https://www.olcdesigns.com/about-us/donaldo-visani/",
      "text": "DONALDO VISANI - OLC | Ohlson Lavoie Corporation About Work Insight Careers Contact About Work Insight Careers Contact DONALDO (DONI) VISANI Senior Principal Donaldo is a Senior Principal with experience in a wide variety of project types, including recreation, sports centers, spas, hospital-based wellness, fitness, housing, and hotels. He has a keen sense for creative and cost-effective design solutions. One of Donaldo’s greatest attributes is working hand-in-hand with boards, commissions, stakeholders and members to develop project goals and oversee the complex process of fine-tuning a design to completely meet everyone’s needs. Donaldo’s experience includes programming, planning, design, documentation and construction administration of projects from start to finish. He is a Lead Designer who is involved in client management, public speaking, and industry presentations. Donaldo is also skilled in specification writing, construction documentation, materials research, budgeting, cost estimating and scheduling. Education Andrews University, Bachelor of Architecture with Honors License Licensed Architect – AZ, CA, CO Hobbies I regularly commute 26 miles by bike. I play soccer and ski. Fun Facts I can juggle, dance and do animal impressions. I won a bicycle in a poetry contest. BACK Back to Team NEXT Contact 2000 Lawrence St Denver, CO 80205 Phone: 303.294.9244 Email Us Join Our Team Search for: Subscribe to our Newsletter Email Address: Leave this field empty if you're human: Follow Locations © Copyright OLC | Website by Small Giants, LLC | Privacy Policy"
    }
  ]
}