{
  "fuentes": [
    {
      "url": "https://cocoavillageplayhouse.com/about/contact",
      "email": "info@cocoavillageplayhouse.com"
    },
    {
      "url": "https://cocoavillageplayhouse.com/about/contact",
      "email": "web@cocoavillageplayhouse.com"
    }
  ],
  "mails": [
    "info@cocoavillageplayhouse.com",
    "web@cocoavillageplayhouse.com"
  ],
  "nombre_sitio": "visitcocoavillage.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://cocoavillageplayhouse.com/about/contact",
      "text": "Contact Us | The Historic Cocoa Village Playhouse Skip to main content The Historic Cocoa Village Playhouse Menu (321) 636-5050 Buy Tickets Gift Account Cart Contact Us info@cocoavillageplayhouse.com (321) 636-5050 10:00 a.m. to 4:00 p.m. Tuesday – Friday and one hour before any ticketed event. To speak to one of our ticketing staff, call (321) 636-5050 or after business hours, leave a clear voice message with your name and telephone number and we will return your call. 300 Brevard Ave, Cocoa, FL Main navigation About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships The Historic Cocoa Village Playhouse, Inc. provides affordable community theatre and promotes lifelong education in the performing arts for Brevard County residents and visitors. The Historic Cocoa Village Playhouse is a 501(c)(3) nonprofit organization in Partnership with The City of Cocoa . Our programming is made possible through funding by the Florida Division of Arts and Culture and coordination through the City of Cocoa. We are supported by the Brevard County Board of County Commissioners and the Space Coast Office of Tourism. (321) 636-5050 300 Brevard Ave, Cocoa, FL 32922 © 2009–2025 Cocoa Village Playhouse. All Rights Reserved. Credits | Report Issue About Us Meet the Team 100th Celebration History Contact Us Business Partners Show History Box Office Ticketing Information Season Subscriptions Seating Chart Plan Your Visit Buy Tickets Online Gift Certificates Donate to the Playhouse Events Broadway on Brevard Spotlight Series Stars of Tomorrow 100th Celebration Auditions College Audition Prep Studio Get Involved Job Opportunities Volunteer Opportunities Audition Information Sponsorship Opportunities The Aladdin Society The Legacy Foundation Student Scholarships"
    }
  ]
}