{
  "fuentes": [
    {
      "url": "https://www.visitstaugustine.com/thing-to-do/crescent-beach-fishing",
      "email": "capt@crescentbeachfishing.net"
    },
    {
      "url": "https://crescentbeachscoceanfrontgetaway.com/contact-us/",
      "email": "logo@2x.png"
    },
    {
      "url": "https://www.crescentbeachcare.com/contact/",
      "email": "info@crescentbeachcare.com"
    },
    {
      "url": "https://www.visitstaugustine.com/thing-to-do/st-augustine-municipal-marina",
      "email": "marina@citystaug.com"
    },
    {
      "url": "https://www.booking.com/hotel/us/crescent-beach-bungalow.html",
      "email": "us@3x.png"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "aberdeenbranchbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "chehalisbranchbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "longbeachbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "oceanparkbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "raymondbranchbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.democratandchronicle.com/story/news/2024/10/25/crescent-beach-owner-katherine-mott-businesses-face-uncertain-future-financial-scandal-rochester-ny/75826040007/",
      "email": "gcraig@rocheste.gannett.com"
    },
    {
      "url": "https://www.visitstaugustine.com/place-to-stay/beachers-lodge",
      "email": "shannon@beacherslodge.com"
    },
    {
      "url": "https://www.cbswimclub.ca/contact-us-2/",
      "email": "info@cbswimclub.ca"
    },
    {
      "url": "https://thecrescentbeachclub.com/about-us/",
      "email": "privateevents@thecrescentbeachclub.com"
    },
    {
      "url": "https://www.yoursunlife.com/sugarbeachmauritius/contact-us/",
      "email": "info.sbr@sugarbeachmauritius.com"
    },
    {
      "url": "https://www.yoursunlife.com/sugarbeachmauritius/contact-us/",
      "email": "reservations.sugarbeach@yoursunlife.com"
    },
    {
      "url": "https://crescentbeachscoceanfrontgetaway.com/about-us/",
      "email": "logo@2x.png"
    },
    {
      "url": "https://www.visitstaugustine.com/event/surfquest-beach-days",
      "email": "lynne@arcsj.org"
    },
    {
      "url": "https://www.linkedin.com/company/thecrescentbeachclub",
      "email": "info@thecrescentbeachclub.com"
    },
    {
      "url": "https://www.st-aug.edu/",
      "email": "saucampustours@st-aug.edu"
    },
    {
      "url": "https://www.crescentbeachrv.com/contact",
      "email": "info@crescentbeachrv.com"
    },
    {
      "url": "https://www.visitstaugustine.com/thing-to-do/crescent-beach",
      "email": "info@sjcfl.us"
    }
  ],
  "mails": [
    "aberdeenbranchbookings@greatnwfcu.com",
    "capt@crescentbeachfishing.net",
    "chehalisbranchbookings@greatnwfcu.com",
    "gcraig@rocheste.gannett.com",
    "info.sbr@sugarbeachmauritius.com",
    "info@cbswimclub.ca",
    "info@crescentbeachcare.com",
    "info@crescentbeachrv.com",
    "info@sjcfl.us",
    "info@thecrescentbeachclub.com",
    "logo@2x.png",
    "longbeachbookings@greatnwfcu.com",
    "lynne@arcsj.org",
    "marina@citystaug.com",
    "oceanparkbookings@greatnwfcu.com",
    "privateevents@thecrescentbeachclub.com",
    "raymondbranchbookings@greatnwfcu.com",
    "reservations.sugarbeach@yoursunlife.com",
    "saucampustours@st-aug.edu",
    "shannon@beacherslodge.com",
    "us@3x.png"
  ],
  "nombre_sitio": "visitstaugustine.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.visitstaugustine.com/thing-to-do/crescent-beach-fishing",
      "text": "Crescent Beach Fishing | Visit St. Augustine Skip to main content Weddings Map & Guide Request Visitor's Info Things to Do ALL Things to Do Attractions Coupons & Deals Family Fun Ghost Tours Golfing Museums Night Life Recreation Shopping Tour Services Transportation Water Tours Weddings ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Camping Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events Seasonal Events ALL Events Featured Events Sing Out Loud Music Festival Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Local Things to Do Food Events Event Venues Live Music ALL Live Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Places of Worship Real Estate Services Schools Utilities Search Crescent Beach Fishing Offering inshore and offshore fishing, water tours, and dolphin-watching excursions. Crescent Beach Fishing (904) 910-8906 Share This Crescent Beach Fishing is a fishing charter provided by Captain Kenny Romero on his 2017 Key West 230 Bay Reef powered by a Yamaha 250 SHO 4 stroke. He offers inshore and offshore fishing, as well as tours on the water and dolphin-watching excursions. Captain Kenny does a lot of the work for you, providing gear, bait, tackle, and fishing licenses, so that all you have to worry about bringing are drinks, snacks (alcohol is allowed but no hard liquor or glass bottles), sunscreen (no spray sunscreen), hat, sunglasses, and a cooler to transport your catch home (which you can leave in your car). Children of any age are welcome and Captain Kenny can even teach young anglers how to fish. He'll talk with you beforehand to sort out a day and time for the fishing charter based on the season, tides, and weather. The boat takes a maximum of four people. Prices are based on two passengers with an added $25 per additional person. Cash or credit payment is permitted, there is a 3% surcharge on credit cards. Crescent Beach Fishing (904) 910-8906 Share This Profile Keywords Recreation Fishing Crescent Beach Related categories Attractions Tour Services Shopping Live Music Nightlife Recreation Weddings Request Visitor Information Request St. Augustine FREE information, direct to your inbox. Request Information Things to Do ALL Things to Do Attractions Tour Services Night Life Recreation Shopping Weddings Places to Stay ALL Places to Stay Bed & Breakfasts Condos & Resorts Hotels & Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Seafood Fine Dining Bar / Lounge / Pub Breakfast Family Fare Food Trucks Events ALL Events Featured Events Live Music Festivals Concerts Local Events Seasonal About Us About Visit St. Augustine Request Visitor Info Accessibility Statement Advertise with Us List your Business Submit an Event Map & Guide © 2003-2025 Visit St. Augustine — Designed & hosted by St. Augustine Web Design in beautiful St. Augustine Florida . Home Things to Do ALL Things to Do Attractions Family Fun Ghost Tours Golfing Tour Services Specialty Tours Shopping Museums Night Life Recreation Transportation Weddings LIVE Music ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Camping Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events ALL Events 4th of July Fireworks Featured Events Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Seasonal Events Local Things to Do Food Events Event Venues LIVE Music ALL LIVE Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Real Estate Services Schools Utilities Deals & Coupons ALL Deals Attractions Hotels Night Life Recreation Restaurants Shopping Tour Services Weddings About Us Map & Guide"
    },
    {
      "url": "https://crescentbeachscoceanfrontgetaway.com/contact-us/",
      "text": "Contact Us - Crescent Beach +1(914) 474 - 2589 everywear1@gmail.com Home About Us Listings Experiences Contact Us Home About Us Listings Experiences Contact Us Book Now Contact Us Get in touch and let us create your perfect stay GET IN TOUCH We would love to hear from you if you have any questions that we haven’t addressed on the site. You can reach us at: +1 (914) 4742589 everywear1@gmail.com CONTACT INFO +1(914) 474-2589 everywear1@gmail.com Home About Us Listings Experiences Contact Us Home About Us Listings Experiences Contact Us Copyright © 2024 | Website made by Boostly Facebook Instagram Search Where to go? North Myrtle Beach Arrive Depart September 2025 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 October 2025 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 November 2025 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 December 2025 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 January 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 February 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 March 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 April 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 May 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 June 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 July 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 August 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Clear Done Guests 0 Adults 0 Children Pets Yes No Apply Advanced Size n. of bedrooms 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 n. of rooms 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 Room Type Entire Home Private Room Price Min. $10.00 $20.00 $30.00 $40.00 $50.00 $60.00 $70.00 $80.00 $90.00 $100.00 $110.00 $120.00 $130.00 $140.00 $150.00 $160.00 Max. $50.00 $100.00 $125.00 $150.00 $160.00 $200.00 $250.00 $300.00 $400.00 $500.00 $600.00 $700.00 $800.00 $900.00 $1,000.00 $1,200.00 Amenities 24 Checkin ac Air conditioning Air Filter Alfresco dining Alfresco shower alfresco_dining alfresco_shower allows Children allows Pets Baby High Chair Baby Travel Bed Backyard Baking Sheet baking_sheet Balcony Balcony Terrasse Barbecue Barbecue utensils Barbeque Utensils Basic Soaps Bathtub BBQ grill Beach Beach access Beach essentials Beach Front Beach View beach_access beach_essentials Beachfront Bed linens bed_linens bicycle Bikes For Rent Blender Board games board_games Boat slip boat_slip Boating Body Soap body_soap books Bread Maker Breakfast Buzzer C D D V D Player cable Cable T V Cable TV Carbon monoxide alarm Carbon monoxide detector carbon_monoxide_detector Ceiling Fan Ceiling Fans ceiling_fan Changing table changing_table check In Option Instruction Children’s books and toys Children’s dinnerware childrens_books_and_toys childrens_dinnerware Cleaning available during stay Cleaning before checkout Cleaning Products Cleaning With Disinfectants cleaning_products Clothes Dryer Clothes Drying Rack clothes_drying_rack Clothing storage Coffee Coffee Maker coffee_maker Conditioner Contactless Checkin Cooking Basics cooking_basics Cookware crib Crockery Cutlery Deadbolt Lock Deck Patio Dedicated workspace Dehumidifier Desk Desk Chair Dining Table dining_table disabled_parking_spot Dishes & Utensils Dishes and silverware Dishes And Utensils dishes_and_silverware Dishwasher Doorman Dryer Drying rack for clothing Elevator Emergency Exit Enhanced Cleaning Essentials Ethernet Connection ethernet_connection Exercise equipment exercise_equipment Extra Pillows And Blankets extra_pillows_and_blankets Fenced Pool Fenced Yard Fire extinguisher Fire Pit fire_extinguisher Fireplace First Aid Kit first_aid_kit Fishing Freshwater Fitness Center Free Parking Free parking on premises Free Street Parking Free wifi free_parking Freezer Fridge Game console Games Garden Garden or backyard garden_or_backyard Gated Property Gym Hair Dryer hair_dryer Hammock Hangers Heated Pool Heating High Touch Surfaces Cleaning With Disinfectants home_step_free_access home_wide_doorway Hospital Host greets you Hot Tub Hot Water Hot water kettle hot_water hot_water_kettle Ice Maker In Person Checkin Indoor Fireplace Indoor Pool Internet Internet Wifi invoice Provided Iron Iron & Board Ironing Facilities is Downtown is Event Friendly is Family Friendly is Laptop Friendly is Near Ocean is Rural is Wheelchair Accessible Jacuzzi Kayak Kettle Keurig coffee machine keurig_coffee_machine Kitchen Kitchen Island kitchenette Lanai Gazebo Laptop Friendly Laptop friendly workspace laptop_friendly_workspace laundromat_nearby Lawn / Garden Library life_size_games Linens Linens Provided Living Room Lock On Bedroom Lock On Bedroom Door lock_on_bedroom_door Lockbox Long term stays allowed long_term_stays_allowed Luggage dropoff allowed Microwave Microwave Oven Mini fridge Museums Nespresso machine Office Outdoor Dining Outdoor dining area Outdoor furniture Outdoor Grill Outdoor Lighting Outdoor Seating Outdoor shower outdoor_seating Outlet covers Outlet Shopping outlet_covers Oven Pack ’n play/Travel crib pack_n_play_travel_crib Paid Off Premises Parking Paid parking paid_parking paid_parking_on_premises Pantry Items Parking Patio Patio or balcony Patio or belcony patio_or_belcony Pets allowed Ping Pong Table playground pool Portable Fans portable_fans Pots And Pans Pots Pans Private entrance Private Pool Private Yard private_entrance private_living_room Rain Shower Refrigerator Resort access resort_access rice_maker Room Darkening Shades room_darkening_shades Safe Safety Card Satellite / Cable Shampoo Shopping Shower Gel shower_gel Single Level single_level_home Smart Tv Smoke alarm Smoke detector smoke_detector Smoking allowed Snowmobiling Sound System sound_system Spices Stair Gates Stove Sun loungers sun_loungers Surveillance Swimming T V Television Test Amenity Test boostly theme_room Toaster Toilet Paper Toiletries Towels Towels Provided Town Toys trash_compacter TV Ventilation Fan Village Wardrobe Wardrobe or closet wardrobe_or_closet Washer Washing Machine Water Front Water Kettle Water Sports Water View Waterfront Wifi Wifi Speed100 Wifi Speed250 Wifi Speed50 Wifi Speed500 window_guards Wine Cellar Wine Glasses wine_glasses Winery Tours Wireless Internet wireless_internet More Reset Apply Filters Search × Login Remember me Forgot password? Log In × Register User registration is disabled in this website. × Forgot Password Please enter your username or email address. You will receive a link to create a new password via email. Submit Compare listings Compare Compare experiences Compare Close Contact Us Sleep up to  ,  Bedroom ,\n                             Bathroom In this home, you will find... Select Currency US Dollar USD - $ Canadian Dollar CAD - CA$ Euro EUR - € Pound Stirling GBP - £ Crescent Beach Home About Us Listings Experiences Contact Us Book Now"
    },
    {
      "url": "https://www.crescentbeachcare.com/contact/",
      "text": "Contact | Crescent Beach Care calendar phone checkmark consultation doctor duration group handshake heart location medical pin repeat smile surgery treatment-time treatment-type wellness nav-phone nav-calendar nav-results facebook twitter instagram youtube pinterest linkedin healthgrades yelp link tiktok checkbox checkbox-checked radio radio-selected play-loop pause-loop chevron-down chevron-left chevron-right chevron-up send location plus menu-close-x play-triangle video-slider-arrow testimonial-quotation click-to-play-video arrow-left arrow-right x-close cross-small weight-loss-video-play nav-phone footer-address footer-hours exit Additional location near 207/US1 intersection coming 10/1/25. Stay posted for the exciting news! x (904) 342-7363 Aesthetics: (904) 826-5441 Patient Portal Contact Our Products Book Online Aesthetics Aesthetics Aesthetics Emsculpt NEO Body Contouring Emface Face Contouring Emtone Cellulite Reduction Exion Skin Tightening RF Microneedling Before & After Gallery Primary Care Primary Care Primary Care Telemedicine Urgent Care Women’s Care Men’s Care More Services Primary Care Treatment Planning Tool Wellness Wellness Wellness Emsella for Urinary Incontinence Emfemme for Intimate Wellness Emsculpt NEO for Functional Wellness Medical Weight Loss Wellness Treatment Planning Tool About About About Our Practice Our Providers Patient Forms & Policies Insurance & Payments Specials Memberships Upcoming Events Before & After Gallery Aesthetics: (904) 826-5441 Patient Portal Contact Our Products Book Online Main Menu Contact Contact Us Fill out the form below to contact Crescent Beach Care! Our team will take a look at your message and get back with you as soon as we can! Locations: Beach- 6573 A1A South, St. Augustine, FL 32080, US US1- 975 S Ponce de Leon Blvd, St. Augustine, Fl 32084, US Phone P: (904) 342-7363 F: (904) 342-7367 Hours Mon-Thur: 8am – 5pm Friday: 8am – 2pm Sat-Sun: Closed Contact \" * \" indicates required fields Name * First Last Email Address * Phone Number * Message Email Newsletter Sign up to receive our email newsletter Instagram This field is for validation purposes and should be left unchanged. Submit Form Δ 6573 A1A South St. Augustine, FL 32080 (904) 342-7363 FAX: (904) 342-7367 Mon-Thur: 8am – 5pm Friday: 8am – 2pm Sat-Sun: Closed Resources Blog Patient Forms & Policies Telemedicine Privacy Policy Explore Careers Influencer Program Specials Contact Connect instagram facebook linkedin healthgrades New Location near 207/US1 intersection coming 10/1/25. Stay posted for the exciting news! Crescent Beach Care – US1 975 S Ponce De Leon Blvd St. Augustine, FL 32084 © 2025 Crescent Beach Care. All Rights Reserved. Web Design & SEO by Lifted Logic"
    },
    {
      "url": "https://www.visitstaugustine.com/thing-to-do/st-augustine-municipal-marina",
      "text": "St. Augustine Municipal Marina | Visit St. Augustine Skip to main content Weddings Map & Guide Request Visitor's Info Things to Do ALL Things to Do Attractions Coupons & Deals Family Fun Ghost Tours Golfing Museums Night Life Recreation Shopping Tour Services Transportation Water Tours Weddings ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Camping Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events Seasonal Events ALL Events Featured Events Sing Out Loud Music Festival Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Local Things to Do Food Events Event Venues Live Music ALL Live Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Places of Worship Real Estate Services Schools Utilities Search St. Augustine Municipal Marina Hosting a dock and mooring space, on-shore facilities, dinghy docks, and a special event lawn. St. Augustine Municipal Marina (904) 825-1026 Next to the Bridge of Lions. 111 Avenida Menendez St. Augustine, FL 32084 The Marina is Open 24/7 for boat traffic. View Google Map Share This Show all As the nation's oldest city and first seaport, St. Augustine has been connected to the sea for more than 450 years. The St. Augustine Municipal Marina is located in the heart of the historic district, with most of the attractions and historic sites within easy walking distance. The marina offers 96 slips for vessels up to 200 feet and 100 moorings. The marina's helpful staff is on duty 24/7, 365 days a year, and provides all necessary facilities for both sail and power boats. Public restrooms are available here, and fuel, oil, and ice are available at the fuel dock. There are additional facilities for boating guests, including showers and a laundry room with washers and dryers. The marina monitors Channel 71. Several popular water tours depart from the marina, including the Black Raven Pirate cruises , the Scenic Cruise , the Schooner Freedom tall ship, and St. Augustine Eco Tours . When it's in port, the replica Spanish galleon El Galeón will dock here as well. During St. Augustine Race Week in the spring, most of the visiting race boats will be on the dock for casual viewing when they are not racing. Events and ceremonies may be held on the Municipal Marina's lawn area. Public restrooms, electric power, and potable water are available on site for events. The Municipal Marina can assist with obtaining catering, tents, tables, and chairs for events. Call (904) 825-1026 for more information about private event usage. For wedding information, call (904) 826-0166. Upcoming Events Event Date Time Blessing of the Fleet 2026 Sunday, March 29th, 2026 12:00 pm - 2:00 pm St. Augustine Municipal Marina (904) 825-1026 Next to the Bridge of Lions. 111 Avenida Menendez St. Augustine, FL 32084 The Marina is Open 24/7 for boat traffic. Share This Admission | Ticket Prices Contact the marina for mooring and dockage rates. Profile Keywords Water Fun Marinas Weddings Wedding Venues Event Venues Historic Downtown Restaurants nearby Chatsworth Pub and Tea Room within 1 block O.C. White's Restaurant within 1 block South-A-Philly Steaks & Hoagies within 1 block Gaufre's & Goods 0.1 miles Places to Stay nearby Bella Bay Inn within 1 block Marion Motor Lodge 0.1 miles Casa de Solana 0.1 miles Victorian House 0.1 miles Related categories Attractions Tour Services Shopping Live Music Nightlife Recreation Weddings Request Visitor Information Request St. Augustine FREE information, direct to your inbox. Request Information Things to Do ALL Things to Do Attractions Tour Services Night Life Recreation Shopping Weddings Places to Stay ALL Places to Stay Bed & Breakfasts Condos & Resorts Hotels & Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Seafood Fine Dining Bar / Lounge / Pub Breakfast Family Fare Food Trucks Events ALL Events Featured Events Live Music Festivals Concerts Local Events Seasonal About Us About Visit St. Augustine Request Visitor Info Accessibility Statement Advertise with Us List your Business Submit an Event Map & Guide © 2003-2025 Visit St. Augustine — Designed & hosted by St. Augustine Web Design in beautiful St. Augustine Florida . Home Things to Do ALL Things to Do Attractions Family Fun Ghost Tours Golfing Tour Services Specialty Tours Shopping Museums Night Life Recreation Transportation Weddings LIVE Music ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Camping Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events ALL Events 4th of July Fireworks Featured Events Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Seasonal Events Local Things to Do Food Events Event Venues LIVE Music ALL LIVE Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Real Estate Services Schools Utilities Deals & Coupons ALL Deals Attractions Hotels Night Life Recreation Restaurants Shopping Tour Services Weddings About Us Map & Guide"
    },
    {
      "url": "https://www.booking.com/hotel/us/crescent-beach-bungalow.html",
      "text": "Crescent Beach Bungalow, St. Augustine (updated prices 2025) Skip to main content ARS List your property Register Sign in Stays Flights Car rental Attractions Airport taxis More Check-in date — Check-out date 2 adults · 0 children · 1 room Search Home Hotels All vacation homes United States Florida (FL) St. Augustine Crescent Beach Bungalow (Vacation Home) (US) Deals Overview Vacation Home Info & Price Facilities House rules The fine print Guest reviews (9) More ! This property isn’t taking reservations on our site right now. But don’t worry, you can find tons of other nearby properties right here . Crescent Beach Bungalow Crescent Beach Bungalow St. Augustine, 32080, United States Excellent location – rated 9.4/10! (score from 9 reviews) Real guests • Real stays • Real opinions – Excellent location – show map +10 photos Crescent Beach Bungalow Reserve now Gallery Close Scored 6.9 6.9 Rated pleasant Pleasant 9 reviews Categories: Staff 8.0 Facilities 7.4 Cleanliness 6.4 Comfort 8.3 Value for money 8.0 Location 9.4 Low score for St. Augustine 1 / 18 Scored 6.9 6.9 Rated pleasant Pleasant 9 reviews Categories: Staff 8.0 Facilities 7.4 Cleanliness 6.4 Comfort 8.3 Value for money 8.0 Location 9.4 Low score for St. Augustine Scored 6.9 6.9 Rated pleasant Pleasant 9 reviews Facilities 7.4 Cleanliness 6.4 Comfort 8.3 Value for money 8.0 Location 9.4 Total 6.9 Excellent location! 9.4 The entire place is yours 45 m² size Private bathroom Pet friendly Air conditioning Kitchen Washing machine Flat-screen TV Cable channels Heating You might be eligible for a Genius discount at Crescent Beach Bungalow. Sign in to check if a Genius discount is available for your selected dates. Genius discounts at this property are subject to booking dates, stay dates, and other available deals. About this property Comfortable Living: Crescent Beach Bungalow in St. Augustine offers a holiday home with two bedrooms and a living room. The property includes a fully equipped kitchen, air-conditioning, and a washing machine. Modern Amenities: Guests can enjoy a kitchenette, tea and coffee maker, hairdryer, coffee machine, sofa bed, refrigerator, work desk, seating area, free toiletries, microwave, TV, and a private entrance. Prime Location: Crescent Beach is a 7-minute walk away. Nearby attractions include St Augustine Beach (6.2 mi), Fort Matanzas (7.5 mi), and Castillo de San Marcos National Monument (9.9 mi). Distance in property description is calculated using © OpenStreetMap Property highlights Top Location: Highly rated by recent guests (9.4) Availability We Price Match Select dates to see this property's availability and prices Check-in date — Check-out date 2 adults · 0 children · 1 room Search Guest reviews See availability Scored 6.9 6.9 Rated pleasant Pleasant · 9 reviews Read all reviews Categories: Staff 8.0 Facilities 7.4 Cleanliness 6.4 Comfort 8.3 Value for money 8.0 Location 9.4 Low score for St. Augustine Select topics to read reviews: Bed Quiet Dog Breakfast Location Read all reviews Quality rating Booking.com rated the quality of this property as 3 out of 5 based on factors like facilities, size, location, and service. Managed by Vacasa Company review score: 8.4 Based on 111,565 reviews from 27483 properties 27483 managed properties Company info Vacation Home Management\n Vacasa unlocks the possibilities of how we enjoy vacation homes. We take care of managing our homeowners’ vacation houses so they can have peace of mind (and their home when they want to). And our guests book vacations confidently knowing they’re going to find exactly what they’re looking for without any surprises. Each vacation home is always cared for by our professional local teams who implement our high cleanliness and maintenance values, while the hands-off tasks of vacation rental management--marketing, filing taxes, and maintaining a website--are handled by a specialized central support team. Our passion and focus remains true: to empower our homeowners, guests, and employees to invest in vacation. Property info Experience Crescent/St. Augustine Beach the way the locals do at Crescent Beach Bungalow, where you'll be just a few minutes' walk from the beach ramp and less than 100 steps from the Intercoastal Waterway. There are great fishing platforms under the drawbridge and the sunset each evening is truly a sight to see!\n\nThis home is one of two separate cottages on the property. This listing is for the smaller house, which has recently been upgraded to include its own washer/dryer. Inside, find old-time charm, comfortable furnishings, and a kitchenette with a two-burner cooktop, a refrigerator, and a microwave.\n\nThe yard is fenced for your dogs, and there's parking right in front of the bungalow (trailers and boats are welcome too!).\n\nCrescent Beach is only 11 miles south of downtown St. Augustine and 45 miles north of Daytona Beach. It offers miles and miles of white sand beach for you to walk or ride your bike on, and the surf fishing is fantastic. Walk with a cup of coffee in the morning and see the sunrise, or head out with a flashlight at night to spot the ghost crabs scrambling on the sand. You'll also be close enough to walk to local restaurants and even a fun Irish pub.\n\nTHINGS TO KNOW\nThis home can be rented together with the other bungalow on the property, Crescent Beach Cottage.\nThere is a kitchenette with a two-burner cooktop, a microwave, and a refrigerator.\nThe following dog breeds are not allowed: Akita, Australian Blue Heeler, Boxer, Bull Mastiff, Chow, Dalmatian, Doberman, English Bulldog, Great Dane, Husky (any type), Malamute, Mastiff (any variation), Pit Bull, Presa Canarios, Rottweiler, Saint Bernard, wolf-dog hybrid. Neighborhood info 2 dog(s)  are welcome in this home. No other animals are allowed without specific Vacasa approval.\nParking notes: There is free parking available for 1 vehicle.\nPlease note: this home resides in a noise-sensitive area and the owners participate in our Good Neighbor protection program. Our smart home technology will alert our team if excessive decibel or occupancy levels are detected, allowing us to reach out directly with a reminder of maximun occupancy and quiet hours. This technology is privacy compliant, and only monitors the presence of decibels and devices -not any personal conversation or information. Thank you for supporting our efforts to be good neighbors!\nDamage waiver: The total cost of your reservation for this Property includes a damage waiver fee which covers you for up to 3,000 dollars of accidental damage to the Property or its contents (such as furniture, fixtures, and appliances) as long as you report the incident to the host prior to checking out. More information can be found from the \"Additional rules\" on the checkout page.\nDue to local laws or HOA requirements, guests must be at least 25 years of age to book. Guests under 25 must be accompanied by a parent or legal guardian for the duration of the reservation. Languages Spoken Czech , German , English , Spanish , French , Italian , Dutch , Portuguese Area info See availability House rules Crescent Beach Bungalow takes special requests – add in the next step! See availability Check-in From 4:00 PM Guests are required to show a photo ID and credit card at check-in. You need to let the property know what time you'll be arriving in advance. Check-out Until 10:00 AM Cancellation/ prepayment Cancellation and prepayment policies vary according to accommodation type. Enter your stay dates and check the conditions of your selected option. Children & Beds Child policies Children of all ages are welcome. To see correct prices and occupancy info, add the number and ages of children in your group to your search. Crib and extra bed policies Cribs and extra beds aren't available at this property. Age restriction The minimum age for check-in is 25 Payments by Booking.com Booking.com takes your payment on behalf of the property for this reservation. Smoking Smoking is not allowed. Parties Parties/events are not allowed Pets Pets are allowed on request. Charges may apply. The fine print Must-know information for guests at this property See availability Guests will receive a rental agreement, which must be signed and returned directly to the property prior to arrival. If the agreement is not received, the guest should contact the property management company at the number on the booking confirmation. Please note that only registered guests are allowed at the property. Guests shall abide by the property's policy. Quiet hours are from 22:00 to 8:00. Guests are required to show a photo ID and credit card upon check-in. Please note that all Special Requests are subject to availability and additional charges may apply. Please inform Crescent Beach Bungalow of your expected arrival time in advance. You can use the Special Requests box when booking, or contact the property directly using the contact details in your confirmation. This property does not accommodate bachelor(ette) or similar parties. Show more Show more The Best of St. Augustine Click here to see more hotels and accommodations near popular landmarks in St. Augustine Cities St. Augustine Jacksonville Beach Palm Coast Saint Augustine Beach Orange Park Airports Daytona Beach International Airport Jacksonville International Airport Gainesville Regional Airport Landmarks Mayo Clinic Jacksonville St Johns Town Center St. Augustine Outlets University of North Florida St George Street Flagler College Windsor Parke Golf Club San Marco Avenue Alhambra Theatre gogless Countries Regions Cities Districts Airports Hotels Places of interest Vacation Homes Apartments Resorts Villas Hostels B&Bs Guest Houses Unique places to stay Reviews Discover monthly stays Support Coronavirus (COVID-19) FAQs Manage your trips Contact Customer Service Safety Resource Center Discover Genius loyalty program Seasonal and holiday deals Travel articles Booking.com for Business Traveller Review Awards Car rental Flight finder Restaurant reservations Booking.com for Travel Agents Terms and settings Privacy & cookies Terms & conditions Accessibility Statement Partner dispute Modern Slavery Statement Human Rights Statement Partners Extranet login Partner help List your property Become an affiliate About About Booking.com How We Work Sustainability Press center Careers Investor relations Corporate contact ARS Booking.com is part of Booking Holdings Inc., the world leader in online travel and related services. Copyright © 1996–2025 Booking.com™. All rights reserved. Start of dialog content Verified reviews from real guests. We have more than 70 million property reviews, all from real, verified guests . How does it work? 1 It starts with a booking It starts with a booking The only way to leave a review is to first make a booking. That's how we know our reviews come from real guests who have stayed at the property. 2 Followed by a trip Followed by a trip When guests stay at the property, they check out how quiet the room is, how friendly the staff is, and more. 3 And finally, a review And finally, a review After their trip, guests tell us about their stay. We check for naughty words and verify the authenticity of all guest reviews before adding them to our site. If you booked through us and want to leave a review, please sign in first. Sign in and leave a review End of dialog content Check-in date Check-out date « » Mo Tu We Th Fr Sa Su Close calendar"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "text": "Contact Us Free Community Shred Day to be held at our Aberdeen, Raymond and Long Beach branch locations - Saturday, September 20th from 9AM to Noon. Bring your sensitive documents and mail to be securely destroyed on-site. Donations of canned goods for local food banks will be accepted. Close Alert Go to main content Video Banking Apply for a Loan Become a Member Locations & ATMs Contact Us Search: Online Banking Login Login Username Register Bank Borrow Manage Discover Spend Checking Overview Great Value Checking Great Perks Checking Great Advantage Checking Platinum Plus Savings Accounts Share Savings HSAs Youth Accounts Christmas Club Investment Accounts Money Market IRAs Certificates Business Accounts Retirement & Investment Services Savings Rates Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More Loans Auto Loans Home Loans Personal Loans Credit Cards Business Loans Car Buying Service Skip-A-Payment Foreclosure Information Loan Rates Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More Access Online Banking Mobile Banking EasyPay Protection Insurance Estate Planning Loan Payment Options Business Services Card Services Courtesy Pay Order Checks Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More About Us About Great NorthWest FCU Become a Member Membership Benefits Buy Local Spend Local Promotions Refer a Friend Career Opportunities Get Help Contact Us Frequently Asked Questions Disclosures & Agreements Provide Feedback Rates Locations Locations & ATMs Financial Education Great NorthWest Insider Great NorthWest Scholarships Credit Score Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More Contact Us We're here when you need us. Have a question or need a hand? We’re here to help. Reach out by phone, text, email, or visit us in person—our team is ready to support you, wherever life takes you. Contact Us Quick Question? Get a quick answer during business hours. Text 3605339990 and a Member Service Representative will reply! Need a notary? Want to open a Safe Deposit Box? Have questions about filing a cardholder dispute? Skip the line at your local branch and Schedule an Appointment ! * Required Fields First Name: Last Name: Email Address: Message: Are you a current member of Great NorthWest FCU? Yes No Branch Information Filter by City All Cities All Cities Aberdeen, WA Chehalis, WA Long Beach, WA Ocean Park, WA Raymond, WA Filter by Service All Services All Services Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Aberdeen Branch 301 W. Wishkah Street Aberdeen, WA 98520 Get Directions Phone: 360-533-9990 TTY: 1-800-533-8396 Email Us Schedule an Appointment 24-Hour Drive-Thru ATM located across the street at 320 W. Wishkah St. You can also visit our Great NorthWest Financial Center. Located at 331 W. Wishkah St., this office houses our Retirement & Investment Services along with Mortgage and Business Lending. Lobby Hours: Mon: 9am - 6pm Tue: 9am - 6pm Wed: 9am - 6pm Thu: 9am - 6pm Fri: 9am - 6pm Sat: 9am - 1pm Sun: Closed Drive Thru Hours: Mon: 8am - 6pm Tue: 8am - 6pm Wed: 8am - 6pm Thu: 8am - 6pm Fri: 8am - 6pm Sat: 9am - 1pm Sun: Closed Drive-thru Safe Deposit Boxes Night Deposit Coin Counter Notary Services Chehalis Branch 1601 N.W. Louisiana Avenue Chehalis, WA 98532 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 8:30am - 5:30pm Tue: 8:30am - 5:30pm Wed: 8:30am - 5:30pm Thu: 8:30am - 5:30pm Fri: 8:30am - 6pm Sat: 9am - 1pm Sun: Closed On-site ATM Notary Services Long Beach Branch 705 Pacific Ave. S. Long Beach, WA 98631 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: 9am - 1pm Sun: Closed Drive Thru Hours: Mon: 8am - 5:30pm Tue: 8am - 5:30pm Wed: 8am - 5:30pm Thu: 8am - 5:30pm Fri: 8am - 6pm Sat: 9am - 1pm Sun: Closed Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Ocean Park Branch 1409 251st Pl. Ocean Park, WA 98640 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: Closed Sun: Closed Drive Thru Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: Closed Sun: Closed Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Raymond Branch 327 Commercial Street Raymond, WA 98577 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: 9am - 1pm Sun: Closed Drive Thru Hours: Mon: 8am - 5:30pm Tue: 8am - 5:30pm Wed: 8am - 5:30pm Thu: 8am - 5:30pm Fri: 8am - 6pm Sat: 9am - 1pm Sun: Closed Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Go to main navigation Make it Great! Send Us A Message This Credit Union is federally-insured by the National Credit Union Administration. We do business in accordance with the Federal Fair Housing Law and the Equal Credit Opportunity Act. *APY=Annual Percentage Yield. **APR=Annual Percentage Rate. NMLS #401392 Call Center (360) 533-9990 (call or text) (800) 533-8396 Call Center Hours (PST) Monday - Friday: 8am - 6pm Saturday: 9am - 1pm Sunday: Closed Mailing Address 301 W. Wishkah St. Aberdeen, WA 98520 Routing Number: 325180333 Accessibility Statement Privacy Policy Disclosures Site Map © 2025 Great NorthWest Federal Credit Union Website by CUSG Facebook Instagram This Credit Union is federally-insured by the National Credit Union Administration. We do business in accordance with the Federal Fair Housing Law and the Equal Credit Opportunity Act. *APY=Annual Percentage Yield. **APR=Annual Percentage Rate. NMLS #401392 Search: Bank Checking Overview Great Value Checking Great Perks Checking Great Advantage Checking Platinum Plus Savings Accounts Investment Accounts Business Accounts Retirement & Investment Services Savings Rates Borrow Auto Loans Home Loans Personal Loans Credit Cards Business Loans Car Buying Service Skip-A-Payment Foreclosure Information Loan Rates Manage Online Banking Insurance Loan Payment Options Business Services Courtesy Pay Card Services Order Checks Discover About Great NorthWest FCU Become a Member Membership Benefits Promotions Career Opportunities Locations & ATMs Contact Us FAQs Provide Feedback Great NorthWest Insider Video Banking Apply for a Loan Become a Member Locations & ATMs Contact Us Google ReCaptcha Error"
    },
    {
      "url": "https://www.democratandchronicle.com/story/news/2024/10/25/crescent-beach-owner-katherine-mott-businesses-face-uncertain-future-financial-scandal-rochester-ny/75826040007/",
      "text": "Crescent Beach owner Katherine Mott faces uncertain future amid scandal News Sports Life Business Data Advertise Obituaries eNewspaper Legals NEWS Crescent Beach owner's business empire faces uncertain future amid financial scandal Gary Craig Rochester Democrat and Chronicle While Katherine Mott's businesses continue to operate amid allegations of a massive check-kiting scheme, her long-term ownership future for her catering and restaurant operations is beginning to look bleak. A court-appointed receiver warns in a report that because of \"structural and systemic operational deficiencies, additional non-business and even business assets must be sold.\" Steps are already underway to sell the shuttered Crescent Beach lakefront restaurant in Greece, which Mott bought but was unable to open. As well, Mott is moving to sell Monroe's Restaurant in Pittsford and the Divinity Estate and Chapel wedding and events operation, the report states. Mott has been a leading restaurateur and events planner locally but, records show, fell onto tougher times as she added more operations. An attorney for Mott declined to comment. The receiver warnings The receiver, Mark Kercher, was appointed in April and has reported that the businesses have stayed afloat and operated largely normally. However, the long-term financial prognostication is steadily turning dire, the report shows. Because of existing debt and other expenses, the money for survival and stability likely will be dependent on sales of the businesses, the report states. Mott's businesses \"are not structurally capable of meeting these ordinary-course obligations,\" Kercher wrote. Kercher does not warn that there should be fears from people who have booked events. In fact, the cash flow from the operations is what has allowed them to continue largely without hiccups in operations and will do so in the near future. Check kiting allegations In a lawsuit filed this year, Five Star Community Bank accused Mott and a business partner of check kiting. With the alleged fraud, Five Star contended, the businesses opened multiple accounts then rapidly shifted money between the accounts. This allowed payments of nearly $19 million that was not covered by money because of the time that could lapse after a deposit and before the bank saw the money was unavailable, Five Star alleges. That prompted another bank, Community Bank, to transfer money from Mott's accounts to Five Star. Mott has sued Community Bank , alleging that its transfer of $593,000 was improper and she should have use of the money. Five Star officials declined to comment about the latest report from the receiver. — Gary Craig is a veteran reporter with the Democrat and Chronicle, covering courts and crime and more. You can reach Craig at gcraig@rocheste.gannett.com . He is the author of two books, including \"Seven Million: A Cop, a Priest, a Soldier for the IRA, and the Still-Unsolved Rochester Brink's Heist. \" Staff Directory Corrections Careers Accessibility Support Sitemap Legals Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Promote your Event Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.democratandchronicle.com. All rights reserved."
    },
    {
      "url": "https://www.visitstaugustine.com/place-to-stay/beachers-lodge",
      "text": "Beacher's Lodge | Visit St. Augustine Skip to main content Weddings Map & Guide Request Visitor's Info Things to Do ALL Things to Do Attractions Coupons & Deals Family Fun Ghost Tours Golfing Museums Night Life Recreation Shopping Tour Services Transportation Water Tours Weddings ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Camping Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events Seasonal Events ALL Events Featured Events Sing Out Loud Music Festival Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Local Things to Do Food Events Event Venues Live Music ALL Live Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Places of Worship Real Estate Services Schools Utilities Search Previous Next Beacher's Lodge Offering beach access, a heated oceanfront pool, and pet-friendly amenities. View Website (904) 471-8849 Beacher's Lodge (904) 471-8849 Just south of the Marathon gas station. 6970 A1A South St. Augustine, FL 32080 Check in 4:00 p.m.; Check out 11:00 a.m. View Google Map Share This +7 more Beacher's Lodge is a condo-style hotel that offers guests beautiful ocean-view suites, each individually owned and uniquely decorated. Every suite features a private balcony or patio overlooking the Atlantic Ocean. Situated in Crescent Beach , this hotel is a few minutes from St. Augustine and steps from the sand and surf. Each suite is fully equipped with all the amenities of home. The front desk and hospitality staff are professional and accommodating, always willing to help guests have the best vacation possible. Beacher's Lodge is welcoming for families and couples, offering both one-bedroom suites and studios with kitchenettes. In addition to the beach, there is also a heated oceanfront pool. Pets are welcome at Beacher's Lodge with pet-friendly units available for those who like to bring their furry companions on vacation. Sunrise looking towards the ocean from Beacher's Lodge Every morning brings a spectacular sunrise to Beacher's Lodge. Guests can share morning coffee with that special someone and enjoy the view from the comfort of a balcony or patio. This hotel offers short and long-term rentals, priced for every budget. Beacher's Lodge is close to several equipment rental companies. The staff is happy to assist with bike rentals, jet skis, or even booking a helicopter tour over the nation's oldest city. Check-In/Out Time: Check-in is at 4:00 p.m. Check-out is at 11:00 a.m. Amenities: Free Wi-Fi, sofa beds, DVD player, TV with standard cable, hair dryer, iron and ironing board, in-room safe, refrigerator, stovetop, microwave, toaster, four-cup coffee maker, coffee, fully-equipped kitchenettes with pots, pans, dishes, and utensils. Beacher's Lodge (904) 471-8849 Just south of the Marathon gas station. 6970 A1A South St. Augustine, FL 32080 Check in 4:00 p.m.; Check out 11:00 a.m. Share This Profile Keywords Condos & Resorts Hotels & Motels Pet Friendly Waterfront Crescent Beach Have a Question? Your Name Your Email Address Your Message Things to Do nearby Crescent Beach 0.1 miles Genung’s Fish Camp 0.2 miles Geo Trippin' Adventure Co. 0.2 miles Devil's Elbow Fishing Resort Boat Rentals 1.0 miles Restaurants nearby Tony's Pizza 0.1 miles Fuzion 904 Eatery 0.1 miles Island Ice Cream Cafe 0.1 miles Yeast Coast Baking Company 0.2 miles Related categories Bed & Breakfasts Condos & Resorts Hotels & Motels Pet Friendly Vacation Rentals Waterfront Wedding Venues Request Visitor Information Request St. Augustine FREE information, direct to your inbox. Request Information Things to Do ALL Things to Do Attractions Tour Services Night Life Recreation Shopping Weddings Places to Stay ALL Places to Stay Bed & Breakfasts Condos & Resorts Hotels & Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Seafood Fine Dining Bar / Lounge / Pub Breakfast Family Fare Food Trucks Events ALL Events Featured Events Live Music Festivals Concerts Local Events Seasonal About Us About Visit St. Augustine Request Visitor Info Accessibility Statement Advertise with Us List your Business Submit an Event Map & Guide © 2003-2025 Visit St. Augustine — Designed & hosted by St. Augustine Web Design in beautiful St. Augustine Florida . Home Things to Do ALL Things to Do Attractions Family Fun Ghost Tours Golfing Tour Services Specialty Tours Shopping Museums Night Life Recreation Transportation Weddings LIVE Music ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Camping Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events ALL Events 4th of July Fireworks Featured Events Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Seasonal Events Local Things to Do Food Events Event Venues LIVE Music ALL LIVE Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Real Estate Services Schools Utilities Deals & Coupons ALL Deals Attractions Hotels Night Life Recreation Restaurants Shopping Tour Services Weddings About Us Map & Guide"
    },
    {
      "url": "https://www.cbswimclub.ca/contact-us-2/",
      "text": "Contact Us - Crescent Beach Swimming Club Skip to content Programs Registration CBSC Events CBSC News Volunteer CBSC Coaches and Staff Summer Staff Become a Coach Hiring About CBSC Board of Directors Mission Statement Core Values Code of Conduct Club History Archives CBSC Gear Contact Us Return to Home Page Programs Registration CBSC Events CBSC News Volunteer CBSC Coaches and Staff Summer Staff Become a Coach Hiring About CBSC Board of Directors Mission Statement Core Values Code of Conduct Club History Archives CBSC Gear Contact Us Return to Home Page Instagram Facebook X 604-538-2180 (July/August) info@cbswimclub.ca Contact Us admin 2025-04-27T11:01:18-07:00 Crescent Beach Swimming Club Contact Us The Crescent Beach Swimming Club is located at the foot of McBride Avenue, adjacent to Blackie Spit, in Surrey BC. From June 30 until August 22, the clubhouse office is open Mondays, Tuesdays, Thursdays and Fridays from 9-12pm and in the afternoons, but closing time will vary. Email: info@cbswimclub.ca Please include as many details as possible as well as a phone number where you can be reached. Clubhouse Phone: 604-538-2180 The CBSC phone number is only in service for the months of July and August. Office staff: Mary Nordby, Teriann Carmichael, Heidi Estabrooks, Alyssa Cooper, and Sadie Larkin. The CBSC Mailing Address* Box 45020 Ocean Park PO 12851 16th Ave, Surrey, BC, V4A 9L1 *Our physical location and mailing address are two different locations. To view your CBSC account online, go to https://ca.apm.activecommunities.com/cbsc/Home STAY CONNECTED! E-Seahorse Sign Up Volunteer Email CBSC Office Go To Your ActiveNet Account CBSC Board of Directors Coaches and Staff Parking Policy Please note that the area in front of the swimming pool gates must be kept clear of all vehicles including bicycles, cars, scooters, etc., in order to allow access at all times for emergency vehicles as well as supply trucks, pedestrians, and strollers. All walkways should also be kept clear. Bicycles should be parked in an orderly fashion at the bike racks. Parents, please help us enforce this parking policy by teaching children the need for this safety rule and the importance of following this procedure. All members, please encourage everyone to park properly. Thank you for your help and cooperation! Inclement Weather Policy Inclement Weather Policy Tennis lessons will be closed when the courts are wet due to rain. The pool will be closed in the event of lightning. We will do our best to send out the eSeahorse or post on Instagram for updates in certain circumstances, but it may not be an up-to-the-minute update. No refund or make up classes are offered in lieu of cancelled classes. QUICK LINKS Go to ActiveNet How to Register 2025 Team Aquatics Shark Card CBLG – Beach Staff Log-In Privacy Policy STAY CONNECTED: 604-538-2180 (July/August) info@cbswimclub.ca E-Seahorse Sign-Up Calendar Volunteer Latest CBSC News COMMUNITY CONTACT INFO Animals On The Beach 604-591-4370 SPCA 604-574-1711 Bylaw Infractions 604-591-4370 Public Washroom Maintenance 604-501-5050 Parking 604-591-4352 Non-Emergency RCMP 604-599-0502 © Copyright 2020 - Date. Crescent Beach Swimming Club. All rights reserved. Page load link We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies. However, you may visit \"Cookie Settings\" to provide a controlled consent. Cookie Settings Accept All Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT Go to Top"
    },
    {
      "url": "https://thecrescentbeachclub.com/about-us/",
      "text": "About Us - The Crescent Beach Club 516-628-3000 About Testimonials From Our Clients – The Crescent Beach Club Awards Virtual Tour of The Crescent Beach Club Wedding Venue Preferred Vendors Weddings Blog Events Upcoming Events Mitzvahs Corporate Milestones Contact Online Employment Application – The Crescent Beach Club Schedule A Tour Ocean Restaurant About Testimonials From Our Clients – The Crescent Beach Club Awards Virtual Tour of The Crescent Beach Club Wedding Venue Preferred Vendors Weddings Blog Events Upcoming Events Mitzvahs Corporate Milestones Contact Online Employment Application – The Crescent Beach Club Schedule A Tour Ocean Restaurant About Us - The Crescent Beach Club 13396 wp-singular,page-template,page-template-full_width,page-template-full_width-php,page,page-id-13396,page-parent,wp-theme-bridge,wp-child-theme-bridge-child,bridge-core-3.0.2,sfsi_actvite_theme_default,wpa-excerpt,ctct-bridge,qode-page-transition-enabled,ajax_fade,page_not_loaded,,footer_responsive_adv,qode-child-theme-ver-1.0.0,qode-theme-ver-29.1,qode-theme-bridge,wpb-js-composer js-comp-ver-6.9.0,vc_responsive,elementor-default,elementor-kit-20624 About Us The Crescent Beach Club is Long Island’s only premier beachfront destination venue. We have been a leading Wedding and Private Events establishment for over 30 years, with our beautiful white sand beach, breathtaking views, and gourmet dining for that “once in a lifetime experience”. Let us cater to your every desire and make your Wedding/Private Event a truly special day not only for you, but for each and every one of your invited guests. Have the destination party that you always dreamed of without ever leaving New York. Whether you’re planning to host a wedding, an intimate party for family and friends, or a business gathering The Crescent Beach Club will make your special event a most memorable occasion for years to come. Your event is our only event. A bright blue sky and a cool gentle breeze give way to the most beautiful place imaginable to enjoy an event to remember. You and your guests will revel in tropical surroundings on a sun-filled deck, a most unique setting, to enjoy cocktails. The Grand Ballroom with its high ceilings, lush palm trees, beautiful crystal chandeliers, and an entire glass wall of doors and windows that leads out onto a spectacular deck overlooking the elegant Long Island Sound. The Crescent Beach Club creates a world class culinary experience that is beyond extraordinary. Our menus are custom designed for each party’s tastes and budget and our service is unparalleled. Our attention to detail cannot be denied as we are known for our dedication to perfection. Put your trust in The Crescent Beach Club and allow us the opportunity to create a lifetime of memories that will not be soon forgotten. We encourage you to see for yourself. Come and visit our truly unique paradise. Your dreams are only a phone call away. Please call the Private Events Sales Office at 516-628-3000 or email us at privateevents@thecrescentbeachclub.com to set up an appointment. SCHEDULE A TOUR TYPE OF AFFAIR Wedding Mitzvah Sweet 16 Milestone Corporate Lists * CBC Website How did you hear about us? Brides of Long Island Facebook Google Here Comes The Guide Instagram LI Weddings The Knot Wedding Wire Submit Testimonials Our wedding was at The Crescent Beach Club this past Sunday. It was fantastic! The food was great, the weather was perfect and our guests were very happy. You almost feel like you are on an island. This is the type of place that will exceed your guest expectations! Thanks to Kim, Stacie and the entire team! Andrew We knew the Crescent Beach Club was the venue for our wedding as soon as we left. It was the one and only venue we looked at for our special day.  All of our guests felt like they were at a destination wedding and were amazed at the views. \r\nWe loved everything about our special day! Nicole So thankful we chose this place. They treated us and all the guest like family. Excelent service, the food was amazing and plenty to go around. The views? Wow Best Sunset ever Carlos My daughter had her wedding at Crescent Beach Club this past weekend. The food and service were beyond outstanding. Stacie, Travis and the entire staff made us feel so at ease. The entire staff is pleasant and professional going above and beyond to accommodate our requests. Nothing was too much for them to handle. The venue is just magnificent. I just can't thank them enough. Krista & Adam Absolutely cannot rave enough about the crescent!! We worked predominantly with Stacie- she was incredible!! She took care of everything so seemlessly! Ludmila was my bridal attendant and she was incredible as well! The chef was phenominal and catered to every request. The venue itself is breathtaking- everyone who came to our wedding was floored and are still talking about how beautiful it was and how much fun they had. If I could give Crescent more than 5 stars I would!! Jessica & Alex I cannot rave enough about the crescent! Everyone was saying my husband and I were such a calm bride & groom & that is LARGLY due to the amazing staff at crescent! They take care of EVERYTHING and will do whatever they can to make your day exactly how you want it! Our wedding day was everything we dreamed of and so much more. Not to mention - it is the most stunning beach venue - our guests were floored by it! And the food is incredible!! Jessica & Alex Our wedding was almost a month ago- and it was a dream come true. We did our ceremony at a church and then just had our reception at the venue at night. It was beyond amazing. The entire staff is incredible. Our guests can't stop talking about the evening! The food was delicious, you have the entire place to yourselves as well which is a huge plus! You feel like you are on vacation, but you are right in Long Island. Kim, Stacie & Molly were the main people we worked with- and they were all so great. DREAM TEAM. The cocktail hour, reception, after party- it was all executed perfectly and it was a dream come true. Thank you thank you! Gabrielle & Stephen They nailed it, their staff was attentive, the ballroom was exactly how we said we wanted it. Stacey worked (without me asking) coordinating with every single vendor when most weren’t even recommended by the venue. The food was UNREAL. The view ... INSANE. If you’re questioning getting married there, let this be my big push to let you know you should 100% hands down, no question about it, BOOK IT! Kimberly & Nicholas This venue is absolutely amazing! Not only are the location and ballroom gorgeous, but the staff was incredible! I got married at the Crescent Beach Club on May 24th, 2019, and I have not one regret. The food was delicious and Molly the Bridal attendant made sure that my husband and I got to eat everything from cocktail hour! The Crescent Beach Club staff, especially Molly, Stacie, and Denise were the best! Stacie works with you throughout the most stressful times of wedding planning, Denise was there from the beginning and was a pleasure to work with, and Molly was absolutely amazing, she not made sure that I had my bouquet when it was misplaced, but she took the time at the end of the night to hold my flower girl when she was cranky and tired. I don't know any other staff that treats you like family! I would suggest the Crescent Beach club a million times over! Amazing experience! Mackenzie Awards Call Us Tel: 516-628-3000 Location 333 Bayville Ave. Bayville, NY 11709 Join The Crescent Beach Club & Ocean Mailing lists Email * © 2024 The Crescent Beach Club | Privacy Policy Schedule a tour TYPE OF AFFAIR Wedding Mitzvah Sweet 16 Milestone Corporate Lists * CBC Website How did you hear about us? Brides of Long Island Facebook Google Here Comes The Guide Instagram LI Weddings The Knot Wedding Wire Submit × × × ×"
    },
    {
      "url": "https://www.yoursunlife.com/sugarbeachmauritius/contact-us/",
      "text": "Contact Us | Sugar Beach, Luxury Mauritius Resort Explore the resorts Back The Resort Rooms & Suites Deluxe Sea View Room Deluxe Beach Front Room Premium Sea View Room Premium Beach Front Room Family Room Premium Suite Premium Accessible Room Executive Beach Front Suite Offers Restaurants & Bars Wellness & Fitness Golf Experiences & Activites Weddings Wedding Packages Legal Requirements Meetings & Celebrations Venue spaces Conferences Parties & Celebrations Gift Voucher Sunlife Sugar Beach Long Beach La Pirogue Ambre Anahita Golf & Spa Resort Anahita Golf Ile aux Cerfs Location Day Pass Contact Us EN FR DE Day Pass Location Gift Voucher Contact Us Book Now Book Now Home Sugar Beach Contact Us Have a Question? Instantly get answers to your questions. Just send us a WhatsApp message. Using a laptop but prefer to chat on your mobile? No problem! Simply scan the QR code to start the conversation. Get in touch Call, email or complete our form Our team will get back to you and we look forward to welcoming you to experience Sugar Beach. Address Wolmar Flic en Flac Mauritius For More Information: Call on: +230 403 3300 For Reservations: Call on: +230 402 0151 or Email: reservations.sugarbeach@yoursunlife.com topic General Enquiry Wedding Enquiry Meeting Enquiry Dining Enquiry Spa Enquiry I AGREE TO THE TERMS & CONDITIONS Submit Newsletter Sign Up First Name Email Address * Website_Visitor Sunlife Sugar Beach Long Beach Ambre La Pirogue I agree to the privacy policy Sustainability Financial Information & Governance Mobile App Reviews Gift Voucher Members Club Join the Team Awards Cookie Policy Privacy Policy © Copyright Sun life 2022 Sugar Beach Wolmar, Flic en Flac, Mauritius Tel: +230 403 3300 Email: info.sbr@sugarbeachmauritius.com Website by 80 Days Resorts Sunlife Sugar Beach Long Beach La Pirogue Ambre Anahita Golf & Spa Resort Anahita Golf Ile aux Cerfs"
    },
    {
      "url": "https://crescentbeachscoceanfrontgetaway.com/about-us/",
      "text": "About Us - Crescent Beach +1(914) 474 - 2589 everywear1@gmail.com Home About Us Listings Experiences Contact Us Home About Us Listings Experiences Contact Us Book Now About Who We Are Join the journey with Lillian Mooradian, the creative force behind Crescent Beach. Envisioning a haven where the beauty of ocean views meets the warmth of family gatherings, Lillian embarked on a mission to redefine beachfront luxury. From the convenience of a short private walkway to the ocean’s edge to the thoughtful inclusion of amenities catering to guests of all ages and abilities, Crescent Beach embodies a passion for creating unforgettable moments. As the sun sets over the Grand Strand, Crescent Beach invites beach enthusiasts of every stripe to immerse themselves in a world where relaxation meets adventure. Book Your Stay Our Team John Borthwick Owner John brings expertise and dedication to ensuring unforgettable vacation experiences for our clients. Our highly skilled team provides exceptional service and support, exceeding expectations with attention to detail and personalization. Trust, professionalism, and personalized attention are at the heart of our mission. John Borthwick Owner John brings expertise and dedication to ensuring unforgettable vacation experiences for our clients. Our highly skilled team provides exceptional service and support, exceeding expectations with attention to detail and personalization. Trust, professionalism, and personalized attention are at the heart of our mission. John Borthwick Owner John brings expertise and dedication to ensuring unforgettable vacation experiences for our clients. Our highly skilled team provides exceptional service and support, exceeding expectations with attention to detail and personalization. Trust, professionalism, and personalized attention are at the heart of our mission. Why Choose Us? Choose Crescent Beach for your oceanfront condo getaway because we offer breathtaking views and direct access to the Grand Strand’s pristine beaches. We prioritize accessibility for all, providing amenities like pack & plays and beach toys for kids and ensuring grandparents can enjoy every moment. Our target market is beach lovers of all types, and our location near 17th street’s shops and restaurants adds convenience to your stay. Experience the epitome of oceanfront luxury with Crescent Beach—your ultimate seaside retreat awaits. Our Core Values Inviting Atmosphere We create an inviting ambiance that immediately sets the tone for a relaxing vacation. Relaxation and Good Vibes Our focus is on providing a relaxing atmosphere filled with positive energy, ideal for families, couples, and anyone seeking a peaceful getaway. Family-Friendly Hospitality Crescent Beach is entirely kid-friendly, offering amenities like pack & plays, beach toys, and games for guests of all ages to enjoy together. Book Your Stay Where Every Sunrise is Magic! Book Your Stay CONTACT INFO +1(914) 474-2589 everywear1@gmail.com Home About Us Listings Experiences Contact Us Home About Us Listings Experiences Contact Us Copyright © 2024 | Website made by Boostly Facebook Instagram Search Where to go? North Myrtle Beach Arrive Depart September 2025 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 October 2025 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 November 2025 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 December 2025 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 January 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 February 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 March 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 April 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 May 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 June 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 July 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 August 2026 M T W T F S S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Clear Done Guests 0 Adults 0 Children Pets Yes No Apply Advanced Size n. of bedrooms 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 n. of rooms 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 Room Type Entire Home Private Room Price Min. $10.00 $20.00 $30.00 $40.00 $50.00 $60.00 $70.00 $80.00 $90.00 $100.00 $110.00 $120.00 $130.00 $140.00 $150.00 $160.00 Max. $50.00 $100.00 $125.00 $150.00 $160.00 $200.00 $250.00 $300.00 $400.00 $500.00 $600.00 $700.00 $800.00 $900.00 $1,000.00 $1,200.00 Amenities 24 Checkin ac Air conditioning Air Filter Alfresco dining Alfresco shower alfresco_dining alfresco_shower allows Children allows Pets Baby High Chair Baby Travel Bed Backyard Baking Sheet baking_sheet Balcony Balcony Terrasse Barbecue Barbecue utensils Barbeque Utensils Basic Soaps Bathtub BBQ grill Beach Beach access Beach essentials Beach Front Beach View beach_access beach_essentials Beachfront Bed linens bed_linens bicycle Bikes For Rent Blender Board games board_games Boat slip boat_slip Boating Body Soap body_soap books Bread Maker Breakfast Buzzer C D D V D Player cable Cable T V Cable TV Carbon monoxide alarm Carbon monoxide detector carbon_monoxide_detector Ceiling Fan Ceiling Fans ceiling_fan Changing table changing_table check In Option Instruction Children’s books and toys Children’s dinnerware childrens_books_and_toys childrens_dinnerware Cleaning available during stay Cleaning before checkout Cleaning Products Cleaning With Disinfectants cleaning_products Clothes Dryer Clothes Drying Rack clothes_drying_rack Clothing storage Coffee Coffee Maker coffee_maker Conditioner Contactless Checkin Cooking Basics cooking_basics Cookware crib Crockery Cutlery Deadbolt Lock Deck Patio Dedicated workspace Dehumidifier Desk Desk Chair Dining Table dining_table disabled_parking_spot Dishes & Utensils Dishes and silverware Dishes And Utensils dishes_and_silverware Dishwasher Doorman Dryer Drying rack for clothing Elevator Emergency Exit Enhanced Cleaning Essentials Ethernet Connection ethernet_connection Exercise equipment exercise_equipment Extra Pillows And Blankets extra_pillows_and_blankets Fenced Pool Fenced Yard Fire extinguisher Fire Pit fire_extinguisher Fireplace First Aid Kit first_aid_kit Fishing Freshwater Fitness Center Free Parking Free parking on premises Free Street Parking Free wifi free_parking Freezer Fridge Game console Games Garden Garden or backyard garden_or_backyard Gated Property Gym Hair Dryer hair_dryer Hammock Hangers Heated Pool Heating High Touch Surfaces Cleaning With Disinfectants home_step_free_access home_wide_doorway Hospital Host greets you Hot Tub Hot Water Hot water kettle hot_water hot_water_kettle Ice Maker In Person Checkin Indoor Fireplace Indoor Pool Internet Internet Wifi invoice Provided Iron Iron & Board Ironing Facilities is Downtown is Event Friendly is Family Friendly is Laptop Friendly is Near Ocean is Rural is Wheelchair Accessible Jacuzzi Kayak Kettle Keurig coffee machine keurig_coffee_machine Kitchen Kitchen Island kitchenette Lanai Gazebo Laptop Friendly Laptop friendly workspace laptop_friendly_workspace laundromat_nearby Lawn / Garden Library life_size_games Linens Linens Provided Living Room Lock On Bedroom Lock On Bedroom Door lock_on_bedroom_door Lockbox Long term stays allowed long_term_stays_allowed Luggage dropoff allowed Microwave Microwave Oven Mini fridge Museums Nespresso machine Office Outdoor Dining Outdoor dining area Outdoor furniture Outdoor Grill Outdoor Lighting Outdoor Seating Outdoor shower outdoor_seating Outlet covers Outlet Shopping outlet_covers Oven Pack ’n play/Travel crib pack_n_play_travel_crib Paid Off Premises Parking Paid parking paid_parking paid_parking_on_premises Pantry Items Parking Patio Patio or balcony Patio or belcony patio_or_belcony Pets allowed Ping Pong Table playground pool Portable Fans portable_fans Pots And Pans Pots Pans Private entrance Private Pool Private Yard private_entrance private_living_room Rain Shower Refrigerator Resort access resort_access rice_maker Room Darkening Shades room_darkening_shades Safe Safety Card Satellite / Cable Shampoo Shopping Shower Gel shower_gel Single Level single_level_home Smart Tv Smoke alarm Smoke detector smoke_detector Smoking allowed Snowmobiling Sound System sound_system Spices Stair Gates Stove Sun loungers sun_loungers Surveillance Swimming T V Television Test Amenity Test boostly theme_room Toaster Toilet Paper Toiletries Towels Towels Provided Town Toys trash_compacter TV Ventilation Fan Village Wardrobe Wardrobe or closet wardrobe_or_closet Washer Washing Machine Water Front Water Kettle Water Sports Water View Waterfront Wifi Wifi Speed100 Wifi Speed250 Wifi Speed50 Wifi Speed500 window_guards Wine Cellar Wine Glasses wine_glasses Winery Tours Wireless Internet wireless_internet More Reset Apply Filters Search × Login Remember me Forgot password? Log In × Register User registration is disabled in this website. × Forgot Password Please enter your username or email address. You will receive a link to create a new password via email. Submit Compare listings Compare Compare experiences Compare Close About Us Sleep up to  ,  Bedroom ,\n                             Bathroom In this home, you will find... Select Currency US Dollar USD - $ Canadian Dollar CAD - CA$ Euro EUR - € Pound Stirling GBP - £ Crescent Beach Home About Us Listings Experiences Contact Us Book Now"
    },
    {
      "url": "https://www.visitstaugustine.com/event/surfquest-beach-days",
      "text": "SurfQuest Beach Days | Visit St. Augustine Skip to main content Weddings Map & Guide Request Visitor's Info Things to Do ALL Things to Do Attractions Coupons & Deals Family Fun Ghost Tours Golfing Museums Night Life Recreation Shopping Tour Services Transportation Water Tours Weddings ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Camping Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events Seasonal Events ALL Events Featured Events Sing Out Loud Music Festival Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Local Things to Do Food Events Event Venues Live Music ALL Live Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Places of Worship Real Estate Services Schools Utilities Search SurfQuest Beach Days Volunteers make the beach and surf accessible to people with disabilities. Select Saturdays | 1:00 p.m. SurfQuest Beach Days (904) 824-7249 Mary St. Boat Ramp in Crescent Beach Mary Street Crescent Beach, FL 32080 View Google Map Share This +1 more The Arc of St. Johns offers a free monthly beach day on select Saturdays at the Mary Street boat ramp in Crescent Beach for anyone with a disability. SurfQuest's dedicated volunteers provide surfing lessons and water recreation programs at these monthly gatherings, helping families access the beach and ocean without barriers. SurfQuest also advocates for beach accessibility for those with limited mobility, providing adaptive equipment and training. The Arc of the St. Johns extends SurfQuest's mission to all disabilities, including veterans. Get more information or learn about volunteering. Email questions about this event to The Arc of The St. Johns. Admission: Free When: At 1:00 p.m. on: May 10, 2025 June 28, 2025 July 19, 2025 Aug. 16, 2025 Sept. 20, 2025 Where: Crescent Beach boat ramp, Mary Street, St. Augustine, 32080 About the Arc of the St. Johns: The Arc of the St. Johns provides the opportunity for hope, growth, and change to people with intellectual or developmental disabilities in the St. Augustine community. They are located at 2101 Arc Drive in St. Augustine, Florida 32084. SurfQuest Beach Days (904) 824-7249 Mary St. Boat Ramp in Crescent Beach Mary Street Crescent Beach, FL 32080 Share This Profile Keywords Featured Events Sports & Outdoors Water Sports Local Things to Do Ponce de Leon Blvd Have a Question? Your Name Your Email Address Your Message Related Events Today Sep 11 9/11 Ceremony of Remembrance 2025 Thursday, Sep. 11, 2025 | 8:30 to 9:00 a.m. Remembering those who died in the terrorist attacks on September 11, 2001. Today Sep 11 CEAM: Department of Visual Arts Faculty Exhibit Monday - Saturday, Sep. 5 - Nov. 8, 2025 | Times Vary Experience the talents of Flagler College's visual arts faculty. Today Sep 11 Doorway of Dreams Exhibit Daily, Sept. 5 - 30, 2025 | Times Vary Explore the interplay between the seen and unseen. Tomorrow Sep 12 Ancient City Con 2025 Friday - Sunday, Sep. 12-14, 2025 | Times Vary Annual celebration of science fiction, anime, fantasy, horror, and gaming. Tomorrow Sep 12 Sing Out Loud Music Festival Sep. 5 - 28, 2025 | Select Days An annual September festival presenting local and national musicians around town. Tomorrow Sep 12 A Sing Out Loud Concert with Remedy Tree and Cori Moore Friday, Sep. 12, 2025 | 7:00 p.m. to 9:00 p.m. The first in a weekend of Sing Out Loud concerts celebrating Gamble Rogers. Related categories Featured Events Festivals Live Entertainment Arts & Culture Sports & Outdoors For Kids Historical Seasonal Show 3 more Show 3 less Food Local Things to Do Fundraisers Editor's Note: We encourage you to verify event times and details with the organizers, as they may change. Request Visitor Information Request St. Augustine FREE information, direct to your inbox. Request Information Things to Do ALL Things to Do Attractions Tour Services Night Life Recreation Shopping Weddings Places to Stay ALL Places to Stay Bed & Breakfasts Condos & Resorts Hotels & Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Seafood Fine Dining Bar / Lounge / Pub Breakfast Family Fare Food Trucks Events ALL Events Featured Events Live Music Festivals Concerts Local Events Seasonal About Us About Visit St. Augustine Request Visitor Info Accessibility Statement Advertise with Us List your Business Submit an Event Map & Guide © 2003-2025 Visit St. Augustine — Designed & hosted by St. Augustine Web Design in beautiful St. Augustine Florida . Home Things to Do ALL Things to Do Attractions Family Fun Ghost Tours Golfing Tour Services Specialty Tours Shopping Museums Night Life Recreation Transportation Weddings LIVE Music ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Camping Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events ALL Events 4th of July Fireworks Featured Events Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Seasonal Events Local Things to Do Food Events Event Venues LIVE Music ALL LIVE Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Real Estate Services Schools Utilities Deals & Coupons ALL Deals Attractions Hotels Night Life Recreation Restaurants Shopping Tour Services Weddings About Us Map & Guide"
    },
    {
      "url": "https://www.linkedin.com/company/thecrescentbeachclub",
      "text": "The Crescent Beach Club | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Sign in Join now The Crescent Beach Club Events Services Bayville, New York 112 followers It's Better at the Beach Follow Discover all 29 employees Report this company About us The Crescent Beach Club is Long Island's premier beachfront destination venue. We have been a leading Wedding and Private Events establishment for over 20 years, with our beautiful white sand beach, breathtaking views, and gourmet dining for that \"once in a lifetime experience\". Let us cater to your every desire and make your Wedding/Private Event a truly special day not only for you, but for each and every one of your invited guests. Have the destination party that you always dreamed of without ever leaving New York.\n\nWhether you're planning to host a wedding, an intimate party for family and friends, or a business gathering, The Crescent Beach Club will make your special event a most memorable occasion for years to come.\n\nYour event is our only event. A bright blue sky and a cool gentle breeze give way to the most beautiful place imaginable to enjoy an event to remember. You and your guests will revel in tropical surroundings on a sun-filled deck, a most unique setting to enjoy cocktails. The Grand Ballroom has high ceilings, beautiful crystal chandeliers, and an entire glass wall of doors and windows that lead out onto a spectacular deck overlooking the elegant Long Island Sound.\n\nThe Crescent Beach Club creates a world class culinary experience that is beyond extraordinary. Our menus are custom designed for each party's tastes and budget and our service is unparalleled. Our attention to detail cannot be denied as we are known for our dedication to perfection. Put your trust in The Crescent Beach Club and allow us the opportunity to create a lifetime of memories that will not be soon forgotten. We encourage you to see for yourself. Come and visit our truly unique paradise. Your dreams are only a phone call away. Website http://www.thecrescentbeachclub.com External link for The Crescent Beach Club Industry Events Services Company size 51-200 employees Headquarters Bayville, New York Type Privately Held Specialties Events Venue, Wedding Venue, Beachfront Venue, Wedding Reception, Wedding Ceremony, Special Events, Private Events, Corporate Events, Event Planning, Events Services, Catering, Mitzvahs, Sweet 16, Weddings, Teambuilding, Destination Wedding, and Beach Bonfire Locations Primary 333 Bayville Ave Bayville, New York 11709, US Get directions Employees at The Crescent Beach Club Ron Isaacs Private Events Director at The Crescent Beach Club Jorge A. Taboada Property maintenance manager at the crescent beach club Samantha Mollica Hospitality Taib Boukami Controller at The Crescent Beach Club See all employees Updates The Crescent Beach Club 112 followers 20h Report this post When you roll the dice on the Crescent Beach Club, you always get lucky! \n\nWhether it is anniversary parties, corporate events or seasonal celebrations, the Crescent Beach Club always provides exemplary service, quality cuisine and a view that never goes out of style.\n\nDecor and Planning: @bellepetalevents Like Comment Share The Crescent Beach Club 112 followers 1mo Report this post Long Island's best kept secret is out!\n\nLong Island's best kept secret...is also Long Island's best wedding and event venue. \n\nThe 2025 Brides of Long Island Summer Soiree host. Over 600 5-star reviews on Google. Wedding Wire Couples Choice Awards winner for every year from 2010 through 2025. \n\nThese achievements and accolades paint a vivid picture of a venue that consistently exceeds expectations—delivering both gorgeous surroundings and unforgettable service. \n\nAnd now...we are sharing our secret with you. \n\nSchedule a tour of the Crescent Beach Club for your wedding and event today!\n\n📍333 Bayville Ave, Bayville, NY 11709\n📞 (516) 628-3000\n📧 info@thecrescentbeachclub.com 🌐 https://lnkd.in/dFmSg7-C …more Like Comment Share The Crescent Beach Club 112 followers 2mo Report this post SWIPE to see what this Crescent Beach Club couple used instead of rice for their wedding ceremony send-off! Hint: It is PERFECT for a beachfront ceremony 🌊🏖️ Like Comment Share The Crescent Beach Club 112 followers 2mo Report this post One of our favorite parts of each wedding? Seeing the signature drinks our couples dream up! 🍸✨ From spicy margaritas to espresso martinis like this one—your bar menu is another way to make the day feel totally yours.⁠\n⁠\nWe love watching your vision come to life, down to every last garnish—and our team is all in on making it happen. ⁠\n⁠\nGot a drink in mind already? Let’s plan it. 🥂\n\nPhotographer: @brittanykellerphoto Like Comment Share The Crescent Beach Club 112 followers 3mo Report this post You think you need a destination wedding… but what you really need is the beach, the breeze, and your favorite people—right here on Long Island.⁠⁠\n⁠\nCrescent Beach Club gives you the oceanfront vibes without hopping on a plane. Ceremony on the sand? Check. Epic food? Obviously. A day your guests won’t stop talking about? Absolutely.⁠\n⁠\n2025 dates are going—come see what all the hype is about.\n📲 Book your tour today! …more Like Comment Share The Crescent Beach Club 112 followers 3mo Report this post Our best view, at our best rate!!!\n\nWhether you're planning an intimate celebration or a daytime event that flows into golden hour, afternoon weddings give you our best views and the best deal. Imagine exchanging vows on the sand, enjoying oceanfront cocktails, and celebrating with your favorite people—without the peak-season price tag or long wait times.\n\n✨ Our Afternoon Wedding Package:\n💍 $9,500 for up to 75 guests⁠\n🕚 11 AM–4 PM exclusive use⁠\n📅 Available for 2025 weddings only⁠\n📌 Must book by June 30⁠\n\nGet the Long Island beachfront wedding you’ve been dreaming of—on your timeline and on your terms. Contact us to schedule your tour today. …more 1 Like Comment Share The Crescent Beach Club 112 followers 3mo Report this post Why do Long Island business owners love hosting their team and corporate events at the Crescent Beach Club? Read it directly from attendees of the Attorney Accountant Networking Group!\n\n\"The luau-themed business event hosted by AANG (Attorney Accountant Networking Group)at the Crescent Beach Club was nothing short of exceptional. From the moment we arrived, the tropical ambiance set the perfect tone for a unique and unforgettable networking experience. The venue’s beachfront setting provided a stunning backdrop, and the attention to detail in the decor, music, and lighting truly transported us to an island paradise.\"\n\n\"The catering was top-notch — from the fresh, flavorful dishes to the creative cocktails, every element was thoughtfully curated and beautifully presented. The Crescent Beach Club’s staff were professional, warm, and attentive, ensuring every guest felt welcome and well taken care of.\"\n\n \"As a professional event, the luau struck the perfect balance between relaxed and productive. The atmosphere encouraged genuine connections and meaningful conversations, which is exactly what AANG stands for. We couldn’t have asked for a better venue or experience. Hats off to the Crescent Beach Club for delivering a spectacular evening that exceeded all expectations!\"\n\nThank you to, Alan J. Schwartz, Esq. President, AANG for sharing this feedback with the Crescent Beach Team! Like Comment Share The Crescent Beach Club 112 followers 3mo Report this post Afternoon I Do’s with a View 💍☀️\nPlanning a 2025 wedding? Our Afternoon Wedding Package offers the same stunning beachfront views—at our best value yet.\n\n✨ $9,500 for up to 75 guests\n🕚 11 AM–4 PM exclusive use\n📅 Available for 2025 weddings only\n📌 Must book by June 30\n\nPerfect for couples who want a dreamy beach ceremony followed by a daylight celebration on the sand.\n\n🌴 Inquire now—availability won’t last! …more Like Comment Share The Crescent Beach Club 112 followers 3mo Report this post Father’s Day Beach Party at Crescent Beach Club! 🌊🍽️\nCelebrate Dad with a BBQ-inspired buffet brunch, top-shelf open bar, live stations, seafood, desserts & more—all with a beachfront view.\n\n📅 Sunday, June 15, 2025 | 12–4 PM\n👨👩👧👦 $105 Adults | $50 Kids (3–14)\n\nView the full menu & grab your tickets under the Events tab on our website.\nBecause it’s always better at the beach. ☀️ https://lnkd.in/eFiXEEyp Like Comment Share The Crescent Beach Club 112 followers 3mo Report this post Why settle for boardrooms when this is the weekday view you could have?\n\nHost your next corporate event right on the beach at Crescent Beach Club in Bayville, NY. From meetings and team retreats to award ceremonies and fundraising galas, our beachfront ballroom brings a refreshing change of scenery—because work is always better with a view. 🌴🌊\n\n📩 Inquire now to reserve your date! Like Comment Share Join now to see what you are missing Find people you know at The Crescent Beach Club Browse recommended jobs for you View all updates, news, and articles Join now Similar pages OHEKA CASTLE Hospitality Huntington, New York The Mansion at Glen Cove Hospitality Glen Cove, NY Lessing's Hospitality Group Hospitality Great River, NY Antun's of Queens Village Hospitality Queens Village, NY Crescent Beach Club Hospitality Bayville, New York Jericho Terrace Hospitality Mineola, New York The Garden City Hotel Hospitality Garden City, NY Villa Lombardi’s Restaurants Holbrook, New York poppi Retail Austin, TX Fort Hill Animal Hospital Veterinary Huntington, New York Show more similar pages Show fewer similar pages Browse jobs Hospitality Specialist jobs 62,565 open jobs Marketing Manager jobs 106,879 open jobs LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at The Crescent Beach Club Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://www.st-aug.edu/",
      "text": "Saint Augustine's University Apply Give Today Alumni Parents Faculty & Staff Store Events Newsletter Welcome Forgot password? Not a member? Join today About SAU SAU at a Glance SAU & Raleigh Strategic Plan University Leadership History Faculty & Staff Directory Campus Safety SAU & the Episcopal Church Offices & Departments Consumer Information University Compliance Title IX Academics Programs Professional Studies & Services Certification/Non-Credit Course Student Portal Library Academic Calendar Registrar University Catalog Accreditation Admissions & Financial Aid Apply Admissions Financial Aid and Scholarships Registration Open House Recruitment Viewbook Tuition and Fees Veterans Affairs Students Student Services Student Accounts Student Portal Self-Service Tutorials Library Commencement Parents Email Brightspace Reset SAU Email Password Athletics Giving News Professional Studies & Enterprise Services Offering Certification and Non-Credit Courses LEARN MORE → APPLY NOW #BelieveInSAU: LEARN HOW YOU CAN HELP LEARN MORE SAU REAFFIRMS ITS COMMITMENT TO STUDENT SUCCESS IN PURSUIT OF MAINTAINING ACCREDITATION READ MORE LEARN MORE HERE STUDENT SUCCESS & TESTING THE SAU TESTING CENTER REMAINS FULLY OPERATIONAL LEARN MORE GET STARTED IN CONTINUING EDUCATION! APPLY HERE REGISTRATION IS AVAILABLE REGISTER FOR SUMMER AND FALL COURSES REGISTER HERE The mission of Saint Augustine’s University is to sustain a learning community in which students can prepare academically, socially and spiritually for leadership in a complex, diverse and rapidly changing world. TOP 50 IN SOCIAL MOBILITY According to U.S. News & World Report 2021 – 2022 ranking. 100% STUDENTS AWARDED scholarships or financial aid to complete their journey at SAU. 12:1 STUDENT-FACULTY RATIO SAU faculty make teaching and mentoring their top priorities. 35 DIFFERENT STATES represented in our student population. The generosity of alumni, the Episcopal Church, corporations, foundations and friends of the University keep SAU and, most importantly, its students thriving. ENSURE THE FUTURE OF SAU GIVE TODAY GIVE HERE DISCOVER Learn what it means to soar. LEARN MORE VISIT Picture yourself at SAU. SCHEDULE A VISIT APPLY You've found your next. Let's get started. APPLY NOW What Our Students Are DOING Ashley Weekes Ashley is a junior accounting major and member of the Track and Field team. This summer she is working as an intern with Deloitte. Sean Kalawan Sean is a junior sport management major and on the Track and Field team. This summer he will work as an intern with Lenovo. Naiylah Archer Naiylah Archer is a senior Film Major. This summer, she worked as an executive intern for Sony Pictures Entertainment. Peter Musenge Peter is a junior Biology major, chosen to participate in Stanford Exposure to Research and Graduate Education (SERGE). Louis Lowndes Louis received the opportunity to attend the National HBCU Business Deans Roundtable hosted by Deloitte University Leadership Center. Lauryn Stubbs Lauryn received the amazing opportunity to attend the National HBCU Business Deans Roundtable hosted by Deloitte University Leadership Center. McKenzie Estep McKenzie is a senior Political Science major and served as the 71st Miss SAU. This summer she is working as an intern with African American Mayors Assoc. Sinanzwayinkosi Ndhlovu Sinanzwayinkosi is a double major in Engineering Mathematics and Computer Information Systems. This summer he will work as an intern with Lenovo. Why I Chose SAU ﻿ ﻿ ﻿ WHAT'S HAPPENING AT SAU NEWS August 15, 2025 staugadmin SAU Secures Accreditation for Fall 2025 through Litigation & Announces Historic Leadership Transition Court Grants Preliminary Injunction, Securing SAU’s Accreditation for Fall 2025. SAU Read More July 14, 2025 staugadmin SAU Reaffirms Its Commitment to Student Success in Pursuit of Maintaining Accreditation Saint Augustine’s University (SAU) today addressed the outcome of its accreditation Read More June 16, 2025 staugadmin Still Rising: SAU Celebrates the Resilience and Excellence of its STEM Scholars Amid ongoing challenges facing Saint Augustine’s University (SAU), the determination, Read More ALL NEWS EVENTS There are no upcoming events at this time. SAU strives to give students the most up to date information about Coronavirus and how they can take preventative measures. LEARN MORE → SCHOOLS School of Arts, Social Sciences & Communications Explore School of Business, Management & Technology Explore School of Education & General Studies Explore School of Public Health and Health Sciences Explore School of Graduate & Professional Gateway Studies Explore School of Science, Mathematics & Allied Health Explore Division of Military Science - Falcon Battalion Explore Also of Interest Admissions in University in Raleigh University Campus Life in Raleigh Professional Studies and Enterprise Services SAINT AUGUSTINE’S UNIVERSITY 1315 Oakwood Avenue Raleigh, NC 27610-2298 919.516.4000 Information For: Alumni Faculty & Staff Media Parents & Guardians Visitors Quick Links Apply Registration Employment Coronavirus Information Commencement Request a Transcript Saint Augustine’s Chapel Giving Strategic Plan Student Complaints Events University Compliance Policies and Procedures Privacy Statement Resources Campus Safety Student Portal Employee Portal Brightspace Office 365 Campus Store Faculty & Staff Directory Map Marketing Service Forms The Prezell R. Robinson Library Joseph G. Gordon Health Center Space Reservations Technology Support Title IX © Copyright 2022 Saint Augustine's University"
    },
    {
      "url": "https://www.crescentbeachrv.com/contact",
      "text": "Contact Us — Crescent Beach Crescent Beach Home Activities Private Beach Surfing & Water Sports Olympic National Park Accommodations RV Sites Tent Sites Cabins Park Information Information Contact Privacy Policy Campground Map Home / Activities / Private Beach Surfing & Water Sports Olympic National Park Accommodations / RV Sites Tent Sites Cabins Park Information / Information Contact Privacy Policy Campground Map Contact Home / Activities / Private Beach Surfing & Water Sports Olympic National Park Accommodations / RV Sites Tent Sites Cabins Park Information / Information Contact Privacy Policy Campground Map Contact Us 2860 Crescent Beach Road Port Angeles, WA 98363 (360) 928-3344 info@crescentbeachrv.com Name * First Name Last Name Email Address * Message * Thank you! Phone : 360-928-3344 | Email : info@crescentbeachrv.com Privacy Policy Contact Terms & Conditions"
    },
    {
      "url": "https://www.visitstaugustine.com/thing-to-do/crescent-beach",
      "text": "Crescent Beach | Visit St. Augustine Skip to main content Weddings Map & Guide Request Visitor's Info Things to Do ALL Things to Do Attractions Coupons & Deals Family Fun Ghost Tours Golfing Museums Night Life Recreation Shopping Tour Services Transportation Water Tours Weddings ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Camping Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events Seasonal Events ALL Events Featured Events Sing Out Loud Music Festival Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Local Things to Do Food Events Event Venues Live Music ALL Live Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Places of Worship Real Estate Services Schools Utilities Search Crescent Beach A beautiful stretch of coastline on the south side, offering a spacious, peaceful atmosphere. Crescent Beach (904) 209-0752 A1A just south of St. Augustine Beach. 6930 A1A S. Crescent Beach, FL 32080 View Google Map Share This Show all Crescent Beach is a beautiful stretch of the Florida coast just south of St. Augustine. It gets its name from the natural shape of the coastline. The hard-packed sand lends itself to activities including beach bike rides, walks, frisbee, and volleyball. Visitors can enjoy relaxing on the beach or participating in a variety of water sports like surfing, swimming, and boogie boarding, as well as boating from the marked public access points on A1A. Crescent Beach is a small community with little commercial development. There are plenty of beach house rentals , condos, and cottages available here. Wooden decks and flyovers provide safe access to the beach across the protected sand dunes. Beach Access and Facilities Minimal vehicle beach access is offered at the Crescent Beach Ramp on Cubbedge Road. A nominal access fee for driving on the beach is charged daily from March 1 through August 31, and then only on Friday, Saturday, and Sunday through September. Visit here for more information. Rules for driving on the beach are posted and are strictly enforced for safety reasons. From May 1 through September 30 driving on the beach is allowed only from 8:00 a.m. to 7:30 p.m. From October 1 through April 30, driving on the beach is allowed only from 9:00 a.m. to 5:00 p.m Horseback riding is allowed during designated times only with a special permit. More information is available here . This map shows all beach access points in St. Johns County and will note the walkover points and footbridges that are currently closed. Upcoming Events Event Date Time SurfQuest Beach Days Saturday, September 20th, 2025 1:00 pm - 3:00 pm Crescent Beach (904) 209-0752 A1A just south of St. Augustine Beach. 6930 A1A S. Crescent Beach, FL 32080 Share This Profile Keywords Beaches Surfing Crescent Beach Restaurants nearby Island Ice Cream Cafe 0.1 miles Fuzion 904 Eatery 0.1 miles Tony's Pizza 0.1 miles Yeast Coast Baking Company 0.3 miles Places to Stay nearby Beacher's Lodge 0.1 miles Cozy Sunsets Rentals 0.4 miles VTrips 0.8 miles Five Star Property Management 0.8 miles Related categories Attractions Tour Services Shopping Live Music Nightlife Recreation Weddings Request Visitor Information Request St. Augustine FREE information, direct to your inbox. Request Information Things to Do ALL Things to Do Attractions Tour Services Night Life Recreation Shopping Weddings Places to Stay ALL Places to Stay Bed & Breakfasts Condos & Resorts Hotels & Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Seafood Fine Dining Bar / Lounge / Pub Breakfast Family Fare Food Trucks Events ALL Events Featured Events Live Music Festivals Concerts Local Events Seasonal About Us About Visit St. Augustine Request Visitor Info Accessibility Statement Advertise with Us List your Business Submit an Event Map & Guide © 2003-2025 Visit St. Augustine — Designed & hosted by St. Augustine Web Design in beautiful St. Augustine Florida . Home Things to Do ALL Things to Do Attractions Family Fun Ghost Tours Golfing Tour Services Specialty Tours Shopping Museums Night Life Recreation Transportation Weddings LIVE Music ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Camping Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events ALL Events 4th of July Fireworks Featured Events Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Seasonal Events Local Things to Do Food Events Event Venues LIVE Music ALL LIVE Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Real Estate Services Schools Utilities Deals & Coupons ALL Deals Attractions Hotels Night Life Recreation Restaurants Shopping Tour Services Weddings About Us Map & Guide"
    }
  ]
}