{
  "fuentes": [
    {
      "url": "https://www.floridastateparks.org/parks-and-trails/rainbow-springs-state-park/hours-fees",
      "email": "fsp.feedback@floridadep.gov"
    },
    {
      "url": "https://rvshare.com/state-parks/florida/rainbow-springs-state-park?msockid=32dd536e5cd864361f27457a5d596544",
      "email": "logo_primary@2x-c99214cdc6ba115a76d2c2a76c6f08e1.png"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "ayoo@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "bcutts@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "boxoffice@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "cdungca@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dht@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dmatlin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "doshima@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "elane@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "emcfadden@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "jmartin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "kmatsuno@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "productions@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "rtandal@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "vgreen@diamondheadtheatre.com"
    },
    {
      "url": "https://lovingstpete.com/blog/rainbow-river-tubing-and-springs/",
      "email": "mike@lovingstpete.com"
    },
    {
      "url": "https://lovingstpete.com/blog/rainbow-river-tubing-and-springs/",
      "email": "flags@2x.png"
    },
    {
      "url": "https://lovingstpete.com/blog/rainbow-river-tubing-and-springs/",
      "email": "globe@2x.png"
    },
    {
      "url": "https://www.ocalamarion.com/directory/rainbow-springs-state-park/",
      "email": "exploreocalamarion@marionfl.org"
    }
  ],
  "mails": [
    "ayoo@diamondheadtheatre.com",
    "bcutts@diamondheadtheatre.com",
    "boxoffice@diamondheadtheatre.com",
    "cdungca@diamondheadtheatre.com",
    "dht@diamondheadtheatre.com",
    "dmatlin@diamondheadtheatre.com",
    "doshima@diamondheadtheatre.com",
    "elane@diamondheadtheatre.com",
    "emcfadden@diamondheadtheatre.com",
    "exploreocalamarion@marionfl.org",
    "flags@2x.png",
    "fsp.feedback@floridadep.gov",
    "globe@2x.png",
    "jmartin@diamondheadtheatre.com",
    "kmatsuno@diamondheadtheatre.com",
    "logo_primary@2x-c99214cdc6ba115a76d2c2a76c6f08e1.png",
    "mike@lovingstpete.com",
    "productions@diamondheadtheatre.com",
    "rtandal@diamondheadtheatre.com",
    "vgreen@diamondheadtheatre.com"
  ],
  "nombre_sitio": "visitrainbowsprings.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.floridastateparks.org/parks-and-trails/rainbow-springs-state-park/hours-fees",
      "text": "Hours & Fees | Florida State Parks Skip to main content Florida State Parks Florida Department of Environmental Protection Main Menu Plan your visit Access for All FAQs Fees Rules & Regulations Camping & Lodging Find a Park Learn Resources Experiences & Amenities Educational Opportunities Programs Research & Collecting Get Involved Events Search Camping & Lodging Shop Breadcrumb Home Find a Park Rainbow Springs State Park Hours & Fees Back to Rainbow Springs State Park Park Menu Hours & Fees Entrances to the Park Experiences & Amenities History Events Aquatic Preserve Make a Reservation Download Park Map Fees Park Entry $5 per vehicle of 2-8 people. $4 for single occupant vehicle. $2 for pedestrian or bicycle entry. Tubing Contact Guest Services at 833-945-2925 for more information about tube rental and shuttle fees. Pavilion There are four covered pavilions available on a first-come, first-served basis. Hours Headsprings Entrance 8 a.m. to sunset, 365 days a year (unless closed at capacity). Tubing Entrance Memorial Day through Labor Day: 8 a.m. to 4 p.m., seven days a week. The last tram leaves at 4:30 p.m. First Saturday in April through Memorial Day: 8 a.m. to 4 p.m., weekends only. The last tram leaves at 4:30 p.m. Labor Day through end of September: 8 a.m. to 4 p.m. weekends only. The last tram leaves at 4:30 p.m. Please call 833-945-2925 to confirm opening; facility may close due to weather). October through March: Closed for the winter season. Campground Office 11 a.m. to 5:30 p.m. daily. Park Capacity Rainbow Springs State Park has very high visitation on weekends and holidays. When the park reaches capacity at the headsprings entrance, the park will close to all visitors . When the park is closed, vehicles may not wait in line in the park or on adjacent roads. All must wait until we reopen to enter. Due to high visitation, Annual Entrance Pass sales are restricted to weekdays and non-holidays only . Annual Entrance Passes may also be purchased online Florida State Parks Main Menu Plan your visit Access for All FAQs Fees Rules & Regulations Camping & Lodging Find a Park Learn Resources Experiences & Amenities Educational Opportunities Programs Research & Collecting Get Involved Events Have Questions? Contact the Statewide Information Line: (850) 245-2157 Or send an email to: FSP.Feedback@FloridaDEP.gov Stay Connected Facebook Twitter Instagram Pinterest You Tube © Copyright 2025 © Copyright 2018 Florida Department of Environmental Protection. Customer Survey Disclaimer Privacy Policy Website Login"
    },
    {
      "url": "https://rvshare.com/state-parks/florida/rainbow-springs-state-park?msockid=32dd536e5cd864361f27457a5d596544",
      "text": "A Guide to Activities & RV Rentals at Rainbow Springs State Park (Florida) | RVshare Sign Up Log In Help List Your RV Rainbow Springs State Park\n     RV & Campground Guide Florida Lodging What to Do Directions Trip Planner Where to Stay What to Do How to Get There Trip Planner Home State Parks Florida Rainbow Springs State Park People have flocked to Rainbow Springs for more than 10,000 years, drawn by its lush greenery and pristine sapphire-blue waters. Native  peoples regularly visited the spring, and today visitors can see ornamental gardens, man-made waterfalls, and verdant, sloping hills from when it was a privately-owned tourist attraction. The weather at the park is warm, although not as hot as it can get in other areas of Florida. The average high in summer months is just at 90°F, and in the frigid days of winter, the January low is a very manageable 46°F. July is the rainiest month, with an average of 13 days of precipitation. Weather Spring 52°F – 87°F Summer 71°F – 90°F Fall 54° F – 88° F Winter 46°F – 72°F Nearby Cities Dunnellon, FL Citrus Springs, FL Pine Ridge, FL Beverly Hills, FL Trip Planner Use our FREE RV trip planner to begin customizing the perfect RV trip. Continue RV Resorts & Campsites in Rainbow Springs State Park Camping is available at the state park campground, along the Rainbow River a few miles from the day use area. All sites have full hookups, and there is a dump station. Pets are allowed in the campground area, but not in much of the park. If you choose to rent an RV, consider renting with RVshare . Each rental vehicle comes with nationwide insurance coverage, 24/7 roadside assistance, and a dedicated team that will work to make sure you have the perfect RV for your travel plans and unique needs. There are also several nearby campgrounds where you can stay while you visit the park: Quail Roost RV Campground This Citrus County RV park is geared towards older folks who appreciate a quiet atmosphere with plenty of activities. The park is a short drive from Crystal River, Kings Bay, and the Rainbow Springs River. Make it your base camp to explore those spots, or spend a day by the pool or participating in one of the classes or activities available at the campground! Water hookup: yes Electrical hookup: yes Sewer hookup: yes Wi-Fi: yes Pet friendly: n/a Other amenities: pool, laundry, showers, planned activities Goethe Trailhead Campground Relax in the fresh country air and enjoy a day at this horse-and-pet-friendly campground. Water hookup: yes Electrical hookup: yes Sewer hookup: yes Wi-Fi: yes Pet friendly: yes Other amenities: horse accommodations, pool, showers RVshare’s Top Picks for Nearby RV Parks & Campgrounds Wildwood RV Village Wild Frontier RV Resort Ocala Sun RV Resort Homosassa River RV Resort Rock Crusher Canyon RV Park Arrowhead Campsites & MHP Sun Retreats Ocala Orange Lake Sportsman's Cove Campground The Cove Pub Campground Lake Panasoffkee RV and Campground View campgrounds near Rainbow Springs State Park RV Rentals Near Rainbow Springs State Park Nearby RV Rentals View More RVs What to Do at Rainbow Springs State Park Inside Rainbow Springs State Park There are a number of things to do at Rainbow Springs State Park. Birding: Rainbow Springs is a wonderful birding area and is park of the Great Florida Birding and Wildlife Trail. You may see woodpeckers, wading birds, hawks, songbirds, and owls, along with other feathered friends. Paddling: Get a close-up view of Florida’s famed moss-covered cypress trees, and float by river otters and wading birds as you paddle the beautiful blue spring waters. Gardens: Gardens and waterfalls remain from when the park was part of a private attraction. The gardens are especially known for their pink, purple, and white azalea blooms every spring. Geocaching: Find coordinates and hints at geocaching.com, then search the park for hidden caches. Geocaching is the perfect activity for the whole family and gets everyone out running around searching for treasures. Hiking: The park offers leisurely strolls through the gardens, with benches for visitors to relax and rest while taking in the sights, sounds, and smells of the area. A native garden that attracts butterflies and hummingbirds is behind the cultural gardens, and a separate nature trail heads behind the gardens to river and phosphate pit overlooks. Snorkeling: Guests can snorkel in the headsprings of the Rainbow River. Swimming: The natural swimming area is between 5-18 feet deep, and the water temperature averages 72°F year-round. Inflatables such as rafts, tubes, and balls are not allowed, but swimmers may wear life preservers or use noodles. Tubing: Tubing is not allowed in the headsprings area of the park, but there is a separate tubing entrance, with shuttle service. Guests can bring their own tubes or rent one there. The float trip takes about two hours to complete. How to Get to Rainbow Springs State Park To get to the Headsprings Entrance: Take I-75 to State Rd. 40 west, which dead ends at U.S. 41. Turn left. The park is on the left. To get to the campground entrance: Head 3.1 miles south of State Rd. 40, or 2.3 miles north of County Rd. 484. To get to the tubing entrance: Head 4.5 miles south of State Rd. 40, or 0.9 miles north of County Rd. 484. The address is 19158 SW 81st Place Rd., Dunnellon, FL. Entering Rainbow Springs State Park There is an entrance fee of $2 per person, with additional fees if you’re planning to rent tubes or use the tubing shuttle. Rainbow Springs State Park Entrance Fee\n              : $2.0 Camping with friends and family is a wonderful way to make memories that are sure to last a lifetime! Renting an RV with RVshare takes a lot of stress off of you and makes the trip easier to plan. Whether you choose to rent an RV near your home and drive, or fly into Florida and rent an RV, you’re sure to have a trip you won’t soon forget! We would love to see pictures of your travels - be sure to send us photos of your trip to [email protected] and tag us on social media. Your memories could be featured on our blog, Facebook, Instagram or Twitter page! Frequently Asked Questions About Rainbow Springs State Park What is the best time of year to visit Rainbow Springs State Park? The best time of year to visit Rainbow Springs State Park is in the springtime. The weather is typically milder, and the flowers are in bloom. The crowds pick up later in the year. What is the climate of Rainbow Springs State Park? The climate of Rainbow Springs State Park is subtropical. The average temperature is 68 degrees Fahrenheit. The park experiences a wet season from May to October and a dry season from November to April. Are there designated RV camping spots in Rainbow Springs State Park? Rainbow Springs State Park offers RV camping with electrical hookups in amps up to 50 amps. There are sewer hookups, a dump station, showers, restrooms, and laundry facilities. The maximum RV length is 103 feet. Do you have to reserve a camping spot at Rainbow Springs State Park and what is the cost? RV spots can be reserved for a small fee of about $30 typically but are subject to your specific RV size and the campground selected. Reservations for RV camping at Rainbow Springs State Park can be done online or by phone. Is Rainbow Springs State Park accessible for disabled visitors? The park offers a variety of accessible features, including wheelchair-accessible picnic tables, fishing piers, and restroom facilities. In addition, the park provides complimentary mobility equipment, such as wheelchairs and walkers. Related Top RV Dump Stations In Florida RV Rentals Near Ginnie Springs RV Rentals Near Lake San Marino RV Rentals Near Lake Breeze RV Park RV Rentals Near Lake Trinity Estates RV Rentals Near Ocala Sun RV Resort RV Rentals Near Lakeside Travel Park RV Rentals Near Encore Lake Magic RV Rentals Near Blueberry Hill RV Resort RV Rentals Near Homosassa River RV Resort RV Rentals Near St. George Island State Park RV Rentals Near Pineglen Motorcoach & RV Park RV Rentals Near Encore Silver Dollar RV Rentals Near Ozello Keys Marina and RV Resort RVshare About us Trust and Safety Careers Press How it Works Blog Affiliates Program Campground Program Corporate and Festival Partnership Program Explore National Parks State Parks Events Campgrounds Dump Stations Road Trips RV Storage RV Repair Companies Partner Deals Renters Search RV Rentals Worry-free Rental Guarantee One Way RV Rentals Help and Support Protection Products & Services Browse RV Models Booking Concierge Services Owners List Your RV List a Park Model Owner Toolkit RV Products and Services Help and Support White Badge © Copyright 2025 RVshare.com Terms of Service Privacy Policy Respectful Community Policy Digital Accessibility at RVshare We use cookies to personalize content and ads, to provide social media features and to analyze our traffic. By visiting RVshare.com, you agree to the use of cookies for these purposes. You can disable cookies at any time by changing your browser settings. View our Privacy Policy. Dismiss"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "text": "Staff & Board of Directors - Diamond Head Theatre Skip to content Box Office: (808) 733-0274 | Business Office: (808) 733-0277 Facebook Instagram YouTube LinkedIn Email Search for: Shows & Tickets Buy Tickets Season Subscriptions Seat Map Show Archive Subscriber Login Donate Annual Giving Capital Campaign Producer’s Club Sponsorship ‘Ilima Awards Auditions Show Auditions Shooting Stars Classes Year-Round Classes Summer Musical Theatre Experience Shooting Stars Instructors Scholarships About Staff & Board of Directors Instructors Volunteer Rentals News Show Archive Your New Theatre Theatrical Arts Building Make a Gift Sponsor a Seat Photos News Capital Campaign Donors Contact BUY TICKETS Staff & Board of Directors Jacque Vaughn 2025-07-23T06:29:51-10:00 STAFF & BOARD OF DIRECTORS We bring the magic of theatre to all Trevor Tamashiro, Executive Director Trevor joined Diamond Head Theatre as Executive Director in April 2023. Born and raised in Hawaii, and a graduate of Punahou School, he brings nearly 20 years of experience in nonprofit executive leadership. Trevor started his journey in New York City working for Broadway Dance Center. Other positions include: Chief Advancement Officer of The Diller-Quaile School of Music; Deputy Director of Saratoga International Theater Institute; and Deputy/Program Director for The Drama League of New York. Trevor is a member of the Association of Fundraising Professionals and is a Certified Fund Raising Executive (CFRE). He holds a degree in Theatre Arts from University of Miami, a Master of Business Administration degree from Pace University, and a Master of Science degree in Nonprofit Management from Columbia University. John Rampage, Artistic Director John Rampage is a performer, actor, choreographer, and director who has served as Diamond Head Theatre’s Artistic Director since 1995. He is the creative mastermind behind all of the theatre’s productions and programs, overseeing the curation of two or more shows each season and selects directors, musical directors, and set designers. His relationship with the theatre began in 1975 where he performed as Tommy Gilas in the 1975 production of Music Man. In the 1980s, Rampage danced and sang his way across the U.S. and Europe and returned in 1991 as choreographer of Evita. More than 120 productions have been shared with the community under his oversight. A 47-time Po‘okela Award winner for excellence in the theatre, John is also the recipient of the Hawaii State Theatre Council 2006 Pierre Bowman Award. OUR TEAM Dana Matlin Business Manager & Capital Campaign Coordinator 808.733-0277 (ext. 303) Krysta Matsuno Individual & Corporate Gifts Manager 808.733-0277 (ext. 306) Erin McFadden Director of Education & Shooting Stars 808.733-0277 (ext. 308) Brando Cutts Facilities & House Manager Volunteer Inquiries 808.733-0277 (ext. 310) Chandler Converse Production & Special Events Coordinator 808.733-0277 (ext. 304) Jamie Martin Box Office Manager 808.733-0277 (ext. 312) Mary Meinel Assistant Box Office Manager Kyle Sombrero Box Office Assistant & Concession Manager Skye Tonokawa Box Office Assistant Andrea Yoo Box Office & Admin Assistant 808.733-0277 (ext. 321) Emily Lane Costume Shop Manager 808.733-0277 (ext. 320) Candy Dungca Lead Stitcher 808.733-0277 (ext. 321) Kanani Sato Stitcher 808.733-0277 (ext. 321) Quinn Curammeng Stitcher 808.733-0277 (ext. 321) Dawn Oshima Lighting Supervisor, Master Stage Electrician 808.733-0277 (ext. 331) Brian Sullivan Technical Director Vincent Green Production Associate 808.733-0277 (ext. 333) Randy Tandal Production Associate 808.733-0277 (ext. 333) Kyle Conner Scene Shop Assistant Ryan Sullivan Scene Shop Assistant Cheyne Nomura House Manager Rochelle Uchibori House Manager Amy Sato Showtime Box Office Assistant Malia Connor Concession Manager Olga Moroz Concession Manager BOARD OF DIRECTORS Officers Colin Miwa CHAIR Trevor Bracher VICE CHAIR, Chair-Elect Mike Ching VICE CHAIR Matthew Pennaz VICE CHAIR Mark Wong VICE CHAIR Jennifer Tanabe SECRETARY Gabe Lee TREASURER Rick Chong IMMEDIATE PAST CHAIR Board Members Cathy Camp Sidney C. L. Char Wayne Chi Rick Ching Jennifer Diesman Uson Y. Ewart Elisia Flores Dennis Francis Candes Meijide Gentry Kay Hampton Randy Harris Todd Iacovelli Kathleen Lin-Hurtubise Mariko Lyons John Magauran, M.D. Tony Mizuno David Okabe Karyn R. Okada Laurence Paxton Nigel Pentland Richard M. Rand Paul M. Saito Kelly Sanders Dean Shigemura Travis Tanaka Sharen Wago Indru Watumull Carolyn A. Berry Wilson Wendell J. Wo Steven Wong Vernon Wong Anna Steenerson Young Diamond Head Theatre is America’s third oldest continuously running community theatre. We are an independent nonprofit that relies on community support. Diamond Head Theatre recognizes the use of diacritical markings in the modern orthography of Hawaiian language. These markings may be omitted to give you the best experience with our website. 520 Makapuu Avenue Honolulu, Hawaii 96816 Box Office Hours: Monday through Friday 10 am to 4 pm Box Office: (808) 733-0274 Business Office: (808) 733-0277 Click Here to Email Us SIGN UP FOR E-NEWS Subscriber Login FOLLOW US © 2024 Diamond Head Theatre | All Rights Reserved | Privacy Policy | About Accessibility | Site created by Transcendence Pacific. Toggle Sliding Bar Area Our Community Giving Campaign needs your kokua to build a new arts complex. Diamond Head Theatre is a 501(c)(3) nonprofit organization. FEIN 99-0073495 Page load link Go to Top"
    },
    {
      "url": "https://lovingstpete.com/blog/rainbow-river-tubing-and-springs/",
      "text": "Rainbow River Tubing and Springs Daytrip to Dunnellon Skip to content Go to... BLOG HOME ST PETE REAL ESTATE INFO CONTACT ST PETE REALTOR ABOUT MIKE + TEAM Real Estate Advice for St Pete & Beaches? Call or Text Realtor Mike Braswell @ 727-510-1084 @LovingStPete is Followed by 95K+ Need Real Estate Advice for St Pete & Beaches? Call/Text Mike! 727-510-1084 Toggle Navigation BLOG HOME ST PETE REAL ESTATE INFO CONTACT ST PETE REALTOR ABOUT MIKE + TEAM Animal Encounters , Date Night , Day Trips , Kids Activity Ideas , Lunch and Dinner Rainbow River Tubing and Springs Daytrip to Dunnellon By St Petersburg Realtor, Mike Braswell Published On: June 24th, 2021 Rainbow River and Springs Daytrip – Tubing P ublished on 06/24/21: When friends ask if you can join them on a float down the Rainbow River, say “YES!”, as we did on Sunday. While it’s a 2 hr drive from St. Pete, we’re talking about a Registered National Landmark, Aquatic Preserve and an “Outstanding Florida Waterway”. Each day, 400 – 600 million gallons of 72 degree fresh water are produced to create the 5.7 mile long Rainbow River. It was drizzly & cloudy, yet we still had a blast, all the more reason to add this #DayTrip to your list. (weather + waterproof phone case were not ideal for 📸, though hopefully these pics give you an idea) Floating down a tranquil river may sound easy enough, however you’ll need to have your ducks in a row to avoid issues. Follow our guide below and you’ll be good to go! There are two common float options: Option 1: (our choice): Park your car at KP Hole Park for a 3-4 hour float to Blue Run of Dunnellon Park. You’ll rent your tube directly from KP Hole for $25/person for ages 6+. Ages 3-5 are free. This covers your entry fee, tube rental & return shuttle service back to your car. Operates from 4/1 – 9/30. Option 2: Park your car at the state park tubing facility, take their tram up-river & float back to your car. Tubes are $20/person, plus a $2 park fee. This is a 1.5 – 2hr hr float and operates seasonally as well. Few Tips for Tubing Rainbow River: 1. You cannot reserve tubes, so arrive at gates near their 8am opening (or reserve using 3rd party such as RainbowRiverKayak.com) 2. Items to bring: Rope to tie tubes together (more fun social-wise), drinking water, waterproof phone case, snacks, goggles/mask to view aquatic life and ideally a speaker for tunes. 3. Young kids imo should opt for the tubes w/ bottoms. Seems safer & less stressful for adults supervising. 4. Disposable items are prohibited. Ie bring a thermos instead of plastic bottles 5. Alcohol is prohibited. 6. You cannot bring your own tube on the KP Hole (longer) float. 7. Visit Swampy’s Bar & Grille afterwards! Simply 100 yards before the Blue Run exit. Live music, food, drinks, kids can play/jump in the river (one of our highlights). 8. While there are gators/snakes all over Florida, we saw none. 9. Kayaks and life jackets can be rented (or bring your own). 10. Try to include the 1K acre Rainbow Springs State Park in your visit as there’s a small beach, swimming/snorkeling area, trails, plus waterfalls (man-made). Open year-round from 8am – sunset. Cost is $2/person for ages 6+, free for < 6. Google Reviews: 197 with a 4.7/5 Average Addresses: (all in city of Dunnellon) KP Hole: 9435 SW 190th Avenue Rd. (352- 489-3055) Blue Run Park: 19680 E Pennsylvania Ave State Park Tubing Facility: 10830 S.W. 180th Ave Rd (833-945-2925) Rainbow Springs State Park: 19158 SW 81st Place Road Phone: KP Hole 352-489-3055 and State Park Tubing Facility 833-945-2925 Website: HOURS AND FEES | Rainbow Springs (visitrainbowsprings.com) I’m a St Petersburg Realtor , with over 25K people following my LovingStPete Guide on social media ! You’ll receive up to $10K at closing when you use my LovingStPete Team to buy or sell a property! My past includes developing a vacation rental advertising business that I ran for more than a decade, then sold to HomeAway/VRBO. I’d love to help you buy or sell a property, simply contact me. Share this article Written by : St Petersburg Realtor, Mike Braswell Mike Braswell is a St Petersburg Realtor, serving St Pete, Clearwater, all nearby beaches and more. He's part of the LovingStPete Team at Keller Williams. Mike, Leah, and Ryan are the trusted real estate team in our area. Mike's Cell: 727-510-1084 Email: [email protected] Mike founded a property advertising business and operated for 10+ years as CEO/Owner, eventually acquired by VRBO. Mike enjoys boating and is an avid tennis player. Mike grew up on an avocado farm with 15+ varieties, some of which you can find in our local Publix/Winn Dixie as his dad still farms the same farm at 88 years old! Leave A Comment Cancel reply You must be logged in to post a comment. Follow us Contact Us Contact Page Name * Last * Phone Email * Message * Captcha SUBMIT St Petersburg Realtor If you are human, leave this field blank. Latest articles September 10, 2025 Paradise Grille in Pass-a-Grille Florida September 10, 2025 Paradise Grille Restaurant in Pass-a-Grille – Video Version of Post September 10, 2025 Bricks & Minifigs in St Pete (aka “BAM”) St Petersburg, 33701 License #: SL3448292 727-510-1084 [email protected] ABOUT Home About Mike Communities Testimonials Contact BUYERS Buying Near St Petersburg SELLERS Sell Your St Pete Property Home Valuation Sold/Pending Communities Old Northeast Shore Acres Venetian Isles Disston Heights Townhome and Condos Waterfront / View LEGAL PRIVACY POLICY © Copyright 2020 – |    Mike Braswell St. Petersburg FL Real Estate @ Keller Williams | St Pete, FL 33702  | All Rights Reserved   | Website Design Page load link Go to Top"
    },
    {
      "url": "https://www.ocalamarion.com/directory/rainbow-springs-state-park/",
      "text": "Rainbow Springs State Park | Ocala / Marion County Florida Skip to content 0 Saved Plan Your Trip Get Our App Equestrian Content Navigation Things to Do Equestrian Outdoor Adventures Indoor Adventures Shopping Arts & Culture Golf Agritourism Spas & Wellness Day Trips & Scenic Drives Events Annual Events Horse Shows & Events Submit Your Event Community Calendar Where to Stay Hotels & Motels Campgrounds & RV Parks Vacation Rentals Bed & Breakfasts Food & Drink Wineries, Breweries & Distilleries Plan Your Visit Transportation Weather & Avg Temperatures FAQs Area Vacation Guide OcalaMarion Travel Guide App E-Newsletter Signup Tropical Weather Updates Plan Your Trip Get Our App Equestrian Content Meetings & Events Blog Sports Events Weddings About Us Partners Download Vacation Guide Email Newsletter Signup Get Exclusive Deals Home Website Rainbow Springs State Park 19158 SW 81st Pl Rd Dunnellon, Florida 34432 United States Details Open in Google Maps Map Rainbow Springs State Park 19158 SW 81st Pl Rd Dunnellon, Florida 34432 (352) 465-8555 Share Overview This is a special place. A place the Earth created millions of years ago to sustain life and bring joy to all who splash in its perfectly clear waters. Today, the 1,000 acre Rainbow Springs State Park offers countless ways to enjoy its beautiful natural environment and crystalline springs that remain 72 degrees year-round. You can paddle or tube down the Rainbow River. Lounge around the small beach at the Headsprings and dive into a cordoned-off swimming area. Take a stroll through the woods and experience lush, mossy hammocks, sloping hills, ornamental gardens and man-made waterfalls. And after youâve worked up an appetite, you can sit down at a charming concession area and enjoy sandwiches, snacks, soft drinks and everyoneâs favorite sweet treat -- ice cream. Rainbow Springs State Park is open every day of the year from 8 a.m. to sunset. Parking Entry $5 per vehicle (2-8 people) $4 per single vehicle or motorcycle $2 per walk up or bicycle Tubing Contact Guest Services at 833-945-2925 for more information about tube rental and shuttle fees. Amenities Amenities Accessible Family Friendly On-site Shuttle Service Paddle Craft Launch Paved Trail Pavilion Pet Friendly Picnic Tables Restrooms RV Site Showers Tent Campground Related Stories & Events Top 11 Things to Do as a Family in Ocala/âMarion County Vacations are the perfect opportunity to make cherished family memories, and Ocala/Marion County is the perfect place to make themâ¦ Details Natural Springs Must-Do Activities in Marion County Here are Marion County's top must-do activities for natural spring lovers. Details 15 Unique Date Night Ideas Plan an exciting and memorable adventure for your sweetheart. Details 40 Things to Do in Ocala/âMarion County There is a LOT to explore when you visit Ocala/Marion County. So much so, in fact, that it can beâ¦ Details Start Planning Your Stay In Ocala Vacation Guide Email Newsletter Visitor Center 109 West Silver Springs Boulevard | Ocala, FL 34475 Phone (352) 438-2800 | 1-888-FL-OCALA About Us Blog Media Contact Us Tour Operators Terms of Use Partners Privacy Policy Accessibility Â©2025 Ocala/Marion County Visitors and Convention Bureau This site uses cookies to provide you with an optimized experience. Privacy Policy Accept Quick Search Search Location Map"
    }
  ]
}