{
  "fuentes": [
    {
      "url": "https://parksaustralia.gov.au/norfolk/about/contact/",
      "email": "norfolkislandnationalpark@dcceew.gov.au"
    },
    {
      "url": "https://www.nps.gov/orgs/1739/contactus.htm",
      "email": "nps_tps@nps.gov"
    },
    {
      "url": "https://www.nps.gov/orgs/1739/contactus.htm",
      "email": "app-promo-phones@2x.png"
    },
    {
      "url": "https://www.nps.gov/orgs/1739/contactus.htm",
      "email": "jennifer_balsonalvarez@nps.gov"
    },
    {
      "url": "https://visitstlucie.com/current-beach-waterway-conditions/",
      "email": "tourism@stlucieco.org"
    },
    {
      "url": "https://visitstlucie.com/listing/stan-blum-boat-ramp/",
      "email": "tourism@stlucieco.org"
    },
    {
      "url": "https://www.townofwrightsvillebeach.com/252/Parks-Facilities",
      "email": "parksandrecreation@towb.org"
    },
    {
      "url": "https://www.nps.gov/im/nccn/contactus.htm",
      "email": "katherine_beirne@nps.gov"
    },
    {
      "url": "https://www.nps.gov/im/nccn/contactus.htm",
      "email": "app-promo-phones@2x.png"
    },
    {
      "url": "https://visitstlucie.com/about-us/",
      "email": "bireleyc@stlucieco.org"
    },
    {
      "url": "https://visitstlucie.com/about-us/",
      "email": "tourism@stlucieco.org"
    },
    {
      "url": "https://home.nps.gov/subjects/nationalregister/contactus.htm",
      "email": "app-promo-phones@2x.png"
    },
    {
      "url": "https://home.nps.gov/subjects/nationalregister/contactus.htm",
      "email": "jeff_joeckel@nps.gov"
    },
    {
      "url": "https://visitstlucie.com/beaches/dog-friendly-st-lucie/",
      "email": "tourism@stlucieco.org"
    },
    {
      "url": "https://visitstlucie.com/listing/motorized-kayak-adventures-launch-site/",
      "email": "tourism@stlucieco.org"
    },
    {
      "url": "https://northbayvillage-fl.gov/accessibility-improvements-coming-to-kennedy-causeway-crossings/",
      "email": "actionteam@nbvillage.com"
    }
  ],
  "mails": [
    "actionteam@nbvillage.com",
    "app-promo-phones@2x.png",
    "bireleyc@stlucieco.org",
    "jeff_joeckel@nps.gov",
    "jennifer_balsonalvarez@nps.gov",
    "katherine_beirne@nps.gov",
    "norfolkislandnationalpark@dcceew.gov.au",
    "nps_tps@nps.gov",
    "parksandrecreation@towb.org",
    "tourism@stlucieco.org"
  ],
  "nombre_sitio": "visitstlucie.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://parksaustralia.gov.au/norfolk/about/contact/",
      "text": "Contact us | Norfolk Island National Park | Parks Australia Skip to main navigation Skip to main content Skip to search Skip to share on social media Norfolk Island National Park Menu Discover Discover Discover Nature Wildlife Plants Conservation Geology History Botanic Garden Phillip Island Norfolk Marine Park Things to do Things to do Things to do Activities Birdwatching Botanic Garden Discovery centre Phillip Island Captain Cook Monument Walks Book ranger-guided walks Tours & events Science at sunset talks Plan Plan Plan Plan your trip Stay Eat Maps & guides Phone & internet Staying safe Permits When to come Getting here Getting around News News News Latest news Bird flu Media centre Norfolk newsletter About About About About us Work with us Privacy notice Contact us Media centre Give feedback Search Search button Norfolk Island National Park About Contact us Contact us Bridle Track. Photo: Norfolk Island Tourism Get in touch with Norfolk Island National Park via phone, email or post. General enquiries Phone: +672 3 22695 Email: NorfolkIslandNationalPark@dcceew.gov.au Media enquiries Please visit our media centre . Postal address Norfolk Island National Park and Botanic Garden PO Box 310 Norfolk Island NSW 2899 Australia Give feedback Give feedback Sign up for Norfolk news Sign up for our monthly newsletter to receive updates about Norfolk Island National Park. Enter your email address Please leave this field empty Let's go I have read the Privacy Notice and consent to my personal information being used and disclosed in accordance with that notice. Australian Government Norfolk Island National Park DISCOVER Nature History Botanic Garden Phillip Island Norfolk Marine Park THINGS TO DO Activities Walks Tours & events PLAN Plan your trip When to come Getting here NEWS Latest news Media centre Norfolk newsletter ABOUT About us Contact us Give feedback Privacy notice Kakadu National Park Uluru Booderee Norfolk Island Christmas Island Pulu Keeling Australian National Botanic Gardens Australian Marine Parks Â© 2013 - 2025 Parks Australia (Commonwealth of Australia) We acknowledge the Traditional Owners of country throughout Australia and recognise their continuing connection to land, waters and culture. We pay our respects to their Elders past, present and emerging."
    },
    {
      "url": "https://www.nps.gov/orgs/1739/contactus.htm",
      "text": "Contact Us - Technical Preservation Services (U.S. National Park Service) An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government\norganization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely connected to\nthe .gov website. Share sensitive information only on official,\nsecure websites. Skip to global NPS navigation Skip to the main content Skip to the footer section National Park Service Search Search This Site All NPS Open Menu Close Menu Explore This Park Explore the National Park Service Exiting nps.gov Cancel Technical Preservation Services Contact Us Contact Us Allen Memorial Church, Edna, Texas Caroline Wright, Texas Historical Commission General Inquiries Main phone:  (202) 354-2060 (Federal Historic Preservation Tax Incentives Program) Main phone:  (202) 513-7270 (General Questions) Email:  NPS_TPS@nps.gov By mail: All US Postal Service mail to Federal agencies in Washington, DC is irradiated, which can damage or destroy materials and can lead to a delay of several weeks in delivery.  We recommend that you contact us via alternate carriers at: Technical Preservation Services National Park Service 1849 C Street, NW Mail Stop 2274 Washington, DC 20240 Read the latest TPS news and susbscribe to TPS updates, including Technical Preservation Services News and TPS Case-Study Snapshots . Looking for the status of a project? Check here first Staff Directory For general inquiries, please use the main phone number or email address above. The lead TPS reviewer for each state, the District of Columbia, Puerto Rico, and the US Virgin Islands is indicated below. Brian Goeken , Chief (202) 354-2033 Illinois, Hawaii, Maine Katherine Anderson (202) 354-2051 Arizona, Kansas, Oklahoma, Texas Vincent Lake, Ph.D. (202) 354-2026 Alabama, California, Connecticut Amanda Apple (202) 354-2296 Alaska, Kentucky, Oregon, Rhode Island, Washington Carol Lovan (202) 354-2023 Admin Office Jennifer Bailey (202) 354-2059 Colorado, Georgia, Idaho, South Carolina Cristin Moody (202) 354-2052 Louisiana, Nevada, Utah Jennifer Balson Alvarez (202) 354-2055 Delaware, Puerto Rico, Tennessee Liz Petrella (202) 354-2040 Maryland, Missouri, North Dakota, Wisconsin Karen Brandt (202) 354-2046 Florida, Minnesota, New York, US Virgin Islands Tina Roach (202) 354-2044 Massachusetts, New Hampshire, Pennsylvania, Vermont Anny Chau (202) 354-2274 Admin Office Angela Shearer (202) 354-2038 District of Columbia, Iowa, Nebraska, New Jersey Raluca Filimon (202) 354-2053 Mississippi, Montana, Ohio Jennifer H. Torres (Oeschger) (202) 354-2025 Indiana, South Dakota, Virginia, Wyoming Melissa Hall (202) 354-2048 Admin Office Amy Elizabeth Uebel (202) 354-2028 Arkansas, Michigan, New Mexico, North Carolina, West Virginia Last updated: June 12, 2025 Tools Site Index Contact Us This Site All NPS Experience Your America. Download the NPS app to navigate the parks on the go. National Park Service U.S. Department of the Interior Accessibility Privacy Policy FOIA Notices Contact The National Park Service NPS FAQ No Fear Act Disclaimer Vulnerability Disclosure Policy USA.gov"
    },
    {
      "url": "https://visitstlucie.com/current-beach-waterway-conditions/",
      "text": "Current Beach & Waterway Conditions - Visit St. Lucie Skip to content Toggle Navigation Trip Builder Communities Weddings & Events Get A Free Guide Live Beach Cams Things to Do Trip Ideas Mets Baseball Performing Arts & Art Galleries Museums & Historical Attractions Entertainment & Nightlife Shopping Spas Nature Tours Water Tours Free Trails, Passes, & Quests Locals Only Outdoor Recreation Boating Fishing Golf Hiking Water Recreation Botanical Gardens Nature Centers Sports & Recreation Beaches Dog-Friendly Beaches Beach Horseback Tours Clothing Optional Beaches Lifeguarded Beaches Eat Stay Beachfront & Waterfront Campgrounds & RV Parks Charming Inns, Boutique Hotels & Unique Stays Hotels & Inns Meeting-Friendly Resort Experience Suites & Extended Stay Vacation Rentals Events Annual Events Boater-Friendly Search this site Search Facebook YouTube Instagram Current Beach & Waterway Conditions Water Quality Conditions – Beaches, Waterways and Estuaries Beach Conditions Hotline: 772-462-1421 Lifeguards provide daily updates by 11am Due to media reports from various sources, we understand you may have concerns before traveling to our area, so we encourage you to use this information to make informed decisions and know the facts. We have gathered information and direct links to obtain the latest report on the water quality conditions of our beaches, waterways and estuaries to help you with your trip planning. Please use this page as a resource as conditions are regularly updated. We also recommend that you contact your hotel or lodging facility, as they will be a good resource for the current conditions at your location within St. Lucie County. Visitor safety is our top priority, therefore we are diligent in ensuring that you are being directed to the proper resources for the most up-to-date information associated with these issues. We can assure you that our residents, local business owners, officials, environmental organizations and elected officials are working hard to find long-term solutions to solve these issues. Please use these links as a resource to stay up-to-date on the latest news and conditions of our beaches, waterways and estuaries. Current Conditions – Check These Useful Links Florida Healthy Beaches Program (Florida Department of Health in St. Lucie County) Information on this site provides biweekly reports on the beach water sampling at designated locations. The coastal beach water samples collected by the county health departments are analyzed for enterococci bacteria. High concentrations of these bacteria may indicate the presence of microorganisms. County health departments will issue health advisories when these conditions are confirmed. Testing is done at a local state certified laboratory and the results are updated twice monthly. St. Lucie River Sampling (Florida Department of Health at St. Lucie County) The St. Lucie County Health Department collects biweekly samples from locations on the North Fork of the St. Lucie River – these include River Park Marina & Veterans Memorial Park in Port St. Lucie. Similar to the Healthy Beaches Program, the water samples are analyzed for enteric bacteria. Advisory signs will be posted, if higher than normal levels of enteric bacteria are present. Florida Department of Environmental Protection (Algal Blooms) Furthering the Florida Department of Environmental Protection’s commitment to making water-quality information more readily available and understandable to the public, the agency has launched a new interactive algal bloom dashboard. This dashboard is a visual enhancement to the state’s existing sampling slate. This data allows the public to easily see where algal blooms are occurring in Florida, in real time. It features real-time updates of sample locations for up to 90 days and all available details related to those samples, such as photos and toxin information. Users can search by specific address, ZIP code, city or place. The tool includes quick links to other resources such as public health information. There is also a brief “How To” video to aid in interacting with the new tool, which is also mobile-friendly. Florida Fish & Wildlife Commission (Red Tide Updates) The Florida Fish & Wildlife Commission regularly reports on the on the current status of Karenia brevis blooms (red tide) using tables, static maps and other online tools. Red Tide Health Concerns: 1-800-222-1222 (Florida Poison Control Center)Report Fish Kills: 1-800-636-0511 (FWC)Shellfish Harvesting Areas: http://shellfish.floridaaquaculture.com/seas/seas_statusmap.htm St. Lucie County Government Use information and updates from this site to contact local St. Lucie County officials if you have any questions. Other Useful Information What is enterococci/enteric bacteria? The Florida Department of Health regularly tests recreational waters for enterococci which is enteric bacteria that normally inhabit the intestinal tract of humans and animals. The presence of enteric bacteria can be an indication of pollution, that if present in high concentrations and are ingested while swimming or entering the skin through a cut or sore, can cause human disease, infections or rashes. If you’re seeing dark-colored water coming from our canals into the Indian River Lagoon or offshore. Water runoff from the canals and streams coming from Lake Okeechobee may cause some discoloration of the water in the Indian River Lagoon in Fort Pierce (near the North Causeway bridge) and offshore leading out of Fort Pierce Inlet. This freshwater contains tannins from plants and other organic material that give the water a darker color than it normally appears. Why is this water being released? Above-average rainfall creates conditions within Lake Okeechobee and the St. Lucie River that causes in large volumes of freshwater being discharged into the river and estuary. How long will the releases last? Freshwater releases from Lake Okeechobee stop once water levels return to normal. For more information, please visit the South Florida Water Management District . What is red tide? In Florida, red tide is a naturally occurring microscopic algae called Karenia brevis or K. brevis that is present in background conditions throughout the year in the Gulf of Mexico. It occurs in saltwater and when natural conditions are right, the organism can form blooms off the coast producing a toxin that can affect the central nervous systems of fish and wildlife. At high concentrations, the blooms may discolor the water – sometimes red, light or dark green, brown or clear. How long can red tide last? Red tide blooms can last days, weeks or months and can also change daily due to wind conditions. Onshore winds normally bring it near the shore and offshore winds drive it out to sea. Can people swim in red tide? Most people can swim in red tide, but it can cause skin irritation and burning eyes. If you experience irritation, get out and thoroughly wash off with fresh water. What are symptoms from breathing in red tide toxins? For most people, coughing, sneezing and teary eyes are temporary symptoms. People with chronic respiratory problems, like asthma and COPD should avoid red tide areas. Can pets swim in red tide? If your pet swims in a red tide patch at the beach, a thorough freshwater rinse as soon as possible is essential. Don’t let your pet play in any sea foam – the foam has been shown to be more toxic than water. Live Webcams See our live web cams below for a real time view of our waterways and beaches that include the Fort Pierce Inlet, the Fort Pierce Inlet Waterway, the Fort Pierce City Marina and the St. Lucie River at Riverwalk Boardwalk in Port St. Lucie. VIEW LIVE WEBCAMS HERE Off the Beach Activities National Navy SEAL-UDT Museum St. Lucie County Aquarium Port St. Lucie Botanical Gardens Manatee Observation Center Hiking at Savannas Preserve State Park 1-800-344-8443 tourism@stlucieco.org Follow Us Facebook YouTube Instagram About Us Transportation Film Commission Media Inquiries Contact Us Get A Free Guide Sign up for eNewsletter Privacy Policy Submit an Event About Us Transportation Film Commission Media Inquiries Contact Us Get A Free Guide Sign up for eNewsletter Privacy Policy Submit an Event © 2025 Visit St. Lucie. All Rights Reserved."
    },
    {
      "url": "https://visitstlucie.com/listing/stan-blum-boat-ramp/",
      "text": "Stan Blum Boat Ramp - Visit St. Lucie Skip to content Toggle Navigation Trip Builder Communities Weddings & Events Get A Free Guide Live Beach Cams Things to Do Trip Ideas Mets Baseball Performing Arts & Art Galleries Museums & Historical Attractions Entertainment & Nightlife Shopping Spas Nature Tours Water Tours Free Trails, Passes, & Quests Locals Only Outdoor Recreation Boating Fishing Golf Hiking Water Recreation Botanical Gardens Nature Centers Sports & Recreation Beaches Dog-Friendly Beaches Beach Horseback Tours Clothing Optional Beaches Lifeguarded Beaches Eat Stay Beachfront & Waterfront Campgrounds & RV Parks Charming Inns, Boutique Hotels & Unique Stays Hotels & Inns Meeting-Friendly Resort Experience Suites & Extended Stay Vacation Rentals Events Annual Events Boater-Friendly Search this site Search Facebook YouTube Instagram Stan Blum Boat Ramp Address 613 N Causeway  Fort Pierce, FL  34949 Map Contact (772) 462-1522 Visit Website Nearby Places To Explore Motorized Kayak Adventures View Listing Hot Reels Offshore Adventures View Listing First Nature Guide Service View Listing Little Jim Bait & Tackle View Listing Dolphin Watch Boat Tours View Listing EZride Surf School View Listing Sunrise City Adventures View Listing Fort Pierce Inlet State Park View Listing Get Up and Go Kayaking View Listing Jack Island Preserve State Park View Listing Stay in Touch With Us Stay up-to-date on St. Lucie events and highlights with our monthly newsletter delivered straight to your inbox. Sign Up Now 1-800-344-8443 tourism@stlucieco.org Follow Us Facebook YouTube Instagram About Us Transportation Film Commission Media Inquiries Contact Us Get A Free Guide Sign up for eNewsletter Privacy Policy Submit an Event About Us Transportation Film Commission Media Inquiries Contact Us Get A Free Guide Sign up for eNewsletter Privacy Policy Submit an Event © 2025 Visit St. Lucie. All Rights Reserved."
    },
    {
      "url": "https://www.townofwrightsvillebeach.com/252/Parks-Facilities",
      "text": "Parks & Facilities | Wrightsville Beach, NC Skip to Main Content Government Services Departments Community Visitors How Do I... Search Accessibility Activities Calendar and Sports League Standings Beach Sweep Business on the Beach Permit Application Film Permit Application Fitness Classes Harbor Way Gardens Parks & Facilities Parks & Recreation Advisory Committee Parks & Recreation Planning Documents Home Government Departments Parks & Recreation Parks & Facilities Parks & Facilities The Town of Wrightsville Beach Parks and Recreation provides a variety of facilities and services that contribute significantly toward the community’s overall quality of life. The Town of Wrightsville Beach Parks and Recreation manages and operates the Wrightsville Beach Park and six (6) neighborhood parks and areas: Causeway Mini-Park, Greensboro Street Mini-Park, Durwood Sykes Sunset Park, Lee’s Nature Park, South Channel Park and Wynn Plaza Waterfront Park. To reserve a facility in Wrightsville Beach Park, go to our Online Catalog . Wrightsville Beach Park, 321 Causeway Drive Wrightsville Beach Park Inclusive Playground Thanks to a $300,000 grant from Trillium Health Resources in 2016, the Town of Wrightsville Beach has a beautiful inclusive playground! Play components include: Aero Glider Sensory Components Slides (6) Spin Cups Quattro See-Saw Unity Dome Cruise Line Wacky Log Cozy Cocoon Rockblocks Climbing Tunnel Swings Ladder and Rope Climbers Facilities Available for Reservation at Wrightsville Beach Park For more information about reserving an area, please call the park office at 910-256-7925 or email ParksAndRecreation@towb.org . To reserve a facility in Wrightsville Beach Park, go to our Online Catalog . Fran Russ Recreation Center Softball Field Event Stage Covered Picnic Shelters Soccer Field Harbor Way Gardens Overflow Parking Field Other Facilities at Wrightsville Beach Park: Outdoor Fitness Equipment Basketball Courts Tennis Courts: Three lighted dedicated tennis courts. Pickleball Courts:  Nine lighted permanent pickleball courts. Tennis practice backwall Public Restrooms *Tennis and pickleball court lights are enabled sunset to 10:00 pm each evening.  To illuminate the courts, depress the button on the post located at the court entrance.  The lights will remain illuminated for one hour. The strobe light located at the top of the post will signal that the button must be pushed again to continue for another hour. The courts are often very busy.  Please follow the posted rules when the courts are full to allow everyone a chance to play and enjoy the courts. Pickleball Open Play is available Tuesday, Thursday, and Friday mornings from 7:00 - 11:00 am April - September, and 8:00 am - 12:00 pm October - March.  During Open Play, Court 1 and Court 2 are challenge courts that allow a three game maximum for winners.  Courts 3 - 5 allow for two players on and two players off with a one game limit.  Winners play 2 games (others rotate off).  When 10 paddles are in the rack, four players on four players off.  Courts 6 - 9 follow the posted rules that require players to rotate off the courts after two games when the courts are full. The John T. Nesbitt Loop \"The Loop\" One of the most popular facilities offered by the Town of Wrightsville Beach is the John T. Nesbitt Loop. “The Loop” as it is locally addressed, is a walking/jogging looped trail approximately 2.45 miles long that runs along Causeway Drive, across the South Banks Channel Bridge onto the barrier island, along North Lumina Avenue to West Salisbury Street and then swings back until it reconnects with Causeway Drive. The trail provides a paved surface for walking/jogging as well as designated rest areas with water. The trail is approximately 4 feet wide and follows the designated pedestrian sidewalk. Click here for a Loop Map ! Harbor Way Gardens, 321 Causeway Drive Harbor Way Gardens Information Come enjoy the peaceful splendor and beauty of this lovely gem maintained by the Harbor Island Garden Club. The Harbor Way Gardens are available by reservation for events such as weddings and garden parties. Please contact Wrightsville Beach Parks & Recreation at 910-256-7925 for more information. Visit the Club’s website to learn how you too can become involved and help support their efforts. Causeway Drive Mini-Park, 1 Causeway Drive Causeway Drive Mini-Park Amenities: A quiet respite with a protective fence to sit and watch the tide roll away under the Heide Trask drawbridge. Greensboro Street Mini-Park, 12 West Greensboro Street Greensboro Street Mini-Park Amenities: Playground Equipment with Swings and Climbing Wall Covered Picnic Shelter with Picnic Table Benches Durwood Sykes Sunset Park, 30 Island Drive Durwood Sykes Sunset Park Amenities: Benches—Views of Motts Channel Trash Receptacle Dogi Pot Litter Bags Dispenser Concrete Steps Leading to Motts Channel Lee Nature Park, 453 Causeway Drive Lee’s Nature Park Amenities: Bench—view of salt marsh on Harbor Island Nature oriented park for plant and bird identification South Channel Park, 101 South Channel Drive South Channel Park Amenities: Benches—Views of Banks Channel Steps Leading to Banks Channel waterway Dogi Pot Litter Bags Dispenser Wynn Plaza Waterfront Park, 2 Waynick Boulevard Memorial to Lieutenant Robert M. Wynn, Firefighter, who gave his life in the service of his community on December 6, 1981. Wynn Plaza Waterfront Park Amenities: Transient Dock Outdoor Shower Gazebo Benches Waterfront Walkway Annual Events Farmers' Market Online Catalog Special Event Permits Sign Up for Notifications Parking Parks & Recreation Jobs Pets Visitors & Community Payments Facebook YouTube Contact Us 321 Causeway Drive PO Box 626 Wrightsville Beach, NC 28480 Monday - Friday, 8:00 am - 4:30 pm Phone: 910-256-7900 Fax: 910-256-7910 Site Links Mission Accessibility Privacy Website Administrator Sign In /QuickLinks.aspx Government Websites by CivicPlus® Tides Public Restrooms Hurricane Preparation Trash Schedule Frequently Asked Questions Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.nps.gov/im/nccn/contactus.htm",
      "text": "Contact Us (U.S. National Park Service) An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government\norganization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely connected to\nthe .gov website. Share sensitive information only on official,\nsecure websites. Skip to global NPS navigation Skip to the main content Skip to the footer section National Park Service Search Search This Site All NPS Open Menu Close Menu Explore This Park Explore the National Park Service Exiting nps.gov Cancel North Coast and Cascades Inventory & Monitoring Network Contact Us Contact Us The North Coast and Cascades Network staff funded by the Inventory and Monitoring program are dispersed among the network parks. Our Mailing Address: North Coast & Cascades Network C/O Olympic National Park 600 East Park Ave. Port Angeles, WA 98362-6757 Network I&M Personnel Name Title/Position Andy Ray Program Manager Natasha Antonova GIS Specialist John Boetsch Ecologist Kristen Bonebrake Data Manager Katherine (Kathy) Braun Assistant Data Manager Hazel Galloway Science Communicator ( NCCN Research Learning Center ) Lise Grace Data Technician / Publications Park I&M Personnel Name Title/Position Katie Ewen Aquatic Ecologist Shannon Hagen Biological Science Technician Vacant Physical Science Technician Last updated: March 12, 2025 Tools Contact Us This Site All NPS Experience Your America. Download the NPS app to navigate the parks on the go. National Park Service U.S. Department of the Interior Accessibility Privacy Policy FOIA Notices Contact The National Park Service NPS FAQ No Fear Act Disclaimer Vulnerability Disclosure Policy USA.gov"
    },
    {
      "url": "https://visitstlucie.com/about-us/",
      "text": "About Us - Visit St. Lucie Skip to content Toggle Navigation Trip Builder Communities Weddings & Events Get A Free Guide Live Beach Cams Things to Do Trip Ideas Mets Baseball Performing Arts & Art Galleries Museums & Historical Attractions Entertainment & Nightlife Shopping Spas Nature Tours Water Tours Free Trails, Passes, & Quests Locals Only Outdoor Recreation Boating Fishing Golf Hiking Water Recreation Botanical Gardens Nature Centers Sports & Recreation Beaches Dog-Friendly Beaches Beach Horseback Tours Clothing Optional Beaches Lifeguarded Beaches Eat Stay Beachfront & Waterfront Campgrounds & RV Parks Charming Inns, Boutique Hotels & Unique Stays Hotels & Inns Meeting-Friendly Resort Experience Suites & Extended Stay Vacation Rentals Events Annual Events Boater-Friendly Search this site Search Facebook YouTube Instagram About Visit St. Lucie Promoting St. Lucie County and its communities as a destination is administered through St. Lucie County’s office of tourism. The office of tourism is responsible for creating annual marketing plans and programs to advertise and publicize St. Lucie County and its communities as a destination. The office of tourism operates the day to day activities with leadership and guidance provided by the St. Lucie County Tourist Development Council and the St. Lucie County Board of County Commissioners. To contact a staff member of the St. Lucie County office of tourism, please call or email us. Toll free: (800) 344-8443 or (772) 462-1539 and/or bireleyc@stlucieco.org . 1-800-344-8443 tourism@stlucieco.org Follow Us Facebook YouTube Instagram About Us Transportation Film Commission Media Inquiries Contact Us Get A Free Guide Sign up for eNewsletter Privacy Policy Submit an Event About Us Transportation Film Commission Media Inquiries Contact Us Get A Free Guide Sign up for eNewsletter Privacy Policy Submit an Event © 2025 Visit St. Lucie. All Rights Reserved."
    },
    {
      "url": "https://home.nps.gov/subjects/nationalregister/contactus.htm",
      "text": "Contact Us - National Register of Historic Places (U.S. National Park Service) An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government\norganization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely connected to\nthe .gov website. Share sensitive information only on official,\nsecure websites. Skip to global NPS navigation Skip to the main content Skip to the footer section National Park Service Search Search This Site All NPS Open Menu Close Menu Explore This Park Explore the National Park Service Exiting nps.gov Cancel National Register of Historic Places Contact Us Contact Us The National Register of Historic Places is the official list of the Nation's historic places worthy of preservation. Authorized by the National Historic Preservation Act of 1966, the National Park Service's National Register of Historic Places is part of a national program to coordinate and support public and private efforts to identify, evaluate, and protect America's historic and archeological resources. General Information Frequently Asked Questions Check our FAQ page , then Email National Register Reference National Register address and phone number Mailing Address: National Park Service National Register of Historic Places 1849 C Street, NW (2013) Washington , DC 20240 Phone: (202) 354-2211 Fax: (202) 371-6447 To find out what it means to be listed Please read the What is the National Register page To find out how to list a property Read the How to List a Property page To find out about tax credits or grants Tax credits and grants are handled by different programs: Tax credits: The Federal Historic Preservation Tax Incentives program encourages private sector investment in the rehabilitation and re-use of historic buildings. Grants: The State, Tribal, Local, Plans & Grants Division (STLPG) provides preservation assistance through a variety of programs. Nominations/Properties/Copies To find out if a property is listed Read the Database/Research page , then contact Archives/ General Reference Jeff Joeckel Archivist/Reference/Web 202-354-2225, e-mail us To check the status of a recent nomination Contact the Workflow Unit Workflow Unit Alexis Abernathy Reviewer: Kansas 202-354-2236, e-mail Jeff Joeckel Archivist/Reference/Web 202-354-2225, e-mail To get a copy of a file of a listed property Check our Database and Research page. If we have not posted it online, email us . Staff Contacts Archives/General Reference Archives/ General Reference Jeff Joeckel Archivist/Reference/Web 202-354-2225, e-mail us National Register Historian/Reviewer by state Map showing reviewers' responsibilities by state (same information as on this contact page, but in map format) Historians/Reviewers Alexis Abernathy Reviewer: Kansas 202-354-2236, e-mail Michelle Diedriech Reviewer: Alabama, Arkansas, Florida, Georgia, Louisiana, Ohio, Rhode Island, South Carolina, Tennessee 202-209-3046, e-mail Sherry Frear Reviewer: District of Columbia (DC), New York 202-913-3763, e-mail Jim Gabbert Reviewer: Illinois, Indiana, Kentucky, Maryland, Michigan, Mississippi, North Carolina, Puerto Rico, Vermont, Virginia, Virgin Islands, West Virginia 202-354-2275, e-mail Rachel Leibowitz Reviewer: Iowa, Minnesota, Missouri, Nebraska, New Jersey, North Dakota, Oklahoma, Pennsylvania, South Dakota, Texas, Wisconsin 202-573-2824, e-mail Paul Lusignan Reviewer: Alaska, American Samoa, Arizona, California, Colorado, Federated States of Micronesia, Guam, Hawai'i, Idaho, Marshall Islands, Montana, New Mexico, Nevada, Northern Mariana Islands, Oregon, Palau, Utah, Washington, Wyoming 202-354-2229, e-mail Roger Reed Reviewer: Connecticut, Delaware, Massachusetts, Maine, New Hampshire 202-354-2278, e-mail Michael Roller Archaeologist/ Reviewer e-mail Workflow Unit Workflow Unit Alexis Abernathy Reviewer: Kansas 202-354-2236, e-mail Jeff Joeckel Archivist/Reference/Web 202-354-2225, e-mail Paloma Bolasny 202-354-2174 e-mail Chief, National Register & National Historic Landmarks Program Chief, National Register & National Historic Landmarks Program Sherry Frear 202-913-3763, e-mail Administrative Assistant, National Register of Historic Places, National Historic Landmarks Program Administrative Assistant, National Register of Historic Places, National Historic Landmarks Program Octavia Pearson 202-354-2213, e-mail Keeper of the National Register of Historic Places Keeper of the National Register of Historic Places Joy Beasley 202-354-6991, e-mail The National Park Service is committed to providing high-quality customer service . We welcome your comments and suggestions. Last updated: September 4, 2025 Tools FAQ Contact Us This Site All NPS Experience Your America. Download the NPS app to navigate the parks on the go. National Park Service U.S. Department of the Interior Accessibility Privacy Policy FOIA Notices Contact The National Park Service NPS FAQ No Fear Act Disclaimer Vulnerability Disclosure Policy USA.gov"
    },
    {
      "url": "https://visitstlucie.com/beaches/dog-friendly-st-lucie/",
      "text": "Dog-Friendly St. Lucie - Visit St. Lucie Skip to content Toggle Navigation Trip Builder Communities Weddings & Events Get A Free Guide Live Beach Cams Things to Do Trip Ideas Mets Baseball Performing Arts & Art Galleries Museums & Historical Attractions Entertainment & Nightlife Shopping Spas Nature Tours Water Tours Free Trails, Passes, & Quests Locals Only Outdoor Recreation Boating Fishing Golf Hiking Water Recreation Botanical Gardens Nature Centers Sports & Recreation Beaches Dog-Friendly Beaches Beach Horseback Tours Clothing Optional Beaches Lifeguarded Beaches Eat Stay Beachfront & Waterfront Campgrounds & RV Parks Charming Inns, Boutique Hotels & Unique Stays Hotels & Inns Meeting-Friendly Resort Experience Suites & Extended Stay Vacation Rentals Events Annual Events Boater-Friendly Search this site Search Facebook YouTube Instagram Dog-Friendly St. Lucie From sandy paws on the beach to patio dining with your pup, St. Lucie is a paradise for pet lovers. Whether you’re exploring lush gardens, hitting the trails, or sipping craft brews with your furry companion, this coastal destination has plenty of pet-friendly spots to enjoy. Doggie Dining Grab a bite to eat and bring the pup along for some company. Some of St. Lucie’s dog-friendly restaurants include Second Street Bistro , Cobb’s Landing , Archie’s Seabreeze , Thirsty Turtle Seagrill , and Berry Fresh Cafe . Owners are responsible for reviewing the establishment’s pet policy before visiting. Beach Bumming Coastal Living named Walton Rocks Beach on South Hutchinson Island one of the best dog-friendly beaches in Florida. This 24-acre off-leash beach is a true haven where dogs can run free in the sand and splash in the waves. Fetching Parks St. Lucie is filled with many designated dog parks and pet-friendly attractions. The most fetching dog parks include: Lyngate Dog Park (Port St. Lucie) – A favorite local spot where dogs of all sizes can romp and play. McChesney Park (Port St. Lucie) – A spacious park offering fenced-in areas for dogs to socialize and exercise. Savannas Recreation Area Dog Park (Fort Pierce) – Perfect for pups who love a mix of hiking and social time in fenced play areas. What’s more? Every nature preserve in St. Lucie is Fido-friendly! Some of St. Lucie’s state preserves and botanical gardens also welcome dogs, including Wildcat Cove on North Hutchinson Island, Savannas Preserve State Park in Port St. Lucie, and Heathcote Botanical Gardens in Fort Pierce. Sit & Stay Many St. Lucie hotels, motels, and RV parks invite you to bring along your dog. For a list of St. Lucie’s pet-friendly accommodations, check out the listings below. Owners should review pet policies and weight restrictions before booking. With so many dog-friendly places to explore, St. Lucie is the perfect getaway for you and your furry co-pilot. Pack the leash, grab some treats, and get ready for a pawsome adventure! Search Categories Select Categories Grid View Map View First ‹‹ Previous ‹ 1 – 0 of 0 loading Next › Last ›› loading loading First ‹‹ Previous ‹ 1 – of 0 loading Next › Last ›› #VisitStLUCIE 1-800-344-8443 tourism@stlucieco.org Follow Us Facebook YouTube Instagram About Us Transportation Film Commission Media Inquiries Contact Us Get A Free Guide Sign up for eNewsletter Privacy Policy Submit an Event About Us Transportation Film Commission Media Inquiries Contact Us Get A Free Guide Sign up for eNewsletter Privacy Policy Submit an Event © 2025 Visit St. Lucie. All Rights Reserved."
    },
    {
      "url": "https://visitstlucie.com/listing/motorized-kayak-adventures-launch-site/",
      "text": "Motorized Kayak Adventures - Visit St. Lucie Skip to content Toggle Navigation Trip Builder Communities Weddings & Events Get A Free Guide Live Beach Cams Things to Do Trip Ideas Mets Baseball Performing Arts & Art Galleries Museums & Historical Attractions Entertainment & Nightlife Shopping Spas Nature Tours Water Tours Free Trails, Passes, & Quests Locals Only Outdoor Recreation Boating Fishing Golf Hiking Water Recreation Botanical Gardens Nature Centers Sports & Recreation Beaches Dog-Friendly Beaches Beach Horseback Tours Clothing Optional Beaches Lifeguarded Beaches Eat Stay Beachfront & Waterfront Campgrounds & RV Parks Charming Inns, Boutique Hotels & Unique Stays Hotels & Inns Meeting-Friendly Resort Experience Suites & Extended Stay Vacation Rentals Events Annual Events Boater-Friendly Search this site Search Facebook YouTube Instagram Motorized Kayak Adventures Address 613 N Causeway  Fort Pierce, FL  34949 Map Contact (772) 380-6815 Visit Website Nearby Places To Explore Stan Blum Boat Ramp View Listing Hot Reels Offshore Adventures View Listing First Nature Guide Service View Listing Little Jim Bait & Tackle View Listing Dolphin Watch Boat Tours View Listing EZride Surf School View Listing Sunrise City Adventures View Listing Fort Pierce Inlet State Park View Listing Get Up and Go Kayaking View Listing Jack Island Preserve State Park View Listing Stay in Touch With Us Stay up-to-date on St. Lucie events and highlights with our monthly newsletter delivered straight to your inbox. Sign Up Now 1-800-344-8443 tourism@stlucieco.org Follow Us Facebook YouTube Instagram About Us Transportation Film Commission Media Inquiries Contact Us Get A Free Guide Sign up for eNewsletter Privacy Policy Submit an Event About Us Transportation Film Commission Media Inquiries Contact Us Get A Free Guide Sign up for eNewsletter Privacy Policy Submit an Event © 2025 Visit St. Lucie. All Rights Reserved."
    },
    {
      "url": "https://northbayvillage-fl.gov/accessibility-improvements-coming-to-kennedy-causeway-crossings/",
      "text": "Accessibility Improvements Coming to Kennedy Causeway Crossings – North Bay Village Skip to content 305-756-7171 1666 Kennedy Causeway, 3rd Floor, North Bay Village, FL 33141 actionteam@nbvillage.com Facebook-f X-twitter Instagram Youtube Linkedin English Arabic Chinese (Simplified) Dutch English French German Italian Portuguese Russian Spanish About Menu Toggle About Us NBV Community Center & Park News Stormwater Capital Improvement Plan Dashboard Government Menu Toggle Mayor Village Commission Village Manager Village Clerk Menu Toggle Business Impact Estimates Campaign Finance Portal North Bay Village Public Portal Village Attorneys Advisory Boards Menu Toggle Animal Welfare Board Community Enhancement Advisory Board Financial Advisory Board Planning & Zoning Advisory Board Resident Services Advisory Board Sustainability and Resilience Task Force Videos, Agendas & Minutes Department Menu Toggle Building Menu Toggle Building Audit Capital Improvements Projects Code Enforcement Communications Menu Toggle Special Event Permit Application Form Finance Department Human Resources Parks & Recreation Menu Toggle Competitive Recreational Soccer Program Free Youth Basketball Clinic Free Youth Saturday Soccer Planning & Zoning Police Menu Toggle Police Gallery Public Works Menu Toggle Stormwater Capital Improvement Plan Dashboard Utilities & Services Online Services Menu Toggle Apply for a Job Apply for Permits Events & Calendar Miami Dade Community Action & Human Services Menu Toggle Mortgage Relief Program Obtain a Business Tax Receipt Pay Bills Online Report an Issue Request Public Records Scholarships Short Term Vacation Rental Sign up for Alerts Videos, Agendas & Minutes Residents Menu Toggle Annual Budget Events & Calendar New Residents Emerg. Preparedness Menu Toggle FDOT Bridge Alert Notification System Harbor Island Parking Mobile Library Parks Passports Post Office Trash Collection Treasure Island Parking Business Menu Toggle Annual Budgets & Financial Reports Become a Vendor Bids & RFPs Business Tax Receipt Public Records Request STVR Info Initiatives Menu Toggle Cooperative Projects NBV 100 Public Art Stormwater Master Plan Water Service Line Inventory Workforce Housing Program Search for: Search for: Main Menu Accessibility Improvements Coming to Kennedy Causeway Crossings / Commission , News , Press Release / By NBV WEB An important community infrastructure project is now underway in the Village to enhance safety and accessibility for all residents crossing the causeway. Work has started on this exciting project and is expected to be completed by the end of the year. The project will install new accessible pedestrian signals at several key crossing points along the causeway. These signals will include both audible and visual cues to assist residents with visual or hearing impairments when navigating the busy roadway. Specific locations where the new accessibility upgrades will be installed include: -Kennedy Causeway & Adventure Avenue -Kennedy Causeway & Hispanola Avenue -Kennedy Causeway 1800 Block Crossing -Kennedy Causeway & East Treasure Drive Improving safety and accessibility for all of our residents is a top priority for the Village. These new pedestrian signals will make a big difference in helping our disabled neighbors cross the causeway with confidence. Approved Maintenance of Traffic (MOT) plans will help minimize disruptions to causeway traffic during the installation process. The Village asks for the community’s patience as this work is completed. Facebook Twitter LinkedIn Email ← Previous Post Next Post → Register for North Bay Village Updates Subscribe Website Archived Pages Contact Us 305-756-7171 actionteam@nbvillage.com 1666 Kennedy Causeway, 3rd Floor, North Bay Village, FL 33141 Title VI / Non Discrimination Policy and Plan Social Media Facebook-f X-twitter Instagram Youtube Linkedin About Menu Toggle About Us NBV Community Center & Park News Stormwater Capital Improvement Plan Dashboard Government Menu Toggle Mayor Village Commission Village Manager Village Clerk Menu Toggle Business Impact Estimates Campaign Finance Portal North Bay Village Public Portal Village Attorneys Advisory Boards Menu Toggle Animal Welfare Board Community Enhancement Advisory Board Financial Advisory Board Planning & Zoning Advisory Board Resident Services Advisory Board Sustainability and Resilience Task Force Videos, Agendas & Minutes Department Menu Toggle Building Menu Toggle Building Audit Capital Improvements Projects Code Enforcement Communications Menu Toggle Special Event Permit Application Form Finance Department Human Resources Parks & Recreation Menu Toggle Competitive Recreational Soccer Program Free Youth Basketball Clinic Free Youth Saturday Soccer Planning & Zoning Police Menu Toggle Police Gallery Public Works Menu Toggle Stormwater Capital Improvement Plan Dashboard Utilities & Services Online Services Menu Toggle Apply for a Job Apply for Permits Events & Calendar Miami Dade Community Action & Human Services Menu Toggle Mortgage Relief Program Obtain a Business Tax Receipt Pay Bills Online Report an Issue Request Public Records Scholarships Short Term Vacation Rental Sign up for Alerts Videos, Agendas & Minutes Residents Menu Toggle Annual Budget Events & Calendar New Residents Emerg. Preparedness Menu Toggle FDOT Bridge Alert Notification System Harbor Island Parking Mobile Library Parks Passports Post Office Trash Collection Treasure Island Parking Business Menu Toggle Annual Budgets & Financial Reports Become a Vendor Bids & RFPs Business Tax Receipt Public Records Request STVR Info Initiatives Menu Toggle Cooperative Projects NBV 100 Public Art Stormwater Master Plan Water Service Line Inventory Workforce Housing Program Copyright © 2025 North Bay Village. All rights reserved. Disclaimer & Privacy | Sitemap Scroll to Top"
    }
  ]
}