{
  "fuentes": [
    {
      "url": "https://www.visitflagler.com/groups/",
      "email": "alukasik@visitflagler.com"
    },
    {
      "url": "https://www.flagler.edu/about/offices-services",
      "email": "lstevenson@flagler.edu"
    },
    {
      "url": "https://www.flagler.edu/about/offices-services",
      "email": "mharbidge@flagler.edu"
    },
    {
      "url": "https://www.flagler.edu/about/offices-services",
      "email": "admissions@flagler.edu"
    },
    {
      "url": "https://www.flagler.edu/about/offices-services",
      "email": "advancement@flagler.edu"
    },
    {
      "url": "https://www.flagler.edu/about/offices-services",
      "email": "athletics@flagler.edu"
    },
    {
      "url": "https://www.flagler.edu/about/offices-services",
      "email": "businessservices@flagler.edu"
    },
    {
      "url": "https://www.flagler.edu/about/offices-services",
      "email": "humanresources@flagler.edu"
    },
    {
      "url": "https://www.flagler.edu/about/offices-services",
      "email": "marketing@flagler.edu"
    },
    {
      "url": "https://www.flagler.edu/about/offices-services",
      "email": "studentaffairs@flagler.edu"
    },
    {
      "url": "https://pcfchamber.com/visitor-info/",
      "email": "info@pcfchamber.com"
    },
    {
      "url": "https://www.visitflagler.com/contact-us/",
      "email": "adavis@visitflagler.com"
    },
    {
      "url": "https://www.visitflagler.com/contact-us/",
      "email": "alukasik@visitflagler.com"
    },
    {
      "url": "https://www.visitflagler.com/contact-us/",
      "email": "cbrokaw@visitflagler.com"
    },
    {
      "url": "https://www.visitflagler.com/contact-us/",
      "email": "chutsell@visitflagler.com"
    },
    {
      "url": "https://www.visitflagler.com/contact-us/",
      "email": "dnaughton@visitflagler.com"
    },
    {
      "url": "https://www.visitflagler.com/contact-us/",
      "email": "jfiske@visitflagler.com"
    },
    {
      "url": "https://www.visitflagler.com/contact-us/",
      "email": "tarrington@visitflagler.com"
    },
    {
      "url": "https://www.visitflagler.com/about/newsletter/",
      "email": "bill@cfarley.com"
    },
    {
      "url": "https://www.visitflagler.com/economic-development/about/contact-us/",
      "email": "dkey@flaglercounty.gov"
    },
    {
      "url": "https://www.flagler.edu/admissions-aid/visit-flagler",
      "email": "20visit@flagler.edu"
    },
    {
      "url": "https://www.flagler.edu/admissions-aid/visit-flagler",
      "email": "visit@flagler.edu"
    },
    {
      "url": "https://pcfchamber.com/about/contact/",
      "email": "info@pcfchamber.com"
    },
    {
      "url": "https://pcfchamber.com/about/contact/",
      "email": "kelsie@pcfchamber.com"
    }
  ],
  "mails": [
    "20visit@flagler.edu",
    "adavis@visitflagler.com",
    "admissions@flagler.edu",
    "advancement@flagler.edu",
    "alukasik@visitflagler.com",
    "athletics@flagler.edu",
    "bill@cfarley.com",
    "businessservices@flagler.edu",
    "cbrokaw@visitflagler.com",
    "chutsell@visitflagler.com",
    "dkey@flaglercounty.gov",
    "dnaughton@visitflagler.com",
    "humanresources@flagler.edu",
    "info@pcfchamber.com",
    "jfiske@visitflagler.com",
    "kelsie@pcfchamber.com",
    "lstevenson@flagler.edu",
    "marketing@flagler.edu",
    "mharbidge@flagler.edu",
    "studentaffairs@flagler.edu",
    "tarrington@visitflagler.com",
    "visit@flagler.edu"
  ],
  "nombre_sitio": "visitflagler.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.visitflagler.com/groups/",
      "text": "Group Events & Meetings in Palm Coast & the Flagler Beaches Dodge the Dunes Social Hub Weddings Groups Venues Sports Accommodations Services Service Request Form Dodge the Dunes Social Hub Weddings Groups Venues Sports Accommodations Services Service Request Form Web Cams Check Hotel Rates Blog Keyword Search Beaches Beaches Webcams Surf Conservation & Marine Life Weather Dodge The Dunes Free Beach Parking Map Beach FAQs Pet Friendly Zones Activity Rentals explore & share Where To Stay Where To Stay Campgrounds & RV Parks Camping Guide Vacation Rentals Luxury Resort Pet Friendly Hotels, Motels & Inns explore & share Things To Do Things To Do Trip Ideas Attractions History Golf Activity Rentals Restaurants & Bars Top Sea-to-Table Dining Diverse Food Scene Kid Approved Eateries Family-Friendly Things to Do Shopping Eat Shop & Play Local Outdoor Adventures Community & State Parks Swim with Dolphins Boating & Fishing Canoeing & Kayaking Biking & Hiking Birding Horseback Riding On The Beach Surfing Camping Arts & Culture Performing Arts Art Galleries Salons & Spas Pet Friendly Activities explore & share Events Events Annual Events Palm Coast Songwriters Festival This Weekend Submit An Event Events Calendar explore & share About About Visitors Guide & Brochures Newsletter Tourism Partner Site Getting Here Insider's Guide Economic Development Our Communities Special Event Marketing Grant Social Hub explore & share Beaches Webcams Weather Beach FAQs Surf Dodge The Dunes Pet Friendly Zones Conservation & Marine Life Free Beach Parking Map Activity Rentals Where To Stay Campgrounds & RV Parks Camping Guide Luxury Resort Hotels, Motels & Inns Vacation Rentals Pet Friendly Things To Do Trip Ideas Restaurants & Bars Top Sea-to-Table Dining Diverse Food Scene Kid Approved Eateries Outdoor Adventures Community & State Parks Swim with Dolphins Boating & Fishing Canoeing & Kayaking Biking & Hiking Birding Horseback Riding On The Beach Surfing Camping Attractions Family-Friendly Things to Do Arts & Culture Performing Arts Art Galleries History Shopping Salons & Spas Golf Eat Shop & Play Local Pet Friendly Activities Activity Rentals Events Annual Events Palm Coast Songwriters Festival Submit An Event Events Calendar This Weekend About Visitors Guide & Brochures Getting Here Our Communities Newsletter Insider's Guide Special Event Marketing Grant Tourism Partner Site Economic Development Social Hub enews signup Get the latest news and updates! Next Web Cams Check Hotel Rates Blog Dodge the Dunes Social Hub Weddings Groups Venues Sports Accommodations Services Service Request Form Share Hold your next meeting, conference or reunion where the forecast is always sunny! Convenient location in between St. Augustine and Daytona Beach Accommodations for every budget ranging from full service resort, vacation rental homes, condos, limited service hotels, Bed and Breakfast and campgrounds Unique off-site venues- Have your meeting on the beach or with dolphins Diverse dining options- Our restaurants allow you to plan memorable dinners and banquets at unique locations that range from casual to upscale. How We Can Help Each year, Palm Coast and the Flagler Beaches provide many event services in a variety of manners to make your event successful. From partnering with event owners and organizations, to simply assisting with housing or facility needs, we are here to provide support and service. Palm Coast and the Flagler Beaches offer a wide range of assistance not only to attract events to Flagler County, but to ensure their success. We are in the business of making your stay simple, enjoyable and to keep you coming back year after year. We invite you to contact us to discuss funding sources that provide event directors with necessary budget relief, available grants, facility booking, contract negotiations and planning assistance. Palm Coast and the Flagler Beaches will assist you with your preparation and event management needs, Plan Not to Plan! Complimentary Event Service Programs Include: RFP distribution Event planning assistance Qualified meetings may be eligible for discretionary funding Site negotiations Site visits Contract negotiations Familiarization tours Off-site venue recommendations and more Referrals to area restaurants, shopping and attractions Destination literature for all attendees Destination script and images for event registration website (logo’s, photos) TDC rep to welcome group Contact our knowledgeable staff for more detailed information and further assistance or fill out our Groups & Meeting Request form . Amy Lukasik Executive Director alukasik@visitflagler.com Read More Blog (866) 736-9291 Contact Us Privacy Policy Sitemap © 2025 Palm Coast and the Flagler Beaches. All rights reserved. Request yours today Visitor Guide Get the latest news & special offers Sign up for our newsletter Cookies are used for measurement, ads and optimization. By continuing to use our site you agree to our privacy policy ."
    },
    {
      "url": "https://www.flagler.edu/about/offices-services",
      "text": "Offices & Services | Flagler College Skip to main content Utility Visit Apply Deposit Give Contact News & Events Quick Links Academics Academics Degrees & Programs Graduate and Education Programs Signature Programs Flagler Core Center for Global Education Honors Program Undergraduate Research Community Integrative Education Center for Religion and Culture Academic Support Academic Access and Success Registrar Academic Catalog Proctor Library Academic Calendar Admissions & Aid Admissions & Aid Visit Flagler Application Process First Year Applicants International Applicants Transfer Applicants Military & Veterans Applicants Living on Campus Admissions Team Tuition & Fees Cost Details Net Price Calculator Part-time, Graduate, Alumni, and Summer Tuition Residence Hall Costs Due Dates Admitted Students Financial Aid & Scholarships Federal Aid Financial Aid Process Financial Aid Team Grants Scholarships State Aid Apply Now Transfer Student Life Student Life Explore St. Augustine Living On Campus First Year Housing Sophomore Housing Junior/Senior Housing Types of Housing Dining Get Involved Groups & Clubs Student Government Health & Wellness Care Team Counseling Services Educational Initiatives Health Services Wellness Education Safety & Security Annual Security Report Emergency Information SafeSaints Program Career Development Career Assessment Four Year Career Plan Graduate School Preparation Information for Employers Interview and Networking Tips Job and Internship Search Resources Professional Attire Resume and Cover Letter Tips Belonging Student Spaces #FCGradStories 2025 About About Flagler Facts Mission & Vision Our History Support Flagler Leadership Offices & Services Employee Directory Contact Us Athletics Explore Flagler Close Search Flagler.edu Sort by Relevance Authored on Title Main Academics Degrees & Programs Graduate and Education Programs Signature Programs Academic Support Academic Calendar Academic Projects Flagler College Tallahassee Legacy Admissions & Aid Visit Flagler Application Process Tuition and Fees Admissions Team Financial Aid & Scholarships Apply Now Transfer to Flagler College News & Events Breaking Eggs Podcast History Maker in Residence Welcome Week Flagler News Presidential Speaker Series Publications Saints of NYC Saints of Atlanta The Mane Event WFCF Flagler College Radio About Flagler Facts Mission & Vision Our History Support Flagler Leadership Office & Services Employee Directory Contact Us Flagler's Legacy Five-Star Plan Student Life #FCGradStories 2025 Explore St. Augustine Two-Year Live-On Requirement at Flagler College Living On Campus Get Involved Health & Wellness Safety & Security Career Development Center Belonging Student Spaces Utility Mobile Apply Now Visit Deposit Give Athletics Flagler Forward Information for... Admitted Students Current Students Families Alumni Counselors Community Members Faculty & Staff Sites and Tools MyFlagler Saints Connect Canvas Academic Catalog Deposit Net Price Calculator Bookstore Proctor Library Parking Portal Planned Giving Mega Menu Footer Resources & Help Center Employee Directory Offices & Services Continuing Education Home About Offices & Services Offices & Services We have all the resources you need to thrive in your new home away from home. Committed teams are ready to help you on your journey. Campus Administrative Divisions Campus Administrative Divisions Office of the President John A. Delaney Flagler College President President's Bio Laura Stevenson Vice President, Chief of Staff LStevenson@flagler.edu Michelle Harbidge Little Executive Administrative Assistant to the President MHarbidge@flagler.edu (904) 819-6288 Academic Affairs We value the development and academic well-being of our students, faculty, and support team. Our services and programs include: Departments and Programs All Academic Departments and Programs Center for Global Education Honors Program Undergraduate Research Flagler CORE Academic Services Academic Access and Success Institutional Research and Effectiveness Office of the Registrar Proctor Library Our Leadership Dr. Arthur Vanden Houten, Vice President of Academic Affairs Dr. Craig Woefel, Dean of Academic Life Hours of Operation Monday- Friday: 8 AM - 5 PM Location President's Wing, Ponce de Leon Hall Business Services The Division of Business Services is the operations arm of Flagler College and oversees the following: Accounting and Finance Budget Planning and Analysis Student Accounts (Bursar) Payroll Parking Facilities Management Risk Management Campus Planning Purchasing and Auxiliaries Leadership Stacey Matthews, Vice President of Business Services Hours of Operation Monday- Friday: 8 AM - 5 PM Location 3rd Floor of the Lightner Museum 75 King Street Contact Us If you have any questions, please visit our business services pages or email us at businessservices@flagler.edu . Enrollment Services Our top priority is to oversee the experience and relationship between Flagler College and prospective students and their families from the point of inquiry through final decision and enrollment. Learn more about what we do by visiting Admission and Aid . Leadership Deborah Thompson, Vice President of Enrollment Services Hours of Operation Monday- Friday: 8 AM - 5 PM Location Hanke Hall Contact Us If you have any questions, email us at admissions@flagler.edu . Institutional Advancement Institutional Advancement's mission is to help support our students, alumni, parents, faculty, staff, and friends by raising money for: Scholarships and Grants Student Life Programs Preservation of Historic Buildings Academic Programming, Faculty Support and Research Sustainability Fund for the Campus New Initiatives Leadership Kristy Myers , Vice President of Institutional Advancement Hours of Operation Monday- Friday: 8 AM - 5 PM Location 170 Malaga Street Contact Us If you have any questions, email us at advancement@flagler.edu or visit our pages . Marketing & Communication We are the connectors on campus, helping divisions and the College meet their marketing and communication goals. Our top priority is elevating the College's image and reputation through best practices. Our services include: Award-winning publications, videos, and other marketing materials Campus brand experiences and strategy Community and government partnerships Communication Lifecycle Journeys Engaging digital and social media Fun and trendy branded merchandise Quality radio programming Revenue-generating programs Student pre-professional opportunities Leadership Carol Branson, Vice President of Marketing and Communication Hours of Operation Monday- Friday: 8 AM - 5 PM Location 3rd Floor, Proctor Library Contact Us Email us at marketing@flagler.edu or visit our pages if you have any questions. Institutional Technology Flagler College's Institutional Technology department prides itself on fast, friendly service. We are here to help students and employees find technology solutions to fit their needs. SERVICES WE PROVIDE Management of campus computers, servers, and printers Management of campus Internet connectivity Management of network & email accounts Troubleshooting dormitory network connectivity Facilitating purchases of technology equipment and software Referral to local technicians for personal computer help Leadership Gwen Pechan, Vice President of Institutional Technology Hours of Operation Monday- Friday: 8 AM - 5 PM Location 3rd and 2nd Floors, Proctor Library Contact Us Email us at support@flagler.edu or visit our pages if you have any questions. Student Affairs The Division of Student Affairs is composed of several departments, working together, to provide programs, services, and experiences for students in social, recreational, and educational ways. Our #1 goal is to create space for learning and engagement outside of the classroom. Our various resources support students as they journey through college on an individualized path through personal development.  We aim to connect impactful experiences to the campus's Core Values and ensure that students have a safe environment as they become leaders and important voices in a global community. From Campus Recreation to our CARE team, we are here to help students have the best possible Flagler experience because in the Division of Student Affairs, “Excellence is our legacy” is not just a slogan; it’s our call to action. Follow us on social media Instagram Facebook Stay connected through Saints Connect Find out about events taking place on and off campus. Saints Connect Leadership Everett Malcolm, Vice President of Student Affairs Hours of Operation Monday- Friday: 8 AM - 5 PM Location Ringhaver Student Center Contact Us Email us at studentaffairs@flagler.edu or visit our pages if you have any questions. Intercollegiate Athletics At Flagler, winning is not defined simply by a final score. It is shaped by the values we practice: accountability, integrity, professionalism, sportsmanship, and teamwork. Our student-athletes are excelling year-round, on the field and off. Flagler Sports The college competes in 14 varsity sports in Division II of the NCAA and is a six-time recipient of the Peach Belt Conference Institution of the Year Sportsmanship Award. Flagler College Athletics Website Leadership Judd Damon, Athletics Director Hours of Operation Monday- Friday: 8 AM - 5 PM Location Lightner Museum Contact Us Email us at athletics@flagler.edu if you have any questions. Human Resources The Division of Human Resources strives to support our students, faculty members, administrative professionals, and support staff so they may succeed in reaching their full potential. We are committed to facilitating the trailblazing spirit of the Flagler College community through our servant leadership philosophy. We provide an environment that challenges students to pursue higher learning, exercise exemplary citizenship, and adhere to ethical standards.  We continually work to grow as a college and engage with the St. Augustine community. Leadership Kelly Toaston, VP, Chief Human Resources Officer Hours of Operation Monday- Friday: 8 AM - 5 PM Location Lightner Museum Contact Us Email us at humanresources@flagler.edu or visit our Human Resources , or Title IX pages if you have any questions × Back to top Home Contact Us 74 King Street, St. Augustine, FL 32084 (904) 829-6481 admissions@flagler.edu Directions & Parking 74 King Street, St. Augustine, FL 32084 (904) 829-6481 admissions@flagler.edu Directions & Parking Connect With Us Facebook Instagram Twitter Youtube Tiktok Newsletter Social Footer Facebook Instagram Twitter Youtube Tiktok Newsletter Flager Forward Popular Searches Degrees & Programs Living on Campus Take a Virtual Tour News & Events Graduate and Education Programs Popular Searches Degrees & Programs Living on Campus Take a Virtual Tour News & Events Graduate and Education Programs Let Us Help You Resources & Help Center Contact Employee Directory Careers Questions & Comments Let Us Help You Resources & Help Center Contact Employee Directory Careers Questions & Comments Flagler Forward Legal Footer © 2025 Flagler College. All rights reserved. Terms & Conditions Notice of Non-Discrimination Title IX Policies & Resources Flagler College Ease Grant Performance Measures"
    },
    {
      "url": "https://pcfchamber.com/visitor-info/",
      "text": "Home - Palm Coast-Flagler Regional Chamber of Commerce Skip to content Facebook Icon LinkedIn icon Twitter icon Instagram icon Youtube icon Member Login About About Us Advocate Educate Connect Committees Membership Why Join? Membership Levels News & Media Ask Flagler Chamber Business Report Evolve Magazine Flagler Buzz Flagler Live Flagler News Weekly Flagler Radio Palm Coast Observer About Flagler County Flagler County Tourism Flagler County Scorecard Government Sites City of Bunnell Flagler Beach Flagler County Palm Coast Town of Beverly Beach Town of Marineland WELCOME TO THE PALM COAST-FLAGLER Regional Chamber of Commerce directory icon Directory pencil icon Join calendar icon Events lock icon Login The Future of Your Business is Our Business The Palm Coast-Flagler Regional Chamber of Commerce supports the growth and unity of the business community by offering meaningful networking opportunities, strategic advocacy, economic insights, and leadership to help shape the future of Flagler County. Mark Your Calendar Register Today Upcoming Events View Chamber Calendar Join Us As We Grow Your Future When you engage with the Palm Coast-Flagler Regional Chamber, you’re not just gaining access to valuable programs, events, and connections — you’re becoming part of a regional effort to strengthen our economy, grow jobs, and create lasting impact. Your investment and involvement empower the Chamber to advocate for business-friendly policies, provide relevant education, and unite the community around key opportunities. Now is the time to lead, connect, and make a difference — for your business and for Flagler County. Membership Benefits Welcome New Members Ready To Become A Member? Become a member and start growing your business today! Join Now! Shop Local The Chamber encourages you to shop local by using our trusted partners. Business and Professional Services Lodging and Dining Home and Relocation Health and Wellness View Member Directory Elite Partners Visionary Members Advent Spectrum Palm Coast Ford Quantum Electrical UF Health Economic Vitality Partners 4cs whaler bunnell career source cline chiumento craig flagler palms dsc dpd etm evolve ground up motors hammock beach resort hampton inn Flagler flagler county fl health care fpl flagler radio foundation risk hilton ici homes intercoastal bank invisa cook ksw palm coast pierson rayonier seagate smart southern states south state bank sunbelt Next Previous © 2025 Palm Coast-Flagler Regional Chamber of Commerce | Site by GrowthZone Get In Touch! 145 City Place Suite 300A Palm Coast, FL 32164 phone icon 386-283-4884 email icon info@PCFchamber.com Additional Resources Join the Chamber Visitor Information Stay Connected! Facebook Icon LinkedIn icon Twitter icon Instagram icon Youtube icon © 2025 Palm Coast-Flagler Regional Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.visitflagler.com/contact-us/",
      "text": "Contact Us | Palm Coast and The Flagler Beaches Dodge the Dunes Social Hub Weddings Groups Venues Sports Accommodations Services Service Request Form Dodge the Dunes Social Hub Weddings Groups Venues Sports Accommodations Services Service Request Form Web Cams Check Hotel Rates Blog Keyword Search Beaches Beaches Webcams Surf Conservation & Marine Life Weather Dodge The Dunes Free Beach Parking Map Beach FAQs Pet Friendly Zones Activity Rentals explore & share Where To Stay Where To Stay Campgrounds & RV Parks Camping Guide Vacation Rentals Luxury Resort Pet Friendly Hotels, Motels & Inns explore & share Things To Do Things To Do Trip Ideas Attractions History Golf Activity Rentals Restaurants & Bars Top Sea-to-Table Dining Diverse Food Scene Kid Approved Eateries Family-Friendly Things to Do Shopping Eat Shop & Play Local Outdoor Adventures Community & State Parks Swim with Dolphins Boating & Fishing Canoeing & Kayaking Biking & Hiking Birding Horseback Riding On The Beach Surfing Camping Arts & Culture Performing Arts Art Galleries Salons & Spas Pet Friendly Activities explore & share Events Events Annual Events Palm Coast Songwriters Festival This Weekend Submit An Event Events Calendar explore & share About About Visitors Guide & Brochures Newsletter Tourism Partner Site Getting Here Insider's Guide Economic Development Our Communities Special Event Marketing Grant Social Hub explore & share Beaches Webcams Weather Beach FAQs Surf Dodge The Dunes Pet Friendly Zones Conservation & Marine Life Free Beach Parking Map Activity Rentals Where To Stay Campgrounds & RV Parks Camping Guide Luxury Resort Hotels, Motels & Inns Vacation Rentals Pet Friendly Things To Do Trip Ideas Restaurants & Bars Top Sea-to-Table Dining Diverse Food Scene Kid Approved Eateries Outdoor Adventures Community & State Parks Swim with Dolphins Boating & Fishing Canoeing & Kayaking Biking & Hiking Birding Horseback Riding On The Beach Surfing Camping Attractions Family-Friendly Things to Do Arts & Culture Performing Arts Art Galleries History Shopping Salons & Spas Golf Eat Shop & Play Local Pet Friendly Activities Activity Rentals Events Annual Events Palm Coast Songwriters Festival Submit An Event Events Calendar This Weekend About Visitors Guide & Brochures Getting Here Our Communities Newsletter Insider's Guide Special Event Marketing Grant Tourism Partner Site Economic Development Social Hub enews signup Get the latest news and updates! Next Web Cams Check Hotel Rates Blog Contact Us Privacy Policy Sitemap Share Come See Us At Our Visitor Center: Flagler Beach Historical Museum 207 S. Central Ave. Flagler Beach, FL 32136 386-517-2025 Hours of Operation: Monday-Sunday 10 a.m.-4 p.m. Write Us A Letter: Flagler County Tourism Development Office 120 Airport Road, Suite 3 Palm Coast, FL 32164 Call/Fax Us: Toll Number: 866-736-9291 Direct Number: 386-313-4230 Fax Number: 386-437-7330 Amy Lukasik Executive Director alukasik@visitflagler.com Debra Morgan Destination Development & Community Engagement Manager dnaughton@visitflagler.com Courtnee Brokaw Tourism Marketing Manager cbrokaw@visitflagler.com Angelene Davis Marketing Media Manager adavis@visitflagler.com Christina Hutsell Administrative Assistant chutsell@visitflagler.com Tywan Arrington Economic Development Manager tarrington@visitflagler.com James Fiske Tourism Liaison jfiske@visitflagler.com Read More Blog (866) 736-9291 Contact Us Privacy Policy Sitemap © 2025 Palm Coast and the Flagler Beaches. All rights reserved. Request yours today Visitor Guide Get the latest news & special offers Sign up for our newsletter Cookies are used for measurement, ads and optimization. By continuing to use our site you agree to our privacy policy ."
    },
    {
      "url": "https://www.visitflagler.com/about/newsletter/",
      "text": "e-Newsletter Sign Up | Palm Coast & The Flagler Beaches Dodge the Dunes Social Hub Weddings Groups Venues Sports Accommodations Services Service Request Form Dodge the Dunes Social Hub Weddings Groups Venues Sports Accommodations Services Service Request Form Web Cams Check Hotel Rates Blog Keyword Search Beaches Beaches Webcams Surf Conservation & Marine Life Weather Dodge The Dunes Free Beach Parking Map Beach FAQs Pet Friendly Zones Activity Rentals explore & share Where To Stay Where To Stay Campgrounds & RV Parks Camping Guide Vacation Rentals Luxury Resort Pet Friendly Hotels, Motels & Inns explore & share Things To Do Things To Do Trip Ideas Attractions History Golf Activity Rentals Restaurants & Bars Top Sea-to-Table Dining Diverse Food Scene Kid Approved Eateries Family-Friendly Things to Do Shopping Eat Shop & Play Local Outdoor Adventures Community & State Parks Swim with Dolphins Boating & Fishing Canoeing & Kayaking Biking & Hiking Birding Horseback Riding On The Beach Surfing Camping Arts & Culture Performing Arts Art Galleries Salons & Spas Pet Friendly Activities explore & share Events Events Annual Events Palm Coast Songwriters Festival This Weekend Submit An Event Events Calendar explore & share About About Visitors Guide & Brochures Newsletter Tourism Partner Site Getting Here Insider's Guide Economic Development Our Communities Special Event Marketing Grant Social Hub explore & share Beaches Webcams Weather Beach FAQs Surf Dodge The Dunes Pet Friendly Zones Conservation & Marine Life Free Beach Parking Map Activity Rentals Where To Stay Campgrounds & RV Parks Camping Guide Luxury Resort Hotels, Motels & Inns Vacation Rentals Pet Friendly Things To Do Trip Ideas Restaurants & Bars Top Sea-to-Table Dining Diverse Food Scene Kid Approved Eateries Outdoor Adventures Community & State Parks Swim with Dolphins Boating & Fishing Canoeing & Kayaking Biking & Hiking Birding Horseback Riding On The Beach Surfing Camping Attractions Family-Friendly Things to Do Arts & Culture Performing Arts Art Galleries History Shopping Salons & Spas Golf Eat Shop & Play Local Pet Friendly Activities Activity Rentals Events Annual Events Palm Coast Songwriters Festival Submit An Event Events Calendar This Weekend About Visitors Guide & Brochures Getting Here Our Communities Newsletter Insider's Guide Special Event Marketing Grant Tourism Partner Site Economic Development Social Hub enews signup Get the latest news and updates! Next Web Cams Check Hotel Rates Blog Beaches Webcams Weather Beach FAQs Surf Dodge The Dunes Pet Friendly Zones Conservation & Marine Life Free Beach Parking Map Activity Rentals Where To Stay Campgrounds & RV Parks Camping Guide Luxury Resort Hotels, Motels & Inns Vacation Rentals Pet Friendly Things To Do Trip Ideas Restaurants & Bars Top Sea-to-Table Dining Diverse Food Scene Kid Approved Eateries Outdoor Adventures Community & State Parks Swim with Dolphins Boating & Fishing Canoeing & Kayaking Biking & Hiking Birding Horseback Riding On The Beach Surfing Camping Attractions Family-Friendly Things to Do Arts & Culture Performing Arts Art Galleries History Shopping Salons & Spas Golf Eat Shop & Play Local Pet Friendly Activities Activity Rentals Events Annual Events Palm Coast Songwriters Festival Submit An Event Events Calendar This Weekend About Visitors Guide & Brochures Getting Here Our Communities Newsletter Insider's Guide Special Event Marketing Grant Tourism Partner Site Economic Development Social Hub Share Read More Browse Archives Contact Information Please fill out the form below to sign up for our e-newsletter First Name*: Last Name*: Newsletter topics I am interested in*: By selecting a Newsletter Topic you are giving us permission to contact you by Email. Newsletter topics I am interested in Arts & Culture Beach Camping Dining Events & Festivals Family Fun Marine Life & Conservation Outdoor Activities Pet Friendly Weddings Zip Code*: Email*: I have read and agree to the Privacy Policy. * Indicates a required field. Submit Reset Under Florida law, e-mail addresses are public records. If you do not want your e-mail address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing to obtain visitors information. Blog (866) 736-9291 Contact Us Privacy Policy Sitemap © 2025 Palm Coast and the Flagler Beaches. All rights reserved. Request yours today Visitor Guide Get the latest news & special offers Sign up for our newsletter Cookies are used for measurement, ads and optimization. By continuing to use our site you agree to our privacy policy ."
    },
    {
      "url": "https://www.visitflagler.com/economic-development/about/contact-us/",
      "text": "Contact Us Web Cams Keyword Search Venues Planners & Officiants Vendors Vendors Florists Entertainment Catering & Wedding Cakes Transportation Photographers Request Info Tourism Matters Tourism Matters Who We Are and What We Do Responsible Tourism Why Tourism Matters Staff Directory Local Faces of Tourism Job Postings TDC TDC Council Members Meetings Agendas & Meeting Minutes Funding Programs Funding Programs Special Event Marketing Grant Guidelines Application Post Event Packet Beaches and Shoreline Capital Project Funding Program Guidelines Application Reports Reports Economic Impact and Visitor Tracking Data & Monthly Reports Strategic Plan Media Media Press Releases Partner Resources Partner Resources Partner Benefits Partner Newsletter Signup Brand Guidelines Partner Extranet Visitor Newsletter Signup Submit an Event Workshops and Presentations Visitor Eco-Discovery Center Visitor Eco-Discovery Center Partner with the VEDC Conceptual Images and Video Goals and Objectives Featured Services and Amenities Synergy Sports Complex Synergy Sports Complex Indoor Features FAQ Outdoor Features Potential Partnerships What is a Private/Public Partnership (P3)? Why Do We Need a Sports Complex? About About Our Communities Contact Us Our Vision Our Partners Why Flagler Why Flagler Prime Location Lifestyle Cost of Doing Business Talent Pipeline Site Selectors Site Selectors Sites & Buildings Utilities Community Profiles Incentives Work Work Available Jobs & Resources Stats Major Employers Live Live Cost of Living Quality of Life Housing Arts & Culture Education Resources Resources Small Business & Entrepreneurs News & Press Releases Newsletter Sign Up Useful Links Venues Planners & Officiants Vendors Florists Catering & Wedding Cakes Photographers Entertainment Transportation Request Info Tourism Matters Who We Are and What We Do Why Tourism Matters Local Faces of Tourism Responsible Tourism Staff Directory Job Postings TDC Council Members Meetings Agendas & Meeting Minutes Funding Programs Special Event Marketing Grant Guidelines Application Post Event Packet Beaches and Shoreline Capital Project Funding Program Guidelines Application Reports Economic Impact and Visitor Tracking Data & Monthly Reports Strategic Plan Media Press Releases Partner Resources Partner Benefits Partner Extranet Submit an Event Partner Newsletter Signup Visitor Newsletter Signup Workshops and Presentations Brand Guidelines Visitor Eco-Discovery Center Partner with the VEDC Goals and Objectives Featured Services and Amenities Conceptual Images and Video Synergy Sports Complex Indoor Features Outdoor Features What is a Private/Public Partnership (P3)? FAQ Potential Partnerships Why Do We Need a Sports Complex? About Our Communities Our Vision Our Partners Contact Us Why Flagler Prime Location Cost of Doing Business Talent Pipeline Lifestyle Site Selectors Sites & Buildings Community Profiles Incentives Utilities Work Available Jobs & Resources Stats Major Employers Live Cost of Living Housing Education Quality of Life Arts & Culture Resources Small Business & Entrepreneurs Newsletter Sign Up Useful Links News & Press Releases Web Cams Weddings Venues Planners & Officiants Vendors Florists Catering & Wedding Cakes Photographers Entertainment Transportation Request Info Tourism Partner Site Tourism Matters Who We Are and What We Do Why Tourism Matters Local Faces of Tourism Responsible Tourism Staff Directory Job Postings TDC Council Members Meetings Agendas & Meeting Minutes Funding Programs Special Event Marketing Grant Guidelines Application Post Event Packet Beaches and Shoreline Capital Project Funding Program Guidelines Application Reports Economic Impact and Visitor Tracking Data & Monthly Reports Strategic Plan Media Press Releases Partner Resources Partner Benefits Partner Extranet Submit an Event Partner Newsletter Signup Visitor Newsletter Signup Workshops and Presentations Brand Guidelines Visitor Eco-Discovery Center Partner with the VEDC Goals and Objectives Featured Services and Amenities Conceptual Images and Video Synergy Sports Complex Indoor Features Outdoor Features What is a Private/Public Partnership (P3)? FAQ Potential Partnerships Why Do We Need a Sports Complex? Economic Development About Our Communities Our Vision Our Partners Contact Us Why Flagler Prime Location Cost of Doing Business Talent Pipeline Lifestyle Site Selectors Sites & Buildings Community Profiles Incentives Utilities Work Available Jobs & Resources Stats Major Employers Live Cost of Living Housing Education Quality of Life Arts & Culture Resources Small Business & Entrepreneurs Newsletter Sign Up Useful Links News & Press Releases Share Read More Dolores Key, Economic Development Manager dkey@flaglercounty.gov (386) 313-4070 Offices are Located at: 120 Airport Road, 3 rd Floor Palm Coast, Florida 32164 Mailing Address: 1769 East Moody Boulevard Building 2 Bunnell, Florida 32110 Flagler Beach Webcams (386) 313-4070 Contact Us VisitFlagler.com © 2025 Palm Coast and the Flagler Beaches. All rights reserved. Request Your Visitors Guide Get the latest news & updates Sign up for our newsletter Cookies are used for measurement, ads and optimization. By continuing to use our site you agree to our privacy policy ."
    },
    {
      "url": "https://www.flagler.edu/admissions-aid/visit-flagler",
      "text": "Visit Flagler | Flagler College Skip to main content Utility Visit Apply Deposit Give Contact News & Events Quick Links Academics Academics Degrees & Programs Graduate and Education Programs Signature Programs Flagler Core Center for Global Education Honors Program Undergraduate Research Community Integrative Education Center for Religion and Culture Academic Support Academic Access and Success Registrar Academic Catalog Proctor Library Academic Calendar Admissions & Aid Admissions & Aid Visit Flagler Application Process First Year Applicants International Applicants Transfer Applicants Military & Veterans Applicants Living on Campus Admissions Team Tuition & Fees Cost Details Net Price Calculator Part-time, Graduate, Alumni, and Summer Tuition Residence Hall Costs Due Dates Admitted Students Financial Aid & Scholarships Federal Aid Financial Aid Process Financial Aid Team Grants Scholarships State Aid Apply Now Transfer Student Life Student Life Explore St. Augustine Living On Campus First Year Housing Sophomore Housing Junior/Senior Housing Types of Housing Dining Get Involved Groups & Clubs Student Government Health & Wellness Care Team Counseling Services Educational Initiatives Health Services Wellness Education Safety & Security Annual Security Report Emergency Information SafeSaints Program Career Development Career Assessment Four Year Career Plan Graduate School Preparation Information for Employers Interview and Networking Tips Job and Internship Search Resources Professional Attire Resume and Cover Letter Tips Belonging Student Spaces #FCGradStories 2025 About About Flagler Facts Mission & Vision Our History Support Flagler Leadership Offices & Services Employee Directory Contact Us Athletics Explore Flagler Close Search Flagler.edu Sort by Relevance Authored on Title Main Academics Degrees & Programs Graduate and Education Programs Signature Programs Academic Support Academic Calendar Academic Projects Flagler College Tallahassee Legacy Admissions & Aid Visit Flagler Application Process Tuition and Fees Admissions Team Financial Aid & Scholarships Apply Now Transfer to Flagler College News & Events Breaking Eggs Podcast History Maker in Residence Welcome Week Flagler News Presidential Speaker Series Publications Saints of NYC Saints of Atlanta The Mane Event WFCF Flagler College Radio About Flagler Facts Mission & Vision Our History Support Flagler Leadership Office & Services Employee Directory Contact Us Flagler's Legacy Five-Star Plan Student Life #FCGradStories 2025 Explore St. Augustine Two-Year Live-On Requirement at Flagler College Living On Campus Get Involved Health & Wellness Safety & Security Career Development Center Belonging Student Spaces Utility Mobile Apply Now Visit Deposit Give Athletics Flagler Forward Information for... Admitted Students Current Students Families Alumni Counselors Community Members Faculty & Staff Sites and Tools MyFlagler Saints Connect Canvas Academic Catalog Deposit Net Price Calculator Bookstore Proctor Library Parking Portal Planned Giving Mega Menu Footer Resources & Help Center Employee Directory Offices & Services Continuing Education Home Admissions & Aid Visit Flagler Visit Flagler Jump to a Section... Experience Flagler College Experience Flagler College Take in Gilded Age architecture and experience what media outlets worldwide call one of the most beautiful campuses in the country . While you're here, enjoy all that sunny, coastal St. Augustine has to offer — from the walkable historic downtown to miles upon miles of pristine beaches. Virtual Tour Virtual Tour Launch Experience Upcoming Events Upcoming Events Campus Visit Day (October 18, 2025) Designed for prospective high school and transfer students, our open house event will give you the opportunity to gain an insider's look at the admission & financial aid process, meet our esteemed faculty, explore campus with Student Ambassadors, and dine in our fabulous Dining Hall! Register Now Daily Visit Experiences Daily Visit Experiences Information Session and Tour Mondays-Fridays This two-hour in-person visit experience is open to both prospective and admitted students and their families. Learn more about Flagler College and the admission process from our admissions staff, followed by an informative campus tour with our Student Ambassadors. *For registration purposes, Firefox and Safari are preferred internet browsers* Register Now Pardon our Dust Throughout the 2024-2025 academic year, Flagler College will be completing very exciting renovations across campus. While the Office of Admissions is offering visits during this time, please note that our tour route may vary based on the construction locations. Regardless, here are some great tips for enjoying your visit. Group Visit Experiences Group Visit Experiences Mondays-Thursdays Designed to introduce college-readiness middle school programs, high school field trips, and community/state college groups of 10-50 students to our campus. Group Visit Experiences can vary depending on the size of the group and the date of the visit, and takes approximately two hours. Group Visit Experiences are offered during the specified dates below: 2025-2026 Academic Year Semester Dates Fall Semester September 15-November 20 Spring Semester February 2-April 9 Summer A Semester May 18-June 18 Please note: If you are looking to book a Group Visit Experience outside of our specified times above, please email visit@flagler.edu before submitting the request form below. Request a Group Visit Experience Now Travel Information Travel Information We invite you to explore Flagler College and have provided information on traveling to our campus below. As you plan your trip, please contact visit@flagler.edu with any questions you may have. Travel Information Questions about tours? Questions? We're here to help. If you are a prospective student and have questions about admissions visit experiences, please click the \"Admissions Visits\" button to email us. Or, give us a call at 904-819-6220. If you are looking for information about our Historic Tours of the former Hotel Ponce de Leon, please click the \"Historic Tours\" button. Admissions Visits Historic Tours × Back to top Home Contact Us 74 King Street, St. Augustine, FL 32084 (904) 829-6481 admissions@flagler.edu Directions & Parking 74 King Street, St. Augustine, FL 32084 (904) 829-6481 admissions@flagler.edu Directions & Parking Connect With Us Facebook Instagram Twitter Youtube Tiktok Newsletter Social Footer Facebook Instagram Twitter Youtube Tiktok Newsletter Flager Forward Popular Searches Degrees & Programs Living on Campus Take a Virtual Tour News & Events Graduate and Education Programs Popular Searches Degrees & Programs Living on Campus Take a Virtual Tour News & Events Graduate and Education Programs Let Us Help You Resources & Help Center Contact Employee Directory Careers Questions & Comments Let Us Help You Resources & Help Center Contact Employee Directory Careers Questions & Comments Flagler Forward Legal Footer © 2025 Flagler College. All rights reserved. Terms & Conditions Notice of Non-Discrimination Title IX Policies & Resources Flagler College Ease Grant Performance Measures"
    },
    {
      "url": "https://pcfchamber.com/about/contact/",
      "text": "Contact Us  - Palm Coast-Flagler Regional Chamber of Commerce Skip to content Facebook Icon LinkedIn icon Twitter icon Instagram icon Youtube icon Member Login About About Us Advocate Educate Connect Committees Membership Why Join? Membership Levels News & Media Ask Flagler Chamber Business Report Evolve Magazine Flagler Buzz Flagler Live Flagler News Weekly Flagler Radio Palm Coast Observer About Flagler County Flagler County Tourism Flagler County Scorecard Government Sites City of Bunnell Flagler Beach Flagler County Palm Coast Town of Beverly Beach Town of Marineland Contact Us First Name Last Name Organization Title Address Line 1 Address Line 2 City State Postal Code Address Type Country United States Canada Afghanistan Aland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo Democratic Republic of Cook Islands Costa Rica Coted Ivoire Croatia Cuba Curacao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea Bissau Guyana Haiti Heard Island and Mc Donald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isleof Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea Democratic Peoples Republic Korea Republic of Kuwait Kyrgyzstan Lao Peoples Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestine Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Reunion Romania Russian Federation Rwanda Saint Barthelemy Saint Helena Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania Thailand Timor Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands British Virgin Islands US Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Sark Phone Email Contact Preference Comments Send Message Palm Coast-Flagler Regional Chamber of Commerce 145 City Place Suite 300-A Palm Coast, FL 32164 (386) 283-4884 kelsie@pcfchamber.com Powered By GrowthZone © 2025 Palm Coast-Flagler Regional Chamber of Commerce | Site by GrowthZone Get In Touch! 145 City Place Suite 300A Palm Coast, FL 32164 phone icon 386-283-4884 email icon info@PCFchamber.com Additional Resources Join the Chamber Visitor Information Stay Connected! Facebook Icon LinkedIn icon Twitter icon Instagram icon Youtube icon © 2025 Palm Coast-Flagler Regional Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    }
  ]
}