{
  "fuentes": [
    {
      "url": "https://www.visitgulf.com/getyourfeetwet/",
      "email": "info@visitgulf.com"
    },
    {
      "url": "https://www.gulfcoastcf.org/",
      "email": "info@gulfcoastcf.org"
    },
    {
      "url": "https://gulfcoastcenter.org/about-us-history/",
      "email": "admin@yoursite.com"
    },
    {
      "url": "https://www.southbaldwinchamber.com/list/member/gulf-shores-orange-beach-tourism-1386",
      "email": "jeanette@southbaldwinchamber.com"
    },
    {
      "url": "https://www.visitgulf.com/plan-your-trip/",
      "email": "info@visitgulf.com"
    },
    {
      "url": "https://www.gulfcoastcf.org/about-us",
      "email": "info@gulfcoastcf.org"
    },
    {
      "url": "https://www.visitgulf.com/listing/st-joe-bar-&-package/287/",
      "email": "info@visitgulf.com"
    },
    {
      "url": "https://www.visitgulf.com/contact/",
      "email": "info@visitgulf.com"
    },
    {
      "url": "https://www.visitgulf.com/chase-the-sun/",
      "email": "info@visitgulf.com"
    },
    {
      "url": "https://gulfcoastadoptions.com/contact-us/",
      "email": "clay@gulfcoastadoptions.com"
    },
    {
      "url": "https://www.visitgulf.com/blog/post/unleash-the-fun-pet-friendly-parks-in-gulf-county/",
      "email": "info@visitgulf.com"
    },
    {
      "url": "https://www.visitgulf.com/about-us/our-team/",
      "email": "info@visitgulf.com"
    },
    {
      "url": "https://www.visitgulf.com/about-us/our-team/",
      "email": "mario@visitgulf.com"
    },
    {
      "url": "https://www.visitgulf.com/about-us/our-team/",
      "email": "rebecca@visitgulf.com"
    },
    {
      "url": "https://www.visitgulf.com/about-us/our-team/",
      "email": "summer@visitgulf.com"
    },
    {
      "url": "https://www.visitgulf.com/partners/strlicense/",
      "email": "info@visitgulf.com"
    },
    {
      "url": "https://gulfcoastgrillcenter.com/contact-us/",
      "email": "joe@gulfcoastgrillcenter.com"
    },
    {
      "url": "https://gulf.floridahealth.gov/about-us/leadership-team/index.html",
      "email": "gulfchd@flhealth.gov"
    },
    {
      "url": "https://www.visitgulf.com/listing/gulf-county-welcome-center/729/",
      "email": "info@visitgulf.com"
    },
    {
      "url": "https://www.visitgulf.com/things-to-do/beaches/pet-friendly-beaches/",
      "email": "info@visitgulf.com"
    },
    {
      "url": "https://www.gulfshores.com/partners/about/staff/",
      "email": "bgendler@alabamabeaches.com"
    },
    {
      "url": "https://www.gulfshores.com/partners/about/staff/",
      "email": "swestendorf@alabamabeaches.com"
    },
    {
      "url": "https://www.visitgulf.com/plan-your-trip/welcome-center/",
      "email": "info@visitgulf.com"
    },
    {
      "url": "https://www.visitgulf.com/pledgetoprotect/",
      "email": "concierge@visitgulf.com"
    },
    {
      "url": "https://www.visitgulf.com/pledgetoprotect/",
      "email": "info@visitgulf.com"
    },
    {
      "url": "http://www.gulfcoasttec.com/ContactUs",
      "email": "sales@gulfcoasttec.com"
    },
    {
      "url": "https://www.gulfchamber.org/chamber-leadership/",
      "email": "director@gulfchamber.org"
    },
    {
      "url": "https://www.gulfchamber.org/chamber-leadership/",
      "email": "info@gulfchamber.org"
    },
    {
      "url": "https://www.visitgulf.com/centennial/",
      "email": "info@visitgulf.com"
    },
    {
      "url": "https://www.visitgulf.com/centennial/",
      "email": "silvia@visitgulf.com"
    },
    {
      "url": "https://www.visitgulf.com/about-us/advisory-council/",
      "email": "info@visitgulf.com"
    },
    {
      "url": "https://www.gulfcoastcf.org/contact-us",
      "email": "info@gulfcoastcf.org"
    }
  ],
  "mails": [
    "admin@yoursite.com",
    "bgendler@alabamabeaches.com",
    "clay@gulfcoastadoptions.com",
    "concierge@visitgulf.com",
    "director@gulfchamber.org",
    "gulfchd@flhealth.gov",
    "info@gulfchamber.org",
    "info@gulfcoastcf.org",
    "info@visitgulf.com",
    "jeanette@southbaldwinchamber.com",
    "joe@gulfcoastgrillcenter.com",
    "mario@visitgulf.com",
    "rebecca@visitgulf.com",
    "sales@gulfcoasttec.com",
    "silvia@visitgulf.com",
    "summer@visitgulf.com",
    "swestendorf@alabamabeaches.com"
  ],
  "nombre_sitio": "visitgulf.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.visitgulf.com/getyourfeetwet/",
      "text": "Get Your Feet Wet Skip to main content Parks Protect Our Shores Sea Turtles Turtle Trail Keep It Wild Ray the Responsible Raccoon Weddings Planning Tips & Ideas Venues Vendors Request Info Blog Partners Short Term Rental Business License Champions of Tourism Nominate a Champion of Tourism Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Destinations Cape San Blas Indian Pass Port St. Joe St. Joe Beach Wewahitchka Waterways St. Joseph Bay Gulf of America Dead Lakes Intracoastal Waterway & Lake Wimico Indian Pass Lagoon Places To Stay Vacation Rentals Inns & Cottages Camping & RV Parks Hotels & Motels Pet Friendly Restaurants & Nightlife Restaurants Seafood Coffee Shops Kid Friendly Ice Cream & Sweets Pizza Dog Friendly Nightlife Bars Live Music Things to Do Beaches Pet Friendly Beaches Beach Safety Water Activities Shelling & Scalloping Fishing Snorkeling & Diving Kayak & Paddle Boarding Boating & Sailing Boat Ramps & Launches Outdoors & Recreation Biking, Hiking & Walking Golf Horseback Riding Camping Parks Shopping Arts & Culture Museums & Historical Sites Health & Wellness Things To Do With Kids Things To Do With Teenagers Rentals & Concierge Services Tours Events Tupelo Honey Festival Blast On The Bay Songwriters Fest Events Calendar Concerts & Live Music Winter Events Submit Your Event Plan Your Trip Visitor Guide Request Digital Visitor Guide Concierge Program Welcome Center About Gulf County Tupelo Honey History Cape San Blas Lighthouse Maps Gulf County Parks Map Gulf County Trails Gulf County Beach Access Map Gulf County Boat Ramps & Launches Map Weather Newsletter Resources Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Menu Media News Releases Story Ideas Media Gallery About Us Advisory Council Our Team Careers Contact Us Contact Site Map Privacy Policy ADA Compliance Media About Us Contact Site Map Privacy Policy Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife CLOSE MENU Share As happy as we are to have you back on our beaches, you play an important role in keeping yourself and others around you safe during your vacation. We also understand you may have questions when planning your vacation so we are offering the information below that may help you feel at ease before your arrival. It is in all of our hands to keep Gulf County open and safe for everyone. Help us wade in. COVID-19 INFORMATION FOR GULF COUNTY Below are bullet points that may answer your questions when regarding travel to Gulf County, Florida. Gulf County B eaches are open. Bars are open at 100% Capacity Restaurants are at 100% occupancy. Retail is open at 100% capacity. Hair & Nail Salons are open for business. Gyms and fitness centers are open at 100% capacity. The T.H. Stone St. Joseph Peninsula State Park is open for day use activities. Local restaurants & businesses are also offering curbside and delivery options.  Please contact them for more information. If you have any specific questions, please do not hesitate to contact a Concierge at the Gulf County Welcome Center or click on the Chat feature on the homepage of the website. Your Gulf County Adventure Awaits Use the below tools to plan your visit. Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Gulf County Tourist Development Council 150 Captain Fred's Place Port St. Joe, Florida 32456 Call Us: 850-229-7800 800-482-GULF Email Us: info@visitgulf.com Media About Us Contact Site Map Privacy Policy © 2025 Gulf County TDC. All Rights Reserved. ADA Compliance"
    },
    {
      "url": "https://www.gulfcoastcf.org/",
      "text": "Welcome to Gulf Coast Community Foundation | Gulf Coast Community Foundation Skip to main content Search Search Share Facebook Twitter Linkedin Google + Email Ways to Give Grants Scholarships Contact Us Room Rentals Donor Log-in Give Now About Us Board Staff Mission, Vision, & Values Financials & Stewardship Strategic Plan 2024-2027 Careers Our Impact Arts & Culture Civic & Economic Development Disaster Response Education Environment Health & Human Services Professional Advisors Why Gulf Coast CAP® Study Group Let's Partner Together Your Resource Blog Your Philanthropy Ways To Give Creating Your Fund Donor Stories Your Philanthropy Team Community Partners Grants Gulf Coast Leadership Institute Invest In Incredible I3 Digital Room Rentals Media & Events Blog In the News Workshops Publications Brand Toolkit 2024 Impact Report Donor Login Donate Now SARASOTA HOUSING ACTION PLAN A Collaborative Approach to Address Housing Needs LET'S TAKE ACTION NOW TRANSFORMING , TOGETHER . 2024-2027 Strategic Plan TRANSFORM WITH US WE ENVISION THRIVING COMMUNITIES WITH OPPORTUNITIES FOR ALL LEARN MORE Your Philanthropy Your Philanthropy Giving through Gulf Coast LEARN MORE Professional Advisors Professional Advisors Our partners in philanthropy LEARN MORE Annual Report Annual Report 25 Years of Impact LEARN MORE Gulf Coast Counter Main Info Latest News Community Impact $ 610,000,000 Community Impact Philanthropists 850 Philanthropists Yearly Granted (FY24) $ 45,000,000 Yearly Granted (FY24) Together with our donors, we transform our region through bold and proactive philanthropy. GULF COAST BLOG September 9, 2025 Investing in Resources, Prioritizing Our Residents Our commitment to meaningful collaboration drives our work with both donors and community partners. Read more about Gulf Coast's work with Rebuilding Together Greater Florida in Newtown to support home repairs and maintenance. September 2, 2025 Mapping the Story of Our Community We need your voice. Our Vice President of Community Leadership Erin Minor highlights the story of our Regional Scan beginning in 2009 and how it has transformed into a Community Playbook to truly reflect the heart of our region, you. August 25, 2025 Announcing Elizabeth Welch, J.D. as Director of Professional Advisor Relationships We are pleased to announce Elizabeth Welch, J.D. as our Director of Professional Advisor Relationships. Our Blog In the News In the News Contact Headquarters 601 Tamiami Trail South Venice, FL 34285 941.486.4600 Philanthropy Center 1549 State Street Sarasota, FL 34236 941.777.1270 Email info@gulfcoastcf.org Brand Toolkit EIN 59-1052433 SUBSCRIBE TO OUR ENEWS Learn more about how we transform our region. SUBSCRIBE TO OUR ENEWS Learn more about how we transform our region. required Email Address * First Name Last Name no thanks Give Now Gulf Coast can accept online donations for a number of selected funds and organizations. Give Now Find Us on Donor Log-In Board Portal Grants Scholarships Contact Us Privacy Policy Sitemap Copyright 2025 Gulf Coast Community Foundation All Rights Reserved"
    },
    {
      "url": "https://gulfcoastcenter.org/about-us-history/",
      "text": "About Us and History – Gulf Coast Center Get Help Mental Health Services IDD Services Substance Use Services Outreach, Education and Disaster Response Trainings In the News Resources Careers About Us About Us and History Board of Trustees Leadership Local Plans Procurement Opportunities Annual Report Contact 24-Hour Crisis Hotline: 866-729-3848 Main Office/Appointments 1-800-643-0967 Donate Today Facebook Instagram About Us Gulf Coast Center is devoted to advancing health equity, improving availability and access   to services, and eliminating health disparities in our communities. We recognize the spectrum of cultural health beliefs and practices, preferred languages, and communication needs that our community possesses. Gulf Coast Center provides a culturally based framework for care services. We recruit, retain, and promote staff that reflect the diversity of the population that we and our community partners serve. Gulf Coast Center provides accessible, efficient and quality services to support the independent and healthy living of those we serve. Every day, our counselors, therapists, psychiatrists, case workers, peers, support, and administrative staff help our clients get and stay healthy and achieve their greatest potential. We provide a range of services and support for people in Galveston and Brazoria counties with mental health, substance use, and intellectual and developmental disability (IDD) needs. We also provide additional community services, including community education and disaster recovery support. Gulf Coast Center is one of 39 community centers in Texas. Around the state, these centers: Manage and provide lower cost community-based services across all 254 Texas counties, touching the lives of more than 500,000 people with intellectual and developmental disabilities, serious mental illness, and substance use disorders Provide a vital lifeline for Texans in mental health emergency and crisis situations, including veterans and their families Represent a public investment in essential services that reduce demand on higher cost government systems, including institutions, jails, prisons, hospitals, and other local health care entities Ensure local control of resources, responsiveness to community needs, partnerships with local law enforcement, schools, healthcare entities and other community-based organizations You can learn about Texas’ other community centers at the Texas Council website . Mission and Values Gulf Coast Center’s mission is to provide accessible, efficient and quality services to support the independent and healthy living of those we serve. Humanity We value people by serving individuals and families with care and compassion. Excellence We value the pursuit of operational excellence by striving to gain efficiencies, decrease costs, and enhance service delivery through innovation. Accountability We value achievement of an exemplary standard of accountability for our individual and collective performance. Loyalty We value the crucial role which family members and other natural supports play in effective treatment. Teamwork We value collaboration to efficiently maximize resources and improve outcomes of care. Honor We value united and uncompromising resolve as we steadfastly safeguard and evolve our work environment to uphold education, responsible self-direction, and collaborative coaching. You We value commitment to build and strengthen partnerships that benefit the needs and values of our community as a whole. Better community healthcare promoting healthy living Our History There was a time when state institutions were the only support source available to citizens suffering from severe mental disabilities. In 1963, President John F. Kennedy proposed a broad new program that included community mental health centers and signed the Community Mental Health Center Act into law. In 1965, the Texas Legislature passed the Texas Mental Health and Mental Retardation Act, now known as the Texas Mental Health and Intellectual Disabilities Act.  It authorized the creation of community centers to serve as local agencies that would work in partnership with the state and federal government to develop community-based services as alternatives to institutional care. That cooperative approach has driven the Texas “community center” care system for nearly 50 years. The doors of Gulf Coast Center’s first facility opened on December 1, 1969, to provide mental retardation services in La Marque. By October 1971, services had been expanded to include mental health. The Gulf Coast Center has evolved into the suite of integrated, whole-person services we provide today as a Certified Community Behavioral Health Clinic (CCHBC). To achieve CCBHC status, Gulf Coast Center has distinguished itself as efficiently reducing healthcare disparities for our community. This designation demonstrates a commitment to an accountable, culturally competent framework that broadens access to care services for anyone seeking Mental Health, Intellectual and Developmental Disabilities (IDD), and Substance Use Disorder (SUD) services, regardless of their ability to pay. Integrated transitions between service agencies, especially for co-occurring and complex diagnoses, are bridges that must be crossed to ensure safe and equitable care. Gulf Coast Center coordinates that care and provides the wrap-around services needed to keep the community in services and services in the community. NEED HELP NOW? CALL OUR 24-HOUR CRISIS HOTLINE 866-729-3848 See Our Locations Get Assistance Mental Health Services IDD Services Substance Use Services Outreach, Education and Disaster Recovery Trainings About Us Contact/Locations Leadership Board of Trustees Annual Report About Us and History Business/Procurement Opportunities Quick Links Careers Local Plans Privacy Policy and Terms of Use Medical Records Request Open Records Request Complaints Resources Fee Schedule Brochures(English & Spanish) No Surprises Act No Surprises Act – Spanish Charity Care Operating Procedures Search Search (c) 2025 Gulf Coast Center x Search Top Search 1-800-555-5555 admin@yoursite.com This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settings ACCEPT Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. MENU Get Help + Mental Health Services IDD Services Substance Use Services Outreach, Education and Disaster Response Trainings In the News Resources Careers About Us − About Us and History Board of Trustees Leadership Local Plans Procurement Opportunities Annual Report Contact 24-Hour Crisis Hotline: 866-729-3848 Main Office/Appointments 1-800-643-0967 Skip to content Open toolbar Accessibility Tools Increase Text Decrease Text Grayscale High Contrast Negative Contrast Light Background Links Underline Readable Font Reset"
    },
    {
      "url": "https://www.southbaldwinchamber.com/list/member/gulf-shores-orange-beach-tourism-1386",
      "text": "Gulf Shores & Orange Beach Tourism | Visitor Information | Attractions Skip to content The Chamber About Us Chamber Team Board of Directors Foundation Diplomats Young Professionals Chamber Champions FAQ Contact Us Members Business Directory SPOTLIGHT: Business of the Month Member Portal Login Map Member Deals & Discounts Sponsorship & Visibility Opportunities Why Join the Chamber? New Member Application Events Chamber Events AM Connections Business After Hours Chicago Street Supper Club Golf Classic Gulf Coast Hot Air Balloon Festival Leadership Series Magnolia Run Ribbon Cuttings Town Toast WMV Free Enterprise Summit Foundation Academic Banquets BBQ & Blues Cook Off Golf FORE! Education Casino Night Fundraiser Ribbon Cuttings Member Events Community Events Travel to Ireland News & Resources Chamber News Newsletters Find It Local Our Partners & Business Resources Business Licenses & Permits SBAwesome Awards News Releases Media List Hot Deals Workforce Jobs Gateway Workforce Initiative Alabama Department of Workforce Alabama Technology Network (ATN) Alabama Office of Apprenticeship CACC Workforce Development GGC: Leadership Skills Training Alabama Department of Labor Alabama Talent Triad Made in Alabama BCEDA SWAPTE AIDT Gulf Shores & Orange Beach Tourism Categories Visitor Information Attractions 900 Commerce Loop Gulf Shores AL 36542 (251) 974-1510 (800) 745-7263 (251) 974-1509 Send Email Visit Website Hours: Weekdays 8-5; Weekends 9-5 About Us Alabama’s Beaches, formerly known as Gulf Shores and Orange Beach Tourism, is dedicated to marketing the Alabama Gulf Coast as a premier year-round destination. Established in 1993 as the Alabama Gulf Coast Convention & Visitors Bureau, the organization promotes sustainable growth and economic prosperity while enhancing residents' and visitors' quality of life. With a focus on helping guests easily access services for an exceptional vacation experience, Alabama’s Beaches aims to support the region’s communities and natural environment through responsible tourism and stewardship. Video Media Highlights Things To Do Places To Stay Events Restaurants Our Staff Rep/Contact Info Ally Dorrough × Close Ally Dorrough Communications & Marketing Manager Phone: (251) 968-9327 Gulf Shores AL 36547 Beth Gendler × Close Beth Gendler President/CEO Phone: (251) 974-4620 Fax: (251) 974-1509 P.O. Drawer 457 Gulf Shores AL 36547 View Personal Bio Kay Maghan × Public Relations Manager Primary contact for Accessible Travel, Arts, Culinary, Health/Wellness, International Leisure Travel and Winter Visitors Also can assist with Annual Events, Family Travel, History, Homeschool/Roadschool, Girls Getaways and Nature/Outdoors Close Kay Maghan Public Relations Manager Phone: (251) 974-4625 P.O. Drawer 457 Gulf Shores AL 36547 Michelle Russ × Close Michelle Russ Vice President of Sales, Sports & Events Phone: (251) 974-4631 P.O. Drawer 457 Gulf Shores AL 36547 Carlos Serrano × Close Carlos Serrano VP of Finance Phone: (251) 974-1510 P.O. Drawer 457 Gulf Shores AL 36547 Todd Walton × Close Todd Walton Vice President of Marketing Phone: (251) 974-4633 P.O. Drawer 457 Gulf Shores AL 36547 Sally Westendorf × Close Sally Westendorf Executive Assistant Phone: (251) 974-4262 P.O. Drawer 457 Gulf Shores AL 36547 Share × Print Email Facebook Twitter LinkedIn Pinterest Close Tell a Friend × Send Request Cancel © 2025 South Baldwin Chamber of Commerce | Site by GrowthZone Get In Touch! 877.461.3712 200 N Alston St, Foley, AL 36535 Mailing Address P.O. Box 1117, Foley, AL 36535 Email Us Resources Business Directory Events Calendar Join the Chamber! Member Login Socialize Facebook X Instagram LinkedIn YouTube © 2025 South Baldwin Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.visitgulf.com/plan-your-trip/",
      "text": "Plan Your Trip | Gulf County, Florida Skip navigation Skip to main content Parks Protect Our Shores Sea Turtles Turtle Trail Keep It Wild Ray the Responsible Raccoon Weddings Planning Tips & Ideas Venues Vendors Request Info Blog Partners Short Term Rental Business License Champions of Tourism Nominate a Champion of Tourism Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Destinations Cape San Blas Indian Pass Port St. Joe St. Joe Beach Wewahitchka Waterways St. Joseph Bay Gulf of America Dead Lakes Intracoastal Waterway & Lake Wimico Indian Pass Lagoon Places To Stay Vacation Rentals Inns & Cottages Camping & RV Parks Hotels & Motels Pet Friendly Restaurants & Nightlife Restaurants Seafood Coffee Shops Kid Friendly Ice Cream & Sweets Pizza Dog Friendly Nightlife Bars Live Music Things to Do Beaches Pet Friendly Beaches Beach Safety Water Activities Shelling & Scalloping Fishing Snorkeling & Diving Kayak & Paddle Boarding Boating & Sailing Boat Ramps & Launches Outdoors & Recreation Biking, Hiking & Walking Golf Horseback Riding Camping Parks Shopping Arts & Culture Museums & Historical Sites Health & Wellness Things To Do With Kids Things To Do With Teenagers Rentals & Concierge Services Tours Events Tupelo Honey Festival Blast On The Bay Songwriters Fest Events Calendar Concerts & Live Music Winter Events Submit Your Event Plan Your Trip Visitor Guide Request Digital Visitor Guide Concierge Program Welcome Center About Gulf County Tupelo Honey History Cape San Blas Lighthouse Maps Gulf County Parks Map Gulf County Trails Gulf County Beach Access Map Gulf County Boat Ramps & Launches Map Weather Newsletter Resources Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Menu Media News Releases Story Ideas Media Gallery About Us Advisory Council Our Team Careers Contact Us Contact Site Map Privacy Policy ADA Compliance Media About Us Contact Site Map Privacy Policy Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife CLOSE MENU Share Plan Your Trip Destinations Find a place to stay that fits your needs! Gulf County has several destinations that fit each traveler's personality. Want to... Welcome Center If you have made it to town, the Gulf County Welcome Center is the perfect place to design your adventure.   While you... About Gulf County Looking to find out some more information about Gulf County? We have Historical Information as well as information on our World... Things to Do You will find no shortage of things to do in Gulf County on your visit. The incredible scenery is an attraction itself, enjoy over... Events We have a lot to celebrate in Gulf County, all in a laid-back atmosphere without the crowds. Come celebrate beach town style with... Places To Stay Find Your Happy Place. From beachfront vacation homes to hotels, inns and quaint B&B's, visitors are drawn to our low-rise... Concierge Program Visitor Guide Request Newsletter Weather Maps Get Your Feet Wet Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Gulf County Tourist Development Council 150 Captain Fred's Place Port St. Joe, Florida 32456 Call Us: 850-229-7800 800-482-GULF Email Us: info@visitgulf.com Media About Us Contact Site Map Privacy Policy © 2025 Gulf County TDC. All Rights Reserved. ADA Compliance"
    },
    {
      "url": "https://www.gulfcoastcf.org/about-us",
      "text": "About Us | Philanthropy | Gulf Coast Community Foundation Skip to main content Search Search Share Facebook Twitter Linkedin Google + Email Ways to Give Grants Scholarships Contact Us Room Rentals Donor Log-in Give Now About Us Board Staff Mission, Vision, & Values Financials & Stewardship Strategic Plan 2024-2027 Careers Our Impact Arts & Culture Civic & Economic Development Disaster Response Education Environment Health & Human Services Professional Advisors Why Gulf Coast CAP® Study Group Let's Partner Together Your Resource Blog Your Philanthropy Ways To Give Creating Your Fund Donor Stories Your Philanthropy Team Community Partners Grants Gulf Coast Leadership Institute Invest In Incredible I3 Digital Room Rentals Media & Events Blog In the News Workshops Publications Brand Toolkit 2024 Impact Report Donor Login Donate Now About Us Together with our donors, we transform our region through bold and proactive philanthropy. About Us What Is Gulf Coast? The Foundation of Community We are a public charity dedicated to serving the needs of our region. Everything we do here is about the community. What Is Gulf Coast? A Partner in Philanthropy We are a collection of charitable funds created by individuals, families, organizations, and corporations to support their favorite causes, in our region and around the world. A Partner in Philanthropy Here Forever As an endowed organization, Gulf Coast Community Foundation will be here in perpetuity—to address emerging needs and to ensure your gifts continue to do all that you envision. Here Forever Bold and Proactive Opportunity is knocking, more and more loudly, across Florida and the nation. That’s why we can’t wait to innovate to keep our region competitive. Bold and Proactive Making Waves We’re impatient for change to improve our region. We see altering the status quo as our obligation to our community and to our donors. Making Waves OUR STORY The notion of a community caring for its own is written in our organizational DNA. Our foundation was created in 1995 with proceeds from the sale of The Venice Hospital, a community hospital that had been founded by local citizens more than four decades earlier. Over 850 generous philanthropists call Gulf Coast home.  Togethe r with our donors, we have surpassed granting over $610 million in the areas of health and human services, civic and economic development, education, arts and culture, and the environment. Leadership Gulf Coast is uniquely positioned to provide needed leadership on emerging regional issues. Learn More Partnership Everything we do is possible only through the generosity of our donors and the work of our vital nonprofit partners. Learn More Endowed Philanthropy Through the power of endowment, your gift to Gulf Coast today can have impact forever. Learn More Together with our donors, we transform our region through bold and proactive philanthropy. Who Is Gulf Coast? Meet Our Board Our Board of Directors comprises the visionary volunteers who set our agenda. VIEW Meet Our Staff A bold and proactive team that is impatient for change. VIEW Financials & Stewardship Honoring our responsibility to be good stewards. Review Our Financials Our Service Area is Sarasota County, Charlotte County, DeSoto County, Boca Grande, Lakewood Ranch, and Longboat Key, Florida. Contact Headquarters 601 Tamiami Trail South Venice, FL 34285 941.486.4600 Philanthropy Center 1549 State Street Sarasota, FL 34236 941.777.1270 Email info@gulfcoastcf.org Brand Toolkit EIN 59-1052433 SUBSCRIBE TO OUR ENEWS Learn more about how we transform our region. SUBSCRIBE TO OUR ENEWS Learn more about how we transform our region. required Email Address * First Name Last Name no thanks Give Now Gulf Coast can accept online donations for a number of selected funds and organizations. Give Now Find Us on Donor Log-In Board Portal Grants Scholarships Contact Us Privacy Policy Sitemap Copyright 2025 Gulf Coast Community Foundation All Rights Reserved"
    },
    {
      "url": "https://www.visitgulf.com/listing/st-joe-bar-&-package/287/",
      "text": "St. Joe Bar & Package Skip to main content Parks Protect Our Shores Sea Turtles Turtle Trail Keep It Wild Ray the Responsible Raccoon Weddings Planning Tips & Ideas Venues Vendors Request Info Blog Partners Short Term Rental Business License Champions of Tourism Nominate a Champion of Tourism Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Destinations Cape San Blas Indian Pass Port St. Joe St. Joe Beach Wewahitchka Waterways St. Joseph Bay Gulf of America Dead Lakes Intracoastal Waterway & Lake Wimico Indian Pass Lagoon Places To Stay Vacation Rentals Inns & Cottages Camping & RV Parks Hotels & Motels Pet Friendly Restaurants & Nightlife Restaurants Seafood Coffee Shops Kid Friendly Ice Cream & Sweets Pizza Dog Friendly Nightlife Bars Live Music Things to Do Beaches Pet Friendly Beaches Beach Safety Water Activities Shelling & Scalloping Fishing Snorkeling & Diving Kayak & Paddle Boarding Boating & Sailing Boat Ramps & Launches Outdoors & Recreation Biking, Hiking & Walking Golf Horseback Riding Camping Parks Shopping Arts & Culture Museums & Historical Sites Health & Wellness Things To Do With Kids Things To Do With Teenagers Rentals & Concierge Services Tours Events Tupelo Honey Festival Blast On The Bay Songwriters Fest Events Calendar Concerts & Live Music Winter Events Submit Your Event Plan Your Trip Visitor Guide Request Digital Visitor Guide Concierge Program Welcome Center About Gulf County Tupelo Honey History Cape San Blas Lighthouse Maps Gulf County Parks Map Gulf County Trails Gulf County Beach Access Map Gulf County Boat Ramps & Launches Map Weather Newsletter Resources Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Menu Media News Releases Story Ideas Media Gallery About Us Advisory Council Our Team Careers Contact Us Contact Site Map Privacy Policy ADA Compliance Media About Us Contact Site Map Privacy Policy Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife CLOSE MENU Back 1 ( ) St. Joe Bar & Package Visit Website Location Information: 305 Reid Ave Port Saint Joe, FL 32456 850-229-9912 About Map Virtual Tour About Established in 1938, St. Joe Bar & Package is one of Gulf County’s longest operating businesses. Located in downtown Port St. Joe on Reid Avenue, it offers a full liquor bar and package store. Enjoy the shuffleboard, pool tables, darts & juke box everyday! Live entertainment and sports on the big screen on the weekends! Be sure to come cheer on your team with the NFL Sunday ticket during season! Bulk orders welcome for special events. Read More Map Virtual Tour Share Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Gulf County Tourist Development Council 150 Captain Fred's Place Port St. Joe, Florida 32456 Call Us: 850-229-7800 800-482-GULF Email Us: info@visitgulf.com Media About Us Contact Site Map Privacy Policy © 2025 Gulf County TDC. All Rights Reserved. ADA Compliance"
    },
    {
      "url": "https://www.visitgulf.com/contact/",
      "text": "Contact Us | Gulf County Florida. The Official Site for Gulf County Tourism. Skip navigation Skip to main content Parks Protect Our Shores Sea Turtles Turtle Trail Keep It Wild Ray the Responsible Raccoon Weddings Planning Tips & Ideas Venues Vendors Request Info Blog Partners Short Term Rental Business License Champions of Tourism Nominate a Champion of Tourism Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Destinations Cape San Blas Indian Pass Port St. Joe St. Joe Beach Wewahitchka Waterways St. Joseph Bay Gulf of America Dead Lakes Intracoastal Waterway & Lake Wimico Indian Pass Lagoon Places To Stay Vacation Rentals Inns & Cottages Camping & RV Parks Hotels & Motels Pet Friendly Restaurants & Nightlife Restaurants Seafood Coffee Shops Kid Friendly Ice Cream & Sweets Pizza Dog Friendly Nightlife Bars Live Music Things to Do Beaches Pet Friendly Beaches Beach Safety Water Activities Shelling & Scalloping Fishing Snorkeling & Diving Kayak & Paddle Boarding Boating & Sailing Boat Ramps & Launches Outdoors & Recreation Biking, Hiking & Walking Golf Horseback Riding Camping Parks Shopping Arts & Culture Museums & Historical Sites Health & Wellness Things To Do With Kids Things To Do With Teenagers Rentals & Concierge Services Tours Events Tupelo Honey Festival Blast On The Bay Songwriters Fest Events Calendar Concerts & Live Music Winter Events Submit Your Event Plan Your Trip Visitor Guide Request Digital Visitor Guide Concierge Program Welcome Center About Gulf County Tupelo Honey History Cape San Blas Lighthouse Maps Gulf County Parks Map Gulf County Trails Gulf County Beach Access Map Gulf County Boat Ramps & Launches Map Weather Newsletter Resources Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Menu Media News Releases Story Ideas Media Gallery About Us Advisory Council Our Team Careers Contact Us Contact Site Map Privacy Policy ADA Compliance Media About Us Contact Site Map Privacy Policy Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife CLOSE MENU Share Contact Us For inquiries or additional information, contact: Gulf County Tourist Development Council 150 Captain Fred’s Place Port St. Joe, Florida 32456 850-229-7800 800-482-GULF info@visitgulf.com You can also meet our team here . Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Gulf County Tourist Development Council 150 Captain Fred's Place Port St. Joe, Florida 32456 Call Us: 850-229-7800 800-482-GULF Email Us: info@visitgulf.com Media About Us Contact Site Map Privacy Policy © 2025 Gulf County TDC. All Rights Reserved. ADA Compliance"
    },
    {
      "url": "https://www.visitgulf.com/chase-the-sun/",
      "text": "Chase the Sun in Gulf County, Florida | Pet-Friendly Vacations Skip navigation Skip to main content Parks Protect Our Shores Sea Turtles Turtle Trail Keep It Wild Ray the Responsible Raccoon Weddings Planning Tips & Ideas Venues Vendors Request Info Blog Partners Short Term Rental Business License Champions of Tourism Nominate a Champion of Tourism Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Destinations Cape San Blas Indian Pass Port St. Joe St. Joe Beach Wewahitchka Waterways St. Joseph Bay Gulf of America Dead Lakes Intracoastal Waterway & Lake Wimico Indian Pass Lagoon Places To Stay Vacation Rentals Inns & Cottages Camping & RV Parks Hotels & Motels Pet Friendly Restaurants & Nightlife Restaurants Seafood Coffee Shops Kid Friendly Ice Cream & Sweets Pizza Dog Friendly Nightlife Bars Live Music Things to Do Beaches Pet Friendly Beaches Beach Safety Water Activities Shelling & Scalloping Fishing Snorkeling & Diving Kayak & Paddle Boarding Boating & Sailing Boat Ramps & Launches Outdoors & Recreation Biking, Hiking & Walking Golf Horseback Riding Camping Parks Shopping Arts & Culture Museums & Historical Sites Health & Wellness Things To Do With Kids Things To Do With Teenagers Rentals & Concierge Services Tours Events Tupelo Honey Festival Blast On The Bay Songwriters Fest Events Calendar Concerts & Live Music Winter Events Submit Your Event Plan Your Trip Visitor Guide Request Digital Visitor Guide Concierge Program Welcome Center About Gulf County Tupelo Honey History Cape San Blas Lighthouse Maps Gulf County Parks Map Gulf County Trails Gulf County Beach Access Map Gulf County Boat Ramps & Launches Map Weather Newsletter Resources Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Menu Media News Releases Story Ideas Media Gallery About Us Advisory Council Our Team Careers Contact Us Contact Site Map Privacy Policy ADA Compliance Media About Us Contact Site Map Privacy Policy Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife CLOSE MENU Share Welcome to Gulf County—Your Pet-Friendly Paradise Awaits! Pack your leash and sense of adventure—Gulf County, Florida, is calling! Here, pets aren’t just welcome; they’re part of the family. With miles of uncrowded beaches, scenic trails, and wide-open spaces to roam, our destination is designed for those who believe every great vacation should include their four-legged best friend. Whether you’re chasing sunsets along the shore, paddling calm waters, or relaxing at a pet-friendly retreat, Gulf County is the perfect place to unwind and make memories together. We’re thrilled to have you and your loyal companion explore all the joys our laid-back coastal paradise has to offer. Let the tail-wagging adventures begin! Stay Where Tails Wag Happily From cozy beach cottages to spacious vacation rentals, find the perfect place for you and your pet... Read More Sandy Paws, Happy Hearts Explore miles of pristine, pet-friendly beaches where you and your companion can splash, stroll, and... Read More Gulf County, Florida - A Place for People & Pets Kelly, a Gulf County, Florida Local Legend, explains that there are some exclusive things to Gulf... Read More Your Ultimate Pet-Friendly Playbook Discover tips, tricks, and must-visit spots to make your Gulf County getaway unforgettable for you and your four-legged friend. Let the adventures begin! Read More Every Adventure Starts with a Hero Gulf County isn’t just a pet-friendly paradise for your furry family members—it’s a community dedicated to helping every pet find a loving home. The stars of our promotional video, adoptable pets from the St. Joseph Bay Humane Society, are living proof of this mission as they Chase the Sun across Gulf County, waiting for their forever families. At the St. Joseph Bay Humane Society, you can be a part of their story. Whether by adopting, volunteering, or donating, you can help make a difference in their lives and leave Gulf County knowing you’ve done something truly special. Make your trip to Gulf County even more memorable by meeting your future best friend! Visit the St. Joseph Bay Humane Society to connect with adoptable pets looking for their forever families. Whether you’re walking along the shore or relaxing at a pet-friendly retreat, you’ll cherish the joy of bringing a new companion into your life. Adoption Hours: ​ Sunday & Monday: CLOSED Tuesday - Friday: 12:00 PM - 5:00 PM ET Saturday: 10:00 AM - 5:00 PM ET Location : 1007 10th St, Port St Joe, FL 32456 Learn More: https://www.sjbhumanesociety.org/ Volunteer or Donate During Your Stay Be a part of the Gulf County community by giving back to animals in need. Whether you’re here for a day or a week, your kindness can make a world of difference: Volunteer : Walk dogs, cuddle with cats, or assist with shelter activities. Donate Items : Bring supplies like food, treats, toys, and towels from their wish list or drop off much-needed items at the Gulf County Welcome Center during your stay. Meet Our Stars: Adopt Today Support the Humane Society Volunteer While You’re Here Get Your Gulf County, Florida Adventure Pup Passport Today! Unleash the fun with our brand-new Gulf County, Florida Adventure Pup Passport! This limited-edition guide is your ticket to exploring Gulf County's most pet-friendly spots alongside your four-legged best friend. From pet-friendly parks and patios to cozy accommodations and scenic trails, your pup can now be part of the adventure. How It Works: Pick up your free Adventure Pup Passport at the Gulf County Welcome Center. Be sure to snap a photo at the Welcome Center to kick things off and earn your pup an official Adventure Pup bandana. Visit participating locations across Gulf County with your pup and collect stamps as you go Complete 5 stops to receive a branded collapsible water bowl Visit 10+ stops for a chance to win the Grand Prize! Return Your Passport Booklet to the Gulf County Welcome Center to Claim Your Swag! Quantities are limited, so don’t miss out! Passports are valid through April 30, 2025. Stop by the Welcome Center to grab yours and start making unforgettable memories! Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Gulf County Tourist Development Council 150 Captain Fred's Place Port St. Joe, Florida 32456 Call Us: 850-229-7800 800-482-GULF Email Us: info@visitgulf.com Media About Us Contact Site Map Privacy Policy © 2025 Gulf County TDC. All Rights Reserved. ADA Compliance"
    },
    {
      "url": "https://gulfcoastadoptions.com/contact-us/",
      "text": "Contact Us | Gulf Coast Adoptions Skip to content 850-999-7977 Home About Us Attorney Clay Whittaker Cheryl Whittaker Melissa Penniman Christy Rushing Adoption Services DCF Adoption Step-Parent Adoption Relative Adoption Identified Adoption Grandparent Adoption Second-Parent Adoption Open Adoption Private Adoption Same-Sex Adoption Special Needs Adoption Adult Adoption Name Change After Adoption I’m Pregnant Families Waiting to Adopt For Florida Birth Moms For Alabama Birth Moms For Texas Birth Moms I Want to Adopt Resources Testimonials FAQs Blog Videos Adoption Attorney Referrals Contact Us Available 24/7 - No Obligation Call Us Text Us Home About Us Attorney Clay Whittaker Cheryl Whittaker Melissa Penniman Christy Rushing Adoption Services DCF Adoption Step-Parent Adoption Relative Adoption Identified Adoption Grandparent Adoption Second-Parent Adoption Open Adoption Private Adoption Same-Sex Adoption Special Needs Adoption Adult Adoption Name Change After Adoption I’m Pregnant Families Waiting to Adopt For Florida Birth Moms For Alabama Birth Moms For Texas Birth Moms I Want to Adopt Resources Testimonials FAQs Blog Videos Adoption Attorney Referrals Contact Us Contact Us How to Reach Us At Gulf Coast Adoptions, we are available to assist you 24/7. Whether you are an expecting mother, looking to adopt a child, or seeking more information about what our services can do for you, be sure to get in touch with us. We provide services for those throughout Florida and Alabama. Our support staff is standing by to provide you personalized attention every step of the way. Send Us a Confidential Message \" * \" indicates required fields Contact Gulf Coast Adoptions today. First Name * Last Name * Phone * Email Where Are You Located? Tell Us About Your Case Submit 100% Secure & Confidential Our Locations We’re proud to serve our community. Visit us at any convenient location. Locations in Texas coming soon! 115 North Calhoun Street, #5, Tallahassee, FL 32301 4497 Woodbine Road, Pace, FL 32571 195 Grand Boulevard, Suite 101, Miramar Beach, FL 32550 721 Oak Circle Dr. E., Mobile, AL 36609 30 South Spring Street, Pensacola, FL 32502 Contact Us clay@gulfcoastadoptions.com Call Us Text Us Hospitals and Medical Centers Ascension Sacred Heart Pensacola 5151 N 9th Ave, Pensacola, FL 32504 (850) 416-7000 Visit Website HCA Florida West Hospital 83838 N Davis Hwy, Pensacola, FL 32514 (850) 494-3212 Visit Website Baptist Hospital 123 Baptist Way, Pensacola, FL 32503 (448) 227-8478 Visit Website Court Info Escambia County Clerk & Comptroller 190 W Government St, Pensacola, FL 32502 (850) 595-4331 Visit Website Police Stations Escambia County Sheriff's Office 1700 W Leonard St, Pensacola, FL 32501 (850) 436-9630 Visit Website Pensacola Police Department 711 N Hayne St, Pensacola, FL 32501 (850) 435-1900 Visit Website Hospitals and Medical Centers USA Health Children's & Women's Hospital 1700 Center St, Mobile, AL 36604 (251) 415-1000 Visit Website USA Health University Hospital 2451 University Hospital Dr, Mobile, AL 36617 (251) 471-7000 Visit Website Springhill Medical Center 3719 Dauphin St, Mobile, AL (251) 344-9630 Visit Website Court Info Mobile County Probate Court 151 Government St, Mobile, AL 36602 (251) 574-6001 Visit Website Mobile County Domestic Relations Court 205 Government St Ninth Floor, Mobile, AL 36644 (251) 574-8441 Visit Website Police Stations Mobile Police Department Precinct 2 5441 Hwy 90 Suite 25, Mobile, AL 36619 (251) 208-1200 Visit Website Mobile Police Department Precinct 4 8080 Airport Blvd, Mobile, AL 36608 (251) 208-1300 Visit Website Mobile Police Department Central Precinct 55 N Water Street, Mobile, AL 36602 (251) 208-2154 Visit Website Our Locations Pace 4497 Woodbine Road Pace , FL 32571 Miramar Beach 195 Grand Boulevard, Suite 101 Miramar Beach , FL 32550 Mobile 721 Oak Circle Dr. E. Mobile , AL 36609 Pensacola 30 South Spring Street Pensacola , FL 32502 Tallahassee 115 North Calhoun Street, #5 Tallahassee , FL 32301 Gulf Coast Adoptions 24/7 CALL US Text Us clay@gulfcoastadoptions.com Menu Home About Us Adoption Services Blog FAQs Contact Us I’m Pregnant For Birth Moms Families Waiting to Adopt I Want to Adopt For Adoptive Parents Adoption Types DCF Adoption Step-Parent Adoption Identified Adoption Kinship/Relative Adoption Second-Parent Adoption Same-Sex Adoption Special Needs Adoption Copyright © 2025 Gulf Coast Adoptions | Disclaimer | Privacy Policy | Accessibility | Sitemap | Powered by DRIVE Law Firm marketing This copy appears in the a.toggle_overlay div. \" * \" indicates required fields Contact Gulf Coast Adoptions today. First Name * Last Name * Phone * Email Where Are You Located? Tell Us About Your Case Submit 100% Secure & Confidential"
    },
    {
      "url": "https://www.visitgulf.com/blog/post/unleash-the-fun-pet-friendly-parks-in-gulf-county/",
      "text": "Unleash the Fun: Pet-Friendly Parks in Gulf County Skip navigation Skip to main content Parks Protect Our Shores Sea Turtles Turtle Trail Keep It Wild Ray the Responsible Raccoon Weddings Planning Tips & Ideas Venues Vendors Request Info Blog Partners Short Term Rental Business License Champions of Tourism Nominate a Champion of Tourism Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Destinations Cape San Blas Indian Pass Port St. Joe St. Joe Beach Wewahitchka Waterways St. Joseph Bay Gulf of America Dead Lakes Intracoastal Waterway & Lake Wimico Indian Pass Lagoon Places To Stay Vacation Rentals Inns & Cottages Camping & RV Parks Hotels & Motels Pet Friendly Restaurants & Nightlife Restaurants Seafood Coffee Shops Kid Friendly Ice Cream & Sweets Pizza Dog Friendly Nightlife Bars Live Music Things to Do Beaches Pet Friendly Beaches Beach Safety Water Activities Shelling & Scalloping Fishing Snorkeling & Diving Kayak & Paddle Boarding Boating & Sailing Boat Ramps & Launches Outdoors & Recreation Biking, Hiking & Walking Golf Horseback Riding Camping Parks Shopping Arts & Culture Museums & Historical Sites Health & Wellness Things To Do With Kids Things To Do With Teenagers Rentals & Concierge Services Tours Events Tupelo Honey Festival Blast On The Bay Songwriters Fest Events Calendar Concerts & Live Music Winter Events Submit Your Event Plan Your Trip Visitor Guide Request Digital Visitor Guide Concierge Program Welcome Center About Gulf County Tupelo Honey History Cape San Blas Lighthouse Maps Gulf County Parks Map Gulf County Trails Gulf County Beach Access Map Gulf County Boat Ramps & Launches Map Weather Newsletter Resources Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Menu Media News Releases Story Ideas Media Gallery About Us Advisory Council Our Team Careers Contact Us Contact Site Map Privacy Policy ADA Compliance Media About Us Contact Site Map Privacy Policy Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife CLOSE MENU Explore Gulf County Fun Filled Itineraries Family Fun In The Spotlight Adventure Awaits Beyond The Beach All Items More Blog Menu Back Unleash the Fun: Pet-Friendly Parks in Gulf County By admin on Dec. 02, 2024 Welcome to Gulf County, where your furry friends are not just allowed—they’re celebrated! We love those wet noses and cute paws almost as much as they love us. Our pristine beaches, lush parks, and welcoming community make this the perfect destination for a tail-wagging good time. Let's em bark on a journey through our top pet-friendly spots that will have both you and your four-legged companion ready to return again and again. St. Joe Beach Start your adventure at St. Joe Beach, where the soft sand and gentle waves create the perfect playground for pups of all sizes. As you stroll along the shoreline, your dog will delight in the salty breeze and endless opportunities for fetch. Just a short distance away, you'll find the crown jewel for dog owners: Veterans Memorial Park at Beacon Hill . This park is the only public spot in Gulf County where your furry friend can legally roam off-- leash, making it a must-visit destination for energetic puppers of all ages. After working up an appetite, head to WindMark Beach Sunrise Cafe . This charming eatery features delicious food, coffee drinks, and sweet treats. Pets are more than welcome on their patio and as a bonus, WindMark is proud to offer \"pup cups\" to keep your canine companion cool and content while you pause to enjoy a savory chicken salad croissant or the nearly famous fruity pebble waffles (ahem, this is a spot where breakfast is served all day!). For a perfect end to your day, swing by The Mill Mercantile & Social where you can expect a bazaar of groceries, local goods, coffee, and cocktails. This unique venue combines shopping and socializing, allowing you to browse local goods while your pup mingles with other four-legged patrons. Cape San Blas & Indian Pass Next on our pet-friendly tour is the Cape San Blas and Indian Pass areas, home to the stunning Salinas Park Bayside. This park is a testament to Gulf County's commitment to our furry visitors, featuring the Serenity Trail boardwalk complete with a dog water fountain. Here, your pup can stay hydrated while you both enjoy the breathtaking bayside views. No visit to this area is complete without a stop at the legendary Indian Pass Raw Bar . Known for its fresh seafood and laid-back atmosphere, this neighborhood hangout welcomes well-behaved dogs on their outdoor patio. Enjoy some of the best oysters in the region while your pup relaxes at your feet. Port St. Joe In the heart of Port St. Joe, you'll find George Core Park , a green oasis that's part of the extensive Port City Trail is within walking distance of most of the area’s most popular amenities. This park offers an ideal setting for both locals and visitors to walk their dogs, with plenty of space for shade and scenic views. As an added bonus, the pet-friendly Gulf County Welcome Center is right next door, ready to provide you with all the information you need for your day or an extended stay. After your walk, treat yourself and your pup to a meal at the Sand Dollar Cafe . This cozy spot offers outdoor seating where your dog can join you as you devour scratch-made Southern cuisine like crab cakes, Charleston-style shrimp and grits, and plenty of other comfort food classics. For a unique evening out, check out TapRoot PSJ . This no-frills Florida dive bar often hosts live music or entertaining events, and their outdoor area is perfect for enjoying a cold beverage with your fur-buddy by your side. St. Joseph Bay State Buffer Preserve For those seeking a more secluded adventure, the St. Joseph Bay State Buffer Preserve is a welcome change of pace. With its extensive trails winding through natural landscapes, this preserve offers a peaceful retreat for you and your pup to explore Florida's diverse ecosystems. The preserve is home to over 5,000 acres of untouched land, featuring coastal scrub, pine flatwoods, and salt marshes, making it an ideal spot for adventurous dogs who love new scents and wide open spaces. The quiet atmosphere means fewer distractions, allowing your dog to roam in a calm, natural environment, while the miles of pet-friendly trails offer a variety of terrain to keep you both feeling fully engaged. These trails are relatively uncrowded, which means plenty of room for a leashed stroll without the hustle and bustle of busier parks. Whether you’re looking for a brisk walk or a day-long hike, St. Joseph Bay State Buffer Preserve offers the perfect backdrop for you and your pup to bond while witnessing the splendor of Florida’s wilder side. A Pet's Paradise Awaits Gulf County isn't just pet-friendly; it's pet-paradise. From our expansive beaches to our welcoming parks and eateries, we've gone the extra mile to ensure your entire family – including the furriest members – has an unforgettable vacation. Ready to plan your pet-perfect getaway? Visit our Plan Your Trip page here for more information on pet-friendly accommodations, activities, and insider tips. Gulf County is waiting to welcome you and your four-legged friend with open arms and wagging tails! Share Author admin Please enable JavaScript to view the comments powered by Disqus. Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Gulf County Tourist Development Council 150 Captain Fred's Place Port St. Joe, Florida 32456 Call Us: 850-229-7800 800-482-GULF Email Us: info@visitgulf.com Media About Us Contact Site Map Privacy Policy © 2025 Gulf County TDC. All Rights Reserved. ADA Compliance"
    },
    {
      "url": "https://www.visitgulf.com/about-us/our-team/",
      "text": "Our Team Skip navigation Skip to main content Parks Protect Our Shores Sea Turtles Turtle Trail Keep It Wild Ray the Responsible Raccoon Weddings Planning Tips & Ideas Venues Vendors Request Info Blog Partners Short Term Rental Business License Champions of Tourism Nominate a Champion of Tourism Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Destinations Cape San Blas Indian Pass Port St. Joe St. Joe Beach Wewahitchka Waterways St. Joseph Bay Gulf of America Dead Lakes Intracoastal Waterway & Lake Wimico Indian Pass Lagoon Places To Stay Vacation Rentals Inns & Cottages Camping & RV Parks Hotels & Motels Pet Friendly Restaurants & Nightlife Restaurants Seafood Coffee Shops Kid Friendly Ice Cream & Sweets Pizza Dog Friendly Nightlife Bars Live Music Things to Do Beaches Pet Friendly Beaches Beach Safety Water Activities Shelling & Scalloping Fishing Snorkeling & Diving Kayak & Paddle Boarding Boating & Sailing Boat Ramps & Launches Outdoors & Recreation Biking, Hiking & Walking Golf Horseback Riding Camping Parks Shopping Arts & Culture Museums & Historical Sites Health & Wellness Things To Do With Kids Things To Do With Teenagers Rentals & Concierge Services Tours Events Tupelo Honey Festival Blast On The Bay Songwriters Fest Events Calendar Concerts & Live Music Winter Events Submit Your Event Plan Your Trip Visitor Guide Request Digital Visitor Guide Concierge Program Welcome Center About Gulf County Tupelo Honey History Cape San Blas Lighthouse Maps Gulf County Parks Map Gulf County Trails Gulf County Beach Access Map Gulf County Boat Ramps & Launches Map Weather Newsletter Resources Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Menu Media News Releases Story Ideas Media Gallery About Us Advisory Council Our Team Careers Contact Us Contact Site Map Privacy Policy ADA Compliance Media About Us Contact Site Map Privacy Policy Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife CLOSE MENU Share Our Team Mario Larry - Parks & Recreational Facilities Director Rebecca Holley - Marketing Director Summer Johns - Marketing & Community Relations Specialist Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Gulf County Tourist Development Council 150 Captain Fred's Place Port St. Joe, Florida 32456 Call Us: 850-229-7800 800-482-GULF Email Us: info@visitgulf.com Media About Us Contact Site Map Privacy Policy © 2025 Gulf County TDC. All Rights Reserved. ADA Compliance"
    },
    {
      "url": "https://www.visitgulf.com/partners/strlicense/",
      "text": "Short Term Rental Business License Skip navigation Skip to main content Parks Protect Our Shores Sea Turtles Turtle Trail Keep It Wild Ray the Responsible Raccoon Weddings Planning Tips & Ideas Venues Vendors Request Info Blog Partners Short Term Rental Business License Champions of Tourism Nominate a Champion of Tourism Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Destinations Cape San Blas Indian Pass Port St. Joe St. Joe Beach Wewahitchka Waterways St. Joseph Bay Gulf of America Dead Lakes Intracoastal Waterway & Lake Wimico Indian Pass Lagoon Places To Stay Vacation Rentals Inns & Cottages Camping & RV Parks Hotels & Motels Pet Friendly Restaurants & Nightlife Restaurants Seafood Coffee Shops Kid Friendly Ice Cream & Sweets Pizza Dog Friendly Nightlife Bars Live Music Things to Do Beaches Pet Friendly Beaches Beach Safety Water Activities Shelling & Scalloping Fishing Snorkeling & Diving Kayak & Paddle Boarding Boating & Sailing Boat Ramps & Launches Outdoors & Recreation Biking, Hiking & Walking Golf Horseback Riding Camping Parks Shopping Arts & Culture Museums & Historical Sites Health & Wellness Things To Do With Kids Things To Do With Teenagers Rentals & Concierge Services Tours Events Tupelo Honey Festival Blast On The Bay Songwriters Fest Events Calendar Concerts & Live Music Winter Events Submit Your Event Plan Your Trip Visitor Guide Request Digital Visitor Guide Concierge Program Welcome Center About Gulf County Tupelo Honey History Cape San Blas Lighthouse Maps Gulf County Parks Map Gulf County Trails Gulf County Beach Access Map Gulf County Boat Ramps & Launches Map Weather Newsletter Resources Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Menu Media News Releases Story Ideas Media Gallery About Us Advisory Council Our Team Careers Contact Us Contact Site Map Privacy Policy ADA Compliance Media About Us Contact Site Map Privacy Policy Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife CLOSE MENU Share Short-Term Rental Business License The Gulf County Board of County Commissioners would like to announce the launching of their new Short-Term Rental Business Licensing software system. This online portal will allow owners and property managers to create and view applications electronically, pay invoices, as well as other features. Please click on the following link to register and apply for your short-term rental property(s): Short Term Rental License Portal If additional information is needed, please contact our office at 850-229-7800 or e-mail us at STRLicense@visitgulf.com. Our Office Hours are: Monday-Thursday 7 am-5:00 pm EST. The entire Short-Term Rental Business License Ordinance can be found here: Gulf County Ordinance 2020-04 Short-Term Rental Inspection Checklist Short-Term Rental Steps Information on Gulf County Short -Term Rental Waste Services Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Gulf County Tourist Development Council 150 Captain Fred's Place Port St. Joe, Florida 32456 Call Us: 850-229-7800 800-482-GULF Email Us: info@visitgulf.com Media About Us Contact Site Map Privacy Policy © 2025 Gulf County TDC. All Rights Reserved. ADA Compliance"
    },
    {
      "url": "https://gulfcoastgrillcenter.com/contact-us/",
      "text": "Contact Us Page - Gulf Coast Grill Center Skip to content Home Outdoor Kitchens Outdoor Kitchens Get Estimate Services Propane Delivery BBQ Grill Cleaning BBQ Grill Repair Portable Grill / Smoker Our Grills Our Grills Grill Types Brands Napoleon Grills – Phantom Series American Made Grills Big Green Egg Alfresco Grills Gallery Learn Blog Get Estimate Grill Types About Us About Us Contact Us Page Gallery Privacy Policy X Contact Us Contact Us Get your Grill On! We’d love to hear from you. Please fill out this form Name Email Message Phone Upload Photos -10MB max each. Send Get in touch with us Don't hesitate to contact us for more information Don’t hesitate to reach out to us with any questions or for expert advice. At Gulf Coast Grill Center, we’re here to help you with all your outdoor kitchen, grill, and propane needs. Your perfect outdoor space is just a call or message away. Click to get an Estimate! Address 7976 Seminole Blvd. Suite 3\nSeminole, Fl 33772 Phone Number (727) 564-9626 Email Address joe@gulfcoastgrillcenter.com Follow us on social : Icon-facebook Icon-linkedin Icon-instagram-1 Youtube Home About Us Contact Our Grills Estimate Propane Office Address 7976 Seminole Blvd. Suite 3 Seminole, Fl 33772 Phone & Email : (727) 564-9626 / joe@gulfcoastgrillcenter.com Visit Us Facebook-f Instagram Youtube Copyright © 2024 Shirt Brain Custom Products, Inc."
    },
    {
      "url": "https://gulf.floridahealth.gov/about-us/leadership-team/index.html",
      "text": "Leadership Team | Florida Department of Health in Gulf Skip Global navigation and goto content Facebook Twitter Youtube Pinterest Florida Department of Health in Gulf County Â Toggle Counties Alachua County Baker County Bay County Bradford County Brevard County Broward County Calhoun County Charlotte County Citrus County Clay County Collier County Columbia County DeSoto County Dixie County Duval County Escambia County Flagler County Franklin County Gadsden County Gilchrist County Glades County Gulf County Hamilton County Hardee County Hendry County Hernando County Highlands County Hillsborough County Holmes County Indian River County Jackson County Jefferson County Lafayette County Lake County Lee County Leon County Levy County Liberty County Madison County Manatee County Marion County Martin County Miami-Dade County Monroe County Nassau County Okaloosa County Okeechobee County Orange County Osceola County Palm Beach County Pasco County Pinellas County Polk County Putnam County St Johns County St Lucie County Santa Rosa County Sarasota County Seminole County Sumter County Suwannee County Taylor County Union County Volusia County Wakulla County Walton County Washington County Â FloridaHealth.gov Menu Â Programs & Services Certificates Locations Newsroom Events About Us Â Search Search Â Submit Â Locations Alachua Baker Bay Bradford Brevard Broward Calhoun Charlotte Citrus Clay Collier Columbia DeSoto Dixie Duval Escambia Flagler Franklin Gadsden Gilchrist Glades Gulf Hamilton Hardee Hendry Hernando Highlands Hillsborough Holmes Indian River Jackson Jefferson Lafayette Lake Lee Leon Levy Liberty Madison Manatee Marion Martin Miami-Dade Monroe Nassau Okaloosa Okeechobee Orange Osceola Palm Beach Pasco Pinellas Polk Putnam St Johns St Lucie Santa Rosa Sarasota Seminole Sumter Suwannee Taylor Union Volusia Wakulla Walton Washington Â Alerts Â No alerts Â Home Patient Portal | Contact Us FILE COMPLAINT Vaccine/Testing/Mask Requirements Find Health Care Screenings and Events It's a New Day in Public Health. The Florida Department of Health works to protect, promote, and improve the health of all people in Florida through integrated state, county, and community efforts. 850-227-1276 All Locations Skip MegaMenu and goto content Programs & Services Certificates Locations Newsroom Events About Us Left navigation requires javascript to be enabled in your browser. Home About Us Leadership Team Leadership Team Public Information Officer Â (850) 227-1276 Â gulfchd@flhealth.gov Â Fax (850) 227-7587 Â Mailing Address 2475 Garrison AveÂ Port St Joe, Florida 32456Â Â April Rester April is a seasoned nurse currently serving as the clerical supervisor for DOH-Gulf and DOH-Franklin. She is enthusiastic and always ready to assist both clients and her clerical team at a moment's notice. Her passion for helping others shines through, and she values the opportunities this role provides, along with the exceptional service her experience allows her to deliver. In 2003, she graduated from Gulf Coast State College and quickly embarked on her nursing career in geriatrics at a local nursing home, while also working with Big Ben Hospice. In 2005, she secured a full-time position at DOH-Franklin. In 2017, she was cross-trained with Healthy Families and Healthy Start to serve as a local liaison, collaborating closely with WIC and its clients. Notably, she was the only county health department nurse across all 50 states trained to provide wrap-around services and care for the health department and WIC clients. During this time, she earned her CLC certification, enabling her to enhance breastfeeding education in our rural communities. In 2024, April accepted a position as the department's clerical supervisor. On her spare time she loves spending time with her children and grandchildren. April likes to go fishing with cast nets. Usually if she is not with her family or fishing, she can be found happily working in yard with with her pet chickens, rabbits, and/or her French bulldog named Buster Deanna “DT” Simmons DT Simmons found her calling in public health over 10 years ago as a Peace Corps volunteer in Ethiopia. Since returning to the U.S. in the fall of 2014, she has worked at the Florida Department of Health in Franklin and Gulf counties and currently serves as an operations manager. She oversees public communications, health education programing, partnership development, community health assessment and improvement planning, and public health accreditation. In her spare time, she enjoys gardening, exercising, cooking, and traveling. Ms. Simmons received a B.S.B.A. in Finance from the University of West Florida and a master of public health in epidemiology and biostatistics from Florida Agricultural & Mechanical University. Her mantra is that “We’re called to serve as the community needs.” Elizabeth \"Jinny\" Trammell Jinny has been working the business office of the Florida Department of Health in Franklin County for 15 years. While working in the Apalachicola seafood industry for 20 years, Jinny found her love for all things public health and now serves as the clerical supervisor. She is the facilities manager, oversees purchasing and accounting, supervises clerical staff and ensures all functions run smoothly. In Jinny's free time she loves spoiling her grandchildren, immersing herself in all things history and working in hotel hospitality. Kari Williams Kari has been working at the Florida Department of Health in Gulf and Franklin counties since 2015. She began as the tobacco prevention specialist in Gulf County and quickly obtained the role in both counties. In early 2019, Kari became the operations consultant, which included working very closely with the budget manager and transitioned into the contract manager for both counties. In April of 2019, Kari became the budget manager for Gulf and Franklin counties. Kari is eager to jump into any role and loves a good challenge. In her free time, she is enjoying a Dr. Pepper and looking for the next Bath and Body Works sale. Lisa Hogan Lisa began her career in public health in 1996 after graduating from Tallahassee Community College's Nursing Program. She has worked as a registered nurse in a variety of roles including clinic staff, epidemiology, Healthy Start, and school health. Lisa is currently serving as supervisor for the Healthy Start Program and is the nursing director for both Franklin and Gulf counties. Lisa is married to her high school sweetheart and they have one daughter who currently attends Troy University in Alabama. In between traveling to and from Troy, Lisa likes to gets creative with her Cricut. Randi \"Nicole\" Sandoval Nicole has been with the Florida Department of Health in Franklin County since 2014. She has served as the public health preparedness planner where she works with community partners, such as the local hospital, long term care facility, law enforcement, emergency management, EMS, and federal, state, and local operations to plan, prepare, respond, and recover from public health emergencies. Prior to starting with the Florida Department of Health, she worked with Weems Memorial Hospital as a registered nurse in the emergency department and the hospital’s clinics. Nicole obtained a degree as a registered nurse at Florida State University in 2003. Nicole enjoys spending time with her family, friends and fur babies. Her hobbies include fishing, kayaking, taking long walks on the beach, watching sunsets, and making the most of everyday. Stephanie Cash After spending seven years in child welfare with the Florida Department of Children and Families, in 2002, Stephanie transitioned to public health and prevention services at the Florida Department of Health. She began her public health career as a clinical supervisor for the nationally accredited, evidence-based Healthy Families Franklin-Wakulla-Gulf home visitation program. Since 2016, she has served as the program manager, focused on improving the health outcomes for families and children in our tri-county area. Stephanie earned her BSW and MSW from Florida State University. In her free time, Stephanie enjoys traveling and relaxing with her family. Talitha Robinson Talitha has been with the Florida Department of Health in Franklin and Gulf counties since 2013. She began in the Tobacco Prevention Program as an Administrative Assistant and quickly moved into the role as a Health Educator with the Closing the Gap Minority Health Program. In 2022, she began working with the Budget and Finance Department as an Administrative Assistant 1, which included purchasing, paying invoices, assisting with front desk duties, and insurance and billing. Recently, she became the Government Operations Consultant II, working as the Personnel Liaison for both counties. Talitha received her Bachelor of Science degree for Florida Agricultural and Mechanical University, in 2005. In her spare time she loves spending time with her family, friends, listening to music, cooking and visiting restaurants. Zach Hodges Zach has been with the Florida Department of Health in Gulf County since 2006 and became an environmental manager in 2007. Zach obtained his undergraduate degree from UGA back in 1998 but shortly after his employment began at DOH–Gulf, he started the master of public health degree program at the University of South Florida. During his time at USF, he also obtained his certificate of disaster management. Related to local job responsibilities, Zach manages a staff who carry out beach water monitoring, animal bite surveillance, biomedical waste, sanitary nuisances, institutional food hygiene, public swimming pools, tanning, tattooing, body piercing, mobile home and RV parks, and limited use public well systems. From a regional lens, he administers a five-county Florida Department of Environmental Protection's regulatory contract oversight of area’s storage tank compliance assistance needs. Additionally, in 2019 Zach became the manager for the county’s public health preparedness program which has kept him incredibly busy with various natural disasters. In his free time, Zach enjoys traveling to his home in North Carolina with his family and watching the Georgia Bulldogs football games. Connect with DOH facebook twitter youtube pinterest Featured Programs Tell Us About Your Visit Complete our Survey Florida Health Across the State State Surgeon General State Leadership Boards, Councils & Committees About Florida Health Accreditation Careers Public Meeting Notices Public Notices Public Records Requests State Health Improvement Plan Annual Regulatory PlansâFlorida Department of Health (pdf) Annual Regulatory PlansâBoards (pdf) Certificates and Registries Birth Certificates Death Certificates Divorce Certificates Marriage Certificates By using this site, you agree to the Privacy Policy . Site Map Disclaimer Accessibility Information Email Advisory Social Media"
    },
    {
      "url": "https://www.visitgulf.com/listing/gulf-county-welcome-center/729/",
      "text": "Gulf County Welcome Center Skip to main content Parks Protect Our Shores Sea Turtles Turtle Trail Keep It Wild Ray the Responsible Raccoon Weddings Planning Tips & Ideas Venues Vendors Request Info Blog Partners Short Term Rental Business License Champions of Tourism Nominate a Champion of Tourism Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Destinations Cape San Blas Indian Pass Port St. Joe St. Joe Beach Wewahitchka Waterways St. Joseph Bay Gulf of America Dead Lakes Intracoastal Waterway & Lake Wimico Indian Pass Lagoon Places To Stay Vacation Rentals Inns & Cottages Camping & RV Parks Hotels & Motels Pet Friendly Restaurants & Nightlife Restaurants Seafood Coffee Shops Kid Friendly Ice Cream & Sweets Pizza Dog Friendly Nightlife Bars Live Music Things to Do Beaches Pet Friendly Beaches Beach Safety Water Activities Shelling & Scalloping Fishing Snorkeling & Diving Kayak & Paddle Boarding Boating & Sailing Boat Ramps & Launches Outdoors & Recreation Biking, Hiking & Walking Golf Horseback Riding Camping Parks Shopping Arts & Culture Museums & Historical Sites Health & Wellness Things To Do With Kids Things To Do With Teenagers Rentals & Concierge Services Tours Events Tupelo Honey Festival Blast On The Bay Songwriters Fest Events Calendar Concerts & Live Music Winter Events Submit Your Event Plan Your Trip Visitor Guide Request Digital Visitor Guide Concierge Program Welcome Center About Gulf County Tupelo Honey History Cape San Blas Lighthouse Maps Gulf County Parks Map Gulf County Trails Gulf County Beach Access Map Gulf County Boat Ramps & Launches Map Weather Newsletter Resources Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Menu Media News Releases Story Ideas Media Gallery About Us Advisory Council Our Team Careers Contact Us Contact Site Map Privacy Policy ADA Compliance Media About Us Contact Site Map Privacy Policy Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife CLOSE MENU Back Gulf County Welcome Center Location Information: 150 Captain Fred's Place Port St. Joe, FL 32456 (850) 229-7800 About Map Amenities About If you have made it to town, the Gulf County Welcome Center is the perfect place to plan your adventure! We are located just off Hwy 98 in downtown Port St Joe. Come up our stairs or ramp where you can start with freebies, including a Visitor Guide, information brochures, maps, wi-fi access, a taste of Tupelo Honey, and a cup of coffee while being welcomed by a Gulf County Concierge.   While you are planning your visit, our Concierge Team can help you discover your interests and connect you with people, places, and activities that best suit you. From easy-going to full-throttle adventure, they can steer you in the right direction, so you get the most of your time in Gulf County. Don’t forget to check out our Historical Artifacts, and take a fun live-action picture in our green screen photo booth! There’s much to do and see, and we are here to answer your questions. \r\n\r\nOur back deck offers cozy lounge furniture and boasts stunning views overlooking St. Joseph Bay. We even have a telescope for you to look out further, where you can see wildlife, St. Joseph Peninsula State Park, and the different small islands and flats of the bay. Below the back deck, right along the Port City Trail, you can hook up your hammocks and relax in the breeze or take family photos in front of our Gulf County mural.\r\n\r\nWelcome Center \r\n150 Captain Fred's Place\r\nPort St Joe FL 32456\r\n\r\nBusiness hours are Monday – Thursday, 7 am – 5:30 pm Eastern time unless it is a holiday. Read More Map Amenities Attractions General Parking Available: Restrooms Onsite: Turtle Trail Location: Share Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Gulf County Tourist Development Council 150 Captain Fred's Place Port St. Joe, Florida 32456 Call Us: 850-229-7800 800-482-GULF Email Us: info@visitgulf.com Media About Us Contact Site Map Privacy Policy © 2025 Gulf County TDC. All Rights Reserved. ADA Compliance"
    },
    {
      "url": "https://www.visitgulf.com/things-to-do/beaches/pet-friendly-beaches/",
      "text": "Pet Friendly Beaches | Gulf County, FL | Hit the sand, leash in hand. Skip navigation Skip to main content Parks Protect Our Shores Sea Turtles Turtle Trail Keep It Wild Ray the Responsible Raccoon Weddings Planning Tips & Ideas Venues Vendors Request Info Blog Partners Short Term Rental Business License Champions of Tourism Nominate a Champion of Tourism Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Destinations Cape San Blas Indian Pass Port St. Joe St. Joe Beach Wewahitchka Waterways St. Joseph Bay Gulf of America Dead Lakes Intracoastal Waterway & Lake Wimico Indian Pass Lagoon Places To Stay Vacation Rentals Inns & Cottages Camping & RV Parks Hotels & Motels Pet Friendly Restaurants & Nightlife Restaurants Seafood Coffee Shops Kid Friendly Ice Cream & Sweets Pizza Dog Friendly Nightlife Bars Live Music Things to Do Beaches Pet Friendly Beaches Beach Safety Water Activities Shelling & Scalloping Fishing Snorkeling & Diving Kayak & Paddle Boarding Boating & Sailing Boat Ramps & Launches Outdoors & Recreation Biking, Hiking & Walking Golf Horseback Riding Camping Parks Shopping Arts & Culture Museums & Historical Sites Health & Wellness Things To Do With Kids Things To Do With Teenagers Rentals & Concierge Services Tours Events Tupelo Honey Festival Blast On The Bay Songwriters Fest Events Calendar Concerts & Live Music Winter Events Submit Your Event Plan Your Trip Visitor Guide Request Digital Visitor Guide Concierge Program Welcome Center About Gulf County Tupelo Honey History Cape San Blas Lighthouse Maps Gulf County Parks Map Gulf County Trails Gulf County Beach Access Map Gulf County Boat Ramps & Launches Map Weather Newsletter Resources Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Menu Media News Releases Story Ideas Media Gallery About Us Advisory Council Our Team Careers Contact Us Contact Site Map Privacy Policy ADA Compliance Media About Us Contact Site Map Privacy Policy Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife CLOSE MENU Share Pet Friendly Beaches HIT THE SAND, LEASH IN HAND! Bring your furry friends along. Woofs are welcome all over Gulf County. Let your four-legged best friend run through the sand, splash in the water, shake it off, and then do it all again. Gulf County Florida is dog heaven and more families are taking their pets along on vacation. In fact, two of the Top 20 Dog Beaches in Florida are located in Gulf County. Both Cape San Blas and Salinas Park received the coveted “5-Bone Rating” for its long stretches of uncrowded beaches and gentle waves by BringFido.com. Pets are welcome on all Gulf County beaches except for St. Joseph Peninsula State Park , William J \"Billy Joe\" Rish Recreation Area and Eglin Airforce Base property on the elbow of Cape San Blas. Animals must remain on a leash at all times, it’s the law. Bring a long lead leash so you and your pet can be active. There are over 20 pet waste disposal stations with bags and receptacles along the public beach access points. However, owners must remove any remnants left behind so it’s a good idea to pack your waste baggies for beach adventures. Many areas on and off the beach are perfect for pets; even the Gulf County Welcome Center is pet-friendly so stop in and say hello! Located in Port St. Joe , it’s a great starting point for the Port City Trail that meanders nearly four miles throughout the town. Many of the local shops and restaurants also welcome pets on leashes. Need help deciding where to stay with your dog? Just look for the paw prints on the vacation rentals page or contact a Concierge . Pet Etiquette or Helpful Tips Always keep your dog on a leash. It’s the law. Respect children and adults around you who may not be familiar with your pet. Always keep waste bags with you. We want our beaches to be people friendly, too. Don’t bury pet waste. Children enjoy digging in the sand as much as pets. Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Gulf County Tourist Development Council 150 Captain Fred's Place Port St. Joe, Florida 32456 Call Us: 850-229-7800 800-482-GULF Email Us: info@visitgulf.com Media About Us Contact Site Map Privacy Policy © 2025 Gulf County TDC. All Rights Reserved. ADA Compliance"
    },
    {
      "url": "https://www.gulfshores.com/partners/about/staff/",
      "text": "Staff Directory | Gulf Shores & Orange Beach Skip to main content Visitors Meetings Sports Search Search Toggle Navigation Menu Partners Partners Reports Back to the visitors main menu All Reports Back to partners main navigation Resources Back to the visitors main menu All Resources Back to partners main navigation Promote Your Business Back to the visitors main menu Partner Benefits Partner Benefits Get Listed Get Listed Advertising Opportunities Advertising Opportunities Sports Sponsorship Sports Sponsorship Submit an Event Submit an Event All Promote Your Business Back to partners main navigation Calendars Back to the visitors main menu All Calendars Back to partners main navigation About Us Back to the visitors main menu Board Meeting Schedule Board Meeting Schedule Board of Directors Board of Directors Contact Us Contact Us Lodging Tax Information Lodging Tax Information Memberships Memberships All About Us Back to partners main navigation Partner Portal Back to the visitors main menu All Partner Portal Back to partners main navigation Partners Partners Reports Back to the visitors main menu All Reports Back to partners main navigation Resources Back to the visitors main menu All Resources Back to partners main navigation Promote Your Business Back to the visitors main menu Partner Benefits Partner Benefits Get Listed Get Listed Advertising Opportunities Advertising Opportunities Sports Sponsorship Sports Sponsorship Submit an Event Submit an Event All Promote Your Business Back to partners main navigation Calendars Back to the visitors main menu All Calendars Back to partners main navigation About Us Back to the visitors main menu Board Meeting Schedule Board Meeting Schedule Board of Directors Board of Directors Contact Us Contact Us Lodging Tax Information Lodging Tax Information Memberships Memberships All About Us Back to partners main navigation Partner Portal Back to the visitors main menu All Partner Portal Back to partners main navigation Visitors Visitors Stay Back to the visitors main menu Book Lodging Book Lodging Why Book With Us Why Book With Us Beach Houses Beach Houses Condos Condos Resorts Resorts Hotels Hotels Cabins Cabins Pet-Friendly Vacation Rentals Pet-Friendly Vacation Rentals Owner-Managed Vacation Rentals Owner-Managed Vacation Rentals Bed & Breakfasts Bed & Breakfasts RV Parks & Camping RV Parks & Camping Best Accommodations with Lazy Rivers on Alabama's Beaches Top Campgrounds on Alabama's Beaches No All Stay Back to main navigation Things to Do Back to the visitors main menu Beaches Beaches Attractions Attractions Family-Friendly Fun Family-Friendly Fun Outdoor Activities Outdoor Activities Excursions & Tours Excursions & Tours Shopping Shopping Golf Golf Nightlife & Bars Nightlife & Bars Indoor Activities Indoor Activities Hiking Hiking Best Biking Trails on Alabama's Beaches Fun Family Beach Activities No All Things to Do Back to main navigation On the Water Back to the visitors main menu Fishing Fishing Boating Boating Jet Skiing Jet Skiing Snorkeling Snorkeling Cruises Cruises Parasailing Parasailing Kayaking Kayaking Paddleboarding & Foil Boarding Paddleboarding & Foil Boarding Sailing Sailing Dolphin Cruises Dolphin Cruises Diving Diving Marinas Marinas 4 Spots to Snorkel & Dive on Alabama's Beaches Coolest Ways to Hit the Water on Alabama's Beaches No All On the Water Back to main navigation Plan Back to the visitors main menu Book Lodging Book Lodging Deals Deals eNewsletter Sign Up eNewsletter Sign Up Back eNewsletter Sign Up menu Fishing Newsletter Golf Newsletter All eNewsletter Sign Up Back to Plan navigation Back to main navigation Family Vacations Family Vacations Couples Getaway Couples Getaway Equipment Rentals & Outfitters Equipment Rentals & Outfitters Weather Weather Getting Here Getting Here Welcome Centers Welcome Centers Beach Safety Beach Safety Responsible Tourism Responsible Tourism Find Photographers Find Photographers Places To Stay Fly Alabama's Beaches How to Get To & Around Alabama's Beaches No All Plan Back to main navigation Events Back to the visitors main menu Annual Events & Festivals Annual Events & Festivals Concerts Concerts Holiday Events Holiday Events Live Music Live Music Shrimp Festival Shrimp Festival Orange Beach Freedom Festival Orange Beach Freedom Festival Fantastic Fall Events on Alabama's Beaches Fall Adventures on Alabama’s Beaches No All Events Back to main navigation Eat & Drink Back to the visitors main menu Seafood Seafood Breakfast Breakfast Lunch Lunch Dinner Dinner Dessert Dessert Food Trails Food Trails Fan Favorites Fan Favorites Recipes Recipes Foodie Getaway Foodie Getaway 50th Bushwacker Anniversary 50th Bushwacker Anniversary Outdoor Dining Spots Sports Bars & Game-Day Restaurants on Alabama's Beaches The Best Coffee Shops on Alabama's Beaches No All Eat & Drink Back to main navigation Blog Back to the visitors main menu 10 Family Activities 10 Family Activities 14 Public Beaches 14 Public Beaches 21 Rainy Day Activities 21 Rainy Day Activities 5 Things I Learned From My Vacation 5 Things I Learned From My Vacation 8 Things to Know Before Your Vacation 8 Things to Know Before Your Vacation Cheap & Free Things To Do 5 Reasons to Visit Alabama's Beaches in Fall 13 Spots to Listen to Live Music No All Blog Back to main navigation Free Guide Back to the visitors main menu No Back to main navigation Deals Back to the visitors main menu Back to main navigation Meetings Meetings Home Back to the meetings main menu All Home Back to meetings main navigation Plan Your Conference Back to the meetings main menu Plan Your Conference Plan Your Conference How Can We Help How Can We Help Why Our Beach Why Our Beach Services Services FAQs FAQs Getting Here Getting Here Restaurants Restaurants Things to Do Things to Do Calendar of Events Calendar of Events Order a Free Vacation Guide Order a Free Vacation Guide Show Your Badge Pass Show Your Badge Pass Five Tips to Becoming a Confident Speaker How to Pack for a Meeting at the Beach All Plan Your Conference Back to meetings main navigation Meeting Spaces Back to the meetings main menu All Meeting Spaces All Meeting Spaces Unique Meeting Spaces Unique Meeting Spaces Accommodations Accommodations Non-Traditional Meeting Spaces on Alabama’s Gulf Coast Which Social Media Networks Help Meeting Planners the Most All Meeting Spaces Back to meetings main navigation Reunions & Weddings Back to the meetings main menu All Reunions & Weddings Back to meetings main navigation Toolkit Back to the meetings main menu Meeting Planner Toolkit Meeting Planner Toolkit Tips To Make Your Next Beach Meeting a Success 5 Ways Social Media Helps Meeting Planners Communicate & Educate Attendees How to Increase Attendance at Your Next Conference on Alabama Beaches All Toolkit Back to meetings main navigation Contact Us Back to the meetings main menu Connect With Us Connect With Us Submit RFP Submit RFP Subscribe Today Subscribe Today Tips for Maintaining a Work-Life Balance as a Meeting Professional “From the Desk of…”: Q&A with Sales Manager Amy Peralta “From the Desk of…”: Q&A with Meetings Former Sales Manager Mary Statkewicz All Contact Us Back to meetings main navigation Blog Back to the meetings main menu All Blog Back to meetings main navigation Sports Sports Home Back to the sports main menu All Home Back to sports main navigation Events & Special Rates Back to the sports main menu All Events All Events Book Lodging Book Lodging Perfect Game World Series Perfect Game World Series Gulf Shores High School Gulf Shores High School Beach Races Beach Races Orange Beach High School Orange Beach High School USSSA Gulf Coast National Championship USSSA Gulf Coast National Championship 4 Spots to Fuel Up for the Game What to Pack for Your Sportcation? All Events & Special Rates Back to sports main navigation Restaurants Back to the sports main menu All Restaurant Sponsors All Restaurant Sponsors On-the-Go & Group Dining On-the-Go & Group Dining Restaurants for Team Dining on Alabama’s Beaches Budget-Friendly Meals for the Whole Team All Restaurants Back to sports main navigation Attractions Back to the sports main menu All Attraction Sponsors All Attraction Sponsors Quirky, Must-Visit Places on Alabama's Beaches 5 Action-Packed Activities Along Alabama’s Gulf Coast What to Do When Your Tournament is Rained Out All Attractions Back to sports main navigation Visiting Athletes Back to the sports main menu Healthcare Healthcare Book Lodging Book Lodging Restaurants Restaurants Attractions Attractions Facility Maps Facility Maps BEach SAFE BEach SAFE Responsible Tourism Responsible Tourism Alabama's Beaches Savings Scorecard Alabama's Beaches Savings Scorecard Blog Blog Sports Shorts Newsletter Sports Shorts Newsletter All Visiting Athletes Back to sports main navigation Facilities Back to the sports main menu All Facilities Back to sports main navigation Bring Your Event Back to the sports main menu Facility Info Facility Info Leisure Events Leisure Events Our Services Our Services Planner Toolkit Planner Toolkit Contact Us Contact Us Play at the Beach Newsletter Play at the Beach Newsletter Future Sports Tourism Development Future Sports Tourism Development Get to Know the Beach's Best Sports Facilities Event Planner Resources for Gulf Shores & Orange Beach Start Planning Your Sportscation to Gulf Shores & Orange Beach All Bring Your Event Back to sports main navigation Sponsors Back to the sports main menu Business Sponsors Business Sponsors All Sponsors Back to sports main navigation Blog Back to the sports main menu All Blog Back to sports main navigation Search Close Search box Search Administration & Finance Beth Gendler President/CEO 251-974-4620 [email protected] Carlos Serrano Vice President - Administration & Finance 251-484-2711 [email protected] Sally Westendorf Executive Assistant 251-974-1510 [email protected] Kellie Herrod Director of Finance 251-968-9324 [email protected] Helen White Finance Specialist 251-968-9331 HWhite @AlabamasBeaches.com Debra Langston Human Resource & Payroll Specialist 251-968-9320 [email protected] Philip Jones Operations Specialist 251-968-7511 [email protected] Susan Brush Finance and Administration Coordinator 251-974-1510 [email protected] Communications Crystal Hinds Vice President of Marketing 251-974-4624 [email protected] Kay Maghan Public Relations Manager 251-974-4625 [email protected] Easton Colvin Public Relations Manager 251-968-9338 [email protected] Austen Bowman Digital Operations Manager 251-968-9334 [email protected] Joanna Almond Social Media Manager 251-484-5760 [email protected] Sydnie Lee Content Specialist 251-974-4605 [email protected] Brittany Nieto Marketing Coordinator 251-968-9328 [email protected] Malia Elliott Digital Operations Coordinator 251-968-9330 [email protected] Sports & Events Michelle Russ Vice President of Sales, Sports & Events 251-974-4631 [email protected] Ashley Wilson Sports & Events Sales Manager 251-974-4619 [email protected] Brittany Roh Sports & Events Sales Manager 251-968-9337 [email protected] Sarah Cooper Sports & Events Operations Manager 251-974-4611 [email protected] Ally Dorrough Communications & Marketing Manager 251-968-9327 [email protected] Lauren Jones Sports & Events Coordinator 251-974-4632 [email protected] Sandra Lopez Sports & Events Coordinator 251-974-4612 [email protected] Sales Amy Peralta Sales Manager 251-974-4621 [email protected] Visitor and Partner Services Kim Chapman Director of Visitor and Partner Services 251-968-9319 [email protected] Kim Jones Partner Liaison (Industry Partner Team) 251-974-4604 [email protected] Janna Nelson CRM Support Specialist (Industry Partner Team) 251-968-9325 [email protected] Britney Clemon Vacation Specialist 251-968-7511 [email protected] Rachel Anderton Vacation Associate 251-968-7511 [email protected] Wynell Bell Vacation Associate 251-968-7511 [email protected] Laura Rodich Vacation Associate 251-968-7511 [email protected] Sherri Smith Vacation Associate 251-968-7511 [email protected] Liz Von Bergen Vacation Associate 251-968-7511 [email protected] Contact Us Office locations Gulf Shores Welcome Center 3459 Gulf Shores Pkwy. (Hwy. 59) Gulf Shores, AL 36547 Orange Beach Welcome Center & Administrative Offices 23685 Perdido Beach Blvd. (Hwy. 182) Orange Beach, AL 36547 Operations Center 900 Commerce Loop Gulf Shores, AL 36547 Mailing address Gulf Shores & Orange Beach Tourism P.O. Drawer 457 Gulf Shores AL 36547 Phone numbers 251-968-7511 251-974-1510 800-745-SAND (7263) Email [email protected] Order a Vacation Guide Subscribe to our Enewsletter Facebook Youtube Instagram Pinterest Tik-Tok Trip Ideas Press Partners Responsible Tourism Weddings Privacy Policy Employment Opportunities 1-800-745-SAND [email protected] Copyright 2025 Gulf Shores & Orange Beach Tourism. All rights reserved. Subscribe to Enews Book Lodging"
    },
    {
      "url": "https://www.visitgulf.com/plan-your-trip/welcome-center/",
      "text": "Welcome Center | Gulf County Florida. The Official Site for Gulf County Tourism. Skip navigation Skip to main content Parks Protect Our Shores Sea Turtles Turtle Trail Keep It Wild Ray the Responsible Raccoon Weddings Planning Tips & Ideas Venues Vendors Request Info Blog Partners Short Term Rental Business License Champions of Tourism Nominate a Champion of Tourism Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Destinations Cape San Blas Indian Pass Port St. Joe St. Joe Beach Wewahitchka Waterways St. Joseph Bay Gulf of America Dead Lakes Intracoastal Waterway & Lake Wimico Indian Pass Lagoon Places To Stay Vacation Rentals Inns & Cottages Camping & RV Parks Hotels & Motels Pet Friendly Restaurants & Nightlife Restaurants Seafood Coffee Shops Kid Friendly Ice Cream & Sweets Pizza Dog Friendly Nightlife Bars Live Music Things to Do Beaches Pet Friendly Beaches Beach Safety Water Activities Shelling & Scalloping Fishing Snorkeling & Diving Kayak & Paddle Boarding Boating & Sailing Boat Ramps & Launches Outdoors & Recreation Biking, Hiking & Walking Golf Horseback Riding Camping Parks Shopping Arts & Culture Museums & Historical Sites Health & Wellness Things To Do With Kids Things To Do With Teenagers Rentals & Concierge Services Tours Events Tupelo Honey Festival Blast On The Bay Songwriters Fest Events Calendar Concerts & Live Music Winter Events Submit Your Event Plan Your Trip Visitor Guide Request Digital Visitor Guide Concierge Program Welcome Center About Gulf County Tupelo Honey History Cape San Blas Lighthouse Maps Gulf County Parks Map Gulf County Trails Gulf County Beach Access Map Gulf County Boat Ramps & Launches Map Weather Newsletter Resources Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Menu Media News Releases Story Ideas Media Gallery About Us Advisory Council Our Team Careers Contact Us Contact Site Map Privacy Policy ADA Compliance Media About Us Contact Site Map Privacy Policy Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife CLOSE MENU Share Gulf County Welcome Center If you have made it to town, the Gulf County Welcome Center is the perfect place to plan your adventure! We are located just off Hwy 98 in downtown Port St Joe. Come up our stairs or ramp where you can start with freebies, including a Visitor Guide , information brochures, maps, wi-fi access, a taste of Tupelo Honey, and a cup of coffee while being welcomed by a Gulf County Concierge.   While you are planning your visit, our Concierge Team can help you discover your interests and connect you with people, places, and activities that best suit you. From easy-going to full-throttle adventure, they can steer you in the right direction, so you get the most of your time in Gulf County. Don’t forget to check out our Historical Artifacts, and take a fun live-action picture in our green screen photo booth! There’s much to do and see, and we are here to answer your questions. Our back deck offers cozy lounge furniture and boasts stunning views overlooking St. Joseph Bay . We even have a telescope for you to look out further, where you can see wildlife, St. Joseph Peninsula State Park, and the different small islands and flats of the bay. Below the back deck, right along the Port City Trail, you can hook-up your hammocks and relax in the breeze or take family photos in front of our Gulf County mural. Welcome Center 150 Captain Fred's Place Port St Joe FL 32456 Business hours are Monday – Thursday, 7 am – 5:30 pm Eastern time, unless it is a holiday. Explore More Concierge Program Visitor Guide Request Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Gulf County Tourist Development Council 150 Captain Fred's Place Port St. Joe, Florida 32456 Call Us: 850-229-7800 800-482-GULF Email Us: info@visitgulf.com Media About Us Contact Site Map Privacy Policy © 2025 Gulf County TDC. All Rights Reserved. ADA Compliance"
    },
    {
      "url": "https://www.visitgulf.com/pledgetoprotect/",
      "text": "Pledge to Protect Skip navigation Skip to main content Parks Protect Our Shores Sea Turtles Turtle Trail Keep It Wild Ray the Responsible Raccoon Weddings Planning Tips & Ideas Venues Vendors Request Info Blog Partners Short Term Rental Business License Champions of Tourism Nominate a Champion of Tourism Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Destinations Cape San Blas Indian Pass Port St. Joe St. Joe Beach Wewahitchka Waterways St. Joseph Bay Gulf of America Dead Lakes Intracoastal Waterway & Lake Wimico Indian Pass Lagoon Places To Stay Vacation Rentals Inns & Cottages Camping & RV Parks Hotels & Motels Pet Friendly Restaurants & Nightlife Restaurants Seafood Coffee Shops Kid Friendly Ice Cream & Sweets Pizza Dog Friendly Nightlife Bars Live Music Things to Do Beaches Pet Friendly Beaches Beach Safety Water Activities Shelling & Scalloping Fishing Snorkeling & Diving Kayak & Paddle Boarding Boating & Sailing Boat Ramps & Launches Outdoors & Recreation Biking, Hiking & Walking Golf Horseback Riding Camping Parks Shopping Arts & Culture Museums & Historical Sites Health & Wellness Things To Do With Kids Things To Do With Teenagers Rentals & Concierge Services Tours Events Tupelo Honey Festival Blast On The Bay Songwriters Fest Events Calendar Concerts & Live Music Winter Events Submit Your Event Plan Your Trip Visitor Guide Request Digital Visitor Guide Concierge Program Welcome Center About Gulf County Tupelo Honey History Cape San Blas Lighthouse Maps Gulf County Parks Map Gulf County Trails Gulf County Beach Access Map Gulf County Boat Ramps & Launches Map Weather Newsletter Resources Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Menu Media News Releases Story Ideas Media Gallery About Us Advisory Council Our Team Careers Contact Us Contact Site Map Privacy Policy ADA Compliance Media About Us Contact Site Map Privacy Policy Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife CLOSE MENU Pledge to Protect Share Gulf County is committed to creating a clean, safe and healthy environment for residents and visitors as we reopen our businesses and organizations following COVID-19 restrictions. Coronavirus doesn’t take a vacation, but it does travel. Everyone is going to have to do their part to make sure that we minimize the spread of the virus moving forward. This means continuing to observe social distancing, wearing masks in places where social distancing is difficult, and following good hygiene practices. Most of all, be respectful and kind to others. Local businesses shown on this page of our website have taken the Pledge to Protect and are stepping up to protect others. Click on any of the listings within this section to find contact info and more details about each business. What is Pledge to Protect? Pledge to Protect is a voluntary program in which Gulf County tourism businesses commit to clean and healthy standards for their guests and employees to prevent the spread of COVID-19. Partners involved: Florida Department of Health in Gulf, Gulf County Tourist Development Council, and Gulf County Chamber of Commerce.  Approved by the Gulf County Board of County Commissioners. By taking the Pledge to Protect, businesses are committing to: Proper Use of Personal Protective Equipment Routine Cleaning and Disinfecting of Surfaces and Equipment Practicing Social Distancing and Minimized Contact Enforcing Any Sick Employees to Stay Home I'm a tourism business owner in Gulf County. How do I take the Pledge to Protect? Take the Pledge to Protect by emailing your interest to Concierge@VisitGulf.com and a staff member will contact you. How will customers know that I've taken the Pledge to Protect? In addition to being listed on this page and receiving free advertising as a participating tourism business, you will receive the free items below (while supplies last) to indicate to customers that you have taken this extra step to ensure the safety and wellbeing of guests and employees. Pledge to Protect Pledge to Protect Placemats Pledge to Protect Mask Pledge to Protect Window Cling Pledge to Protect Certificate COVID FAQ's Use the tools below to plan your visit. Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Gulf County Tourist Development Council 150 Captain Fred's Place Port St. Joe, Florida 32456 Call Us: 850-229-7800 800-482-GULF Email Us: info@visitgulf.com Media About Us Contact Site Map Privacy Policy © 2025 Gulf County TDC. All Rights Reserved. ADA Compliance"
    },
    {
      "url": "http://www.gulfcoasttec.com/ContactUs",
      "text": "Contact Us - Gulf Coast Technology Group Gulf Coast Technology Group 713-702-3100 Toggle navigation Gulf Coast Technology Group Home About Overview Management Team Services Strategic Technology Consulting Software Development Services Infrastructure Services Technology Software Infrastructure Clients Partners Contact Us Contact Us Our U.S. offices are located in Houston, TX and our Software Development Center is located in Yerevan, Armenia. Send Message × Thank You! We have received your message and will contact to you as soon as possible. × Error! We are experiencing some technical problems. Please try again later. Name * Email address * Message * Please confirm that you are a human. Submit Contact Information Gulf Coast Technology Group, LLC 713-702-3100 Sales Inquiries: sales@gulfcoasttec.com Sitemap Home Company Overview Management Team Strategic Technology Consulting Software Development Services Infrastructure Services Software Development Technologies Infrastructure Technologies Clients Partners Contact Us Contacts 713-702-3100 sales@gulfcoasttec.com © 2016 Gulf Coast Technologies, LLC. All rights reserved."
    },
    {
      "url": "https://www.gulfchamber.org/chamber-leadership/",
      "text": "Chamber Leadership - Gulf County Chamber of Commerce Skip to content Banner Sample Next Previous Facebook Instagram Home About Us Chamber Leadership Members Membership Application Membership Benefits Business Listings Helpful Links Events Annual & Monthly Events Job Postings Online Documents Contact Us Chamber Leadership Leadership President/CEO Joe Whitmer director@gulfchamber.org Board of Directors Aaron Little Chairman of the Board Tom Butram Lisa Forehand Treasurer Christian Johnson Brittney Hulsey Joey Jernigan © 2025 Gulf County Chamber of Commerce | Site by GrowthZone Gulf County Chamber of Commerce telephone Â 850-227-1223 address 321B Reid Ave â¢ Port St. Joe, Florida 32456 email info@gulfchamber.org Facebook Instagram © 2025 Gulf County Chamber of Commerce. All Rights Reserved. Scroll To Top"
    },
    {
      "url": "https://www.visitgulf.com/centennial/",
      "text": "Centennial Celebration | Gulf County, Florida Skip navigation Skip to main content Parks Protect Our Shores Sea Turtles Turtle Trail Keep It Wild Ray the Responsible Raccoon Weddings Planning Tips & Ideas Venues Vendors Request Info Blog Partners Short Term Rental Business License Champions of Tourism Nominate a Champion of Tourism Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Destinations Cape San Blas Indian Pass Port St. Joe St. Joe Beach Wewahitchka Waterways St. Joseph Bay Gulf of America Dead Lakes Intracoastal Waterway & Lake Wimico Indian Pass Lagoon Places To Stay Vacation Rentals Inns & Cottages Camping & RV Parks Hotels & Motels Pet Friendly Restaurants & Nightlife Restaurants Seafood Coffee Shops Kid Friendly Ice Cream & Sweets Pizza Dog Friendly Nightlife Bars Live Music Things to Do Beaches Pet Friendly Beaches Beach Safety Water Activities Shelling & Scalloping Fishing Snorkeling & Diving Kayak & Paddle Boarding Boating & Sailing Boat Ramps & Launches Outdoors & Recreation Biking, Hiking & Walking Golf Horseback Riding Camping Parks Shopping Arts & Culture Museums & Historical Sites Health & Wellness Things To Do With Kids Things To Do With Teenagers Rentals & Concierge Services Tours Events Tupelo Honey Festival Blast On The Bay Songwriters Fest Events Calendar Concerts & Live Music Winter Events Submit Your Event Plan Your Trip Visitor Guide Request Digital Visitor Guide Concierge Program Welcome Center About Gulf County Tupelo Honey History Cape San Blas Lighthouse Maps Gulf County Parks Map Gulf County Trails Gulf County Beach Access Map Gulf County Boat Ramps & Launches Map Weather Newsletter Resources Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Menu Media News Releases Story Ideas Media Gallery About Us Advisory Council Our Team Careers Contact Us Contact Site Map Privacy Policy ADA Compliance Media About Us Contact Site Map Privacy Policy Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife CLOSE MENU Share Gulf County Centennial Celebration On June 6, 2025, Gulf County turns 100, and we’re rolling out the red carpet for a week-long centennial celebration! From June 1–7, join us as we honor a century of history, community, and natural beauty with events, activities, and experiences designed to bring everyone together. Gulf County, Florida is a place where small-town charm meets breathtaking landscapes. Whether you're a long-time local or visiting for the first time, we invite you to take part in this momentous occasion. From our pristine beaches - Cape San Blas , St. Joe Beach or Indian Pass - to the stunning Dead Lakes in historic Wewahitchka and the vibrant downtown Port St. Joe , there’s something here for everyone. What to Expect A Week of Countywide Celebration From Port St. Joe to Wewahitchka, enjoy daily events that bring Gulf County’s story to life— community events, family movie night, live music, and more. Check the events calendar below for full details. Centennial Fireworks Celebration Join us at Veterans Memorial Park at Beacon Hill on Friday, June 6 for live music, food vendors, and a spectacular fireworks display to cap off the week. Local Flavors & Artisans Taste your way through the celebration with dishes from beloved Gulf County restaurants, local food trucks, and handcrafted goods from regional makers. History Comes to Life Step into the past with interactive exhibits, a time capsule ceremony, and a history panel featuring longtime residents and local historians. Plan Your Visit With a variety of accommodations available—from beachfront homes to charming inns —you’ll find the perfect spot to stay. Looking for a getaway? Spend time exploring our beaches , trails , and parks to unwind between events. Our Vacation Rental Management Companies and hotels are ready to welcome you, and our free Concierge Services are here to help plan your perfect trip. Share Your Centennial Spirit Tag us on social media using #Gulf100 and share your memories of this once-in-a-lifetime celebration. Because every moment in Gulf County is a memory worth making! For more details or help planning your visit, contact us at the Welcome Center via email or phone at 850-229-7800. Let’s make Gulf County’s 100th a celebration to remember! Centennial Emblem We invite all Gulf County organizations to participate in this historic celebration by displaying the Gulf County Centennial Emblem on your website, marketing materials, signage, merchandise, etc.  The Emblem can be displayed now and throughout the end of the Centennial year.  To request use of the Emblem, please email Silvia Williams .  Dimensions and color of the Emblem should not be altered. Restaurants From the freshest local seafood to wood-fired pizza, sizzling steaks, and roadside barbeque, there’s always something... Places to Eat Things to Do Things To Do You will find no shortage of things to do in Gulf County on your visit. The incredible scenery is an attraction itself.... Places to Eat Things to Do Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Gulf County Tourist Development Council 150 Captain Fred's Place Port St. Joe, Florida 32456 Call Us: 850-229-7800 800-482-GULF Email Us: info@visitgulf.com Media About Us Contact Site Map Privacy Policy © 2025 Gulf County TDC. All Rights Reserved. ADA Compliance"
    },
    {
      "url": "https://www.visitgulf.com/about-us/advisory-council/",
      "text": "Advisory Council Skip navigation Skip to main content Parks Protect Our Shores Sea Turtles Turtle Trail Keep It Wild Ray the Responsible Raccoon Weddings Planning Tips & Ideas Venues Vendors Request Info Blog Partners Short Term Rental Business License Champions of Tourism Nominate a Champion of Tourism Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Parks Protect Our Shores Weddings Blog Partners Local Legend Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Destinations Cape San Blas Indian Pass Port St. Joe St. Joe Beach Wewahitchka Waterways St. Joseph Bay Gulf of America Dead Lakes Intracoastal Waterway & Lake Wimico Indian Pass Lagoon Places To Stay Vacation Rentals Inns & Cottages Camping & RV Parks Hotels & Motels Pet Friendly Restaurants & Nightlife Restaurants Seafood Coffee Shops Kid Friendly Ice Cream & Sweets Pizza Dog Friendly Nightlife Bars Live Music Things to Do Beaches Pet Friendly Beaches Beach Safety Water Activities Shelling & Scalloping Fishing Snorkeling & Diving Kayak & Paddle Boarding Boating & Sailing Boat Ramps & Launches Outdoors & Recreation Biking, Hiking & Walking Golf Horseback Riding Camping Parks Shopping Arts & Culture Museums & Historical Sites Health & Wellness Things To Do With Kids Things To Do With Teenagers Rentals & Concierge Services Tours Events Tupelo Honey Festival Blast On The Bay Songwriters Fest Events Calendar Concerts & Live Music Winter Events Submit Your Event Plan Your Trip Visitor Guide Request Digital Visitor Guide Concierge Program Welcome Center About Gulf County Tupelo Honey History Cape San Blas Lighthouse Maps Gulf County Parks Map Gulf County Trails Gulf County Beach Access Map Gulf County Boat Ramps & Launches Map Weather Newsletter Resources Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Destinations Places To Stay Restaurants & Nightlife Things to Do Events Plan Your Trip Wellness Live Stream Menu Media News Releases Story Ideas Media Gallery About Us Advisory Council Our Team Careers Contact Us Contact Site Map Privacy Policy ADA Compliance Media About Us Contact Site Map Privacy Policy Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife CLOSE MENU Share The Gulf County Tourist Development Council Advisory Board would like to thank you for visiting our website and, hopefully, our quiet shores along the Gulf of America. We are here to help answer any questions you may have about our unspoiled natural environment and our welcoming communities. Our goal is to help visitors and locals alike enjoy all that Gulf County offers and create lasting memories in this special place we call home. The Gulf County Tourist Development Council (TDC) is dedicated to supporting tourism that enhances both visitor experiences and the quality of life for our residents. The TDC is funded through tourism bed-tax collected in Gulf County, and these funds are reinvested to promote our destination, protect our natural assets, and encourage sustainable growth. The Advisory Board is comprised of members appointed by the Gulf County Board of County Commissioners. The board includes representatives from tourism-related businesses, local accommodations, community leaders, and elected officials. Together, they provide guidance on tourism initiatives and ensure that Gulf County remains a welcoming destination for all. Advisory Council Members Blake Rish, Chairperson Gulf County Board of County Commissioner Sandy Quinn Port St. Joe City Commissioner Scott Hoffman Wewahitchka City Commissioner Charlie Pettis Lynn Peters, Co-Chairperson Patty Fisher Lisa Forehand Christian Johnson Zach Childs Public Notices & Special Meetings See Public Notices & Special Meetings by checking the Gulf County Board of County Commissioners Calendar below. www.gulfcounty-fl.gov/cms/One.aspx?portalId=6501074&pageId=6501090 Annual Tourist Development Tax Collections (TDT) The Tourist Development Tax (commonly referred to as the \"bed tax\") funds the marketing and promotional activities performed by the Gulf County Tourist Development Council. The tax is also used for beach cleaning and grooming, product improvement, and beach nourishment. To find out more information on the Tourist Development Tax, contact the Clerk of Court's office at 850-229-6112 Monthly Analysis Reports Monthly TDT Analysis – September 2025 Join Our E-Newsletter Be part of the Gulf County tribe! Sign-up to receive adventure inspiration Get A Visitors Guide Discover what it means to be connected to the water and the wildlife Gulf County Tourist Development Council 150 Captain Fred's Place Port St. Joe, Florida 32456 Call Us: 850-229-7800 800-482-GULF Email Us: info@visitgulf.com Media About Us Contact Site Map Privacy Policy © 2025 Gulf County TDC. All Rights Reserved. ADA Compliance"
    },
    {
      "url": "https://www.gulfcoastcf.org/contact-us",
      "text": "Contact Us | Gulf Coast Community Foundation Skip to main content Search Search Share Facebook Twitter Linkedin Google + Email Ways to Give Grants Scholarships Contact Us Room Rentals Donor Log-in Give Now About Us Board Staff Mission, Vision, & Values Financials & Stewardship Strategic Plan 2024-2027 Careers Our Impact Arts & Culture Civic & Economic Development Disaster Response Education Environment Health & Human Services Professional Advisors Why Gulf Coast CAP® Study Group Let's Partner Together Your Resource Blog Your Philanthropy Ways To Give Creating Your Fund Donor Stories Your Philanthropy Team Community Partners Grants Gulf Coast Leadership Institute Invest In Incredible I3 Digital Room Rentals Media & Events Blog In the News Workshops Publications Brand Toolkit 2024 Impact Report Donor Login Donate Now Get In Touch Contact Us For Media Inquiries please call Kelly Carlstein, Vice President of Brand Strategy, 941.486.4618 Connect With Us Room Requests Click Here Headquarters 601 Tamiami Trail South Venice, FL 34285 941.486.4600 Get Directions Philanthropy Center 1549 State Street Sarasota, FL 34236 941.777.1270 Get Directions Media Inquiries Kelly Carlstein 941.486.4618 Email info@gulfcoastcf.org Fax 941.486.4699 Fill out my online form . Contact Headquarters 601 Tamiami Trail South Venice, FL 34285 941.486.4600 Philanthropy Center 1549 State Street Sarasota, FL 34236 941.777.1270 Email info@gulfcoastcf.org Brand Toolkit EIN 59-1052433 SUBSCRIBE TO OUR ENEWS Learn more about how we transform our region. SUBSCRIBE TO OUR ENEWS Learn more about how we transform our region. required Email Address * First Name Last Name no thanks Give Now Gulf Coast can accept online donations for a number of selected funds and organizations. Give Now Find Us on Donor Log-In Board Portal Grants Scholarships Contact Us Privacy Policy Sitemap Copyright 2025 Gulf Coast Community Foundation All Rights Reserved"
    }
  ]
}