{
  "fuentes": [
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "ayoo@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "bcutts@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "boxoffice@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "cdungca@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dht@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dmatlin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "doshima@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "elane@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "emcfadden@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "jmartin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "kmatsuno@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "productions@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "rtandal@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "vgreen@diamondheadtheatre.com"
    },
    {
      "url": "https://www.airgigs.com/job_board",
      "email": "help@airgigs.com"
    },
    {
      "url": "https://vividmusic.net/contact1",
      "email": "info@vividmusic.net"
    },
    {
      "url": "https://vividband.co.uk/about-us",
      "email": "info@vividmusic.net"
    },
    {
      "url": "https://tickets.lineleap.com/e/wQ5mTV8FByJ350GwBmLp",
      "email": "info@vividskyvertical.com"
    },
    {
      "url": "https://tickets.lineleap.com/e/wQ5mTV8FByJ350GwBmLp",
      "email": "john@vividskyvertical.com"
    },
    {
      "url": "https://www.kent-music.com/about-us/meet-the-team/",
      "email": "recruitment@kent-music.com"
    },
    {
      "url": "https://vividmusic.net/about-us",
      "email": "info@vividmusic.net"
    },
    {
      "url": "https://www.vividsydney.com/info/contact-us",
      "email": "public.comms@whodares.com.au"
    },
    {
      "url": "https://www.vividsydney.com/info/contact-us",
      "email": "vivid.access@dnsw.com.au"
    },
    {
      "url": "https://www.vividskypro.com/",
      "email": "allyoffice@vividskypro.com"
    },
    {
      "url": "https://www.vividskypro.com/",
      "email": "office@vividskypro.com"
    }
  ],
  "mails": [
    "allyoffice@vividskypro.com",
    "ayoo@diamondheadtheatre.com",
    "bcutts@diamondheadtheatre.com",
    "boxoffice@diamondheadtheatre.com",
    "cdungca@diamondheadtheatre.com",
    "dht@diamondheadtheatre.com",
    "dmatlin@diamondheadtheatre.com",
    "doshima@diamondheadtheatre.com",
    "elane@diamondheadtheatre.com",
    "emcfadden@diamondheadtheatre.com",
    "help@airgigs.com",
    "info@vividmusic.net",
    "info@vividskyvertical.com",
    "jmartin@diamondheadtheatre.com",
    "john@vividskyvertical.com",
    "kmatsuno@diamondheadtheatre.com",
    "office@vividskypro.com",
    "productions@diamondheadtheatre.com",
    "public.comms@whodares.com.au",
    "recruitment@kent-music.com",
    "rtandal@diamondheadtheatre.com",
    "vgreen@diamondheadtheatre.com",
    "vivid.access@dnsw.com.au"
  ],
  "nombre_sitio": "vividmusichall.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "text": "Staff & Board of Directors - Diamond Head Theatre Skip to content Box Office: (808) 733-0274 | Business Office: (808) 733-0277 Facebook Instagram YouTube LinkedIn Email Search for: Shows & Tickets Buy Tickets Season Subscriptions Seat Map Show Archive Subscriber Login Donate Annual Giving Capital Campaign Producer’s Club Sponsorship ‘Ilima Awards Auditions Show Auditions Shooting Stars Classes Year-Round Classes Summer Musical Theatre Experience Shooting Stars Instructors Scholarships About Staff & Board of Directors Instructors Volunteer Rentals News Show Archive Your New Theatre Theatrical Arts Building Make a Gift Sponsor a Seat Photos News Capital Campaign Donors Contact BUY TICKETS Staff & Board of Directors Jacque Vaughn 2025-07-23T06:29:51-10:00 STAFF & BOARD OF DIRECTORS We bring the magic of theatre to all Trevor Tamashiro, Executive Director Trevor joined Diamond Head Theatre as Executive Director in April 2023. Born and raised in Hawaii, and a graduate of Punahou School, he brings nearly 20 years of experience in nonprofit executive leadership. Trevor started his journey in New York City working for Broadway Dance Center. Other positions include: Chief Advancement Officer of The Diller-Quaile School of Music; Deputy Director of Saratoga International Theater Institute; and Deputy/Program Director for The Drama League of New York. Trevor is a member of the Association of Fundraising Professionals and is a Certified Fund Raising Executive (CFRE). He holds a degree in Theatre Arts from University of Miami, a Master of Business Administration degree from Pace University, and a Master of Science degree in Nonprofit Management from Columbia University. John Rampage, Artistic Director John Rampage is a performer, actor, choreographer, and director who has served as Diamond Head Theatre’s Artistic Director since 1995. He is the creative mastermind behind all of the theatre’s productions and programs, overseeing the curation of two or more shows each season and selects directors, musical directors, and set designers. His relationship with the theatre began in 1975 where he performed as Tommy Gilas in the 1975 production of Music Man. In the 1980s, Rampage danced and sang his way across the U.S. and Europe and returned in 1991 as choreographer of Evita. More than 120 productions have been shared with the community under his oversight. A 47-time Po‘okela Award winner for excellence in the theatre, John is also the recipient of the Hawaii State Theatre Council 2006 Pierre Bowman Award. OUR TEAM Dana Matlin Business Manager & Capital Campaign Coordinator 808.733-0277 (ext. 303) Krysta Matsuno Individual & Corporate Gifts Manager 808.733-0277 (ext. 306) Erin McFadden Director of Education & Shooting Stars 808.733-0277 (ext. 308) Brando Cutts Facilities & House Manager Volunteer Inquiries 808.733-0277 (ext. 310) Chandler Converse Production & Special Events Coordinator 808.733-0277 (ext. 304) Jamie Martin Box Office Manager 808.733-0277 (ext. 312) Mary Meinel Assistant Box Office Manager Kyle Sombrero Box Office Assistant & Concession Manager Skye Tonokawa Box Office Assistant Andrea Yoo Box Office & Admin Assistant 808.733-0277 (ext. 321) Emily Lane Costume Shop Manager 808.733-0277 (ext. 320) Candy Dungca Lead Stitcher 808.733-0277 (ext. 321) Kanani Sato Stitcher 808.733-0277 (ext. 321) Quinn Curammeng Stitcher 808.733-0277 (ext. 321) Dawn Oshima Lighting Supervisor, Master Stage Electrician 808.733-0277 (ext. 331) Brian Sullivan Technical Director Vincent Green Production Associate 808.733-0277 (ext. 333) Randy Tandal Production Associate 808.733-0277 (ext. 333) Kyle Conner Scene Shop Assistant Ryan Sullivan Scene Shop Assistant Cheyne Nomura House Manager Rochelle Uchibori House Manager Amy Sato Showtime Box Office Assistant Malia Connor Concession Manager Olga Moroz Concession Manager BOARD OF DIRECTORS Officers Colin Miwa CHAIR Trevor Bracher VICE CHAIR, Chair-Elect Mike Ching VICE CHAIR Matthew Pennaz VICE CHAIR Mark Wong VICE CHAIR Jennifer Tanabe SECRETARY Gabe Lee TREASURER Rick Chong IMMEDIATE PAST CHAIR Board Members Cathy Camp Sidney C. L. Char Wayne Chi Rick Ching Jennifer Diesman Uson Y. Ewart Elisia Flores Dennis Francis Candes Meijide Gentry Kay Hampton Randy Harris Todd Iacovelli Kathleen Lin-Hurtubise Mariko Lyons John Magauran, M.D. Tony Mizuno David Okabe Karyn R. Okada Laurence Paxton Nigel Pentland Richard M. Rand Paul M. Saito Kelly Sanders Dean Shigemura Travis Tanaka Sharen Wago Indru Watumull Carolyn A. Berry Wilson Wendell J. Wo Steven Wong Vernon Wong Anna Steenerson Young Diamond Head Theatre is America’s third oldest continuously running community theatre. We are an independent nonprofit that relies on community support. Diamond Head Theatre recognizes the use of diacritical markings in the modern orthography of Hawaiian language. These markings may be omitted to give you the best experience with our website. 520 Makapuu Avenue Honolulu, Hawaii 96816 Box Office Hours: Monday through Friday 10 am to 4 pm Box Office: (808) 733-0274 Business Office: (808) 733-0277 Click Here to Email Us SIGN UP FOR E-NEWS Subscriber Login FOLLOW US © 2024 Diamond Head Theatre | All Rights Reserved | Privacy Policy | About Accessibility | Site created by Transcendence Pacific. Toggle Sliding Bar Area Our Community Giving Campaign needs your kokua to build a new arts complex. Diamond Head Theatre is a 501(c)(3) nonprofit organization. FEIN 99-0073495 Page load link Go to Top"
    },
    {
      "url": "https://www.airgigs.com/job_board",
      "text": "Studio Musicians Wanted - AirGigs.com × Airgigs App Airgigs Inc. Open In App Find Pros Top Categories Vocalists & Voiceover Vocalists & Voiceover Male Vocals Female Vocals Backing Vocals EDM Vocals Metal Vocals Country Vocals Rock Vocals Rap Artists Voiceovers Mixing & Mastering Mixing & Mastering Mixing Engineers Mastering Engineers Audio Editing Remixes Analog Mix / Master Song Production Song Production Arrangements Backing Bands Consultations Backing Tracks Beat Makers Full Song Production Songwriting Songwriting Songwriters Topline Guitars & Folk Strings Guitars & Folk Strings Electric Acoustic Slide Pedal Steel Lap Steel Banjo Mandolin Dobro Sitar Piano, Keys Synth Piano, Keys Synth Piano Rhodes Hammond Organ Synths Drums & Percussion Drums & Percussion Session Drummers Percussion Programmed Drums Arrangements & Pre-Production Arrangements & Pre-Production Arrangers Transcription Consultations Strings Strings Violin Viola Cello Quartets Bass Bass Electric Acoustic / Upright Horns Horns Saxophone Trumpet Bassoon Sections See all categories Want talent to come to you? Post your project Start Selling Are you a Music Pro looking to sell your services? Become part of the AirGigs community and help songwriters, music creators and producers bring their projects to life. Sign up today and post your service listing, or browse our artists wanted board to find creators who are looking for your services. Sign up today for more info! sign up now! Artists Wanted Are you a studio professional who loves to play, sing, mix, jam, rock or roll?\n            Are you a musician with mad skills and a desire to help others create that sweet, sweet music? View Recent Projects Why Sell On AirGigs? Be part of a fast growing community of music professionals No cost to join No membership fees Seller protection Cash bonuses and more Support by music production pros See Seller FAQ Blog Log In Sign Up Find Pros Start Selling Blog Login Signup FIND PROS Vocalists & Voiceover Mixing & Mastering Song Production Songwriting Guitars & Folk Strings Piano, Keys Synth Drums & Percussion Arrangements & Pre-Production Strings Bass Horns See All Categories Vocalists & Voiceover Male Vocals Female Vocals Backing Vocals EDM Vocals Metal Vocals Country Vocals Rock Vocals Rap Artists Voiceovers Post your project Mixing & Mastering Mixing Engineers Mastering Engineers Audio Editing Remixes Analog Mix / Master Post your project Song Production Arrangements Backing Bands Consultations Backing Tracks Beat Makers Full Song Production Post your project Songwriting Songwriters Topline Post your project Guitars & Folk Strings Electric Acoustic Slide Pedal Steel Lap Steel Banjo Mandolin Dobro Sitar Post your project Piano, Keys Synth Piano Rhodes Hammond Organ Synths Post your project Drums & Percussion Session Drummers Percussion Programmed Drums Post your project Arrangements & Pre-Production Arrangers Transcription Consultations Post your project Strings Violin Viola Cello Quartets Post your project Bass Electric Acoustic / Upright Post your project Horns Saxophone Trumpet Bassoon Sections Post your project SELLER Post a Service My Services My Subscriptions My Custom Offers My Proposals Artists Wanted Manage Sales Revenues My Subscribers Purchases BUYER Post a Project My Posts My orders My Subscriptions My Favorites Invoices PROFILE View Profile My Favorites Marketing Tools New Purchases Settings Artists Wanted Post Projects, Receive Proposals From Top Studio Professionals Filters Filter Projects By Project Type Remote Local Category Album Artwork Arrangements Audio Editing Backing Bands Backing Tracks Bass Beat Makers Brass, Woodwind Consultations Design Drums Folk Instruments Guitar Lessons Mastering Misc Instrumental Mixing Percussion Personalized Concerts Piano, Keys, Synth proposal Rap Artists Remixes Song Production Songwriters Sound Design Transcription Videos Violin, Viola, Cello Vocals Vocals (Female) Vocals (Male) Price Range Select 20 - 100 101 - 300 301 - 500 501 - 800 801 - 1000 1000+ Delivery Date Up\n                    to 24 hours Up\n                    to 7 days Any Genre Ambient Americana Bluegrass Blues Broadway Choral Christian Classical Country Dubstep EDM Electronic Folk Funk Gospel Hard Rock Hip Hop House Jazz Latin Metal Musical theatre Opera Pop Pop-Rock Punk R&B Rap Rock Singer-Songwriter Soul Swing Techno Trap World Clear Filters Artists Wanted Post Projects, Receive Proposals From Top Studio Professionals Post your Project Not Rated Yet Seeking drummer to re-record or sample e... I have a ~3:45 singer/songwriter type song. I had the drums tracked remotely during covid and have all stems. The performance is pretty good, though the kick and snare lack bass and meat. I have Superior Drummer 3 and am... View Details » Not Rated Yet Independent hip-hop artist seeking vocal... I’m an independent hip-hop artist (GMA Greedy Money) from San Francisco working on a new project blending Hip Hop, R&B, and Pop influences. My music is detail-oriented, high-energy, and inspired by real stories of ambi... View Details » Not Rated Yet help fixing my mic/interface setup on a ... I need help fixing my mic/interface setup on a Mac, and then I’d like to see a mixer mix one of my tracks and explain the process of how they do it mid session. View Details » Not Rated Yet Need background instrumental of cover so... I want to do a cover about a song that i love a lot, reason why i need people to make a cover is to not get copyrighted by using the full original track, im gonna sing it, i just need help making the music, the cover i w... View Details » Not Rated Yet Seeking a mixing engineer Hello I’m looking for a mixing engineer for a few personal projects of mine. I’m not a professional, I just like to record songs as a hobby. Most of the beats I rap over are ones I hear on the radio, but there are a ... View Details » Not Rated Yet Quiero producir pistas musicales para gr... Quiero producir pistas musicales para grabar covers y subirlos a plataformas digitales. Requiero sesión total del fonograma.\r\n\r\nI want to produce music tracks to record covers and upload them to digital platforms. I req... View Details » Not Rated Yet Help With Lyrics Hi, I've written a song and am looking for help with lyrics.  I've uploaded it with scratch vocals below.  I'm looking for help with lyrics, but if there is anything else you feel could be improved upon, please let me kn... View Details » Not Rated Yet Seeking female vocal Seeking female vocal for pop power ballade with emotional virtuoze convincing vocal. Please send examples of work in the style and your pricing per song. View Details » Not Rated Yet Hammond, Vox, Guitar & Percussion for So... Sono Qui (“I am here”) is a new song, created with AI and now ready to be brought to life by real musicians. It’s a bluesy, soulful pop track inspired by the Italian mountains and artists like Zucchero. Expect warm... View Details » Not Rated Yet Seeking production help for country song I wrote a country song for my boyfriend for our anniversary and I would love to record a good version more professional to upload to my Apple Music and Spotify account. \r\nI recorded a full album back in the time in Nashv... View Details » Not Rated Yet Professional producer/songwriter seeking... Professional producer/songwriter seeking male and female vocalists for new songs. Please send examples of your work and pricing per song View Details » Not Rated Yet alt-lofi track needing a semi-etherial f... alt-lofi track needing a semi-etherial female vocal for backing vocals. I have a rough cut using generated female vocals that need to be replaced by a human voice. View Details » Not Rated Yet Seeking Arrangements Seeking skilled arranger for several band projects. Please send samples of past work and pricing View Details » Not Rated Yet Seeking percussion for Ambient Music Pro... Seeking percussion for Ambient Music Production project. Please send examples of past work and pricing per song. View Details » Not Rated Yet Need mixing and mastering Need mixing and mastering for 15 song mixtape. Please send examples of past work and pricing. View Details » Not Rated Yet I'm looking for an engineer or producer ... I'm looking for an engineer or producer to run pro tools for me remotely. I'm looking to pay per hour, my sessions last around 4-6 hours. I use audiomovers and zoom so the engineer gets a high quality audio signal and th... View Details » Not Rated Yet Mixing and  mastering Seeking someone who specializes in mixing and mastering hip hop tracks View Details » Not Rated Yet A lead sheet created I have an original song that I wrote (lyrics and melody) with help from sunoai, and I need a professional lead sheet created for copyright registration.\r\n\r\nHere’s what I need:\r\n\r\nA lead sheet with:\r\n\r\nThe melody writte... View Details » Not Rated Yet Need lead and background vocals My name is Olivier, I am a French composer and I am looking for a qualified singer to record my song \"I Take control\"\r\n\r\nI want to have the main singing and the accompaniments (Choirs) in a new metal style: novelists - D... View Details » Not Rated Yet Looking for session pros to help with an... I have an album written of (let's say) ten or eleven songs, which I need help bringing to completion. Influences range from old songbook standards to folk, blues, rock and roll, and even some electronic music (in short, ... View Details » Not Rated Yet Seeking female vocalist for my project For the project I'm working on now, I am looking for a female vocalist. View Details » Not Rated Yet Seeking band to perform my AI music and ... Looking for band to perform my AI music and record the performance from multiple angles View Details » Not Rated Yet Seeking vocalists for my songs I write a wide variety of music and play a the violin though I use LMMS to mix my audio and make my music. I am a beginner in this field and have a lot to learn. I have terrible vocals in my opinion so I would like to hi... View Details » Not Rated Yet Seeking personalized remote concert for ... I run an instagram account that posts a video of the famous Utaloid “Kasane Teto” singing a song called “Brain Implosion Energy”. Our 100th day video is coming soon and I’d like a live band to perform to make t... View Details » Not Rated Yet Female VOCALIST for “PERIOD ANTHEM” ... VOCALIST BRIEF – “PERIOD ANTHEM”\r\n\r\nProject Type:\r\nCatchy, empowering, and slightly humorous anthem for TikTok / Reels use — written for a feminine care brand that breaks period taboos and empowers women to take ... View Details » Not Rated Yet Seeking mix / master for 2 tracks I need someone to mix 2 tracks (piano & string section).  Also to master. View Details » Not Rated Yet Album Cover. Front image only. Album Cover. Front image only. \r\nAlbum title: Something Worth Sharing\r\nArtist: Angie Ebensberger\r\nImage: Centered pair of female open hands making a sharing gesture (line-drawing style, delicate, not overly detailed). Fr... View Details » Not Rated Yet Need someone to sing growl, opera , clea... Seeking female vocalist. Need someone to sing growl, opera , clear voice. Please share samples of past work. View Details » prev 1 2 3 4 5 6 7 8 9 10 next Copyright © 2012-2025 AirGigs, IIc. All rights reserved. Need Help? contact us Top Pages Home About us Blog Shop Privacy Policy Terms & Conditions Airgigs Reviews Get Started Find Pros Post a Project How it works FAQ Log In Sign Up Connect Facebook X Instagram Pinterest YouTube Linkedin × How it Works The Concept: A marketplace & community of recording, mixing and mastering professionals working on projects from their own studios. The Goal: To open up new possibilities for music production via online collaboration and a new income stream for sound designers, session musicians and audio engineers. And why do we think it's possible? \"Virtual\" collaboration is already happening all over the music world, and AirGigs is just a central platform where people can post gigs for their skills and talents. The Process: On AirGigs, sellers post gigs for music production services that they can deliver online. They set the terms, provide representative audio samples and specify what materials (rough mixes, session files, formats, etc) that they require from buyers. All communication and file exchange happens through the Airgigs system. Buyers can leave reviews of gigs they have purchased. The Finances: When a buyer purchases a gig, payment is made through PayPal. AirGigs holds payment until the gig has been completed and then Sellers pay between 8-15% commission based on seniority, bonuses and promotions. For more detail click here The Benefits: For sellers the benefit is obvious - we handle all the marketing and you make money doing what you're best at. Buyer's have the opportunity to browse offerings from amazingly talented people all over the world. × Awesome, You're all set! Find the perfect artist or studio for your project and start building your musical dream team. Post Your Project (Lets The Artist Find You) Browse Services (Find Your Artist) PS. Keep an eye on your inbox for tips on hiring talent × Awesome, You're all set! You're one step closer to connecting with clients in need of your talent. The next step is to setup your service. Post Your Service PS. Keep an eye on your inbox for tips on getting bookings × Great! Your email is now confirmed Here's where to start: Want some helpful tips getting started? Let us know if you plan to find pros, or get hired? Find Music Pros Get Hired Need help? Contact us We'll send you an email with help documents Skip × Contact What are you seeking? Tell a bit about the project File upload (optional) Drag and drop files here or click to upload I want to receive proposals from other pros for this project What other categories do you need? Array\n                                                                    Album Artwork Album Artwork Arrangements Arrangements Audio Editing Audio Editing Backing Bands Backing Bands Backing Tracks Backing Tracks Bass Bass Beat Makers Beat Makers Brass, Woodwind Brass, Woodwind Consultations Consultations Drums Drums Folk Instruments Folk Instruments Guitar Guitar Lessons Lessons Lyric Videos Lyric Videos Mastering Mastering Misc Instrumental Misc Instrumental Mixing Mixing Music Promotion Music Promotion Percussion Percussion Personalized Concerts Personalized Concerts Piano, Keys, Synth Piano, Keys, Synth Podcast Editing Podcast Editing Rap Artists Rap Artists Remixes Remixes Song Production Song Production Songwriters Songwriters Sound Design Sound Design Transcription Transcription Violin, Viola, Cello Violin, Viola, Cello Vocals (Female) Vocals (Female) Vocals (Male) Vocals (Male) Voiceovers Voiceovers Next × Login to continue Continue with Facebook Continue with Google Continue with Apple OR Email address Password SHOW Continue Remember me Forgot password? Not a member? Sign up now Continue to login or signup to send your message Already a member? LOG IN NOW Join free today and get immediate access to an amazing community of top studio professionals. Continue with Facebook Contiue with Google Continue with Apple or signup with your email Email address Continue By joining I agree to receive emails from Airgigs. Join Airgigs Username Password SHOW Join By joining, you agree to Airgigs’s Terms of Service ,\n                    as well as to receive occasional emails from us. Reset Password Please enter your email address and we'll send you a link to reset your password. Email address Continue Back to Log in × Login Welcome back! Login with Facebook Login with Google Login with Apple OR Email address Password SHOW Continue Remember me Forgot password? Not a member? Sign up now SIGNUP Already a member? LOG IN NOW Join free today and get immediate access to an amazing community of top studio professionals. Sign Up with Facebook Sign Up with Google Sign Up with Apple or signup with your email Email address Continue By joining I agree to receive emails from Airgigs. Join Airgigs Username Password SHOW Join By joining, you agree to Airgigs's Terms of Service ,\n                    as well as to receive occasional emails from us. Already a member? Log in now Reset Password Please enter your email address and we'll send you a link to reset your password. Email address Continue Back to Log in × Get Recommended by Past Clients Learn More 1. Select type of recommendation General Recommendation 2. Copy URL Copy Url 3. Send your link to colleagues so they can recommend you Close × Success Close × Recommend (500 character max) Select 1-5 Star Review: Recommendation Headline What you do / Your title × LABEL SERVICES WANT PUBLICITY FOR YOUR PROJECT? X Close"
    },
    {
      "url": "https://vividmusic.net/contact1",
      "text": "Contact Page — Vivid Music Home Media Setlists The Band Packages Gallery FAQ Contact Home Media Setlists The Band Packages Gallery FAQ Contact Contact Us Name * First Name Last Name Email * Event date * Further information (event location, approximate guest numbers, timings etc). * Please add all the details that you have at this time so we can provide you with an accurate quote. Let us know what type of event you are hosting (i.e. wedding / corporate / private party etc.) . Thank you! Our Office 30 St Andrew’s Court London E17 6AX Tel. 0208 925 8747 Vivid Music LTD 2025   Registered in England No. 12652147 30 St Andrew’s Court E17 6AX  :  Tel. 020 8925 8747 : Email info@vividmusic.net Firestation Studios N16, United Kingdom 0208 925 8747 info@vividmusic.net Hours Mon 9am to 7pm Tue 9am to 7pm Wed 9am to 7pm Thu 9am to 7pm Fri 9am to 7pm Sat 10am to 7pm Sun 11am to 7pm Packages | FAQ | Instagram | Facebook | X | Back to top | Privacy policy | Production Powered by Squarespace"
    },
    {
      "url": "https://vividband.co.uk/about-us",
      "text": "About Us — Vivid Band Sign In My Account Home Media Setlists The Band Packages Gallery FAQ Contact Sign In My Account Home Media Setlists The Band Packages Gallery FAQ Contact We Are Vivid Band VIVID IS THE GO-TO BAND for parties, weddings and corporate events.  We are a professionally managed, scalable and established event band. We have more great reviews, and a wealth of material for our customers to review. We genuinely love what we do and this is reflected in our fantastic performances across the UK and Europe. SO WHY BOOK WITH US? *SOUND QUALITY of the band is probably the most important thing to consider at your event and it often gets overlooked. However good the performers are, if the overall sound quality is poor, the vocals indecipherable and the distinction between the instruments non existent, it will be difficult to appreciate the music at all. Live sound will vary from the sound you listen to in promotional videos on your home / mobile devices, and different venues have different acoustic properties. We own and supply genuine industry grade equipment to all events and we have a qualified engineer band member to manage the sound setup. Sound and disco lighting production for events of up to 250 persons is included as standard with all our packages. Additional production is also available  (in-house and upon request). In addition to this, our 8-piece and above line-ups are all booked with an independent sound engineer. We own our own 9-seater tour bus so we are able to carry a good stock of spares and we can all travel to gigs together which is very healthy for the environment too! *OUR HUGE SONG REPERTOIRE of both classic and contemporary songs makes us a very appealing option to any potential client. We have also complied a collection of song medleys that form the basis of the repertoire that you can choose for your event (take a peak at the Setlists page for more details). Performance medleys give us the opportunity to perform many more songs than would otherwise be available to you within your performance period. We avoid unnecessary stops and starts between songs, and we maintain the momentum throughout the show. Modern music is heavily produced and we can recreate this with our genuine authentic reproductions using modern instruments and versatile effects units. *OUR EXPERIENCE is legendary. We have been trusted to perform at many high calibre events and for numerous high profile clients such as Mercedes UK, Shell Europe, R.A.F. Marriott Hotels, Guoman Hotels, The Natural History Museum, The Victoria & Albert Museum. Our singers have worked with producers such as Rodney Jerkins, Jimmy Harry, and Shelley Peikin, having contributed to original songs for artists such as Michael Jackson, Madonna, Beyonce, Whitney Houston, Ed Sheeran, and Kylie. *VIVID MUSICIANS AND VOCALISTS are a stellar collection of London's West End performers and industry professional musicians. All our singers are experienced West End show performers or have established, successful industry solo careers. All of our musicians are professional performers and all carry degrees from respected music schools.  We are all qualified in both jazz and pop disciplines. *ADDITIONAL SERVICE options are available to cover many other areas of your entertainment brief . We have 3 DJ selections as well as DJ sax live option. We provide instrumental and vocal-led acoustic / jazz band options, roaming bands, horn sections and multiple vocalist line-ups. We have additional production available for events over 250 persons and we can provide a mesmerising star cloth background to all clients. We can even supply a range of photo booths from our sister company Viivd Booths. *SAXOPHONE IS INCLUDED WITH ALL BOOKINGS. That’s right - whichever line up you choose, we provide a saxophonist as part of the band and to roam the dance floor if you wish! *CHOOSE YOUR LINE-UP. You can choose from a wide range of band line-up options as follows; 4-piece COMPACT - Lead female vocal / Acoustic drums / Guitar / (Keyboards and Saxophone - one player). Limited setlist. 5-piece  STANDARD - Lead female vocal / Acoustic drums / Guitar lead & rhythm / Bass guitar /  (Keyboards and saxophone - one player). 6-piece MIXED VOCAL - Lead female vocal / Lead male vocal /  Acoustic drums / Guitar lead & rhythm / Bass guitar / (Keyboards and saxophone - one player). 7-piece - BRASSY - Lead female vocal  /  Acoustic drums / Guitar lead & rhythm / Bass guitar /  (Keyboards and saxophone - one player) / Trumpet / Trombone. 8 piece - SELECT - Lead female vocal / Lead male vocal / Acoustic drums / Guitar lead & rhythm / Bass guitar /  (Keyboards and saxophone - one player) / Trumpet / Trombone. 10 piece - HARMONY - 2 x Lead female vocal / 1 x Lead male vocal / Acoustic drums / Guitar lead & rhythm / Bass guitar  / Keyboards / Saxophone / Trumpet / Trombone. 13 piece SHOW BAND - 3 x Lead female vocal / 2 x Lead male vocal / Acoustic drums / Guitar lead & rhythm / Bass guitar  / Keyboards / Saxophone / Trumpet / Trombone / Percussionist. We have performed indoors / outdoors, at large festivals and in tiny spaces. We’ve performed abroad and we’ve travelled the length and breadth of the British Isles. *VENUE REQUIREMENTS - yes -we provide all necessary insurance and additional documentation upon request. We will fully liaise with your venue if preferred and reduce your workload a fair bit. *WE DON’T HAVE ANY SPECIAL REQUIREMENTS  -we can plug straight into the domestic 3 pin power sockets and we don’t require a stage (although it is nice if your venue can provide one!). All we ask is that you provide each band member with a hot meal if we are on site for over 5 hours. We have been together as a band for nearly a decade and in the unlikely event of any of the team falling ill, we can cover the part from our pool of fully rehearsed musicians. We have a dedicated and experienced manager who will work with you throughout the booking process and is always available to offer help & advice. How it works : Get in touch with us via the contact page on this site. Provide us with some details of your event, most importantly : location, date, performance times and preferred package details. We will confirm availability and quote you a price. Claire Marie Hall. 'Live and Upfront' (London Palladium), Sharon Cunetta (Wembley Arena), Champion Children (ITV). Amy Pearson. Platinum selling singer songwriter (The Prototypes, Zoe Badwi, Eddie Craig). Denquar. Residency, Hyatt Regency hotels (UK / Japan / Hong Kong), Leopard Bar, London. Gerad McArthur. Jason Donavan, Mike and the Mechanics and Deacon Blue. GeO Gospel Choir. Matt Holland Robbie Williams, Van Morrison, Lisa Stansfield. Grammy Award Albums (Ray Charles / Roger Daltry). Alessandro Taglioni. Diploma MUS, Teacher. Paul Narang. BA Music Hons Performance, Middlesex University. Francisco Bernhard. BA Music Hons Performance Munich School. Richard Cross Yehudi Menuhin, Vladimir Ashkenazy, Carl Davis and Katherine Jenkins, The Royal Academy of Music. Giles Narang. Former Bronzehead drummer, Toured with LCD Soundsystem. Antoine Sarkar. Royal College Music BA Hons Mus. Lycée College Voltaire. Andrew Simmons. Royal College of Music, London, MMus, Newcastle College, BAMusic (First Class). Vivid Music LTD 2025   Registered in England No. 12652147 30 St Andrew’s Court E17 6AX  :  Tel. 020 8925 8747 : Email info@vividmusic.net Packages | FAQ | Instagram | Facebook | X | Back to top | Privacy policy Powered by Squarespace"
    },
    {
      "url": "https://tickets.lineleap.com/e/wQ5mTV8FByJ350GwBmLp",
      "text": "DJ DIESEL @ Vivid Music Hall | LineLeap Tickets DJ DIESEL @ Vivid Music Hall Shaq, Shaquille O'Neal, Diesel, DJ Diesel Dec 7, 2024 7:00 PM - 2:00 AM Vivid Music Hall • Gainesville • FL Event Description DJ DIESEL (SHAQ) delivers a nightmare before Christmas this December 7th in Gainesville! This event has happened. All sales have ended. Overview Vivid Sky Pres. DJ DIESEL! Venue: Vivid Music Hall Address: 201 W. University Ave, Gainesville, FL 32601 For any questions, group pricing or other service please contact us at: Email: info@vividskyvertical.com John: (561) 758 - 7628 Brandon: (561) 654 - 6798 Instagram: @VividSkyVertical & @VividMusicHall Facebook: Vivid Sky Vertical & Vivid Music Hall *To help rebuild our community, we are donating $2 from every ticket purchased for Hurricane Relief Efforts.* ________________________________________________________________________________________ Shaquille O'Neal, renowned as one of the most dominant NBA players in history, has also become a global entertainment icon. His passion for music began at 14 after seeing Public Enemy live, inspiring him to save for his first DJ equipment. In 1993, his rap album Shaq Diesel sold over a million copies, making him the first athlete with a platinum record. After discovering electronic dance music at TomorrowWorld in 2014, he launched his DJ career as DJ Diesel, collaborating with top artists like Steve Aoki and Riot Ten. Now, he headlines major festivals worldwide, runs his own event series, Shaq's Bass All-Stars, and holds a Las Vegas residency. Download the App Company Contact Us What is LineLeap? About Us Customers Refunds Venue Owners Learn More Platform Pricing Dashboard Login Event Organizers Learn More © LineLeap 2025 Privacy Policy Terms & Conditions"
    },
    {
      "url": "https://www.kent-music.com/about-us/meet-the-team/",
      "text": "Kent Music Staff - Meet the team Skip to page content Return to homepage User Log in About Show menu Back About Us Welcome to Kent Music, where we believe in the power of music to inspire and transform lives. About Us Kent & Medway Music Hub Partners Find Out More Policies Terms and Conditions Equality, Diversity and Inclusion Meet the team Join Our Team Support Us Courses Show menu Back Courses Explore a wide range of music courses available throughout the year to suit all ages and skill levels. Discover Courses Financial Assistance Featured Courses Orchestra ONE Half Term Courses Find Out More About Kent Music Summer School County Groups Courses Half Term Courses Orchestra One Courses Groups Show menu Back Groups Discover the joy of making music together with our diverse range of groups! Discover Groups Financial Assistance County Groups Music Centres Search By Learning Vocals Learning Strings Learning Woodwind Learning Brass Learning Drums and Percussion Learning Piano, Keyboard and Tech Lessons Show menu Back Music Lessons Expert teaching for every stage of your musical journey Discover Lessons Financial Assistance Music Lessons Our Teachers Learning Vocals Learning Strings Learning Woodwind Learning Brass Learning Drums and Percussion Learning Piano, Keyboard and Tech Instrument Hire Show menu Back Instrument Hire Discover our easy and convenient instrument hire service. Financial Assistance Search by Individual Instrument Hire School Instrument Hire News and Events Show menu Back What's On Stay updated with our latest news and events to enhance your musical journey and connect with the music community in Kent & Medway. View All Events Latest News Events News Schools Show menu Back Music in Schools Our aim is to support schools to create the conditions where music thrives Find out more Planning Music in Your School Supporting Music in Your School Music Development Plan CPD and Training Funded Opportunities School Survey Contact Toggle search User Log in open mobile navigation Search for: Search Meet the team Professional, friendly, passionate From our ensemble leaders and teachers to administrators and managers, all Kent Music staff have one thing in common – a commitment to supporting you throughout your musical journey with us. Meet the non-teaching team below! You can reach us by emailing hello@kent-music.com We will forward your message to the relevant member of staff, who will be happy to help. Want to find out more about our teaching staff? Meet the teachers here . Kent Music Staff: Board of Trustees Our Board of Trustees is made up of dedicated professionals who guide and oversee Kent Music. They bring experience from education, arts, business, and community service, helping to shape our vision and ensure we provide excellent music education in Kent and Medway. Our Trustees are committed to fostering creativity, inclusivity, and excellence in all our programs. Meet our Trustees below and learn about the unique skills they bring to our organisation. Interested in Becoming a Kent Music Trustee? We are always on the lookout for passionate and dedicated individuals to join our Board of Trustees. If you have a love for music and a commitment to enhancing music education in Kent and Medway, we would love to hear from you. For more information or to have an informal conversation about becoming a trustee, please contact us at recruitment@kent-music.com Ray Mia Ray is a film, audio and theatre producer who has worked across the entire creative landscape from technology design and build through to production, delivery and distribution. Jessica Cooling Jessica is a freelancer working with choirs and orchestras in London and the South East, focussing in concert production and administration. Alicia Moyles Alicia is Head of Service, Specialist Employment at the Education People. Rebecca Evernden Rebecca is Director of Cross Cutting Policies & Negotiations for the Civil Service. Elizabeth Topiwala Elizabeth is a retired primary school Head Teacher who trained as a piano teacher and has a lifelong interest in music education. She was also Head Teacher at Wrotham Primary School and Stocks Green Primary School. Robin Hammerton Robin works as a freelancer in the music education sector. Until July 2016 he was the National Lead for Music for Ofsted. Kyle Siwek Kyle is a doctorate student at the University of Oxford, where he holds a Choral Scholarship at The Queen’s College, but he previously spent fourteen years participating in Kent Music’s County Groups, Summer Schools, and Music Centres. He studied for undergraduate and master’s degrees in History and Politics, and has also served as a governor of a secondary academy school and an independent school trust. At university, he has been involved in collegiate governance and student representation. Geoff Miles Chair Geoff is a former BBC TV producer who is now Chair of Maidstone TV studios. Geoff is also the Chair of the Business Development Group of the South East Local Enterprise Partnership and Chair of the Kent Enterprise in Business Awards. Tim Leates Tim is retired. Before retirement he was the Head of Finance and Administration at the ABRSM. Heulwen Finley Heulwen is a Talent Agent and Senior Music Executive. As an agent and member of the senior leadership team at leading talent and entertainment company UTA for 16 years (UTA acquiring The Agency Group in 2015), she played a crucial role in shaping the music department and London office. Specialising in Classical, Theatre, and Performing Arts, Heulwen founded a global division representing top-tier talent, including singers, bands, podcasters and children’s entertainment. Her accolades include induction into the Women in Music Awards: Roll of Honour by Music Week, being a finalist for Live Music Agent of the Year at the 2020 Music Week Awards and being featured on the Variety International Women’s Impact list. Heulwen was previously an artist manager of opera singers at IMG Artists. She was a Royal Albert Hall 150th Anniversary Ambassador and has been a Trustee of Kent Music since 2024. Interested in joining our team? Discover our current roles and join our passionate team by visiting our vacancies page. Join Our Team Meet our teachers Get to know our dedicated teaching staff and their musical expertise. Find out more Return to homepage Kent Music is proud to be certified a Disability Confident Employer: Supported by: Quick Links About Us Courses Groups Music Lessons Events Instrument Hire Schools Make a payment User Log In Teacher log in Newsletter Sign Up Sign up to the Kent Music monthly newsletter for all the latest news and updates, as well as special offers and promotions. It's great for keeping parents and teachers up to date. Sign up Get in touch Kent Music, Units 25 & 26, Creative Enterprise Quarter, Javelin Way, Ashford, TN24 8FN Phone: 01622 691212 Email: hello@kent-music.com     This website and its content is copyright of Kent Music - © 2025 Kent Music. All rights reserved. Policies Privacy Policy Cookies T&Cs Accessibility Support Us Website by Pillory Barn"
    },
    {
      "url": "https://vividmusic.net/about-us",
      "text": "About Us — Vivid Music Home Media Setlists The Band Packages Gallery FAQ Contact Home Media Setlists The Band Packages Gallery FAQ Contact We Are Vivid Music VIVID IS THE GO-TO BAND for parties, weddings and corporate events.  We are a professionally managed, scalable and established event band. We have more great reviews, and a wealth of material for our customers to review. We genuinely love what we do and this is reflected in our fantastic performances across the UK and Europe. SO WHY BOOK WITH US? *SOUND QUALITY of the band is probably the most important thing to consider at your event and it often gets overlooked. However good the performers are, if the overall sound quality is poor, the vocals indecipherable and the distinction between the instruments non existent, it will be difficult to appreciate the music at all. Live sound will vary from the sound you listen to in promotional videos on your home / mobile devices, and different venues have different acoustic properties. We own and supply genuine industry grade equipment to all events and we have a qualified engineer band member to manage the sound setup. Sound and disco lighting production for events of up to 250 persons is included as standard with all our packages. Additional production is also available  (in-house and upon request). In addition to this, our 8-piece and above line-ups are all booked with an independent sound engineer. We own our own 9-seater tour bus so we are able to carry a good stock of spares and we can all travel to gigs together which is very healthy for the environment too! *OUR HUGE SONG REPERTOIRE of both classic and contemporary songs makes us a very appealing option to any potential client. We have also complied a collection of song medleys that form the basis of the repertoire that you can choose for your event (take a peak at the Setlists page for more details). Performance medleys give us the opportunity to perform many more songs than would otherwise be available to you within your performance period. We avoid unnecessary stops and starts between songs, and we maintain the momentum throughout the show. Modern music is heavily produced and we can recreate this with our genuine authentic reproductions using modern instruments and versatile effects units. *OUR EXPERIENCE is legendary. We have been trusted to perform at many high calibre events and for numerous high profile clients such as Mercedes UK, Shell Europe, R.A.F. Marriott Hotels, Guoman Hotels, The Natural History Museum, The Victoria & Albert Museum. Our singers have worked with producers such as Rodney Jerkins, Jimmy Harry, and Shelley Peikin, having contributed to original songs for artists such as Michael Jackson, Madonna, Beyonce, Whitney Houston, Ed Sheeran, and Kylie. *VIVID MUSICIANS AND VOCALISTS are a stellar collection of London's West End performers and industry professional musicians. All our singers are experienced West End show performers or have established, successful industry solo careers. All of our musicians are professional performers and all carry degrees from respected music schools.  We are all qualified in both jazz and pop disciplines. *ADDITIONAL SERVICE options are available to cover many other areas of your entertainment brief . We have 3 DJ selections as well as DJ sax live option. We provide instrumental and vocal-led acoustic / jazz band options, roaming bands, horn sections and multiple vocalist line-ups. We have additional production available for events over 250 persons and we can provide a mesmerising star cloth background to all clients. We can even supply a range of photo booths from our sister company Viivd Booths. *SAXOPHONE IS INCLUDED WITH ALL BOOKINGS. That’s right - whichever line up you choose, we provide a saxophonist as part of the band and to roam the dance floor if you wish! *CHOOSE YOUR LINE-UP. You can choose from a wide range of band line-up options as follows; 4-piece COMPACT - Lead female vocal / Acoustic drums / Guitar / (Keyboards and Saxophone - one player). Limited setlist. 5-piece  STANDARD - Lead female vocal / Acoustic drums / Guitar lead & rhythm / Bass guitar /  (Keyboards and saxophone - one player). 6-piece MIXED VOCAL - Lead female vocal / Lead male vocal /  Acoustic drums / Guitar lead & rhythm / Bass guitar / (Keyboards and saxophone - one player). 7-piece - BRASSY - Lead female vocal  /  Acoustic drums / Guitar lead & rhythm / Bass guitar /  (Keyboards and saxophone - one player) / Trumpet / Trombone. 8 piece - SELECT - Lead female vocal / Lead male vocal / Acoustic drums / Guitar lead & rhythm / Bass guitar /  (Keyboards and saxophone - one player) / Trumpet / Trombone. 10 piece - HARMONY - 2 x Lead female vocal / 1 x Lead male vocal / Acoustic drums / Guitar lead & rhythm / Bass guitar  / Keyboards / Saxophone / Trumpet / Trombone. 13 piece SHOW BAND - 3 x Lead female vocal / 2 x Lead male vocal / Acoustic drums / Guitar lead & rhythm / Bass guitar  / Keyboards / Saxophone / Trumpet / Trombone / Percussionist. We have performed indoors / outdoors, at large festivals and in tiny spaces. We’ve performed abroad and we’ve travelled the length and breadth of the British Isles. *VENUE REQUIREMENTS - yes -we provide all necessary insurance and additional documentation upon request. We will fully liaise with your venue if preferred and reduce your workload a fair bit. *WE DON’T HAVE ANY SPECIAL REQUIREMENTS  -we can plug straight into the domestic 3 pin power sockets and we don’t require a stage (although it is nice if your venue can provide one!). All we ask is that you provide each band member with a hot meal if we are on site for over 5 hours. We have been together as a band for nearly a decade and in the unlikely event of any of the team falling ill, we can cover the part from our pool of fully rehearsed musicians. We have a dedicated and experienced manager who will work with you throughout the booking process and is always available to offer help & advice. How it works : Get in touch with us via the contact page on this site. Provide us with some details of your event, most importantly : location, date, performance times and preferred package details. We will confirm availability and quote you a price. Claire Marie Hall. 'Live and Upfront' (London Palladium), Sharon Cunetta (Wembley Arena), Champion Children (ITV). Amy Pearson. Platinum selling singer songwriter (The Prototypes, Zoe Badwi, Eddie Craig). Denquar. Residency, Hyatt Regency hotels (UK / Japan / Hong Kong), Leopard Bar, London. Gerad McArthur. Jason Donavan, Mike and the Mechanics and Deacon Blue. GeO Gospel Choir. Matt Holland Robbie Williams, Van Morrison, Lisa Stansfield. Grammy Award Albums (Ray Charles / Roger Daltry). Alessandro Taglioni. Diploma MUS, Teacher. Paul Narang. BA Music Hons Performance, Middlesex University. Francisco Bernhard. BA Music Hons Performance Munich School. Richard Cross Yehudi Menuhin, Vladimir Ashkenazy, Carl Davis and Katherine Jenkins, The Royal Academy of Music. Giles Narang. Former Bronzehead drummer, Toured with LCD Soundsystem. Antoine Sarkar. Royal College Music BA Hons Mus. Lycée College Voltaire. Andrew Simmons. Royal College of Music, London, MMus, Newcastle College, BAMusic (First Class). Vivid Music LTD 2025   Registered in England No. 12652147 30 St Andrew’s Court E17 6AX  :  Tel. 020 8925 8747 : Email info@vividmusic.net Firestation Studios N16, United Kingdom 0208 925 8747 info@vividmusic.net Hours Mon 9am to 7pm Tue 9am to 7pm Wed 9am to 7pm Thu 9am to 7pm Fri 9am to 7pm Sat 10am to 7pm Sun 11am to 7pm Packages | FAQ | Instagram | Facebook | X | Back to top | Privacy policy | Production Powered by Squarespace"
    },
    {
      "url": "https://www.vividsydney.com/info/contact-us",
      "text": "Contact Us | Vivid Sydney Skip to main content Vivid Sydney 23 May - 14 June Social Links Facebook TikTok Twitter Instagram Facebook Ideas Twitter Ideas Access & Inclusion Getting to Vivid Sydney Contact User account menu Log in Toggle navigation Main navigation About About Vivid Sydney FAQs Blog Sustainability Acknowledgements News Room Contact Us Opportunities Expressions of Interest Work With Us Info Contact Us The Vivid Sydney team is here to help! Whether you have questions, need support, or want to provide feedback, reach out via email, phone, or the contact form. You may also find links to FAQs or customer service resources for quick assistance. The team will respond as soon as possible. Frequently asked questions Before contacting us we recommend reading our Frequently Asked Questions (FAQ) page for answers to commonly asked questions about the festival. Event Period The event period will run through 3 stages; bump in, event period, and bump out. Bump in: 12 - 23 May 2025 Event: 23 May - 14 June 2025, lights on from 6pm - 11pm nightly Bump out: 15 - 22 June 2025 Contact numbers General Enquiries & Feedback​​ https://www.vividsydney.com/info/contact-us ​ Available​​ 9am-5pm​​ Traffic ​Management​​ public.comms@whodares.com.au ​ 0403 589 972​ ​Live traffic updates livetraffic.com Available​​ 22 April – 22 May ​ 9:00am – 5:00pm Available 23 May – 14 June ​​ 9:00am – 12:00am Vivid Sydney Accessibility enquiries, noise complaints & operations. vivid.access@dnsw.com.au 0429 897 028 Available​​ 5 May – 22 May ​​ 9:00am – 7:00pm​​ ​​ Available 23 May – 14 June ​​ 9:00am – 12:00am​​ ​​ Available 15 June - 22 June​​ 9:00am – 7:00pm​​ Towed Vehicles 132 701 Available 23 May – 14 June 7:00am – 1:00am Emergency evacuation Please note that the footprint of Vivid Sydney may temporarily impact your emergency evacuation locations from the beginning of bump in, Monday 5 May 2024. Please review the Light Walk map here for any changes. Sydney Notice of Development Application Read the submitted applications. Application 1 > Application 2 > Media Enquiries To contact the Vivid Sydney Media Team, along with the latest information on the festival, including announcements and media ready assets, please visit the Vivid Sydney News Room . Connect on Social For all the latest festival announcements visit Vivid Sydney's official social media channels Instagram > Facebook > TikTok > YouTube > X > LinkedIn > If you still can't find the answer to your questions please use the contact form below. A member of the Vivid Sydney team will be in touch with you as soon as possible. First Name Last Name Email Phone Company Name Type Please select... Commercial Partnerships Complaint Compliment Expression of Interest General Enquiry Legal/Ethics Local Business Program & Accessibility Media Requests Non-Disclosure Agreement (NDA) People Employment Matters Request for Quotation Retail Activation/ Local Business Program Area Please select... Empty Event General Marketing Mobile Application Social Media Website Event General Marketing Mobile Application Social Media Website Ideas Light Music Empty General Ideas Light Music Subject Description Would you like to be contacted by a member of the Vivid Sydney team in response to your enquiry? Yes No reCAPTCHA helps prevent automated form spam. The submit button will be disabled until you complete the CAPTCHA. In respect of personal information, Destination NSW advises that it collects, uses and stores any of your personal information strictly in compliance with the Privacy and Personal Information Protection Act 1998 (NSW) and the Privacy Act 1988 (Cth). For your information, our privacy policy is located at: https://www.destinationnsw.com.au/privacy-policy . Destination NSW may share your information with third parties including third party suppliers and operators conducting and administering the activity and other related activities, however your personal information will not generally be disclosed to anyone outside Australia, unless in connection with the activities. Where the information is shared with any countries in the European Union, Destination NSW will adhere to the data protection rules as per the General Data Protection (GDPR) Regulation. Information relating to this is also located within our privacy policy. You can opt out at any time by contacting Destination NSW. Partners See All Partners Proudly Owned, Managed and Produced by Major Partners Official Partners Contact FAQs Contact Us Meet the Team Work with us Resources News Room Archive Terms of Use Privacy Policy Cookie Notice Follow Us Instagram Threads Facebook X LinkedIn TikTok YouTube Newsletter We'll keep you in the loop on the hottest acts, and ticket information. You can opt-out at anytime. By clicking \"Sign up\", you accept our privacy policy . Sign Up Leave this field blank Contact FAQs Contact Us Meet the Team Work with us Resources News Room Archive Terms of Use Privacy Policy Cookie Notice Follow Us Instagram Threads Facebook X LinkedIn TikTok YouTube © Destination NSW 2025. Footer Terms of use Privacy Acknowledgement of Country Destination NSW acknowledges the Gadigal people of the Eora Nation, the\n      traditional owners of the land and waters upon which Vivid Sydney is hosted.\n      We offer our respect to their Elders both past and present. Subscribe to Vivid Sydney Be the first to know about the hottest acts, latest events as well as access to offers and discounts exclusive to subscribers. Don't miss a thing - sign up now! * Indicates a required field Email Country - Select a country - Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua & Barbuda Argentina Armenia Aruba Ascension Island Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia & Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory British Virgin Islands Brunei Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Canary Islands Cape Verde Caribbean Netherlands Cayman Islands Central African Republic Ceuta & Melilla Chad Chile China Christmas Island Clipperton Island Cocos (Keeling) Islands Colombia Comoros Congo - Brazzaville Congo - Kinshasa Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d’Ivoire Denmark Diego Garcia Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard & McDonald Islands Honduras Hong Kong SAR China Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Kosovo Kuwait Kyrgyzstan Laos Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao SAR China Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar (Burma) Namibia Nauru Nepal New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Korea North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territories Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Islands Poland Portugal Puerto Rico Qatar Romania Russia Rwanda Réunion Samoa San Marino Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia & South Sandwich Islands South Korea South Sudan Spain Sri Lanka St. Barthélemy St. Helena St. Kitts & Nevis St. Lucia St. Martin St. Pierre & Miquelon St. Vincent & Grenadines Sudan Suriname Svalbard & Jan Mayen Sweden Switzerland Syria São Tomé & Príncipe Taiwan Tajikistan Tanzania Thailand The Netherlands Timor-Leste Togo Tokelau Tonga Trinidad & Tobago Tristan da Cunha Tunisia Turkmenistan Turks & Caicos Islands Tuvalu Türkiye U.S. Outlying Islands U.S. Virgin Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Vatican City Venezuela Vietnam Wallis & Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Postcode By signing up, I have read and agree to the Privacy Policy and Terms of Use of Destination NSW Subscribe Leave this field blank Thanks for Subscribing Check your inbox for the latest Vivid Sydney updates. Explore Vivid Sydney"
    },
    {
      "url": "https://www.vividskypro.com/",
      "text": "Professional Audio & Visual Services | Vivid Sky Pro Home Services Gallery USED GEAR About Contact Professional Audio & Visual Services With top quality audio, lighting, video, and special effects equipment we make your live events memorable.  We provide nationwide live event services for anything from conferences to festivals.  Contact Vivid Sky today and let us make your vision come to life! CONTACT US Breaking News: Articles on Us! VIVID SKY PRO EXPANDS Vivid Sky Productions Expands Presence with Acquisition of Production Support Group in Tallahassee READ MORE FOH MAGAZINE Slightly Stoopid: From Stadiums to Street Festivals READ MORE MIX Mixing The Live Vibes of Slightly Stoopid READ MORE VIVID SKY PRO From Great to Amazing: Adding the L-Acoustics K3 READ MORE ALLEYCVT Vivid Music Hall Button REGGAE RISE UP 25 Vinoy Park VIEW PHOTOS RESONATE Suwannee River State Park VIEW PHOTOS Follow us @vividskypro Powered by EmbedSocial → Gainesville: Phone: (352) 363 - 6382 Email: office@vividskypro.com Address: 3500 NE Waldo Rd. Suite A Gainesville, FL 32609 9:00A.M. - 5:00P.M. Tallahassee: Phone: (850) 562-1070 Email: t allyoffice@vividskypro.com Address: 5013 Oniel Ln. Tallahassee, FL 32303 ﻿ 9:00A.M. - 5:00P.M. © All rights reserved  Vivid Sky Productions Share by:"
    }
  ]
}