{
  "fuentes": [
    {
      "url": "https://www.pawsandreflect.blog/p/smyrna-dunes-park-dog-friendly-florida-beach-review",
      "email": "authors@thefp.com"
    },
    {
      "url": "https://smyrna1897.org/about-us/who-we-are",
      "email": "210f910f-eac7-48d0-b8aa-498fd43f0edd@2x.jpg"
    },
    {
      "url": "https://smyrna1897.org/about-us/who-we-are",
      "email": "23a6c92f-4129-402e-ad3a-b84960820bd7@2x.png"
    },
    {
      "url": "https://smyrna1897.org/about-us/who-we-are",
      "email": "2dfcb54f-2983-44fd-a1bb-a223ff61e332@2x.png"
    },
    {
      "url": "https://smyrna1897.org/about-us/who-we-are",
      "email": "638b4468-dabd-4bcb-b077-5ad1ec901d62@2x.jpg"
    },
    {
      "url": "https://smyrna1897.org/about-us/who-we-are",
      "email": "6528a2ab-583a-4ced-9582-754d908703ec@2x.png"
    },
    {
      "url": "https://smyrna1897.org/about-us/who-we-are",
      "email": "69dc4752-4f52-40db-add2-64e87b831bb0@2x.png"
    },
    {
      "url": "https://smyrna1897.org/about-us/who-we-are",
      "email": "abobo@smyrna1897.org"
    },
    {
      "url": "https://smyrna1897.org/about-us/who-we-are",
      "email": "admin@smyrna1897.org"
    },
    {
      "url": "https://smyrna1897.org/about-us/who-we-are",
      "email": "bchappell@smyrna1897.org"
    },
    {
      "url": "https://smyrna1897.org/about-us/who-we-are",
      "email": "c5b7af3e-afbb-42ca-9f8a-3d01511bf3ef@2x.jpg"
    },
    {
      "url": "https://smyrna1897.org/about-us/who-we-are",
      "email": "c6f5bf03-8c25-46c5-9500-ec5f593179ee@2x.jpg"
    },
    {
      "url": "https://smyrna1897.org/about-us/who-we-are",
      "email": "d43f8b02-a705-4991-b0dc-776a85a20042@2x.png"
    },
    {
      "url": "https://smyrna1897.org/about-us/who-we-are",
      "email": "dwatson@smyrna1897.org"
    },
    {
      "url": "https://smyrna1897.org/about-us/who-we-are",
      "email": "echaplin@smyrna1897.org"
    },
    {
      "url": "https://smyrna1897.org/about-us/who-we-are",
      "email": "rrowland@smyrna1897.org"
    },
    {
      "url": "https://www.volusia.org/services/growth-and-resource-management/building-and-zoning/staff-contacts.stml",
      "email": "kmatter@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/growth-and-resource-management/building-and-zoning/staff-contacts.stml",
      "email": "bbradburn@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/growth-and-resource-management/building-and-zoning/staff-contacts.stml",
      "email": "chutchison@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/growth-and-resource-management/building-and-zoning/staff-contacts.stml",
      "email": "ediamond@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/growth-and-resource-management/building-and-zoning/staff-contacts.stml",
      "email": "kleuzinger@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/growth-and-resource-management/building-and-zoning/staff-contacts.stml",
      "email": "kmatter@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/growth-and-resource-management/building-and-zoning/staff-contacts.stml",
      "email": "lcushing@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/growth-and-resource-management/building-and-zoning/staff-contacts.stml",
      "email": "mnelson@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/growth-and-resource-management/building-and-zoning/staff-contacts.stml",
      "email": "nventura@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/growth-and-resource-management/building-and-zoning/staff-contacts.stml",
      "email": "rjones@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/financial-and-administrative-services/human-resources/why-work.stml",
      "email": "humanresources@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/financial-and-administrative-services/human-resources/why-work.stml",
      "email": "dpaige@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/public-works/coastal-division/coastal-parks/",
      "email": "recprocoastal@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/public-works/coastal-division/coastal-parks/",
      "email": "jfentress@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/public-works/coastal-division/coastal-parks/cardinal-drive-beach-park.stml",
      "email": "recprocoastal@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/public-works/coastal-division/coastal-parks/cardinal-drive-beach-park.stml",
      "email": "jfentress@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/growth-and-resource-management/environmental-management/sustainability-and-resilience/protected-species/beach-mice.stml",
      "email": "jspain@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/growth-and-resource-management/environmental-management/sustainability-and-resilience/protected-species/beach-mice.stml",
      "email": "dcolflesh@volusia.org"
    },
    {
      "url": "https://www.volusia.org/about-us/volunteer.stml",
      "email": "cops@vcso.us"
    },
    {
      "url": "https://www.volusia.org/about-us/volunteer.stml",
      "email": "clmiller@volusia.org"
    },
    {
      "url": "https://www.volusia.org/about-us/volunteer.stml",
      "email": "info@dunlawtonsugarmillgardens.org"
    },
    {
      "url": "https://www.volusia.org/services/public-works/coastal-division/coastal-parks/sun-splash-park.stml",
      "email": "recprocoastal@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/public-works/coastal-division/coastal-parks/sun-splash-park.stml",
      "email": "jfentress@volusia.org"
    },
    {
      "url": "https://idahodunesrv.com/contact-us/",
      "email": "reservations@idahodunesrv.com"
    },
    {
      "url": "https://www.volusia.org/services/public-works/coastal-division/coastal-parks/smyrna-dunes-park.stml",
      "email": "recprocoastal@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/public-works/coastal-division/coastal-parks/smyrna-dunes-park.stml",
      "email": "jfentress@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/public-protection/beach-safety/beach-driving-and-parking.stml",
      "email": "beachsafety@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/public-protection/beach-safety/beach-driving-and-parking.stml",
      "email": "dstrom@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/public-protection/beach-safety/beach-driving-and-parking.stml",
      "email": "jrlifeguard@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/public-protection/beach-safety/beach-driving-and-parking.stml",
      "email": "tmalphurs@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/public-works/coastal-division/coastal-parks/mary-mcleod-bethune-beach-park.stml",
      "email": "recprocoastal@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/public-works/coastal-division/coastal-parks/mary-mcleod-bethune-beach-park.stml",
      "email": "jfentress@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/public-protection/animal-services/",
      "email": "animalcontrol@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/public-protection/animal-services/",
      "email": "jbwilkinson@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/public-protection/animal-services/",
      "email": "vcacc@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/public-works/coastal-division/reserving-pavilions.stml",
      "email": "recprocoastal@volusia.org"
    },
    {
      "url": "https://www.volusia.org/services/public-works/coastal-division/reserving-pavilions.stml",
      "email": "jfentress@volusia.org"
    }
  ],
  "mails": [
    "210f910f-eac7-48d0-b8aa-498fd43f0edd@2x.jpg",
    "23a6c92f-4129-402e-ad3a-b84960820bd7@2x.png",
    "2dfcb54f-2983-44fd-a1bb-a223ff61e332@2x.png",
    "638b4468-dabd-4bcb-b077-5ad1ec901d62@2x.jpg",
    "6528a2ab-583a-4ced-9582-754d908703ec@2x.png",
    "69dc4752-4f52-40db-add2-64e87b831bb0@2x.png",
    "abobo@smyrna1897.org",
    "admin@smyrna1897.org",
    "animalcontrol@volusia.org",
    "authors@thefp.com",
    "bbradburn@volusia.org",
    "bchappell@smyrna1897.org",
    "beachsafety@volusia.org",
    "c5b7af3e-afbb-42ca-9f8a-3d01511bf3ef@2x.jpg",
    "c6f5bf03-8c25-46c5-9500-ec5f593179ee@2x.jpg",
    "chutchison@volusia.org",
    "clmiller@volusia.org",
    "cops@vcso.us",
    "d43f8b02-a705-4991-b0dc-776a85a20042@2x.png",
    "dcolflesh@volusia.org",
    "dpaige@volusia.org",
    "dstrom@volusia.org",
    "dwatson@smyrna1897.org",
    "echaplin@smyrna1897.org",
    "ediamond@volusia.org",
    "humanresources@volusia.org",
    "info@dunlawtonsugarmillgardens.org",
    "jbwilkinson@volusia.org",
    "jfentress@volusia.org",
    "jrlifeguard@volusia.org",
    "jspain@volusia.org",
    "kleuzinger@volusia.org",
    "kmatter@volusia.org",
    "lcushing@volusia.org",
    "mnelson@volusia.org",
    "nventura@volusia.org",
    "recprocoastal@volusia.org",
    "reservations@idahodunesrv.com",
    "rjones@volusia.org",
    "rrowland@smyrna1897.org",
    "tmalphurs@volusia.org",
    "vcacc@volusia.org"
  ],
  "nombre_sitio": "volusia.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.pawsandreflect.blog/p/smyrna-dunes-park-dog-friendly-florida-beach-review",
      "text": "Smyrna Dunes Park: Dog-friendly Florida beach review Subscribe Sign in Smyrna Dunes Park: Dog-friendly Florida beach review From the perspective of a reactive dog owner Haley Young Aug 14, 2020 Share My dog’s very first beach experience was at Smyrna Dunes Park in Volusia County, Florida. We stumbled upon it shortly after moving to the Sunshine State while looking for places we could take our blue heeler to learn to swim — and I’m so happy we did! Here’s our complete review of what it’s like to visit Smyrna Dunes Park’s dog-friendly beach with a dog in tow. Smyrna Dunes Park at a glance We love Smyrna Dunes Park! We’ve thoroughly enjoyed every time we brought Scout. It is not ideal for highly reactive or nervous dogs, but it’s completely doable even if your dog doesn’t want to meet strangers . There is nothing quite like a sunrise from Smryna Dunes Park’s elevated boardwalk. Our favorite things about Smyrna Dunes Park: Pets are allowed on the beach at all times of day It’s spacious, with plenty of room to sniff and romp Leashes are required at all times The entire park is absolutely gorgeous and extremely well-kept There is a complete dog rinsing station and restroom facilities The dog-friendly beach is on the inlet side, which means the water is calm enough to properly swim Our least favorite things: It does cost $10 to enter the park (but you can get an annual pass for $20 ) Some owners violate leash laws and allow their dogs to run freely At high tide, parts of the beach become extremely narrow If you go, make sure you bring: A waterproof collar (or one you don’t mind getting dirty) A sturdy leash A towel or two Drinking water Waste disposal bags Food or a toy to play and reward good behavior! Pet corrector, citronella spray, pepper gel, or another deterrent for off-leash dogs The least busy times are: Weekdays, particularly early to mid-morning Weekend early mornings Late evenings The details of Smyrna Dunes dog-friendly beach Where are dogs allowed? On the inlet shore beach (not on the Atlantic oceanside) and on the elevated boardwalk at certain times of day. When are dogs allowed? On the beach at all times the park is open from 6 am to 7:30 pm! On the boardwalk until 10 am and again after sunset. What restrictions are there for dogs? Dogs must be leashed at all times and can not walk on the dunes or disturb wildlife. Owners must clean up after their dogs. More information, including any timely updates, can be found on Volusia County’s website ! It’s easy to have a good time at Smyrna Dunes dog-friendly beach. Getting to Smyrna Dunes Smyrna Dunes Park is in New Smyrna Beach, Florida. It’s between Daytona Beach and the Canaveral National Seashore , a little less than an hour’s drive from Cocoa Beach and a little more than an hour from Orlando. Once you arrive at the park When you get to the park, a staff member will take your one-time payment or scan your annual pass at the entrance. They’ll also: Be able to provide a map of the park Answer any questions you have off the bat Remind you to keep your dog leashed Provide extra waste disposal bags if you need them If you arrive right as the park is opening on a weekend, there might be a line of cars in front of the gate. It usually moves quickly! Once you’re in, you can park your car almost anywhere. There are several places to pull off into the grass alongside the boardwalk. You can also follow the entrance road to the end, where there is a larger parking lot complete with a rinsing station and restroom facilities. Note that the rinsing area and main parking lot is often crowded with people and dogs. If your dog needs space, it’s a good idea to scan the area before opening the car door so you don’t get surprised! Enjoy views from the boardwalk If you arrive before 10 am, you and your dog can enjoy some breathtaking views from the elevated boardwalk! It’s over two miles long in total and is particularly gorgeous at sunrise. paws.andreflect A post shared by @paws.andreflect There are several walkways off of the boardwalk that take you down to the beach — just be sure to read the signs about which parts are dog-friendly so you don’t accidentally end up on the wrong side. Some things to note about the boardwalk: It’s about eight feet wide, which can be too narrow for some space-sensitive dogs We recommend putting your dog in a heel to be respectful while passing others It gets hot quickly — check it with your hand to make sure your dog’s paws will be okay! Dogs are only allowed before 10 am and then again an hour before sunset One of my favorite things is how far ahead you can see. There are no blind corners or sharp turns — you’ll be able to know well in advance if you’ll have to pass another person or dog! This gives you plenty of time to put your dog in a command and set everyone up for success. Take a beautiful sandy trail If you arrive after 10 am or just don’t want to pass anyone in close quarters, there is a sandy trail that will take you directly from the parking lot to the dog-friendly area of the beach! At the trails narrowest point, you should still have at least about 15 feet of space to pass other people and dogs if you pull off to the side. Note that the sand gets hot just as quickly as the boardwalk does. Some type of paw wax protection is a great idea for your dog, and you won’t want to be caught without shoes of your own! Splash around in the water Once you make it to the beach, you’ll have plenty of space to walk, sniff, and play. You can set up camp for a few hours or merely meander along the shore. paws.andreflect A post shared by @paws.andreflect Since dogs are only allowed on the inlet side of the park, there aren’t large ocean waves like on many other Florida beaches. This makes it an ideal place to actually swim! At high tide, certain sections of the beach do become quite narrow. It’s best to check out the tide chart before you go, or at least be prepared to pass other people and dogs in close proximity. Remember: leashes are required! Dogs are required to be leashed at all times while in Smyrna Dunes Park — including while they’re in the water. Here’s why: Loose dogs could erode the dunes Wildlife (particularly turtles) makes its home in the park Leash laws enable guests who might be afraid of dogs to still enjoy their experience Certain parts of the inlet have strong currents, and a leash can keep your dog safe Off-leash dogs could consume leftover trash from other patrons Check out this article for some more information about why leash laws matter! With that said, there is no length limit — so feel free to bring your retractable lead or a long line along! Just make sure you have full control over your dog so they don’t approach anyone uninvited or get into mischief. Thankfully, most owners have respected the leash laws on our trips to Smyrna Dunes. We’ve only seen a handful of off-leash dogs there. All but one have been engaged with their owners, generally just dragging their leash along the shore. In these cases, calling ahead to ask them to pick up the leash before you pass works wonders! We did once see an off-leash dog charge up to several people while ignoring its owner’s recall. It was a pretty scary situation — we’re personally prepared to body block or use pepper gel in order to keep other dogs from getting into Scout’s space. There are plenty of signs around the dog-friendly beach reminding visitors of the leash rules. If you have any questions, look for a staff member — they’ll back you up! Park personnel aren’t shy about asking owners to leash their dogs (and actually hold onto the leash). All in all: a great way to start the morning All in all, Smyrna Dunes Park is one of our favorite places to take Scout for a beach day. We particularly enjoy going early in the morning when the crowds are minimal and the sunrise paints the sky. The park is well-maintained and has always been pristine on our trips. It’s worth the entrance fee — as long as you’re prepared to pass other people and defend yourself from off-leash dogs if needed, you’ll have an excellent time! Share Previous Next Discussion about this post Comments Restacks Top Latest Discussions No posts Ready for more? Subscribe © 2025 Haley Young Privacy ∙ Terms ∙ Collection notice Start writing Get the app Substack is the home for great culture This site requires JavaScript to run correctly. Please turn on JavaScript or unblock scripts"
    },
    {
      "url": "https://smyrna1897.org/about-us/who-we-are",
      "text": "Smyrna Baptist Church | Who We Are Skip to main content Menu Menu Home About Us Who We Are Our Beliefs Our History Ministries Children Youth Sunday School Worship Ministry Baptist Men Women of Grace Missions Resources My Smyrna Smyrna Calendar Newsletter Sermons Sunday School Lessons Daily Devotions Podcast Emmaus Road Library Teacher Training Give Home About Us Who We Are Our Beliefs Our History Ministries Children Youth Sunday School Worship Ministry Baptist Men Women of Grace Missions Resources My Smyrna Smyrna Calendar Newsletter Sermons Sunday School Lessons Daily Devotions Podcast Emmaus Road Library Teacher Training Give Who We Are Our Beliefs Our History Pastoral Staff T ake a moment to get to know your leadership! Aaron Bobo lead pastor I was born and raised in Fayetteville, GA. After high school, I was blessed to attend Columbus State University in Columbus, GA, where I received my undergrad degree in Communication. Columbus State is where I met my wife of 15 years, Ashley. We have three beautiful girls, Analeigh, Alizabeth, and Allison. In addition to an undergrad degree, I currently hold a Masters of Arts degree in Pastoral Ministry from Liberty University. My desire is to adequately equip and build up the local church with the truth of the Gospel by thoroughly teaching the Word of God. In addition to spending time with my family and ministering to the local church, I enjoy reading anything I can get my hands on and watching sports, particularly the Atlanta Braves and Georgia Bulldogs! Contact: abobo@smyrna1897.org Dr. Robert Rowland Executive pastor of care I was born in Dinwiddie back in 1967. I left the county in 1985 to attend VA. Tech, but mostly in pursuit of a girl, Johanna Nelson, who became my wife 36 years ago.  God has blessed us with four awesome kids who all love and serve the Lord - two of whom serve as our church planters at Capital City Church in Richmond, Va. along with their wives and our third son and his wife. Our daughter Laura attends Liberty Univ currently.  I eventually earned my Bachelor's Degree in psychology from VCU, and then a Masters of Divinity and a Doctorate from Southeastern Baptist Theological Seminary in Wake Forest, NC. Johanna, the kids, and I served as missionaries to India for two years where the Lord taught us so much about blessings, priorities, and sacrifice. It is my humble desire to see others truly know the Lord. I remain convinced that if others can see Jesus for who He really is, there is a great chance that they will love Him, too. It is the mandate of the local church to represent, reflect, and reveal Jesus to our community, state, nation, and the world. Contact: rrowland@smyrna1897.org daniel watson pastoral resident I was born in Maryland in 1985. I\ngrew up in a military family, along with my twin sister and older brother.\nDuring my childhood, my dad was in the Air Force. This gave me the opportunity\nto live in Maine, Washington and now Virginia, where I have spent the majority\nof my life. I was also blessed to have been raised in a Christian home by my\nparents. Church life was very important to my family and was instilled in me\nfrom an incredibly early age. I graduated from Park View High School in 2003.\nIn 2005, I earned my Associateâs Degree from Southside Virginia Community\nCollege. Fast forward some years to where God providentially, and graciously,\nbrought the love of my life to me, my wife Tabitha. We were married in 2019.\nNot long after this God led us to Smyrna Baptist Church. Smyrna quickly became\nthe church home we had been praying for. Even though we have only been here a\nfew years, God has provided opportunities for us to grow in this church family.\nThe sermons, classes and fellowship opportunities have enhanced our walk with\nChrist. This new stage of ministry training is an answer to prayer. I am eager\nto learn as God uses my pastors and church family to equip me for the next\nstage of the journey that He has for me. In April of 2025, our first child will\nbe born, a baby girl. As Tabitha and I look to the future we are excited for\nwhat God has planned for us. Contact: dwatson@smyrna1897.org Ministry Staff Audrey Erdmann Administrative Assistant I was born and raised in Florida. In 1991 I moved to Wisconsin with a friend and met the love of my life, Jim. After a short two-month courtship we married in November of 1991. My family moved to Dinwiddie County in 1997 where I have been actively involved in various churches in the area. In 2009 I found my church home here at Smyrna Baptist. I started working as one of our part-time administrative assistants in July of 2017 and became the full-time administrative assistant in 2018. God has blessed me beyond measure with two wonderful children (a daughter and son), four granddaughters and a grandson. When I am not working or serving at Smyrna Baptist this 'empty-nester' enjoys sewing, cooking and spending time my husband, my grandkids and my church family. Contact: admin@smyrna1897.org Melodie Parsons Director of Music I was born and raised in Huntington, West Virginia, and married my husband, Joe, after high school. After we had our two daughters we moved to Greenville, South Carolina where we were blessed to grow deeper in our faith and develop our talents and gifts in service through a local church. I have been involved with music my entire life serving in various positions in my home state and then in South Carolina, North Carolina and Virginia. I am passionate about music and how it is used in the local church to worship the Lord and encourage believers of all ages in their walk with Christ. I am also passionate about worship and the role it plays in our relationship with our creator. I enjoy leading and serving as part of a team and I am honored and privileged to plan the music for our worship services and special events along with others that serve through the worship ministry. I enjoy family time, musical theatre, worship conferences and travel. erica chaplin children's director I grew up in Dinwiddie, VA on our 100+ year-old family farm. I earned a Bachelors in Business Management at VCU. I met my love, Jason, and was living my dream. We were both working fulltime and a few years later started our family with our firstborn son, Trevor. Our world was rocked when we lost Trevor at the tender age of 2 1/2 years old. I was faced with feeling alone, lost, and terrified to move forward, lost myself and my purpose, but through my faith, was able to navigate the new life I was living. Five weeks after the most devastating day of our lives, we celebrated the birth of our second son, Hunter. Talk about a roller coaster ride. Hunter was also born with the disease, but thanks to God for all that we discovered through Trevor's death, Hunter is healed and lives a normal life. A few years later, Jason and I welcomed our free-spirited daughter, Brianna. Our family was complete. Through this roller coaster I call life, Smyrna has been my saving grace. While going through the turmoil with Trevor's health, Smyrna felt like home to me. Ten years later I find myself blessed to be working in God's house which has been a constant shining light in some of my darkest moments. Children are God's precious gifts and I am beyond blessed to work with His children and lead His wonderful volunteers so that we can instill a love for Jesus in the hearts of the little ones of Smyrna Baptist. Contact: echaplin@smyrna1897.org Brad Perkinson Worship Leader I was born and raised in Dinwiddie County. I graduated from Dinwiddie High School in 2006 where I met the girl of my dreams, Ashley Brooke, who later became my wife and mother of my 4 sons, Jackson, Noah, and Luke and Micah. I have been a member at Smyrna since I was 6 and have seen God do some amazing things in and through our church. My love for music started as a youngster and continued later in my teenage years, playing with various bands in different venues. I am so thankful for God's amazing love and grace that providentially brought me to the place I serve today. I love our church and the culture of worship that our leadership teaches and exemplifies. My desire is to lead in a way where God is glorified, Jesus is lifted up, and His presence is always welcome. When I am not serving the church I love playing with my boys and every second I have alone with my wife! Brittney chappell accountant Contact: bchappell@smyrna1897.org Click HERE to subscribe to our \"Points to Ponder\" Daily Devotions â Â Â î§ circlefacebook â î circleyoutube â î circlemap Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â  Â Â 18971 Carson Rd, Dinwiddie, VA, 23841 (804) 469-9363 admin@smyrna1897.org Â© 1897-2020 Smyrna Baptist Church. All Rights Reserved. church websites by clover"
    },
    {
      "url": "https://www.volusia.org/services/growth-and-resource-management/building-and-zoning/staff-contacts.stml",
      "text": "Staff Contacts Skip to main content Submit Search Button Search Website Doing Businesses Government News Divisions Visitors Help & Info Request a service Online Services Payments Agendas & Minutes About us Careers Contact us Go To Social Media Page With Link To Facebook Go To Social Media Page With Link To Twitter Go To Social Media Page With Link To YouTube Volusia County offices will be closed on Dec. 25 and Jan. 1, in observance of the holidays. Coastal Floods, Severe Rip Currents, and Significant Rainfall Expected. Read More . Request a service About us Careers Volunteer Search Search button Doing Business Business Incubator Demographics Doing business with the county Register with OpenGov Economic Development Licenses and permits Payments Watering restrictions Government Agendas and minutes Boards and Committees Board and Committee Meetings Business Impact Estimates Capital Project Schedule Census Redistricting Charter Review Commission Citizens Academy County Council County Council actions County Council Budget Resolutions County Council Events County Council's goals County Council meeting calendar County Council Meeting Information County Council Proclamations Watch Live Meetings County Manager County ordinances Financial Reports and Schedules Home Rule Charter Internal Auditor Meetings Calendar Meeting Closed Captioning Watch Archived Meetings Watch Live Meetings Organizational chart Permit and Code\r\nConcierge Service Public Records Requests Special Districts Title VI Policy and Plan Volusia County Elected Officials Roundtable News County Council meeting information Events and  Meetings Calendar News releases Newsletters Photo gallery Public Information Network Radio and Podcast RSS Calendar Feed RSS News Feed Social media feeds Watch Live Meetings Divisions Departments & Divisions Accounting Agriculture Center/UF Extension Airport (DBIA) Animal Services Aviation and Economic Resources Beach Safety Building and Code Administration Business Services Coastal Code Compliance Community Assistance Community Information Community Services Corrections Economic Development Elections Emergency Management Emergency Medical Administration Emergency Medical Services Emergency Services Engineering and Construction Environmental Management Facility Management Fleet Management Finance Department Fire Rescue Growth and Resource Management Health Department Human Resources Information Technology Library Services Management and Budget Medical Examiner Mosquito Control Ocean Center Parks, Recreation and Culture Planning and Development Property Appraiser Public Protection Public Works Purchasing Recovery and Resiliency Transform386 Resource Stewardship Road and Bridge Sheriff's Office Solid Waste and Recycling Tax Collector Traffic Engineering Treasury and Billing Veterans Services Votran Water and Utilities Visitors Art and culture Beaches Chambers of Commerce Cities and communities Convention Center Convention and visitors bureaus Daytona Beach International Airport DeBary Hall ECHOtourism Explore Volusia History and Fast Facts Libraries Lyonia Environmental Center Marine Science Center Parks and trails Sports Volusia Transportation Search Search Search Search Search Hamburger Menu Menu Building and Code Administration Code Compliance - Human Trafficking Ordinance Connect Live - Online Complaints - Online Permit Center Contractor Licensing Impact Fees Permit Center Permit Inspections Permit Plan Reviews Code Enforcement Board Contractor Licensing and Construction Appeals Board Applications and Forms Fee Schedules FAQs Staff Contacts Helpful Phone Numbers Nicholas Ventura Director and Chief Building Official nventura@volusia.org Kelli Matter Chief Plans Examiner KMatter@volusia.org Ramona Jones Administrative Assistant rjones@volusia.org Bryan Bradburn Chief Building Inspector bbradburn@volusia.org Elizabeth Diamond Permit Process Manager ediamond@volusia.org Chris Hutchison Code Compliance Manager chutchison@volusia.org Phone 386-626-6591 Staff Contacts Home | Departments and Divisions | Growth and Resource Management | Building and Code Administration | Staff Contacts Nicholas Ventura Director and Chief Building Official nventura@volusia.org Ramona Jones Administrative Assistant rjones@volusia.org Kelli Matter Chief Plans Examiner kmatter@volusia.org Elizabeth Diamond Permit Process Manager ediamond@volusia.org Chris Hutchison Code Enforcement Manager chutchison@volusia.org Bryan Bradburn Chief Building Inspector bbradburn@volusia.org How Can We Serve You? Contact Us If you don't find what you're looking for you can reach out to us through our contact form or call us at 386-736-2700 . Thank you! 123 W. Indiana Ave. DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All Contact Us Use our contact form Call: 386-736-2700 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All How Can We Serve You? If you need help, use our Contact Form or call us at (386) 736-2700 . All Rights Reserved, © 2025 Volusia County. All Rights Reserved. Web Design by DigitalUs on Solodev Select a language English French Spanish Portuguese Chinese Japanese Text size A A A Search Site Search button Search Site Search button We use cookies to provide and improve our services. By using our site, you consent to cookies. Accept Learn more"
    },
    {
      "url": "https://www.volusia.org/services/financial-and-administrative-services/human-resources/why-work.stml",
      "text": "Why Work for Us? Skip to main content Submit Search Button Search Website Doing Businesses Government News Divisions Visitors Help & Info Request a service Online Services Payments Agendas & Minutes About us Careers Contact us Go To Social Media Page With Link To Facebook Go To Social Media Page With Link To Twitter Go To Social Media Page With Link To YouTube Volusia County offices will be closed on Dec. 25 and Jan. 1, in observance of the holidays. Coastal Floods, Severe Rip Currents, and Significant Rainfall Expected. Read More . Request a service About us Careers Volunteer Search Search button Doing Business Business Incubator Demographics Doing business with the county Register with OpenGov Economic Development Licenses and permits Payments Watering restrictions Government Agendas and minutes Boards and Committees Board and Committee Meetings Business Impact Estimates Capital Project Schedule Census Redistricting Charter Review Commission Citizens Academy County Council County Council actions County Council Budget Resolutions County Council Events County Council's goals County Council meeting calendar County Council Meeting Information County Council Proclamations Watch Live Meetings County Manager County ordinances Financial Reports and Schedules Home Rule Charter Internal Auditor Meetings Calendar Meeting Closed Captioning Watch Archived Meetings Watch Live Meetings Organizational chart Permit and Code\r\nConcierge Service Public Records Requests Special Districts Title VI Policy and Plan Volusia County Elected Officials Roundtable News County Council meeting information Events and  Meetings Calendar News releases Newsletters Photo gallery Public Information Network Radio and Podcast RSS Calendar Feed RSS News Feed Social media feeds Watch Live Meetings Divisions Departments & Divisions Accounting Agriculture Center/UF Extension Airport (DBIA) Animal Services Aviation and Economic Resources Beach Safety Building and Code Administration Business Services Coastal Code Compliance Community Assistance Community Information Community Services Corrections Economic Development Elections Emergency Management Emergency Medical Administration Emergency Medical Services Emergency Services Engineering and Construction Environmental Management Facility Management Fleet Management Finance Department Fire Rescue Growth and Resource Management Health Department Human Resources Information Technology Library Services Management and Budget Medical Examiner Mosquito Control Ocean Center Parks, Recreation and Culture Planning and Development Property Appraiser Public Protection Public Works Purchasing Recovery and Resiliency Transform386 Resource Stewardship Road and Bridge Sheriff's Office Solid Waste and Recycling Tax Collector Traffic Engineering Treasury and Billing Veterans Services Votran Water and Utilities Visitors Art and culture Beaches Chambers of Commerce Cities and communities Convention Center Convention and visitors bureaus Daytona Beach International Airport DeBary Hall ECHOtourism Explore Volusia History and Fast Facts Libraries Lyonia Environmental Center Marine Science Center Parks and trails Sports Volusia Transportation Search Search Search Search Search Hamburger Menu Menu Benefits Career Opportunities/Job Descriptions Employee Self-Service (ESS) Internship Program Occupational Health Clinic Risk Management Title VI Policy and Plan Volunteer Opportunities Why Work for Us? Director Dana Paige dpaige@volusia.org Human Resources 125 W. New York Ave Suite 141 DeLand, FL 32720 Office hours 8 a.m. to 5 p.m. Email HumanResources@volusia.org West Volusia 386-736-5951 Daytona Beach 386-257-6029 New Smyrna Beach 386-423-3300 Fax 386-740-5149 Why Work for Us? Home | Departments and Divisions | Financial and Administrative Services | Human Resources | Why Work for Us? As a Volusia County employee, you’ll play a vital role in helping the community function efficiently and effectively. Our team of some 3,000 public service employees is involved in just about every part of our residents’ lives, from law enforcement to libraries, road repair, recreation, elections, environmental protection and much more. In addition to a great work environment, Volusia County offers a wide range of benefits to help you grow professionally and personally. Volusia County is also a great place to live and play, with terrific weather, 47 miles of beaches, and an abundance of parks, historic and cultural-based attractions, national sporting events, festivals and museums for our residents and visitors. Learn more by viewing our Why Work for Us brochure How Can We Serve You? Contact Us If you don't find what you're looking for you can reach out to us through our contact form or call us at 386-736-2700 . Thank you! 123 W. Indiana Ave. DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All Contact Us Use our contact form Call: 386-736-2700 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All How Can We Serve You? If you need help, use our Contact Form or call us at (386) 736-2700 . All Rights Reserved, © 2025 Volusia County. All Rights Reserved. Web Design by DigitalUs on Solodev Select a language English French Spanish Portuguese Chinese Japanese Text size A A A Search Site Search button Search Site Search button We use cookies to provide and improve our services. By using our site, you consent to cookies. Accept Learn more"
    },
    {
      "url": "https://www.volusia.org/services/public-works/coastal-division/coastal-parks/",
      "text": "Coastal parks Skip to main content Submit Search Button Search Website Doing Businesses Government News Divisions Visitors Help & Info Request a service Online Services Payments Agendas & Minutes About us Careers Contact us Go To Social Media Page With Link To Facebook Go To Social Media Page With Link To Twitter Go To Social Media Page With Link To YouTube Volusia County offices will be closed on Dec. 25 and Jan. 1, in observance of the holidays. Coastal Floods, Severe Rip Currents, and Significant Rainfall Expected. Read More . Request a service About us Careers Volunteer Search Search button Doing Business Business Incubator Demographics Doing business with the county Register with OpenGov Economic Development Licenses and permits Payments Watering restrictions Government Agendas and minutes Boards and Committees Board and Committee Meetings Business Impact Estimates Capital Project Schedule Census Redistricting Charter Review Commission Citizens Academy County Council County Council actions County Council Budget Resolutions County Council Events County Council's goals County Council meeting calendar County Council Meeting Information County Council Proclamations Watch Live Meetings County Manager County ordinances Financial Reports and Schedules Home Rule Charter Internal Auditor Meetings Calendar Meeting Closed Captioning Watch Archived Meetings Watch Live Meetings Organizational chart Permit and Code\r\nConcierge Service Public Records Requests Special Districts Title VI Policy and Plan Volusia County Elected Officials Roundtable News County Council meeting information Events and  Meetings Calendar News releases Newsletters Photo gallery Public Information Network Radio and Podcast RSS Calendar Feed RSS News Feed Social media feeds Watch Live Meetings Divisions Departments & Divisions Accounting Agriculture Center/UF Extension Airport (DBIA) Animal Services Aviation and Economic Resources Beach Safety Building and Code Administration Business Services Coastal Code Compliance Community Assistance Community Information Community Services Corrections Economic Development Elections Emergency Management Emergency Medical Administration Emergency Medical Services Emergency Services Engineering and Construction Environmental Management Facility Management Fleet Management Finance Department Fire Rescue Growth and Resource Management Health Department Human Resources Information Technology Library Services Management and Budget Medical Examiner Mosquito Control Ocean Center Parks, Recreation and Culture Planning and Development Property Appraiser Public Protection Public Works Purchasing Recovery and Resiliency Transform386 Resource Stewardship Road and Bridge Sheriff's Office Solid Waste and Recycling Tax Collector Traffic Engineering Treasury and Billing Veterans Services Votran Water and Utilities Visitors Art and culture Beaches Chambers of Commerce Cities and communities Convention Center Convention and visitors bureaus Daytona Beach International Airport DeBary Hall ECHOtourism Explore Volusia History and Fast Facts Libraries Lyonia Environmental Center Marine Science Center Parks and trails Sports Volusia Transportation Search Search Search Search Search Hamburger Menu Menu Artificial reef program Beach Access and Recovery Beach driving, parking and passes Beach Ramp Improvement Projects Capital Project Schedule Coastal Anti-Littering Initiatives Coastal parks Pavilion rental FAQs Reserving Pavilions Sand Placement Projects Coastal Division Director Jessica Fentress jfentress@volusia.org Questions and comments RecProCoastal@volusia.org Daytona Beach 386-248-8072 DeLand 386-736-2700, ext. 18072 New Smyrna Beach 386-423-3300, ext. 18072 Coastal parks Home | Departments and Divisions | Public Works | Coastal Division | Coastal parks Coastal Parks Storm Recovery Information The Coastal Division manages and maintains the following parks in east Volusia County. Beach Parks: Al Weeks Sr. North Shore Park Argosy Beach Park Cardinal Drive Beach Park Dahlia Avenue Park Edwin W. Peck Sr. Park Frank Rendon Park Hiles Blvd. Beach Park Mary McLeod Bethune Beach Park Tom Renick Park Sun & Surf Park Sun Splash Park Toronita Avenue Beach Park University Blvd. Beach Park Winterhaven Park Inlet Parks: Lighthouse Point Park Smyrna Dunes Park Effective January 1, 2025: All County-owned and operated off-beach parking lots require a $20 daily parking fee , separate from on-beach driving fees. The daily parking fee can be paid by following the directions on the signage in the parking lots. Volusia County residents can park for free if they register their vehicles online at parkvolusia.org or in-person at one of two ParkVolusia offices located at: 302 N. Causeway, New Smyrna Beach (Open: Monday – Friday, 10:00 am – 6:00 pm), call 386-217-0216 2422 S. Atlantic Avenue, Daytona Beach Shores (Open: Monday – Saturday, 8:30 am – 6:00 pm), call 386-217-0078 Nonresidents may purchase an annual off-beach parking pass for $100 online at parkvolusia.org or in-person at a ParkVolusia office. This pass allows nonresidents unlimited parking in County-owned and operated lots for 365 days from the date of purchase. The $20 daily parking fee and annual off-beach parking passes do not provide access to the Inlet Parks ( Lighthouse Point Park and Smyrna Dunes Park ). Daily passes for Inlet Parks can be purchased at the entrance booth. To purchase an Inlet Park annual pass visit parkvolusia.org or a ParkVolusia office location. How Can We Serve You? Contact Us If you don't find what you're looking for you can reach out to us through our contact form or call us at 386-736-2700 . Thank you! 123 W. Indiana Ave. DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All Contact Us Use our contact form Call: 386-736-2700 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All How Can We Serve You? If you need help, use our Contact Form or call us at (386) 736-2700 . All Rights Reserved, © 2025 Volusia County. All Rights Reserved. Web Design by DigitalUs on Solodev Select a language English French Spanish Portuguese Chinese Japanese Text size A A A Search Site Search button Search Site Search button We use cookies to provide and improve our services. By using our site, you consent to cookies. Accept Learn more"
    },
    {
      "url": "https://www.volusia.org/services/public-works/coastal-division/coastal-parks/cardinal-drive-beach-park.stml",
      "text": "Cardinal Drive Beach Park Skip to main content Submit Search Button Search Website Doing Businesses Government News Divisions Visitors Help & Info Request a service Online Services Payments Agendas & Minutes About us Careers Contact us Go To Social Media Page With Link To Facebook Go To Social Media Page With Link To Twitter Go To Social Media Page With Link To YouTube Volusia County offices will be closed on Dec. 25 and Jan. 1, in observance of the holidays. Coastal Floods, Severe Rip Currents, and Significant Rainfall Expected. Read More . Request a service About us Careers Volunteer Search Search button Doing Business Business Incubator Demographics Doing business with the county Register with OpenGov Economic Development Licenses and permits Payments Watering restrictions Government Agendas and minutes Boards and Committees Board and Committee Meetings Business Impact Estimates Capital Project Schedule Census Redistricting Charter Review Commission Citizens Academy County Council County Council actions County Council Budget Resolutions County Council Events County Council's goals County Council meeting calendar County Council Meeting Information County Council Proclamations Watch Live Meetings County Manager County ordinances Financial Reports and Schedules Home Rule Charter Internal Auditor Meetings Calendar Meeting Closed Captioning Watch Archived Meetings Watch Live Meetings Organizational chart Permit and Code\r\nConcierge Service Public Records Requests Special Districts Title VI Policy and Plan Volusia County Elected Officials Roundtable News County Council meeting information Events and  Meetings Calendar News releases Newsletters Photo gallery Public Information Network Radio and Podcast RSS Calendar Feed RSS News Feed Social media feeds Watch Live Meetings Divisions Departments & Divisions Accounting Agriculture Center/UF Extension Airport (DBIA) Animal Services Aviation and Economic Resources Beach Safety Building and Code Administration Business Services Coastal Code Compliance Community Assistance Community Information Community Services Corrections Economic Development Elections Emergency Management Emergency Medical Administration Emergency Medical Services Emergency Services Engineering and Construction Environmental Management Facility Management Fleet Management Finance Department Fire Rescue Growth and Resource Management Health Department Human Resources Information Technology Library Services Management and Budget Medical Examiner Mosquito Control Ocean Center Parks, Recreation and Culture Planning and Development Property Appraiser Public Protection Public Works Purchasing Recovery and Resiliency Transform386 Resource Stewardship Road and Bridge Sheriff's Office Solid Waste and Recycling Tax Collector Traffic Engineering Treasury and Billing Veterans Services Votran Water and Utilities Visitors Art and culture Beaches Chambers of Commerce Cities and communities Convention Center Convention and visitors bureaus Daytona Beach International Airport DeBary Hall ECHOtourism Explore Volusia History and Fast Facts Libraries Lyonia Environmental Center Marine Science Center Parks and trails Sports Volusia Transportation Search Search Search Search Search Hamburger Menu Menu Al Weeks Sr. North Shore Park Argosy Beach Park Cardinal Drive Beach Park Dahlia Avenue Park Edwin W. Peck Sr. Park Frank Rendon Park Hiles Blvd. Beach Park Lighthouse Point Park Mary McLeod Bethune Beach Park Smyrna Dunes Park Sun & Surf Park Sun Splash Park Tom Renick Park Toronita Avenue Beach Park University Blvd. Beach Park Winterhaven Park Coastal Division Director Jessica Fentress jfentress@volusia.org Questions and comments RecProCoastal@volusia.org Daytona Beach 386-248-8072 DeLand 386-736-2700, ext. 18072 New Smyrna Beach 386-423-3300, ext. 18072 Cardinal Drive Beach Park Home | Departments and Divisions | Public Works | Coastal Division | Coastal parks | Cardinal Drive Beach Park Coastal Parks Storm Recovery Information The Cardinal Drive Off-beach Parking Lot is located at the intersection of S. Atlantic Avenue and Cardinal Drive directly across from the Cardinal Drive Beach Ramp.  There are 6 handicapped and 118 regular public parking spaces and a signalized pedestrian crosswalk to the beach ramp at this lot. Location: 650 S. Atlantic Avenue, Ormond Beach, 1.25 miles south of Granada Blvd. Open daily: Parking is prohibited from 11 p.m. to 5 a.m. Effective January 1, 2025: All County-owned and operated off-beach parking lots require a $20 daily parking fee , separate from on-beach driving fees. The daily parking fee can be paid by following the directions on the signage in the parking lots. Volusia County residents can park for free if they register their vehicles online at parkvolusia.org or in-person at one of two ParkVolusia offices located at: 302 N. Causeway, New Smyrna Beach (Open: Monday – Friday, 10:00 am – 6:00 pm), call 386-217-0216 2422 S. Atlantic Avenue, Daytona Beach Shores (Open: Monday – Saturday, 8:30 am – 6:00 pm), call 386-217-0078 Nonresidents may purchase an annual off-beach parking pass for $100 online at parkvolusia.org or in-person at a ParkVolusia office. This pass allows nonresidents unlimited parking in County-owned and operated lots for 365 days from the date of purchase. The $20 daily parking fee and annual off-beach parking passes do not provide access to the Inlet Parks ( Lighthouse Point Park and Smyrna Dunes Park ). Daily passes for Inlet Parks can be purchased at the entrance booth. To purchase an Inlet Park annual pass visit parkvolusia.org or a ParkVolusia office location. All Coastal and Inlet Parks are open 365 days a year. How Can We Serve You? Contact Us If you don't find what you're looking for you can reach out to us through our contact form or call us at 386-736-2700 . Thank you! 123 W. Indiana Ave. DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All Contact Us Use our contact form Call: 386-736-2700 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All How Can We Serve You? If you need help, use our Contact Form or call us at (386) 736-2700 . All Rights Reserved, © 2025 Volusia County. All Rights Reserved. Web Design by DigitalUs on Solodev Select a language English French Spanish Portuguese Chinese Japanese Text size A A A Search Site Search button Search Site Search button We use cookies to provide and improve our services. By using our site, you consent to cookies. Accept Learn more"
    },
    {
      "url": "https://www.volusia.org/services/growth-and-resource-management/environmental-management/sustainability-and-resilience/protected-species/beach-mice.stml",
      "text": "Beach mice Skip to main content Submit Search Button Search Website Doing Businesses Government News Divisions Visitors Help & Info Request a service Online Services Payments Agendas & Minutes About us Careers Contact us Go To Social Media Page With Link To Facebook Go To Social Media Page With Link To Twitter Go To Social Media Page With Link To YouTube Volusia County offices will be closed on Dec. 25 and Jan. 1, in observance of the holidays. Coastal Floods, Severe Rip Currents, and Significant Rainfall Expected. Read More . Request a service About us Careers Volunteer Search Search button Doing Business Business Incubator Demographics Doing business with the county Register with OpenGov Economic Development Licenses and permits Payments Watering restrictions Government Agendas and minutes Boards and Committees Board and Committee Meetings Business Impact Estimates Capital Project Schedule Census Redistricting Charter Review Commission Citizens Academy County Council County Council actions County Council Budget Resolutions County Council Events County Council's goals County Council meeting calendar County Council Meeting Information County Council Proclamations Watch Live Meetings County Manager County ordinances Financial Reports and Schedules Home Rule Charter Internal Auditor Meetings Calendar Meeting Closed Captioning Watch Archived Meetings Watch Live Meetings Organizational chart Permit and Code\r\nConcierge Service Public Records Requests Special Districts Title VI Policy and Plan Volusia County Elected Officials Roundtable News County Council meeting information Events and  Meetings Calendar News releases Newsletters Photo gallery Public Information Network Radio and Podcast RSS Calendar Feed RSS News Feed Social media feeds Watch Live Meetings Divisions Departments & Divisions Accounting Agriculture Center/UF Extension Airport (DBIA) Animal Services Aviation and Economic Resources Beach Safety Building and Code Administration Business Services Coastal Code Compliance Community Assistance Community Information Community Services Corrections Economic Development Elections Emergency Management Emergency Medical Administration Emergency Medical Services Emergency Services Engineering and Construction Environmental Management Facility Management Fleet Management Finance Department Fire Rescue Growth and Resource Management Health Department Human Resources Information Technology Library Services Management and Budget Medical Examiner Mosquito Control Ocean Center Parks, Recreation and Culture Planning and Development Property Appraiser Public Protection Public Works Purchasing Recovery and Resiliency Transform386 Resource Stewardship Road and Bridge Sheriff's Office Solid Waste and Recycling Tax Collector Traffic Engineering Treasury and Billing Veterans Services Votran Water and Utilities Visitors Art and culture Beaches Chambers of Commerce Cities and communities Convention Center Convention and visitors bureaus Daytona Beach International Airport DeBary Hall ECHOtourism Explore Volusia History and Fast Facts Libraries Lyonia Environmental Center Marine Science Center Parks and trails Sports Volusia Transportation Search Search Search Search Search Hamburger Menu Menu Bald eagle Beach mice Florida manatee Florida scrub jay Osprey Gopher tortoises Sea turtles Jennifer Spain Pollution Control and Water Quality Activity Project Manager Jspain@volusia.org Ext. 12073 Phone: 386-736-5927 Denise Colflesh Admin Coordinator II dcolflesh@volusia.org Phone: 386-736-5927 Beach mice Home | Departments and Divisions | Growth and Resource Management | Environmental Management | Sustainability and Resilience | Protected species | Beach mice Photo by Donna Oddy The historic range of the southeastern beach mouse (Peromyscus polionotus niveiventris) has been significantly reduced by habitat loss, but Smyrna Dunes Park in New Smyrna Beach is home to one of the few remaining populations. This small, nocturnal mammal inhabits sea oat dominated sand dunes where they build small burrows for nesting, food storage and refuge. The major threats to beach mice are habitat loss and fragmentation due to human development, which are intensified by threats from hurricanes and predation by domestic cats. To learn more about beach mice, visit these sites: USFWS Profile website How Can We Serve You? Contact Us If you don't find what you're looking for you can reach out to us through our contact form or call us at 386-736-2700 . Thank you! 123 W. Indiana Ave. DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All Contact Us Use our contact form Call: 386-736-2700 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All How Can We Serve You? If you need help, use our Contact Form or call us at (386) 736-2700 . All Rights Reserved, © 2025 Volusia County. All Rights Reserved. Web Design by DigitalUs on Solodev Select a language English French Spanish Portuguese Chinese Japanese Text size A A A Search Site Search button Search Site Search button We use cookies to provide and improve our services. By using our site, you consent to cookies. Accept Learn more"
    },
    {
      "url": "https://www.volusia.org/about-us/volunteer.stml",
      "text": "Volunteer opportunities Skip to main content Submit Search Button Search Website Doing Businesses Government News Divisions Visitors Help & Info Request a service Online Services Payments Agendas & Minutes About us Careers Contact us Go To Social Media Page With Link To Facebook Go To Social Media Page With Link To Twitter Go To Social Media Page With Link To YouTube Volusia County offices will be closed on Dec. 25 and Jan. 1, in observance of the holidays. Coastal Floods, Severe Rip Currents, and Significant Rainfall Expected. Read More . Request a service About us Careers Volunteer Search Search button Doing Business Business Incubator Demographics Doing business with the county Register with OpenGov Economic Development Licenses and permits Payments Watering restrictions Government Agendas and minutes Boards and Committees Board and Committee Meetings Business Impact Estimates Capital Project Schedule Census Redistricting Charter Review Commission Citizens Academy County Council County Council actions County Council Budget Resolutions County Council Events County Council's goals County Council meeting calendar County Council Meeting Information County Council Proclamations Watch Live Meetings County Manager County ordinances Financial Reports and Schedules Home Rule Charter Internal Auditor Meetings Calendar Meeting Closed Captioning Watch Archived Meetings Watch Live Meetings Organizational chart Permit and Code\r\nConcierge Service Public Records Requests Special Districts Title VI Policy and Plan Volusia County Elected Officials Roundtable News County Council meeting information Events and  Meetings Calendar News releases Newsletters Photo gallery Public Information Network Radio and Podcast RSS Calendar Feed RSS News Feed Social media feeds Watch Live Meetings Divisions Departments & Divisions Accounting Agriculture Center/UF Extension Airport (DBIA) Animal Services Aviation and Economic Resources Beach Safety Building and Code Administration Business Services Coastal Code Compliance Community Assistance Community Information Community Services Corrections Economic Development Elections Emergency Management Emergency Medical Administration Emergency Medical Services Emergency Services Engineering and Construction Environmental Management Facility Management Fleet Management Finance Department Fire Rescue Growth and Resource Management Health Department Human Resources Information Technology Library Services Management and Budget Medical Examiner Mosquito Control Ocean Center Parks, Recreation and Culture Planning and Development Property Appraiser Public Protection Public Works Purchasing Recovery and Resiliency Transform386 Resource Stewardship Road and Bridge Sheriff's Office Solid Waste and Recycling Tax Collector Traffic Engineering Treasury and Billing Veterans Services Votran Water and Utilities Visitors Art and culture Beaches Chambers of Commerce Cities and communities Convention Center Convention and visitors bureaus Daytona Beach International Airport DeBary Hall ECHOtourism Explore Volusia History and Fast Facts Libraries Lyonia Environmental Center Marine Science Center Parks and trails Sports Volusia Transportation Search Search Search Search Search Hamburger Menu Menu Volunteer opportunities Home | About us | Volunteer opportunities Thousands of residents are making positive changes in our community by lending their time and talents through Volusia County Government’s volunteer programs. Volunteers rescue stranded sea turtles, clean river banks, help prevent crime, assist library staff, serve on advisory boards, and more. Below is a comprehensive list of volunteer opportunities. If you are interested in an opportunity that is currently filled, you may be able to sign up to become a Volusia County Government volunteer and then apply if it becomes open. Show all Advisory Boards Animal Services Daytona Beach International Airport Environmental Management Library Services Marine Science Center Parks, Recreation and Culture Sheriff’s Office Solid Waste Division University of Florida/Volusia County Extension Advisory Boards Volusia County Government Volusia County Government has 29 advisory boards composed of citizen volunteers who are appointed by the Volusia County Council. These boards serve an essential role in the policy-making process by providing the county council with in-depth assessments of issues related to their area of expertise. Qualified citizens are encouraged to apply to become a board member by completing an application available in the county manager's office or online . Animal Services Volunteering in the Clinic CURRENTLY, WE DO NOT HAVE ANY VOLUNTEER OPENINGS AT THIS TIME. PLEASE CHECK BACK. If an opening becomes available, volunteers will help ensure that our clinic continues to maintain the highest standards of care, compassion, cleanliness and efficiency. Volunteers wash instruments, wrap packs, help with laundry, clean common areas. For additional information call 386-248-1790. Sign up to become a Volusia County Government volunteer or log into your account. If the opportunity is currently open, you can then apply online: Volunteer Sign-Up and Online Application Daytona Beach International Airport Airport Ambassadors Friendly volunteers greet passengers, answer general questions, give out flight information, offer hotel and taxi information, and point out area sights. View more information . Environmental Management Adopt-a-Beach More than 150 volunteers, including families and organizations, commit to cleaning trash along their favorite mile of beach. A clean beach is pleasant for us and safer for wildlife! With support and supplies, groups clean their mile at least four times a year. View more information . Jay Watch Volunteers Volunteers monitor federally threatened scrub jays in Lyonia Preserve from June 15 through July 15. This Audubon Florida program trains volunteers to go to set points, call in scrub jays, and record information about them. Contact Christie Miller at 386-789-7207 ext. 21025 or clmiller@volusia.org . Lyonia Environmental Center Volunteers assist with educational programs and field trips, lead guided hikes through Lyonia Preserve, staff special events, help to create educational materials, and participate in outreach programs. For more information, visit www.lyoniapreserve.com . Manatee Watch Nearly 150 volunteers report manatee sightings around the county and take photos for identification, sketch scar patterns, and record behavior. The information gathered provides vital manatee data that helps protection efforts. View more information . Monofilament Recovery and Recycling This group, which has 60 volunteers, empties monofilament bins once a month. They clean the line; remove hooks, bobbers and sinkers; recycle the line; and record data. Monofilament fishing line poses numerous threats to the environment, wildlife and humans. View more information . River, beach and spring clean-ups More than 1,000 volunteers turn out each year to remove trash from the beach, DeLeon Springs, and the banks of the Halifax/Indian and St. Johns rivers. View more information . Scouting groups Eagle Scout candidates and scouting groups often volunteer to work on projects on Volusia County conservation lands.  Projects have included bench and picnic table construction, re-vegetation of wetland ponds, and cutting and marking of trails. Contact Christie Miller at 386-789-7207 ext. 21025 or clmiller@volusia.org . Volunteer Volusia Volusia County has many opportunities to get involved. Join our network of professionals and volunteers in the protection, restoration and appreciation of Volusia County's natural resources. View more information . Washback Watchers This team of more than 50 permitted volunteers is trained to find and rescue young sea turtles that wash ashore due to heavy winds and surf. Volunteers look for the sea turtles in seaweed deposits that have been washed onto shore. The program is a partnership among Volusia County’s Environmental Management Division, the Marine Science Center, Beach Patrol, Florida Fish and Wildlife Conservation Commission, Volusia Turtle Patrol, Volusia Sea Turtle Society, and Ecological Associates. View more information . Library Services Library Volunteers and Friends of the Library The library system could not offer the caliber of services currently provided to so many patrons without the hard work and dedication of volunteers. This is a great opportunity to meet new people and make friends. Many of the volunteers work in bookstores and periodic book sales, shelve returned materials, and make telephone calls to patrons who reserved items ready for pickup. Students can earn community service hours while gaining new skills and fulfilling school or scholarship requirements! Applicants must be age 16 or older and must be enrolled in high school or equivalent. All volunteers must pass a background check before volunteering. Volunteer opportunities are based on the needs of each branch. Contact your local branch for details at https://volusialibrary.org . Marine Science Center Education Department Volunteers in the education department play a vital role helping convey the Marine Science Center’s educational and conservation message. There are many opportunities including docents, special educational programming, summer camps, animal feeding programs, special events and administrative assistance. Visit https://www.marinesciencecenter.com/support/volunteer.stml for more information. Sea Turtle Hospital The Turtle Hospital cares for a high volume of sick or injured sea turtles, gopher tortoises and other reptiles. Due to the critical nature of these endangered species, volunteers are carefully trained to help with the maintenance of the animal exhibits and day-to-day operations necessary to make the hospital run smoothly. Visit https://www.marinesciencecenter.com/support/volunteer.stml for more information. Mary Keller Seabird Rehabilitation Center Volunteers in the Seabird Hospital help care for the wide variety of birds that enter the hospital for rehabilitation as well as resident birds on exhibit. Volunteers are trained to help maintain the exhibits and hospital. Visit https://www.marinesciencecenter.com/support/volunteer.stml for more information. Aquarium and Life Support Department Caring for the animals on exhibit and in rehabilitation is dependent on a number of important duties that trained volunteers assist with. These duties include testing water quality, food preparation, feeding animals, and aquarium and life support maintenance. Visit https://www.marinesciencecenter.com/support/volunteer.stml for more information. Guest Services Volunteering in the Guest Services Department offers an excellent opportunity to provide memorable guest interactions. Whether you are assisting customers with purchases or displaying merchandise, each MSC Guest Services team member is a representative of the County of Volusia. Visit https://www.marinesciencecenter.com/support/volunteer.stml for more information. Maintenance Department and Native Plant Gardener This department assists with facility work for the Marine Science Center across a wide variety of tasks related to general maintenance and gardening. Volunteering as a native plant gardener offer opportunities to gain experience in general gardening activities, plant identification, and disease prevention. Volunteers will work closely with the garden coordinator to cultivate ideal gardening locations and select appropriate plants. Visit https://www.marinesciencecenter.com/support/volunteer.stml for more information. Parks, Recreation and Culture Adopt-a-Park and Adopt-a Trail programs Volunteers help to beautify the county’s parks and trails and keep them litter-free. Community organizations, businesses, school groups and individuals over the age of 18 may volunteer to adopt a park or trail in their community. Call 386-736-5953. The selected park must maintained by Volusia County Parks, Recreation and Culture. Botanical Gardens of Volusia This volunteer group leases and maintains the Dunlawton Sugar Mill Gardens historic site in Port Orange and has created a beautifully landscaped garden. The park hosts many weddings and special events. More than 100 volunteers are dedicated to preserving the park’s historic nature, while enhancing its beauty with lush plants and landscaped areas. For more information, please email info@dunlawtonsugarmillgardens.org . DeBary Hall Docents Volunteers serve as tour guides at DeBary Hall Historic Site. View more information . Sheriff’s Office Citizen Observer Program (COP) and Citizen Volunteer Auxiliary Program More than 200 COP volunteers assist deputies in combating crime by patrolling neighborhoods and acting as extra eyes and ears for the Volusia Sheriff’s Office. In addition, the Citizens Volunteer Auxiliary Program provides professional, technical, clerical and computer assistance at locations throughout the agency. For more information on either program, email COPS@vcso.us or visit http://www.volusiasheriff.org/services/community-programs.stml Solid Waste Division Adopt-a-Road Groups volunteer to clean at least one mile or the entire length of a road’s right of way four times a year. The county has several active groups. View more information . University of Florida/Volusia County Extension Volusia County Master Gardener Program The Master Gardener Volunteer Program is a citizen-driven program that benefits UF/IFAS Extension and the residents of Volusia County. The program consists of trained volunteers who have an interest in gardening and giving back to their communities. Examples of programs found throughout the county include, Ask the Master Gardener Plant Clinics, the Master Gardener Speaker Series, plant sales, and informational booths throughout the county. Those who are interested in becoming a Master Gardener volunteer can contact the University of Florida/IFAS Extension Volusia County Urban Horticulture agent and Master Gardener Coordinator at 386-822-5778 . Florida LAKEWATCH Program Florida LAKEWATCH is a citizen volunteer lake monitoring program that facilitates \"hands-on\" citizen participation in the management of Florida lakes, estuaries, rivers, and springs through monthly monitoring activities. LAKEWATCH is now one of the largest lake monitoring programs in the nation with over 1800 trained citizens currently monitoring 525 lakes, 175 estuary stations, 125 river stations, 20 coastal dune lakes and 10 spring runs in 57 counties. Those who are interested can contact the University of Florida/IFAS Extension Volusia County Natural Resources agent at 386-822-5778 . Florida Money Master Mentors The Florida Master Money Mentor (FMMM) program is a coordinated referral network designed to match mentors trained in increasing financial knowledge and promoting positive financial practices with people needing these skills. Volunteers receive approximately 20 hours of intensive training in basic money management, strategies for dealing with financial problems, credit and debt management, savings, mentoring techniques, and connecting to community resources. Following the training, each volunteer provides financial mentoring for at least 50 hours within one year of completion of training. Anyone is welcome to apply to become a mentor and no previous financial education is needed. Those who are interested in becoming a Volusia County Money Master Mentor can contact the University of Florida/IFAS Extension Volusia County Family Consumer Science agent at 386-822-5778 . Volusia County 4-H Program Volusia County 4-H relies on dedicated volunteers to promote the 4-H mission to help youth gain the knowledge and life skills they need to be productive, responsible citizens. Your time as a volunteer will provide these youth the safe environment they need to pursue whatever interests, causes, and/or leadership roles that are most important to them. Volunteers can lead 4-H clubs, judge events, and assist with leadership skills. Those who are interested in becoming a Volusia County 4-H volunteer can contact the University of Florida/IFAS Extension Volusia County 4-H agent at 386-822-5778 . How Can We Serve You? Contact Us If you don't find what you're looking for you can reach out to us through our contact form or call us at 386-736-2700 . Thank you! 123 W. Indiana Ave. DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All Contact Us Use our contact form Call: 386-736-2700 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All How Can We Serve You? If you need help, use our Contact Form or call us at (386) 736-2700 . All Rights Reserved, © 2025 Volusia County. All Rights Reserved. Web Design by DigitalUs on Solodev Select a language English French Spanish Portuguese Chinese Japanese Text size A A A Search Site Search button Search Site Search button We use cookies to provide and improve our services. By using our site, you consent to cookies. Accept Learn more"
    },
    {
      "url": "https://www.volusia.org/services/public-works/coastal-division/coastal-parks/sun-splash-park.stml",
      "text": "Sun Splash Park Skip to main content Submit Search Button Search Website Doing Businesses Government News Divisions Visitors Help & Info Request a service Online Services Payments Agendas & Minutes About us Careers Contact us Go To Social Media Page With Link To Facebook Go To Social Media Page With Link To Twitter Go To Social Media Page With Link To YouTube Volusia County offices will be closed on Dec. 25 and Jan. 1, in observance of the holidays. Coastal Floods, Severe Rip Currents, and Significant Rainfall Expected. Read More . Request a service About us Careers Volunteer Search Search button Doing Business Business Incubator Demographics Doing business with the county Register with OpenGov Economic Development Licenses and permits Payments Watering restrictions Government Agendas and minutes Boards and Committees Board and Committee Meetings Business Impact Estimates Capital Project Schedule Census Redistricting Charter Review Commission Citizens Academy County Council County Council actions County Council Budget Resolutions County Council Events County Council's goals County Council meeting calendar County Council Meeting Information County Council Proclamations Watch Live Meetings County Manager County ordinances Financial Reports and Schedules Home Rule Charter Internal Auditor Meetings Calendar Meeting Closed Captioning Watch Archived Meetings Watch Live Meetings Organizational chart Permit and Code\r\nConcierge Service Public Records Requests Special Districts Title VI Policy and Plan Volusia County Elected Officials Roundtable News County Council meeting information Events and  Meetings Calendar News releases Newsletters Photo gallery Public Information Network Radio and Podcast RSS Calendar Feed RSS News Feed Social media feeds Watch Live Meetings Divisions Departments & Divisions Accounting Agriculture Center/UF Extension Airport (DBIA) Animal Services Aviation and Economic Resources Beach Safety Building and Code Administration Business Services Coastal Code Compliance Community Assistance Community Information Community Services Corrections Economic Development Elections Emergency Management Emergency Medical Administration Emergency Medical Services Emergency Services Engineering and Construction Environmental Management Facility Management Fleet Management Finance Department Fire Rescue Growth and Resource Management Health Department Human Resources Information Technology Library Services Management and Budget Medical Examiner Mosquito Control Ocean Center Parks, Recreation and Culture Planning and Development Property Appraiser Public Protection Public Works Purchasing Recovery and Resiliency Transform386 Resource Stewardship Road and Bridge Sheriff's Office Solid Waste and Recycling Tax Collector Traffic Engineering Treasury and Billing Veterans Services Votran Water and Utilities Visitors Art and culture Beaches Chambers of Commerce Cities and communities Convention Center Convention and visitors bureaus Daytona Beach International Airport DeBary Hall ECHOtourism Explore Volusia History and Fast Facts Libraries Lyonia Environmental Center Marine Science Center Parks and trails Sports Volusia Transportation Search Search Search Search Search Hamburger Menu Menu Al Weeks Sr. North Shore Park Argosy Beach Park Cardinal Drive Beach Park Dahlia Avenue Park Edwin W. Peck Sr. Park Frank Rendon Park Hiles Blvd. Beach Park Lighthouse Point Park Mary McLeod Bethune Beach Park Smyrna Dunes Park Sun & Surf Park Sun Splash Park Tom Renick Park Toronita Avenue Beach Park University Blvd. Beach Park Winterhaven Park Coastal Division Director Jessica Fentress jfentress@volusia.org Questions and comments RecProCoastal@volusia.org Daytona Beach 386-248-8072 DeLand 386-736-2700, ext. 18072 New Smyrna Beach 386-423-3300, ext. 18072 Sun Splash Park Home | Departments and Divisions | Public Works | Coastal Division | Coastal parks | Sun Splash Park Coastal Parks Storm Recovery Information Sunsplash Park is three blocks south of the intersection of International Speedway Boulevard and South Atlantic Avenue in Daytona Beach. This popular handicapped accessible park has 162 parking spaces, restrooms, showers, a freshwater splash pad, picnic pavilions, playgrounds and over 600 feet of direct beachfront access. The Volusia County Lifeguard Headquarters is also located at this park. Reserving pavilions Pavilion map Location: 611 S. Atlantic Avenue, Daytona Beach. Open daily: Restroom facilities are available within one hour of sunrise and within one hour of sunset. Parking is restricted from 11 p.m. to 5 a.m. Splash Pad Hours: 8 a.m. to 7 p.m. THE SPLASH PAD IS OPEN!! Effective January 1, 2025: All County-owned and operated off-beach parking lots require a $20 daily parking fee , separate from on-beach driving fees. The daily parking fee can be paid by following the directions on the signage in the parking lots. Volusia County residents can park for free if they register their vehicles online at parkvolusia.org or in-person at one of two ParkVolusia offices located at: 302 North Causeway, New Smyrna Beach (10 a.m. to 6 p.m. Monday through Friday) 386-217-0216 2422 S. Atlantic Ave., Daytona Beach Shores (8:30 a.m. to 6 p.m. Monday through Saturday) 386-217-0078 Nonresidents may purchase an annual off-beach parking pass for $100 online at parkvolusia.org or in-person at a ParkVolusia office. This pass allows nonresidents unlimited parking in County-owned and operated lots for 365 days from the date of purchase. The $20 daily parking fee and annual off-beach parking passes do not provide access to the Inlet Parks ( Lighthouse Point Park and Smyrna Dunes Park ). Daily passes for Inlet Parks can be purchased at the entrance booth. To purchase an Inlet Park annual pass visit parkvolusia.org or a ParkVolusia office location. All Coastal and Inlet Parks are open 365 days a year. How Can We Serve You? Contact Us If you don't find what you're looking for you can reach out to us through our contact form or call us at 386-736-2700 . Thank you! 123 W. Indiana Ave. DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All Contact Us Use our contact form Call: 386-736-2700 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All How Can We Serve You? If you need help, use our Contact Form or call us at (386) 736-2700 . All Rights Reserved, © 2025 Volusia County. All Rights Reserved. Web Design by DigitalUs on Solodev Select a language English French Spanish Portuguese Chinese Japanese Text size A A A Search Site Search button Search Site Search button We use cookies to provide and improve our services. By using our site, you consent to cookies. Accept Learn more"
    },
    {
      "url": "https://idahodunesrv.com/contact-us/",
      "text": "Contact Us - Idaho Dunes RV Skip to content Direct access to the St. Anthony Idaho Sand Dunes Location Email Us 208-624-3275 Direct access to the St. Anthony Idaho Sand Dunes Location Email Us 208-624-3275 Reservations Reservations Campground Map Local Attractions Galleries Contact Us FAQ Meet the Team Rules Jobs Fallen Duner VP Racing Fuel Get in touch with us Want to get in touch? We’d love to hear from you. Here’s how you can reach us… Contact Information Idaho Dunes RV 1695 E 500 Rd N St Anthony, ID 83445 Tel: 208-624-3275 Email: reservations@idahodunesrv.com Learn More! Google Maps Frequently asked Questions CampGround Rules Meet our Team Have a question or comment? Please fill out the form below and a knowledgeable Idaho Dunes RV representative will reply to you shortly. Your Name (required) Your Email (required) Your Phone (optional) I am interested in learning more about (optional): Idaho Dunes RV General Campsite Info On Site Amenities Campground Rules Cancellation Policies BLM OHV Rules and Regulations Sand Dune Insight and Tips Seasonal Weather Info Local Attractions On Site Helicopter Tours UTV Trail Tours Nearby River Floats White Water Rafting Day Trips to Yellowstone National Park Day Trips to Jackson WY Lakeside Lodge and Resort Other Your Message (optional) Frequently asked Questions How do I get to Idaho Dunes RV Park? Directions from the South (Idaho Falls) Take SR20 heading East toward Rigby/Yellowstone (approx. 29 miles) Take exit 337 (North Rexburg exit) Turn left on N. Salem Rd and travel 7.5 miles Turn left at 500 North (Red Flashing 4 Way) and travel 1/4 mile Follow signs for Egin Lakes access At fork stay right on 500N (go over the RR tracks) and travel 1 mile Idaho Dunes RV Park entrance will be on the right. Store/Office is at end of dirt road on the left. Directions from the North (Yellowstone) Take SR20 heading West toward Rexburg Take Exit 337 (North Rexburg exit) Turn right at N Salem Rd and travel 7.5 miles Turn left at 500 North (Red Flashing 4 Way) and travel 1/4 mile Follow signs for Egin Lakes access At fork stay right on 500N (go over the RR tracks) and travel 1 mile Idaho Dunes RV Park entrance will be on the right. Store/Office is at end of dirt road on the left. How many campsites are there and how are they configured? We have 24 “Standard Full Hook-Up” sites (Water, 50-amp power and sewer, sites 1-24) Pull through. 20-22’ wide X 70’ long. Sites include a concrete patio. Sites 2/3, 4/5, 6/7, 8/9, 10/11, 14/15, 16/17, 18/19, 20/21, 22/23 are configured to share a patio with the neighboring site. We have 32 “Standard Partial Hook-Up” sites (Water and 50-amp power, sites 25-56) Pull through. 25-35’ wide X 70’ long. These sites are configured traditionally at a 45-degree angle all facing the same direction. We have 3 “Premium Partial Hook-Up” sites (Water and 50-amp power, sites 57-59) Head in. 26’ wide X 65’ long. These sites are configured traditionally all facing the same direction. We have 10 “Premium Full Hook-Up” sites (Water, 50-amp power and sewer, sites 60-69) Head in. 26’ wide X 65’ long. These sites are configured traditionally all facing the same direction. We have 25 acres of dry camping (no hook-ups ) Dry camping is always a first come first serve basis. How far is it to St. Anthony Sand Dunes Recreation Area? STATE CITY DISTANCE TIME ID Idaho Falls 40 0.5 ID Pocatello 90 1.2 UT Salt Lake City 250 3.5 MT Helena 275 3.9 MT Billings 300 4.2 ID Boise 325 4.6 WY Casper 350 5.0 WA Spokane 500 7.1 UT St. George 550 7.8 CO Denver 600 8.5 SD Rapid City 600 8.5 NV Las Vegas 675 9.6 ND Bismark 725 10.3 OR Portland 750 10.7 WA Seattle 800 11.4 CA San Francisco 875 12.5 CA Riverside 900 12.8 AZ Phoenix 900 12.8 CA Los Angeles 940 13.5 CA San Diego 1000 14.2 How big are the dunes compared to Glamis? The St. Anthony Sand Dunes cover over 10,000 acres with massive contiguous sand dunes. Osborne Overlook to China Wall in Glamis is approximately 13 miles, in direct comparison Idaho Dunes RV Park to the end of the biggest dunes near “Devils Dune” is approximately 12 miles. The infamous Choke Cherry Hill is steeper than China Wall and a significantly more difficult climb. How close is the campground to the dunes? Immediate access from your campsite to the dunes. Ride your ATV directly from the camp. IDRV is the nearest private campground to the big dunes. What amenities can be found at Idaho Dunes RV Park? Fully Stocked General Store Showers Toilets 69 Hook Up Spots 25 Acre Dry Camping Kids Playground Direct Dune Access Picnic Area On Site Seasonal RV Storage What else can I do while visiting Idaho? Yellowstone National Park Jackson Hole, WY Grand Teton National Park Yellowstone Bear World Fly Fishing Mountain Biking Photography Wildlife Viewing River Rafting Is it possible to make reservations for tent and dry camping on-line? Dry camping sites are always on a first come first serve basis. No reservations are required to camp in this area. Can we reserve a specific dry camping area? Dry camping is on a first come first serve basis and no reservations for a specific area can be provided. We're coming in with a large group and want to be together, can we reserve a group area ahead of time? At this time, we have not assigned specific group areas for camping. Groups for dry camping will on a first come first serve basis only. Is there a dump station at the park and is there a fee to dump? Use of our dump station is reserved for partial hook-up guests only. Our septic system has limited capacity and will not handle high volume dry camping dump volumes. We do not allow non-patrons use of our dump station. What is your reservation policy? Deposit policy: Reservations must be paid in full at time of booking without exception. Cancellation policy: There are no refunds under any circumstance. There are no adjustments for late arrivals or early departures. We will accommodate a one-time rescheduling of your reservation if notified at least 7 days prior to your reservation arrival date. Check-In Upon Arrival: Please check in at the Idaho Dunes RV Store immediately upon arrival. All registered guests will be issued a registration permit and receipt to affix to the window of your vehicle. Permits must be affixed in front windshield in clear view. Late Arrivals: Late arrivals must check in at the Idaho Dunes RV Store before 10:00 AM. Failure to self-register will result in a 20% registration surcharge. How late can I get to Idaho Dunes RV Park on my day of arrival? In consideration of our other campers please arrive prior to 10pm. If this is not possible please call ahead and provide advanced notice of late arrival. What time is check-out? Check out time is 11:00 AM What if I want to spend more time at the park the day we check-out? You are more than welcome to enjoy the dunes the day of check-out. Please see the manager at least one day prior to your check out date for arrangements. Are there shower facilities? The park has four (4) private showers/restrooms available 24 hours a day. There is a nominal fee for taking showers. Showers take quarters only. Showers are for Idaho Dunes RV Park guests only. Can I rent camping trailers on-site? We always recommend https://tetonar.com/rv-rentals/ for trailer rentals. Does the park allow pets? Pets are welcome. Please keep pets on a leash no longer than 10ft. Please clean-up after your pet. Is there a play area for the kids? Idaho Dunes RV has the largest three-story playground in the area for children under 10. All children must be supervised by an adult. Seating for adults is available in the immediate area to watch the kids play. Do you still have the kids track? Idaho Dunes RV does not have a designated area for youth riders on the property at this time. Please take the kids to the dune area to ride ATV’s. How can I stay up to date with what is going on at Idaho Dunes RV Park? Please visit www.idahodunesrv.com for general campground info. For the most up to the minute information on events and activities please visit our Facebook Fan Page at www.facebook.com/idahodunesrv Do you sell food on-site? Idaho Dunes RV Park may have outside food vendors on-site during special events and some holiday periods. Dates and availability will vary. Please contact us at 208-624-3275 for more information. Can we have camp fires in the park? Camp fires are allowed in the steel barrels provided. For your safety please do not dig below ground fire pits anywhere on the property. Smudge Pots are strictly prohibited and must not be used anywhere on the property. If we plan to dry camp will it be possible to fill up with water when we arrive? Water is available to all guests staying at the RV Park. Do you sell fuel on-site? VP Racing 110 Octane Fuel is sold on-site. 5-gallon pails and 54-gallon drums are typically in stock in limited quantities. Pre-ordering of VP 110 fuel is available with 20 days advance notice at https://idahodunesrv.com/vp-racing-fuel-pre-order/ Are there any Hotels/Motels nearby? Hotel accommodations can be found in both Rexburg, ID and St. Anthony, ID. Both cities are about 10 minutes away. Are picnic tables available at each camp site? Idaho Dunes RV Park does not offer picnic tables at each site. We recommend that guests bring their own tables and chairs as required. Can I place a tent on a full or partial hook-up camp site? A tent may occupy a full or partial hook-up camp site but must pay the specific rate for the type of site being occupied. Additional tents may be added for the nightly rate for tent camping. Tents must not extend beyond the physical site, infringe on the adjoining camp sites, or hinder interior roads. A maximum of 2 additional tents per hook-up site will be allowed. Does the campground offer FREE High Speed Internet YES. Idaho Dunes RV has a FREE Wi-Fi Hot Spot located near the general store with excellent connection speeds and coverage. We have installed a dedicated data line to support guests need for internet connectivity while at the campground. Our Wi-Fi is not accessible to the entire 50 acre campground but full-hook up sites are within close enough proximity to get excellent connectivity. Can I run a generator in camp? Generators can be run from 7:00 AM to Midnight in our dry camping area only. All generators must be turned off by 12:00 AM. Should you have needs that require power 24 hours per day please book an appropriate hook-up camping site. CAMPGROUND RULES Welcome to Idaho Dunes RV! Please make your party aware of the following rules and policies: Any violation of these rules may be cause for your immediate removal from the facility without a refund. No riding in camp except to access the dunes. Speed limit in camp is 5 MPH. No Music after 10:00 PM (Absolutely No Noise After Midnight Including Generators) No fireworks or smudge pots on property. All pets must be on a leash and cleaned up after. Dripping or draining of grey or black water will result in a $100 fine. Please check in at office prior to setting up camp. If arriving after hours please check in promptly at 9:00 AM the following day. Maximum of 10 people allowed per site. Limit of 1 “Extra Vehicle” allowed per site. Only 1 “Camping Unit” allowed per site. Extra vehicles staying overnight in sites will be allowed at an additional cost of $10.00 per night. All vehicles and equipment must fit within the site and not overflow onto roadways or into neighboring camps. All vehicles entering the Idaho Dunes RV gate must be registered and properly displaying registration tags. This includes RV’s, cars, and trucks. Lost, missing or stolen registration documentation will not be reissued. Individual named on the site is responsible for all parties. Do not move or alter orange safety cones in any way. Campfires are allowed in above ground burn barrels only. Absolutely no digging or below ground firepits on property. Please make children aware that power, water and communication lines are running below ground. The Idaho Dunes RV dump station is primarily reserved for partial hook-up site guests. If our septic system does have capacity, dry camping guests may pay a $10.00 dump fee to utilize the dump. Please check in with office before dumping. Dumpsters are provided for household garbage only. Any child 16 and under must be directly supervised by an adult at all times. Playground area is for children 10 and under. Children must be supervised by an adult at all times. No parking of vehicles on concrete patios in full hook-up sites. Check-In is after 1:00 PM, Check-Out is before 11:00 AM. Do not trespass on neighboring farms or properties. Please drive carefully. You are personally responsible for any damage to Idaho Dunes RV or other guests property. Idaho Dunes RV reserves the right to refuse service to anyone. Please be aware that you are on private property. We simply ask that you treat our facility as if we were all camping at your home. Ride safe and have a blast at Idaho Dunes RV! Meet the Team Mike McGroarty Owner Mike McGroarty has been an off-road, aviation, and outdoor enthusiast his entire life.  At the age of 15, Mike earned the rank of Eagle Scout in the Boy Scouts of America and by that time had over 300 nights of wilderness camping experience.  His love for the outdoors turned into a passion for off-roading as soon as his first job earned him enough income to purchase his first sport ATV.  This first ATV started an addiction for rock crawling, trail riding and sand duning that still occupies 100% of Mike’s interest to this day. Garrett McGroarty Manager Garrett McGroarty was born into the “Idaho Dunes Way of Life”.  At 3 years old, Garrett started his off-road passion on a Kawasaki KFX 50.  Garrett has logged more trail miles between Idaho Dunes RV and West Yellowstone than anyone in the area.  At a young age, Garrett developed a passion for helicopters and aviation.  Before graduating from high school, Garrett earned both his private helicopter license (PPL-H) and commercial helicopter license (CPL-H).  With advanced pilot training from the best instructors in the industry at Helisafe in Southern California, Garrett has mastered the Robinson R44 Raven II helicopters flight systems and emergency procedures.  If you have questions about the campground, dunes, local area, trail rides, or helicopter tours Garrett is your best bet to get the answers you are looking for. Colter Canon Chief Security Officer Colter Canon is Idaho Dunes RV’s Chief Security Officer. By day Colter serves Fremont County Idaho as a Sherriff’s Deputy as well as South Fremont Highschool as the School Resource Officer (SRO). Colter and his team go out of their way to ensure Idaho Dunes RV’s guests experience a safe but enjoyable atmosphere. “We understand everyone in camp is on vacation and wants to have a great time and let their hair down. We also understand that some people visiting the campground like to sleep. Its our job to make sure everyone can have the experience they are looking for within reason…” Colter Canon Google Contact Instagram Facebook Camping at St Anthony Dunes Phone: 208-624-3275 Email: reservations@idahodunesrv.com Location: 1695 E 500 Rd N, St Anthony, ID 83445 Copyright 2025 © Idaho Dunes Site Built by Moranton Media || Terms and Conditions || Privacy Policy || Reservations Campground Map Local Attractions Galleries Contact Us FAQ Meet the Team Rules Jobs Fallen Duner VP Racing Fuel Location Email Us 208-624-3275 Login Username or email address * Required Password * Required Remember me Log in Lost your password? This site uses cookies to offer you a better browsing experience. By browsing this website, you agree to our use of cookies. More info Accept"
    },
    {
      "url": "https://www.volusia.org/services/public-works/coastal-division/coastal-parks/smyrna-dunes-park.stml",
      "text": "Smyrna Dunes Park Skip to main content Submit Search Button Search Website Doing Businesses Government News Divisions Visitors Help & Info Request a service Online Services Payments Agendas & Minutes About us Careers Contact us Go To Social Media Page With Link To Facebook Go To Social Media Page With Link To Twitter Go To Social Media Page With Link To YouTube Volusia County offices will be closed on Dec. 25 and Jan. 1, in observance of the holidays. Coastal Floods, Severe Rip Currents, and Significant Rainfall Expected. Read More . Request a service About us Careers Volunteer Search Search button Doing Business Business Incubator Demographics Doing business with the county Register with OpenGov Economic Development Licenses and permits Payments Watering restrictions Government Agendas and minutes Boards and Committees Board and Committee Meetings Business Impact Estimates Capital Project Schedule Census Redistricting Charter Review Commission Citizens Academy County Council County Council actions County Council Budget Resolutions County Council Events County Council's goals County Council meeting calendar County Council Meeting Information County Council Proclamations Watch Live Meetings County Manager County ordinances Financial Reports and Schedules Home Rule Charter Internal Auditor Meetings Calendar Meeting Closed Captioning Watch Archived Meetings Watch Live Meetings Organizational chart Permit and Code\r\nConcierge Service Public Records Requests Special Districts Title VI Policy and Plan Volusia County Elected Officials Roundtable News County Council meeting information Events and  Meetings Calendar News releases Newsletters Photo gallery Public Information Network Radio and Podcast RSS Calendar Feed RSS News Feed Social media feeds Watch Live Meetings Divisions Departments & Divisions Accounting Agriculture Center/UF Extension Airport (DBIA) Animal Services Aviation and Economic Resources Beach Safety Building and Code Administration Business Services Coastal Code Compliance Community Assistance Community Information Community Services Corrections Economic Development Elections Emergency Management Emergency Medical Administration Emergency Medical Services Emergency Services Engineering and Construction Environmental Management Facility Management Fleet Management Finance Department Fire Rescue Growth and Resource Management Health Department Human Resources Information Technology Library Services Management and Budget Medical Examiner Mosquito Control Ocean Center Parks, Recreation and Culture Planning and Development Property Appraiser Public Protection Public Works Purchasing Recovery and Resiliency Transform386 Resource Stewardship Road and Bridge Sheriff's Office Solid Waste and Recycling Tax Collector Traffic Engineering Treasury and Billing Veterans Services Votran Water and Utilities Visitors Art and culture Beaches Chambers of Commerce Cities and communities Convention Center Convention and visitors bureaus Daytona Beach International Airport DeBary Hall ECHOtourism Explore Volusia History and Fast Facts Libraries Lyonia Environmental Center Marine Science Center Parks and trails Sports Volusia Transportation Search Search Search Search Search Hamburger Menu Menu Al Weeks Sr. North Shore Park Argosy Beach Park Cardinal Drive Beach Park Dahlia Avenue Park Edwin W. Peck Sr. Park Frank Rendon Park Hiles Blvd. Beach Park Lighthouse Point Park Mary McLeod Bethune Beach Park Smyrna Dunes Park Sun & Surf Park Sun Splash Park Tom Renick Park Toronita Avenue Beach Park University Blvd. Beach Park Winterhaven Park Coastal Division Director Jessica Fentress jfentress@volusia.org Questions and comments RecProCoastal@volusia.org Daytona Beach 386-248-8072 DeLand 386-736-2700, ext. 18072 New Smyrna Beach 386-423-3300, ext. 18072 Smyrna Dunes Park Home | Departments and Divisions | Public Works | Coastal Division | Coastal parks | Smyrna Dunes Park Coastal Parks Storm Recovery Information SMYRNA DUNES PARK Location: 2995 N. Peninsula Ave., New Smyrna Beach Open daily: February 10 through Daylight Saving Time start:  6 a.m. to 7:30 p.m. Start of Daylight Savings Time through September 30:  6 a.m. to 9 p.m. October 1 through End of Daylight Saving Time November 1:  6 a.m. to 7:30 p.m. End of Daylight Saving Time through February 9:  6 a.m. to 6 p.m. Admission $10 per vehicle $20 Inlet Park Pass Free for Handicapped and Disabled Veterans Vehicles Additional discounts available for Veterans, surviving spouses or children of first responders and Veterans whom died in the line of duty Effective October 1, 2024, the annual pass has transitioned away from windshield stickers to now registering a license plate.  Any current annual passes sold prior to October 1, 2024, are still valid until their expiration date. Annual Passes are no longer sold at the park entrances. The $20 Inlet Parks Annual Pass may be purchased online at parkvolusia.org or in person at one of two Park Volusia offices located at: 302 N. Causeway, New Smyrna Beach (10 a.m. to 6 p.m. Monday through Friday) 386-217-0216 2422 S. Atlantic Ave., Daytona Beach Shores (8:30 a.m. to 6 p.m. Monday through Saturday) 386-217-0078 The Coastal Division approves unsolicited/organized park activities through a Special Event Permit. Alcohol and Trailers are not permitted in the park. The Coastal Division approves unsolicited/organized park activities through a Special Event Permit . There is a $25 application fee, and the form can be submitted via email to RecProCoastal@volusia.org . Smyrna Dunes Park is a 184-acre inlet park along the southern shoreline of Ponce de Leon Inlet. The park has over 2 miles of wide, elevated, handicapped-accessible boardwalk capped with recycled lumber that is both comfortable and durable. Multiple scenic overlooks allow breathtaking views of the Atlantic Ocean, the Indian River and Ponce de Leon Inlet. Special park features include a 300-foot handicapped accessible fishing pier and dog-friendly swimming beach areas located along the park river shore. Restrooms and picnic pavilions are also available at this very popular coastal park. The park property is jointly owned by the U.S. Bureau of Land Management and the Florida Department of Environmental Protection. Volusia County manages the park under leases it maintains with these federal and state agencies. Fishing license requirements and salt-water fishing regulation information is available at these links: https://myfwc.com/license/recreational/do-i-need-one/ https://myfwc.com/fishing/saltwater/recreational/ Park pavilions are available on a first-come, first-served basis and cannot be reserved. All Coastal and Inlet Parks are open 365 days a year. How Can We Serve You? Contact Us If you don't find what you're looking for you can reach out to us through our contact form or call us at 386-736-2700 . Thank you! 123 W. Indiana Ave. DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All Contact Us Use our contact form Call: 386-736-2700 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All How Can We Serve You? If you need help, use our Contact Form or call us at (386) 736-2700 . All Rights Reserved, © 2025 Volusia County. All Rights Reserved. Web Design by DigitalUs on Solodev Select a language English French Spanish Portuguese Chinese Japanese Text size A A A Search Site Search button Search Site Search button We use cookies to provide and improve our services. By using our site, you consent to cookies. Accept Learn more"
    },
    {
      "url": "https://www.volusia.org/services/public-protection/beach-safety/beach-driving-and-parking.stml",
      "text": "Beach driving and parking Skip to main content Submit Search Button Search Website Doing Businesses Government News Divisions Visitors Help & Info Request a service Online Services Payments Agendas & Minutes About us Careers Contact us Go To Social Media Page With Link To Facebook Go To Social Media Page With Link To Twitter Go To Social Media Page With Link To YouTube Volusia County offices will be closed on Dec. 25 and Jan. 1, in observance of the holidays. Coastal Floods, Severe Rip Currents, and Significant Rainfall Expected. Read More . Request a service About us Careers Volunteer Search Search button Doing Business Business Incubator Demographics Doing business with the county Register with OpenGov Economic Development Licenses and permits Payments Watering restrictions Government Agendas and minutes Boards and Committees Board and Committee Meetings Business Impact Estimates Capital Project Schedule Census Redistricting Charter Review Commission Citizens Academy County Council County Council actions County Council Budget Resolutions County Council Events County Council's goals County Council meeting calendar County Council Meeting Information County Council Proclamations Watch Live Meetings County Manager County ordinances Financial Reports and Schedules Home Rule Charter Internal Auditor Meetings Calendar Meeting Closed Captioning Watch Archived Meetings Watch Live Meetings Organizational chart Permit and Code\r\nConcierge Service Public Records Requests Special Districts Title VI Policy and Plan Volusia County Elected Officials Roundtable News County Council meeting information Events and  Meetings Calendar News releases Newsletters Photo gallery Public Information Network Radio and Podcast RSS Calendar Feed RSS News Feed Social media feeds Watch Live Meetings Divisions Departments & Divisions Accounting Agriculture Center/UF Extension Airport (DBIA) Animal Services Aviation and Economic Resources Beach Safety Building and Code Administration Business Services Coastal Code Compliance Community Assistance Community Information Community Services Corrections Economic Development Elections Emergency Management Emergency Medical Administration Emergency Medical Services Emergency Services Engineering and Construction Environmental Management Facility Management Fleet Management Finance Department Fire Rescue Growth and Resource Management Health Department Human Resources Information Technology Library Services Management and Budget Medical Examiner Mosquito Control Ocean Center Parks, Recreation and Culture Planning and Development Property Appraiser Public Protection Public Works Purchasing Recovery and Resiliency Transform386 Resource Stewardship Road and Bridge Sheriff's Office Solid Waste and Recycling Tax Collector Traffic Engineering Treasury and Billing Veterans Services Votran Water and Utilities Visitors Art and culture Beaches Chambers of Commerce Cities and communities Convention Center Convention and visitors bureaus Daytona Beach International Airport DeBary Hall ECHOtourism Explore Volusia History and Fast Facts Libraries Lyonia Environmental Center Marine Science Center Parks and trails Sports Volusia Transportation Search Search Search Search Search Hamburger Menu Menu Beach driving, parking and passes Beach Furniture Ordinance Beach information for the disabled Beach Map Beaches Mobile App Beach rules Beach safety tips Beach warning flags Beachcam and Current Conditions Beachfront lighting information Beachfront parks Bonfires on the beach Commercial Fisherman Conservation zone Dogs on the Beach Found and abandoned property Habitat Conservation Plan Payments Junior Lifeguard Program Lifeguard Corps Personal watercraft zones north of Ponce Inlet Personal watercraft zones south of Ponce Inlet Skin care tips Special events Statistics and Daily Beach Report Surf zones The beach environment Division Director Tamra Malphurs tmalphurs@volusia.org Questions and comments BeachSafety@volusia.org Questions about the Junior Lifeguard Program jrlifeguard@volusia.org Call us at 386-239-7873 Beach driving and parking Home | Departments and Divisions | Public Protection | Beach Safety | Beach driving, parking and passes ParkVolusia Beach Parking Program The Volusia County Council voted to waive fees for residents to drive on the beach and to park at County-owned off-beach parking lots. The current beach parking rates for visitors and unregistered residents are: On-Beach Driving Rates (Effective 10/1/24) $30 daily fee $150 annual visitor pass Off-Beach Parking Rates (Effective 1/1/25) $20 daily fee $100 annual visitor pass Daily beach parking fees can be paid upon arrival at a County-owned off-beach parking lot or beach ramp booth. Annual passes are no longer available for purchase at the beach ramp booths and cannot be purchased at off-beach parking lots. Volusia County residents must register for their free combination on-beach/off-beach annual pass online at www.parkvolusia.org or in-person at one of two ParkVolusia offices: 302 N. Causeway, New Smyrna Beach (Open: Monday – Friday, 10:00 am – 6:00 pm), call 386-217-0216 2422 S. Atlantic Avenue, Daytona Beach Shores (Open: Monday – Saturday, 8:30 am – 6:00 pm), call 386-217-0078 Nonresidents/visitors can also purchase annual passes for beach driving and off-beach parking through the same avenues as residents. Current Pass Holders Existing beach pass holders with windshield stickers, both residents and nonresidents, may continue using their current passes at staffed toll booths until expiration. However, once a beach access point converts to a license plate reader, vehicles must be registered with the ParkVolusia program, or a gate will not open even with a valid annual pass. Additionally, these windshield stickers do not cover the fees for parking in a County-owned off-beach parking lot. Inlet Parks The no-cost beach parking permit for residents does not include access to the Inlet Parks ( Lighthouse Point Park and Smyrna Dunes Park ). Residents and visitors must purchase a separate daily or annual Inlet Park pass for access. Daily fees can be paid upon arrival at the entrance booth while annual passes can only be purchased online at www.parkvolusia.org or in-person at a ParkVolusia Office. A daily pass is $10 and an annual pass is $20 plus taxes and credit card fees. Registration for Persons with Disabilities Residents and visitors with verified permanent or temporary disabled parking documentation will continue to receive no-cost access to beach driving, parking in County-owned off-beach lots, and entry to the inlet parks. They are also encouraged to register at no-cost with the ParkVolusia program online or in-person at a ParkVolusia office to facilitate access. More Information and Assistance Download the Volusia Beaches App for real-time beach ramp access statuses and off-beach parking availability. Visit the Park Volusia website for more information, including documentation requirements to register and FAQs. Both residents and nonresidents can further inquire about the registration process and necessary documentation based on their residency status by contacting ParkVolusia’s 24/7 assistance line at 386-260-1482. ParkVolusia Frequently Asked Questions What if I have handicapped parking? Residents with state-registered handicapped license plates, including Disabled Veteran plates, or temporary handicapped placards should register their vehicles with ParkVolusia to access beach driving at automated beach ramps and to avoid fines at off-beach lots with license plate readers. Non-Volusia County persons with handicapped license plates, including Disabled Veteran plates, or placards qualify for waived off-beach parking and beach driving fees through program registration. The kiosks in the off-beach lots are unable to waive daily parking fees; however, the fine can be waived with appropriate documentation of a handicapped license plate, including a Disabled Veteran plate. How do I receive notice my application was approved? Individuals who register with the ParkVolusia program will receive updates about their application status through the email address provided during registration. Once approved, they will receive a confirmation email. Since the ParkVolusia program uses license plates to verify registration, participants will not receive a sticker, placard, or physical item by mail, nor will they need to pick up anything in person. Is there a deadline to register for a permit? There is no deadline to register a vehicle with the ParkVolusia program, and registrations may continue beyond Jan. 1, 2025. However, residents should ensure their vehicle’s registration is confirmed with the program before parking in County-owned and operated off-beach lots or driving on the beach. How many cars can I register? Volusia County residents may register as many vehicles as they wish, provided the vehicles are registered in their name. Nonresidents can only register one vehicle per pass purchased. Are off-beach parking and beach driving separate permits? Volusia County residents who register for the program will receive complimentary access to both off-beach parking in County-owned and operated lots and beach driving, requiring only a one-time registration. Non-Volusia County residents, however, must purchase two separate annual passes: one for off-beach parking at $100 and another for beach driving at $150. Beach Driving Driving and parking on the beach are permitted in designated areas. Make sure to park on the seaward side of the conservation zone. Your vehicle must not cross beyond the conservation zone markers (refer to the image below). Park either facing the ocean or backing into your spot toward the dunes. Download the Volusia Beaches app for real-time updates on open vehicular access ramps. Please remember to follow all standard safety and traffic laws. This includes adhering to the posted speed limit, keeping your headlights on, and ensuring at least one front seat window is open. Off-Beach Parking Volusia County offers more than 60 off-beach parking lots that can be utilized to easily access the beach within a short walk and are included in the ParkVolusia beach parking program. To view a full list of all County-owned off-beach parking lots, visit the ParkVolusia website or utilize the Volusia Beaches app . Registered residents and visitors need to note that ParkVolusia permits are not valid in off-beach parking lots and boat ramps owned by municipalities . This includes the following locations: 27th Street Oceanfront Park (New Smyrna Beach) Flagler Avenue Oceanfront Park (New Smyrna Beach) Esther Street Oceanfront Park (New Smyrna Beach) Grayce Barck North Beach Community Park (New Smyrna Beach) Marianne Clancy Park (New Smyrna Beach) North Causeway Boat Ramp (New Smyrna Beach) Swoop Boat Ramp (New Smyrna Beach) Breakers Oceanfront Park and Breakers Lot (Daytona Beach) Harvey Ave / S Ocean Ave Lot (Daytona Beach) Auditorium Blvd / N Grandview Ave Lot (Daytona Beach) Ocean Ave On Street Parking (Daytona Beach) Residents and visitors should contact the respective city governments for information on fees applicable to these municipal lots listed above. Additionally, ParkVolusia registration does not cover complimentary access to Lighthouse Point Park and Smyrna Dunes Park . Residents and visitors can purchase an Inlet Park annual pass through their ParkVolusia account or pay the daily entrance fee upon arrival. For beach parking questions or concerns, please contact Daniel Strom at dstrom@volusia.org or 386-248-8072 ext. 20360 How Can We Serve You? Contact Us If you don't find what you're looking for you can reach out to us through our contact form or call us at 386-736-2700 . Thank you! 123 W. Indiana Ave. DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All Contact Us Use our contact form Call: 386-736-2700 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All How Can We Serve You? If you need help, use our Contact Form or call us at (386) 736-2700 . All Rights Reserved, © 2025 Volusia County. All Rights Reserved. Web Design by DigitalUs on Solodev Select a language English French Spanish Portuguese Chinese Japanese Text size A A A Search Site Search button Search Site Search button We use cookies to provide and improve our services. By using our site, you consent to cookies. Accept Learn more"
    },
    {
      "url": "https://www.volusia.org/services/public-works/coastal-division/coastal-parks/mary-mcleod-bethune-beach-park.stml",
      "text": "Mary McLeod Bethune Beach Park Skip to main content Submit Search Button Search Website Doing Businesses Government News Divisions Visitors Help & Info Request a service Online Services Payments Agendas & Minutes About us Careers Contact us Go To Social Media Page With Link To Facebook Go To Social Media Page With Link To Twitter Go To Social Media Page With Link To YouTube Volusia County offices will be closed on Dec. 25 and Jan. 1, in observance of the holidays. Coastal Floods, Severe Rip Currents, and Significant Rainfall Expected. Read More . Request a service About us Careers Volunteer Search Search button Doing Business Business Incubator Demographics Doing business with the county Register with OpenGov Economic Development Licenses and permits Payments Watering restrictions Government Agendas and minutes Boards and Committees Board and Committee Meetings Business Impact Estimates Capital Project Schedule Census Redistricting Charter Review Commission Citizens Academy County Council County Council actions County Council Budget Resolutions County Council Events County Council's goals County Council meeting calendar County Council Meeting Information County Council Proclamations Watch Live Meetings County Manager County ordinances Financial Reports and Schedules Home Rule Charter Internal Auditor Meetings Calendar Meeting Closed Captioning Watch Archived Meetings Watch Live Meetings Organizational chart Permit and Code\r\nConcierge Service Public Records Requests Special Districts Title VI Policy and Plan Volusia County Elected Officials Roundtable News County Council meeting information Events and  Meetings Calendar News releases Newsletters Photo gallery Public Information Network Radio and Podcast RSS Calendar Feed RSS News Feed Social media feeds Watch Live Meetings Divisions Departments & Divisions Accounting Agriculture Center/UF Extension Airport (DBIA) Animal Services Aviation and Economic Resources Beach Safety Building and Code Administration Business Services Coastal Code Compliance Community Assistance Community Information Community Services Corrections Economic Development Elections Emergency Management Emergency Medical Administration Emergency Medical Services Emergency Services Engineering and Construction Environmental Management Facility Management Fleet Management Finance Department Fire Rescue Growth and Resource Management Health Department Human Resources Information Technology Library Services Management and Budget Medical Examiner Mosquito Control Ocean Center Parks, Recreation and Culture Planning and Development Property Appraiser Public Protection Public Works Purchasing Recovery and Resiliency Transform386 Resource Stewardship Road and Bridge Sheriff's Office Solid Waste and Recycling Tax Collector Traffic Engineering Treasury and Billing Veterans Services Votran Water and Utilities Visitors Art and culture Beaches Chambers of Commerce Cities and communities Convention Center Convention and visitors bureaus Daytona Beach International Airport DeBary Hall ECHOtourism Explore Volusia History and Fast Facts Libraries Lyonia Environmental Center Marine Science Center Parks and trails Sports Volusia Transportation Search Search Search Search Search Hamburger Menu Menu Al Weeks Sr. North Shore Park Argosy Beach Park Cardinal Drive Beach Park Dahlia Avenue Park Edwin W. Peck Sr. Park Frank Rendon Park Hiles Blvd. Beach Park Lighthouse Point Park Mary McLeod Bethune Beach Park Smyrna Dunes Park Sun & Surf Park Sun Splash Park Tom Renick Park Toronita Avenue Beach Park University Blvd. Beach Park Winterhaven Park Coastal Division Director Jessica Fentress jfentress@volusia.org Questions and comments RecProCoastal@volusia.org Daytona Beach 386-248-8072 DeLand 386-736-2700, ext. 18072 New Smyrna Beach 386-423-3300, ext. 18072 Mary McLeod Bethune Beach Park Home | Departments and Divisions | Public Works | Coastal Division | Coastal parks | Mary McLeod Bethune Beach Park Coastal Parks Storm Recovery Information Mary McLeod Bethune Beach Park is 3.5 miles south of New Smyrna Beach and one mile north of the Apollo Beach entrance to Canaveral National Seashore Park. This handicapped accessible county park honors the African American heritage of Dr. Mary McLeod Bethune, the founder of Bethune-Cookman University in Daytona Beach. The beachfront area of the park has restrooms, large picnic pavilions, showers and nearly 800 feet of direct beachfront sidewalk that overlooks this remote and beautiful beach. The riverside park area is a short distance across South Atlantic Avenue and has tennis, pickleball, basketball and volleyball courts, a playground, fishing pier, and restrooms. The river area around the park is an excellent location for viewing manatees, dolphins and pelicans. The Coastal Division approves unsolicited/organized park activities through a Special Event Permit . There is a $25 application fee and the form can be submitted via email to RecProCoastal@volusia.org . Reserving pavilions Pavilion map Bethune Meeting Room Rules Bethune Meeting Room Application Location: 6656 S. Atlantic Ave., New Smyrna Beach. Open daily: Restroom facilities are available from within one hour of sunrise to within one hour of sunset.  Parking is prohibited from 11 p.m. to 5 a.m. There is currently no ADA access to the beach. Effective January 1, 2025: All County-owned and operated off-beach parking lots require a $20 daily parking fee , separate from on-beach driving fees. The daily parking fee can be paid by following the directions on the signage in the parking lots. Volusia County residents can park for free if they register their vehicles online at parkvolusia.org or in person at one of two ParkVolusia offices located at: 302 North Causeway, New Smyrna Beach (10 a.m. to 6 p.m. Monday through Friday) 386-217-0216 2422 S. Atlantic Ave., Daytona Beach Shores (8:30 a.m. to 6 p.m. Monday through Saturday) 386-217-0078 Nonresidents may purchase an annual off-beach parking pass for $100 online at parkvolusia.org or in-person at a ParkVolusia office. This pass allows nonresidents unlimited parking in County-owned and operated lots for 365 days from the date of purchase. The $20 daily parking fee and annual off-beach parking passes do not provide access to the Inlet Parks ( Lighthouse Point Park and Smyrna Dunes Park ). Daily passes for Inlet Parks can be purchased at the entrance booth. To purchase an Inlet Park annual pass visit parkvolusia.org or a ParkVolusia office location. All Coastal and Inlet Parks are open 365 days a year. How Can We Serve You? Contact Us If you don't find what you're looking for you can reach out to us through our contact form or call us at 386-736-2700 . Thank you! 123 W. Indiana Ave. DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All Contact Us Use our contact form Call: 386-736-2700 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All How Can We Serve You? If you need help, use our Contact Form or call us at (386) 736-2700 . All Rights Reserved, © 2025 Volusia County. All Rights Reserved. Web Design by DigitalUs on Solodev Select a language English French Spanish Portuguese Chinese Japanese Text size A A A Search Site Search button Search Site Search button We use cookies to provide and improve our services. By using our site, you consent to cookies. Accept Learn more"
    },
    {
      "url": "https://www.volusia.org/services/public-protection/animal-services/",
      "text": "Animal Services Skip to main content Submit Search Button Search Website Doing Businesses Government News Divisions Visitors Help & Info Request a service Online Services Payments Agendas & Minutes About us Careers Contact us Go To Social Media Page With Link To Facebook Go To Social Media Page With Link To Twitter Go To Social Media Page With Link To YouTube Volusia County offices will be closed on Dec. 25 and Jan. 1, in observance of the holidays. Coastal Floods, Severe Rip Currents, and Significant Rainfall Expected. Read More . Request a service About us Careers Volunteer Search Search button Doing Business Business Incubator Demographics Doing business with the county Register with OpenGov Economic Development Licenses and permits Payments Watering restrictions Government Agendas and minutes Boards and Committees Board and Committee Meetings Business Impact Estimates Capital Project Schedule Census Redistricting Charter Review Commission Citizens Academy County Council County Council actions County Council Budget Resolutions County Council Events County Council's goals County Council meeting calendar County Council Meeting Information County Council Proclamations Watch Live Meetings County Manager County ordinances Financial Reports and Schedules Home Rule Charter Internal Auditor Meetings Calendar Meeting Closed Captioning Watch Archived Meetings Watch Live Meetings Organizational chart Permit and Code\r\nConcierge Service Public Records Requests Special Districts Title VI Policy and Plan Volusia County Elected Officials Roundtable News County Council meeting information Events and  Meetings Calendar News releases Newsletters Photo gallery Public Information Network Radio and Podcast RSS Calendar Feed RSS News Feed Social media feeds Watch Live Meetings Divisions Departments & Divisions Accounting Agriculture Center/UF Extension Airport (DBIA) Animal Services Aviation and Economic Resources Beach Safety Building and Code Administration Business Services Coastal Code Compliance Community Assistance Community Information Community Services Corrections Economic Development Elections Emergency Management Emergency Medical Administration Emergency Medical Services Emergency Services Engineering and Construction Environmental Management Facility Management Fleet Management Finance Department Fire Rescue Growth and Resource Management Health Department Human Resources Information Technology Library Services Management and Budget Medical Examiner Mosquito Control Ocean Center Parks, Recreation and Culture Planning and Development Property Appraiser Public Protection Public Works Purchasing Recovery and Resiliency Transform386 Resource Stewardship Road and Bridge Sheriff's Office Solid Waste and Recycling Tax Collector Traffic Engineering Treasury and Billing Veterans Services Votran Water and Utilities Visitors Art and culture Beaches Chambers of Commerce Cities and communities Convention Center Convention and visitors bureaus Daytona Beach International Airport DeBary Hall ECHOtourism Explore Volusia History and Fast Facts Libraries Lyonia Environmental Center Marine Science Center Parks and trails Sports Volusia Transportation Search Search Search Search Search Hamburger Menu Menu Adopt-a-pet Animal Abuse Database Animal Control Advisory Board Apply for an unaltered animal permit Foster Hobby Breeder Lost/Found Pets Pet Disaster Preparedness Public Records Report Suspicious Animal Behavior Requirements of pet ownership Spay and neuter ordinance Spay and Neuter Services Statistics Trap/Neuter/Return-Return to Field Program and Q & A Volunteer Opportunities Director Angela Miedema Animal Control Welfare Concerns or Questions: Animalcontrol@volusia.org Volusia County Animal Care Clinic Spay/Neuter Services: VCACC@volusia.org Animal Services 386-248-1790 FAX 386-323-3523 Animal Services Home | Departments and Divisions | Public Protection | Animal Services IMPORTANT NOTICES: Notice: Temporary Hold on New Appointments We are currently postponing the scheduling of October clinic appointments to focus on improving our internal operations and ensure we can provide the highest quality care to our patients. TNR will continue to serve the community on Tuesdays as normal . **NO TNR SEPT 2nd and 23rd.** We sincerely apologize for any inconvenience this may cause and look forward to serving our community again in the near future. We will notify you as soon as new appointments become available. ---------------- We will update you all as soon as we know when/how many new appointments will be re-opening . Our Mission To provide animal services to the public in the most effective, efficient and courteous means possible. We will provide professional, proactive enforcement of Volusia County Code of Ordinances chapter 14 and the State Statutes pertaining to animals. We will promote responsible pet ownership by individual contact and community outreach programs. Report Suspicious Animal Behavior If you have noticed suspicious animal behavior, report it immediately. When submitting your report, please include the following details: A general description of the animal. The type of behavior that raised your concern. The address or general location where the behavior occurred. If your concern falls outside the jurisdiction of Volusia County Animal Services, we will forward your report to the appropriate agency. An animal control officer may contact you for further details. For emergencies involving an animal that requires immediate attention, please call 911. Submit your concern here . Outside of Volusia County jurisdiction contact information: Here Spay and Neuter Services Volusia County Animal Services is proud to offer low-cost spay and neuter services at the Volusia County Animal Care Clinic (VCACC) for low-income residents. Our state-of-the-art facility provides affordable access to vital sterilization services, helping pet owners comply with Volusia County's mandatory spay and neuter ordinance ( Sec. 14-58 ) while contributing to the reduction of pet overpopulation and homelessness. By offering these essential services, we aim to improve the well-being of pets and foster a healthier, more responsible pet-owning community. Please review the income eligibility requirements below to confirm your qualification for our clinic services. We look forward to helping you care for your pets! Household Size Qualified Income Maximums 1 $46,400 2 $53,000 3 $59,650 4 $66,250 5 $71,550 6 $76,850 7 $82,150 8 $87,450 For more information, you can visit our Spay and Neuter Services page. Now Hiring Veterinarian Assistants We're looking for dedicated individuals to join our team. The ideal candidate should have a high school diploma or G.E.D. and two years' experience working in a veterinarian office assisting with animal spay/neuter surgery or certification as a veterinary technician. Learn more and apply . Contact Dispatch Municipal animal services Volusia County Animal Services enforces ordinances and provides services for the unincorporated areas of the county, the City of Oak Hill and the City of Pierson.  If you live within city limits, please contact your local animal services office through the Volusia County communication center: 386-248-1777 386-736-5999 386-878-8701   Deltona Community Outreach Community outreach program Animal Services has a speaker available for presentations on responsible pet ownership for your group, such as schools, boy scouts, girl scouts, homeowners associations and civic organizations. Please email Jbwilkinson@volusia.org to schedule your presentation. Links of Interest Dangerous Dogs in Unincorporated Volusia County Monthly Statistics Partner Links Edgewater Animal Shelter Halifax Humane Society New Hope Animal Shelter Southeast Volusia Humane Society Volusia County Disaster Shelter Information How Can We Serve You? Contact Us If you don't find what you're looking for you can reach out to us through our contact form or call us at 386-736-2700 . Thank you! 123 W. Indiana Ave. DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All Contact Us Use our contact form Call: 386-736-2700 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All How Can We Serve You? If you need help, use our Contact Form or call us at (386) 736-2700 . All Rights Reserved, © 2025 Volusia County. All Rights Reserved. Web Design by DigitalUs on Solodev Select a language English French Spanish Portuguese Chinese Japanese Text size A A A Search Site Search button Search Site Search button We use cookies to provide and improve our services. By using our site, you consent to cookies. Accept Learn more"
    },
    {
      "url": "https://www.volusia.org/services/public-works/coastal-division/reserving-pavilions.stml",
      "text": "Reserving Pavilions Skip to main content Submit Search Button Search Website Doing Businesses Government News Divisions Visitors Help & Info Request a service Online Services Payments Agendas & Minutes About us Careers Contact us Go To Social Media Page With Link To Facebook Go To Social Media Page With Link To Twitter Go To Social Media Page With Link To YouTube Volusia County offices will be closed on Dec. 25 and Jan. 1, in observance of the holidays. Coastal Floods, Severe Rip Currents, and Significant Rainfall Expected. Read More . Request a service About us Careers Volunteer Search Search button Doing Business Business Incubator Demographics Doing business with the county Register with OpenGov Economic Development Licenses and permits Payments Watering restrictions Government Agendas and minutes Boards and Committees Board and Committee Meetings Business Impact Estimates Capital Project Schedule Census Redistricting Charter Review Commission Citizens Academy County Council County Council actions County Council Budget Resolutions County Council Events County Council's goals County Council meeting calendar County Council Meeting Information County Council Proclamations Watch Live Meetings County Manager County ordinances Financial Reports and Schedules Home Rule Charter Internal Auditor Meetings Calendar Meeting Closed Captioning Watch Archived Meetings Watch Live Meetings Organizational chart Permit and Code\r\nConcierge Service Public Records Requests Special Districts Title VI Policy and Plan Volusia County Elected Officials Roundtable News County Council meeting information Events and  Meetings Calendar News releases Newsletters Photo gallery Public Information Network Radio and Podcast RSS Calendar Feed RSS News Feed Social media feeds Watch Live Meetings Divisions Departments & Divisions Accounting Agriculture Center/UF Extension Airport (DBIA) Animal Services Aviation and Economic Resources Beach Safety Building and Code Administration Business Services Coastal Code Compliance Community Assistance Community Information Community Services Corrections Economic Development Elections Emergency Management Emergency Medical Administration Emergency Medical Services Emergency Services Engineering and Construction Environmental Management Facility Management Fleet Management Finance Department Fire Rescue Growth and Resource Management Health Department Human Resources Information Technology Library Services Management and Budget Medical Examiner Mosquito Control Ocean Center Parks, Recreation and Culture Planning and Development Property Appraiser Public Protection Public Works Purchasing Recovery and Resiliency Transform386 Resource Stewardship Road and Bridge Sheriff's Office Solid Waste and Recycling Tax Collector Traffic Engineering Treasury and Billing Veterans Services Votran Water and Utilities Visitors Art and culture Beaches Chambers of Commerce Cities and communities Convention Center Convention and visitors bureaus Daytona Beach International Airport DeBary Hall ECHOtourism Explore Volusia History and Fast Facts Libraries Lyonia Environmental Center Marine Science Center Parks and trails Sports Volusia Transportation Search Search Search Search Search Hamburger Menu Menu Artificial reef program Beach Access and Recovery Beach driving, parking and passes Beach Ramp Improvement Projects Capital Project Schedule Coastal Anti-Littering Initiatives Coastal parks Pavilion rental FAQs Reserving Pavilions Sand Placement Projects Coastal Division Director Jessica Fentress jfentress@volusia.org Questions and comments RecProCoastal@volusia.org Daytona Beach 386-248-8072 DeLand 386-736-2700, ext. 18072 New Smyrna Beach 386-423-3300, ext. 18072 Reserving Pavilions Home | Departments and Divisions | Public Works | Coastal Division | Reserving Pavilions To reserve pavilions at the parks listed below, click the Rent Now button. We do not accept pavilion reservations on holidays. Groups with 50 or greater attendees who are visiting Lighthouse Point Park, Mary McLeod Bethune Park, or Smyrna Dunes Park must obtain a Special Event Permit.  Please complete this application and email it to RecProCoastal@volusia.org .  There is a $25 application fee in addition to the pavilion rental and the group may also be required to provide insurance. For groups with 50 or more attendees who are visiting other Coastal Parks listed below, please visit the Beach Safety’s Special Event Permit page . Dahlia Park: 3621 South Atlantic Ave, Daytona Beach Two small pavilions Frank Rendon Park: 2655 S. Atlantic Av, Daytona Beach Shores ( Pavilion map )  Two small pavilions - each with two (2) picnic tables Currently Unavailable Lighthouse Point Park: 5000 S. Atlantic Av, Ponce Inlet ( Pavilion map ) Four large pavilions - Office pavilion has six (6) picnic tables, pavilions #5 - #7 each have four (4) picnic tables Mary McLeod Bethune Park: 6656 S. Atlantic Av, New Smyrna Beach ( Pavilion map )   Five large pavilions - #1, #2 and #5 each have four (4) picnic tables, pavilion #4 has five (5) tables and #3 has nine (9) picnic tables. Sun Splash Park: 611 S. Atlantic Av, Daytona Beach ( Pavilion map )   Three small pavilions - each with one (1) picnic table Tom Renick Park: 1565 Ocean Shore Blvd, Ormond by the Sea ( Pavilion map )  Three small pavilions - each with two (2) picnic tables If you experience difficulty when reserving, please call 386-248-8040. Volusia County residents Large Pavilion Full day - $70 Large Pavilion Half day* - $40 Small Pavilion Full Day - $40 Small Pavilion Half Day* - $25 Non-county residents Large Pavilion Full day - $75 Large Pavilion Half day* - $45 Small Pavilion Full Day - $45 Small Pavilion Half Day* - $30 Fees listed above do not include sales tax. *Half-day rentals are from sunrise to noon -or- noon to sunset. If you are renting a pavilion for a tax exempt organization, please create an account using the \"Rent Now\" button, then call 386-248-8040 for assistance. Pavilion reservations do not guarantee parking space availability. Electricity is not available at the Coastal or Inlet parks. Pavilion rentals at Lighthouse Point Park do not include Inlet Park entrance fees. Pavilion rentals at other Coastal parks do not include the required $20 daily off-beach parking fee . Volusia County residents can park for free if they register their vehicles online at parkvolusia.org or in-person at one of two ParkVolusia offices located at: 302 N. Causeway, New Smyrna Beach (Open: Monday – Friday, 10:00 am – 6:00 pm), call 386-217-0216 2422 S. Atlantic Avenue, Daytona Beach Shores (Open: Monday – Saturday, 8:30 am – 6:00 pm), call 386-217-0078 Pavilion rentals are not available over the Easter, Mother's Day, Memorial Day, July 4th and Labor Day holidays and are listed below for 2025. Easter: April 18 through April 20, 2025 Mother’s Day: May 9  through 11, 2025 Memorial Day: May 23 through May 26, 2025 July 4th: July 4 through July 6, 2025 Labor Day: August 29th  through September 1, 2025 How Can We Serve You? Contact Us If you don't find what you're looking for you can reach out to us through our contact form or call us at 386-736-2700 . Thank you! 123 W. Indiana Ave. DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All Contact Us Use our contact form Call: 386-736-2700 123 W. Indiana Ave DeLand, FL 32720 (386) 736-2700 from 8am to 5pm Monday through Friday About Us ADA Notice Civil Rights Notice Contact Us County Council Events Employment Feedback Privacy Policy Public Records Requests Doing Business Business Incubator Demographics Doing Business with the County Economic Development Licenses & Permits View All Services Building & Code Administration Community Services Finance Department Public Protection Public Works View All How Can We Serve You? If you need help, use our Contact Form or call us at (386) 736-2700 . All Rights Reserved, © 2025 Volusia County. All Rights Reserved. Web Design by DigitalUs on Solodev Select a language English French Spanish Portuguese Chinese Japanese Text size A A A Search Site Search button Search Site Search button We use cookies to provide and improve our services. By using our site, you consent to cookies. Accept Learn more"
    }
  ]
}