{
  "fuentes": [
    {
      "url": "https://myemail-api.constantcontact.com/This-Week---Wahoo-s-River-Bar-and-Grill.html?soid=1119360583959&aid=OZjQPaMy4KE",
      "email": "kcoville@port32marinas.com"
    },
    {
      "url": "https://myemail-api.constantcontact.com/This-Week---Wahoo-s-River-Bar-and-Grill.html?soid=1119360583959&aid=OZjQPaMy4KE",
      "email": "rm@port32marinas.com"
    },
    {
      "url": "https://www.tallahassee.com/story/life/food/2016/01/06/wahoo-seafood-grill-brings-coastal-delights-tallahassee-palates/78305550/",
      "email": "nwilborn@tallahassee.com"
    },
    {
      "url": "https://ezaxisbar.com/contact",
      "email": "flags@2x.png"
    },
    {
      "url": "https://ezaxisbar.com/contact",
      "email": "wendy_d_27@yahoo.com"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "email": "info@rivervillegrill.com"
    }
  ],
  "mails": [
    "flags@2x.png",
    "info@rivervillegrill.com",
    "kcoville@port32marinas.com",
    "nwilborn@tallahassee.com",
    "rm@port32marinas.com",
    "wendy_d_27@yahoo.com"
  ],
  "nombre_sitio": "wahoosriverbarandgrill.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://myemail-api.constantcontact.com/This-Week---Wahoo-s-River-Bar-and-Grill.html?soid=1119360583959&aid=OZjQPaMy4KE",
      "text": "This Week @ Wahoo's River Bar and Grill Clubhouse Specials & Events Download Document The Clubhouse atPort 32 Naples | 475 North Road , Naples, FL 34104 Unsubscribe rm@port32marinas.com Update Profile | Constant Contact Data Notice Sent by kcoville@port32marinas.com powered by Try email marketing for free today!"
    },
    {
      "url": "https://www.tallahassee.com/story/life/food/2016/01/06/wahoo-seafood-grill-brings-coastal-delights-tallahassee-palates/78305550/",
      "text": "Wahoo Seafood Grill brings coastal delights to Tallahassee palates News Sports Entertainment Opinion Email Us Advertise Obituaries eNewspaper Legals LIFE Wahoo Seafood Grill brings coastal delights to Tallahassee palates Nubyjas J Wilborn Democrat staff writer A life-long love affair with serving delicious food and a desire to return to Tallahassee has resulted in the city's newest seafood restaurant. \"I wanted to bring the coast to Tallahassee,\" said Shawn Shepherd, owner of Wahoo Seafood Grill. Shepherd, who once was a member of Harry's Seafood Bar & Grille's management team, had moved to Gainesville to open his own restaurant. \"I love this town and am happy to be back. The dining scene has come a long way, but was missing fresh seafood.\" Tucked behind the Holiday Inn on Graves Road, off North Monroe Street near I-10, the Wahoo Seafood Grill seats 250 people and is 9,000 square feet. It had a soft opening in December. Despite only being advertised on I-10 billboards, the restaurant has gained a following among Tallahassee diners seeking fresh seafood they would have to travel to Apalachicola or farther to enjoy. \"I've been here twice a week since it opened,\" said local diner Roberta Clark. \"My favorite dish is the Southern Stuffed Snapper. It is literally everything. I love getting all the flavors on my fork.\" The stuffed snapper is one of many dishes on the menu inspired by Shepherd's life. He was born in Ohio and raised in the South. His father was a Navy man, so his family moved around. Shepherd attended six high schools. During the summer, he would visit his grandfather's seafood restaurant in Pennsylvania. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. The inspiration for the stuffed snapper came from his time in Mississippi, where he eventually graduated high school. Blackened fresh snapper is placed over fried cornbread dressing and covered with tasso cream sauce. Shepherd, 51, fell in love with cooking early — at 6 years old. His mother taught him how to make the perfect scrambled egg. \"I still remember those eggs, the secret is in the butter,\" Shepherd said. \"Most people use just enough to make the eggs not stick. But you gotta put the butter in the eggs. It makes them fluffy and taste good.\" From there the Ada, Ohio, native would try to re-create dishes from his mother, grandfather and friends' parents — whoever allowed him into their kitchen. \"I learned a lot about cooking in Mississippi,\" Shepherd said. \"Louisiana tries to take all the credit for Cajun food, but I learned from older women in Jackson. They would teach me how to create dishes and about life. Food is about the experience, and I get to share mine through my restaurant.\" His Mississippi upbringing shines in the Redeye Shrimp and Grits. It has grilled Gulf shrimp tossed in redeye gravy and is served over smoked cheese grits. \"The gravy is what separates my shrimp and grits from everyone else's,\" Shepherd said. \"It's old fashioned Mississippi-style with big ole shrimp from the Gulf Sea.\" After high school, he went to the Navy and wanted to cook. \"They wouldn't let me cook, I couldn't believe it,\" Shepherd said. \"My testing scores were really high, and they wanted me to do different things. But I couldn't think of anything better than cooking. It's what I love.\" Nearly seven years later, he would be honorably discharged. He would start to live out his deferred dream. Shepherd made two promises once he traded his pristine white naval uniform for an apron. He would do his best to use great ingredients. Secondly, he would help others live out their ambitions. \"All I wanted growing up was for somebody to listen to me,\" Shepherd said. \"Everybody had plans for me, without me. Now I'm creating my own plan, by my design.\" Greg Home is Wahoo's general manager. He met Shepherd as a line cook at Harry's. The assistant kitchen manager, Anthony James, is a former dishwasher at Harry's. When Shepherd decided to return to Tallahassee, he called Horne to assemble the old crew. \"He invited me to play golf and pitched his plan to open the restaurant,\" said Horne, 31. \"He said he wasn't coming back without me and I knew I had to be part of it.\" That conversation occurred in April. It set off a mad dash to transform the abandoned building, which once was the home of Marie Livingston's Steakhouse. Over the ensuing four months, Shepherd and Horne hired the staff and picked the decor. Their task was made easier because Shepherd had a blueprint from his Wahoo Grill in Gainesville. Stepping inside feels like being whisked away to the beach. Smells of steamed crab, old bay seasoning, crawfish and hot butter tantalize the nose. Eyes are drawn to the neon lights, re-purposed street signs and the intricate bar. The bar is made of oak from Tallahassee and is distinctive in it's design. \"I don't know if I should take pics, or eat and drink,\" said diner Barbara Hall. \"It's so beautiful, I'm afraid, I'll mess it up. It feels like the fancy table at your granny's house.\" On a Friday night customers will hear a live band playing country music. They'll see Shepherd walking around greeting patrons at every table. He's a gregarious man who likes his restaurant to be lively and energetic. Shepherd will talk to anyone about food and sports for hours. Having lived and worked in both Gainesville and Tallahassee, he has an appreciation for both the Gators and Seminoles. But his favorite moments, however, are the silent, savory ones. \"I love to hear a table go quiet once those plates are dropped,\" Shepherd said. \"It's my favorite feeling. You see them smiling and nodding. I don't even have to ask them how the meal was. The empty plate will tell the story.\" Wahoo Seafood Grill dishes worth trying Mudbug Fries French fries covered in our smoked cheddar and crawfish sauce. Drizzled with bacon and green onions. Grouper Gillen Blackened grouper served over cheese grits and topped with our smoked cheddar crawfish sauce. Wahoo Roll. Ahi tuna, wahoo, cucumber & scallions, and cream cheese lightly dusted with panko and is flash fried. Cajun Jumpers. Cajun fried frog legs served with remoulade sauce. To Go Hours: 11 a.m. to 10 p.m Monday through Sunday 2174 Graves Road (seated behind the Holiday Inn near the North Monroe Street Exit(199) For more information: visit wahooseafoodgrill.com  or call 850-629-4059 Contact Nubyjas Wilborn at nwilborn@tallahassee.com and follow him on Twitter @nwilborn19 Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Licensing & Reprints Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.tallahassee.com. All rights reserved."
    },
    {
      "url": "https://ezaxisbar.com/contact",
      "text": "Contact: Wendy&#x27;s EZ Axis Bar &amp; Grill of Fall River WI Wendy's EZ Axis Bar & Grill Home Menu About Contact Contact Us Delicious Bar Food Contact Us Wendy's EZ Axis Bar & Grill | Fall River, WI Bar Food Restaurant, Takeout in Fall River, WI Get In Touch with us today Contact Wendy's EZ Axis Bar & Grill Wendy's EZ Axis Bar & Grill values our customers and hope you try us for delicious Bar Food. We would also love to hear from you. Please click one of the options below to get in touch with us today. Thanks and see you soon! (920) 484-3502 [email protected] 310 North Main Street Fall River, WI 53932 Contact Us Delicious Bar Food Wendy's EZ Axis Bar & Grill Pizza, Burgers, Salads & More in Fall River, WI Website Links Home Menu About Contact Privacy Policy Terms of Service Contact Us [email protected] (920) 484-3502 310 North Main Street Fall River, WI 53932 Business Hours Mon: Closed Tues: 11:00 AM - 2:00 AM Wed: 11:00 AM - 2:00 AM Thurs: 11:00 AM - 2:00 AM Fri: 11:00 AM - 2:00 AM Sat: 11:00 AM - 2:00 AM Sun: 10:00 AM - 12:00 AM Bar Food Restaurant Takeout Fall River © 2025 Wendy's EZ Axis Bar & Grill • All Rights Reserved • Website Designed & Powered By: Web Wisconsin Website Design & Online Ordering by: Web Wisconsin"
    },
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "text": "Contact Us - Riverville Bar & Grill Skip to content Our location (608) 424-0020 Menu Menu Our location (608) 424-0020 Get in touch We’d love to hear from you. Here’s how you can reach us! Call us! Want to make a reservation or have a question? (608) 424-0020 Have a question? Fill out my online form . Copyright 2025 © Riverville Bar & Grill Design & Development: Accent Graphix Design Studio Home Browse our Menu Mexican Specials Menu Gallery Contact Us #image_title ×"
    }
  ]
}