{
  "fuentes": [
    {
      "url": "https://www.dinefish30a.com/private-dining",
      "email": "fishprivatedining@stjoe.com"
    },
    {
      "url": "https://www.dinefish30a.com/private-dining",
      "email": "fishprivatedining@stjoe.com"
    },
    {
      "url": "https://watercolorbeachclub.ez-chow.com/watercolorbeachclub/contactus.htm",
      "email": "info@wcbcgrill.com"
    },
    {
      "url": "https://www.watercolorresort.com/faq",
      "email": "wcbonfires@stjoe.com"
    },
    {
      "url": "https://www.watercolorresort.com/faq",
      "email": "wciconcierge@stjoe.com"
    },
    {
      "url": "https://www.watercolorresort.com/about-us/contact-us",
      "email": "reservations@stjoe.com"
    },
    {
      "url": "https://www.watercolorresort.com/about-us/contact-us",
      "email": "sales@stjoe.com"
    },
    {
      "url": "https://www.watercolorresort.com/about-us/contact-us",
      "email": "stjoe@mmgy.com"
    },
    {
      "url": "https://www.watercolorresort.com/about-us/contact-us",
      "email": "wciconcierge@stjoe.com"
    },
    {
      "url": "https://www.watercolorresort.com/experience/beach-life",
      "email": "wcbonfires@stjoe.com"
    },
    {
      "url": "https://www.watercolorresort.com/experience/beach-life",
      "email": "reservations@stjoe.com"
    },
    {
      "url": "https://www.watercolorresort.com/groups/meetings",
      "email": "sales@stjoe.com"
    },
    {
      "url": "https://www.watercolorresort.com/groups/weddings/weddings-gallery",
      "email": "watercolorweddings@stjoe.com"
    },
    {
      "url": "https://www.watercolorresort.com/experience/recreation",
      "email": "watercolortennis@ccmcnet.com"
    }
  ],
  "mails": [
    "fishprivatedining@stjoe.com",
    "info@wcbcgrill.com",
    "reservations@stjoe.com",
    "sales@stjoe.com",
    "stjoe@mmgy.com",
    "watercolortennis@ccmcnet.com",
    "watercolorweddings@stjoe.com",
    "wcbonfires@stjoe.com",
    "wciconcierge@stjoe.com"
  ],
  "nombre_sitio": "watercolorresort.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.dinefish30a.com/private-dining",
      "text": "Private Dining Options at Our WaterColor Beachfront Restaurant - Fish Out of Water Skip to navigation Skip to main content Skip to footer (opens in a new tab) Private Beachfront Dining Options Planning Your WaterColor Event with Us Fish Out of Water® private dining capabilities include the Wine Room and Gulf Level. The restaurant does not take reservations, but we have several options for private and semi-private events. To make reservations or for additional information on private dining options, please email our team at FISHprivateDining@stjoe.com . Wine Room Private area surrounded by an impressive wine cellar Completely private room seating for up to thirty-six (36) guests at round tables Parties up to twelve (12) guests may order from the full à la carte menu tableside For parties of thirteen (13) or more, a special menu for guests to pre-select items prior is available Full bar service is available with a world-class inventory of wine Reservations may be made for brunch or dinner service Minimum purchase required for reservation Gulf Level Located on the west side of the main dining room on a raised level with views of the Gulf Semi-private area in the main dining room with seating for up to thirty-eight (38) guests Seating consists of permanent booths with a mix of smaller round and square tables Parties up to twelve (12) guests can order from the full à la carte menu tableside For parties of thirteen (13) or more, a special menu for guests to pre-select items prior is available Functions for this area are limited to two (2) hours Full bar service is available with a world-class inventory of wine Reservations may be made for brunch or dinner service Minimum purchase required for reservation"
    },
    {
      "url": "https://watercolorbeachclub.ez-chow.com/watercolorbeachclub/contactus.htm",
      "text": "Watercolor Toggle navigation Menu Login Contact Us Contact Us For support with the online ordering website, call us at 855-429-2532 or email us at https://support.ez-chow.com . To place an order, please contact the respective location: BEACH CLUB MON - SUN  10:00 AM-8:00 PM (850) 534-5049 info@wcbcgrill.com Please Wait... × Login to your Watercolor profile Email Address * Password * Log In Forgot Password © 2025 Powered by Ez-Chow . Terms and Conditions Sorry, our online ordering website requires your browser's javascript to be enabled."
    },
    {
      "url": "https://www.watercolorresort.com/faq",
      "text": "FAQs | WaterColor Inn & Resort Instagram Tripadvisor Youtube Google Business facebook google_business skip to main content Subscribe Reservations Gallery Accommodations Guest Rooms Rotunda Suites 1-Bedroom Family Suites 2-Bedroom Family Suites Offers Dining Fish Out Of Water Gather Kitchen + Bar WaterColor Grill Costa Chica Beach Cow The Canteen In-Room Dining Experience Special Events Beach Life WaterColor Beach Club Camp WaterColor Amenities Town Center Recreation St. Joe Experiences Groups Meetings Weddings Home Catering Beach Setups Retail Location About Us Contact Us Awards Mountainfilm on Tour Gallery Accommodations Guest Rooms Rotunda Suites 1-Bedroom Family Suites 2-Bedroom Family Suites Offers Dining Fish Out Of Water Gather Kitchen + Bar WaterColor Grill Costa Chica Beach Cow The Canteen In-Room Dining Experience Special Events Beach Life WaterColor Beach Club Camp WaterColor Amenities Town Center Recreation St. Joe Experiences Groups Meetings Weddings Home Catering Beach Setups Retail Location About Us Contact Us Awards Mountainfilm on Tour Reservations: 1-866-426-2656 Beach Chair Setups: 1-888-775-2473 Hotel Information : (850) 534-5000 Stay Social Book now WaterColor Inn FAQs View Resort Map View 360 Tour Welcome to your stay at WaterColor Inn! To best provide you with all of the details you might need as you plan your visit, our team has drafted the following Frequently Asked Questions. You’ll also find plenty of information about our in-room amenities , dining , pools , recreational options , beach services , area attractions and more, including any timely updates on our website . For information specific to 30A and South Walton, including area events, attractions, beach safety and more, please click here . Should you have additional questions, or if we may assist you in any way, please don’t hesitate to contact us by emailing wciconcierge@stjoe.com General What are WaterColor Inn’s check-in and check-out times? WaterColor Inn’s check-in time is 4 p.m. While an early check-in may be requested, it cannot be guaranteed. Should you arrive early and your room becomes available before 4 p.m., the Concierge will send you a SMS text to notify you that your room is ready. In the meantime, our Guest Services team can assist you with Valet Parking and Luggage Storage. You will also be given full Resort Access upon your arrival to enjoy our amenities at your leisure while you wait. As well, the Inn Lobby and Beach Club restrooms are available for changing into your beach/pool clothes as needed. Check-out time is 11 a.m. You will have full Resort Access for the entire day of your departure. Our Guest Services team can assist with Luggage Storage as needed. Parking Where is parking for WaterColor Inn? As our guest, you will have the choice between valet or self-parking (both complimentary) in our secure parking lot located in front of WaterColor Inn. You will receive a hotel parking pass during check-in to place on your vehicle’s dashboard.  Paid parking spots are available throughout the WaterColor resort and is managed by the WaterColor Community Association.  You can also utilize the complimentary trolley stops (available seasonally) or request a pickup or drop-off to Camp WaterColor through the WaterColor Guest Services team at the Front Desk. Transportation Does WaterColor Inn provide shuttle service? No, but we do recommend several local shuttle and taxi services for airport transportation and for getting around the town. Please contact our Concierge at wciconcierge@stjoe.com for more information. Car rental services are also available at area airports. Please note that Uber and Lyft ride-shares are limited in the 30A area. What is the WaterColor Trolley? The WaterColor Multi-Passenger Trolley offers convenient transportation for guests throughout the WaterColor Resort community. Trolley service is available daily, from 9 AM – 7 PM, during peak season (March - Labor Day).  The trolley will stop at specific destinations throughout the resort, including WaterColor BoatHouse and Camp WaterColor; it requires guests to adhere to all road safety standards, including wearing seatbelts. Open beverages are prohibited while riding on the trolley and children 5 and under are required to be in a self-provided and properly-secured child restraint device as required by Florida law.  Guest are encouraged to download the WC Trolley App to request on-demand and point-to-point rides within WaterColor. This complimentary service is provided by the WaterColor Community Association and Trolley hours are subject to change. View WC Trolley Map | Download WC Trolley App Can I rent a golf cart at WaterColor Inn? You may rent a golf cart directly from the Electric Cart Company , the exclusive vendor for LSVs within the WaterColor Community. These can be parked overnight at WaterColor Inn (we have two designated parking spots with charging outlets). Any other rental company LSVs parked on property will be towed. Please note: there is a limit of 80 LSVs allowed for rental. If that limit is met, no additional golf carts may be rented. As such, we recommend that you book your cart(s) with as much notice as possible. Room Amenities Is WaterColor Inn ADA accessible? Yes. ADA-accessible rooms are located on every floor with elevator access. Pool Lifts are also available and ready for guests’ use upon their request. For guests needing ramp access down to the beach, there is an ADA accessible Western boardwalk located adjacent to the WaterColor Beach Club. Does WaterColor Inn offer complimentary WiFi? Yes. As our guest, you will have complimentary WiFi in your room as well as throughout the resort. Does WaterColor Inn offer pack-and-plays or cribs? While WaterColor Inn does not keep pack-and-plays or cribs on-site, our Concierge team can provide you with contact information for local rental companies that will deliver this equipment to your room. Does WaterColor Inn provide daily housekeeping services? Yes. Housekeeping services are provided daily. In the evening, our Housekeeping team also delivers our signature fresh-baked cookies to your room to help close out a special day. While housekeeping services are usually provided until 7 p.m., you may request additional supplies; such as, towels, toiletries, coffee pods, etc. at any time during your stay by contacting our Concierge team. What are \"Treat Suites\"? Treat Suites are guest amenity rooms that are stocked with complimentary snacks and treats, such as freshly ground coffee, hot cocoa, fresh fruit, soft drinks, popcorn, ice cream snacks and more.  These rooms are accessed with your room key card and are available 24 hours a day for all WaterColor Inn guests to enjoy.  Treat Suites are located outside the elevator on the 2nd, 3rd, and 4th floors. What special amenities can be delivered to my room before arriving? Prior to your arrival, you may request an Amenity Order Form from our Concierge team to order a special treat to be waiting in the room upon your arrival or delivered at a specific time. Options include chocolate-covered strawberries, bottles of wine, fruit-and-cheese platters and other selections made for all celebratory occasions. Please contact our Concierge at wciconcierge@stjoe.com to request the Amenity Request form. Can meals at WaterColor Inn be charged to my room during my stay? Yes. You may charge any meal within our Resort to your room by providing your last name and room number. Resort dining options include Room Service, Fish Out of Water, WaterColor Grill, Costa Chica, Beach Cow, The Canteen and Scratch Biscuit Kitchen. For a full list of WaterColor Inn dining options, click here. Pools How many pools does WaterColor Inn have? WaterColor Inn guests have access to 10 resort pools within the WaterColor Community: WaterColor Inn Family-friendly 2,800 sq. ft. pool WaterColor Beach Club Main pool with expanded seating and lounge areas, including private cabana rentals Second infinity pool with lounge seating (adults only) Third shallow pool on lower deck with zero-entry (ideal for younger children) Camp WaterColor (lifeguards on duty) Main Butterfly Pool with Monarch Slide Catepillar Pool (zero-entry, children's area with Skipper Slide) Lazy Lizard Pool (zero-entry, lazy river) WaterColor Resort pools (LakeHouse, Sand Hill, Dragonfly) Are WaterColor Inn’s pools heated? Yes. All of the pools in the WaterColor community are heated year-round, based on outdoor conditions and temperatures for guests’ enjoyment Does WaterColor Inn provide pool/beach towels? Yes. Complimentary beach towels are provided to WaterColor Inn guests at the hotel's pool deck, the WaterColor Beach Club entrace gate, or at Camp WaterColor .  We ask that you kindly return your towels to one of the many desginated towel return bins. Beach Services & Information Does WaterColor Inn provide beach setups? Beach setups are available for a daily fee (hotel guests received a discounted rate). Setups include two canvas chairs and a large shady umbrella. We advise that you reserve your beach setups in advance of your stay, especially during busier time periods. For your convenience, beach setups can be reserved through our beach setup reservations line at 1-888-775-2473 or online here . Beach setups must be cancelled prior to 48 hours from start of the setup reservations; no refunds are provided for inclement weather.  If advance beach setup reservations are sold out for your requested dates, guests can reserve a beach setup each morning directly at the end of the West Boardwalk beginning at 9 a.m. (first-come, first-served basis). What beach access do WaterColor Inn guests have? With 80 miles of impeccable beaches winding along the Gulf of Mexico, Northwest Florida’s Gulf Coast is one of the country’s most beautiful vacation destinations, and WaterColor Inn is the quintessential 30A beachfront hotel destination. As a guest, you’ll enjoy a variety of beach access points, inc luding an ADA-accessible ramp at the west boardwalk at WaterColor Beach Club. For more beach information, click here . Are there lifeguards on duty at the WaterColor beach? Yes. Professional lifeguard services are provided by the South Walton Fire Department daily from 10 AM to 6 PM (March 1 – October 31). Are beach bonfires allowed at WaterColor Inn? Beach Bonfire packages may be booked through WaterColor Inn with a 48-hour notice. Beach Bonfire setups include two hours of bonfire fun for up to 30 guests, including beach chairs, s’mores and bottled waters. Bonfires take place on the beach behind WaterColor Beach Club and WaterColor Inn. Click here for more information or contact WCBonfires@StJoe.com . Where can I stay up to date on area beach rules and safety? For information on beach safety in South Walton, click here . Resort Amenities Where is morning coffee and hot tea served? WaterColor Inn guests can start their day with a complimentary fresh-brewed coffee bar daily, from 5 - 11 AM, at Gather Kitchen + Bar (located adjacent to the main lobby).  Hot tea is also available. Does WaterColor Inn have a gym? Guest have access to our Cardio Room, located by the Lobby near the Inn Pool entrance. The Cardio Room is accessible 24/7 (your room key is required to enter). Does WaterColor Inn have a spa? No, but many of our guests visit Spa Pearl in nearby Rosemary Beach at our sister resort, The Pearl Hotel. There are also a variety of nail and hair salons in the area, with which our Guest Services team can connect you. Does WaterColor Inn offer bikes? Yes. You have access to two (2) complimentary adult bicycles. These can be checked out from our Guest Services team at any time upon your request. We encourage you to enjoy the wonderful biking trails located near the Western Lake/WaterColor BoatHouse area. Should you need more information on trails, please don’t hesitate to ask the Front Desk.  Children's bike rentals or specialty equipment may be rented on-site at the WaterColor Bike Barn located near the WaterColor Boathouse or you may contact our Concierge team for information to rent them in advance and delivered to the hotel. Does WaterColor Inn offer kayaks? Yes. You have access to one hour of complimentary kayaks at our nearby Watercolor BoatHouse . Please contact the BoatHouse Paddle Club at (850) 419-6188 with your preferred date/time. The BoatHouse also offers standup paddleboarding rentals at discounted rates for hotel guests.  Fitness classes and guide ecotours are also available (sign-up required). Are there nearby hiking trails? Of course! Nestled within 500 acres of sugar-white sand beach and surrounded by pine forests alongside Western Lake – a rare coastal dune lake – you’ll find plenty of beautiful natural trails to explore nearby. Click here to see our roundup of some of our favorite nearby natural sights. You’ll also find trails outside of the WaterColor community, too. Click here to explore more. Does WaterColor Inn have a nearby grocery store? There is a Publix supermarket within the WaterColor community, located at WaterColor Crossings (approximately 1.25 miles from WaterColor Inn). Publix also offers Instacart delivery, making it easy for your groceries to be delivered directly to the hotel, where our Guest Services team can bring them up to your room (each room has a mini fridge for your convenience). Another nearby option includes Modica Market , a New York-style grocer located in the town plaza (located in Seaside, 0.5 miles east of WaterColor Inn). Additionally, our FOOW Package Store (located directly below our FOOW restaurant) offers an extensive selection of local craft beers, wines and liquors. Safety & Security What safety and security policies should guests be aware of during their stay? All WaterColor Inn guests are expected to comply with the rules and guidelines set forth by the WaterColor Community Association while enjoying any resort amenity or spending time in the community. These measures are in place to ensure a safe and welcoming environment for all. Curfew Policy : Unaccompanied minors under the age of 18 are not permitted in common areas—including parks, trails, pools, and the Beach Club—between the hours of 10 PM and 5 AM. During peak times such as spring break and major holiday weekends, curfew enforcement begins earlier at 8 PM. Quiet Hours : Community-wide quiet hours are observed nightly from 10 PM to 7 AM. Guests are kindly asked to be mindful of their surroundings during this time. To familiarize yourself with community expectations, we encourage you to watch the WaterColor Community Guest Orientation Video prior to your stay. Contact Us Careers Terms of use Privacy + Cookie Policy Accessibility St. Joe Hotels Back to top Contact Us Careers Terms of use Privacy + Cookie Policy Accessibility St. Joe Hotels WaterColor Inn & Resort 34 Goldenrod Circle Santa Rosa Beach, FL, 32459 Reservations: 1-866-426-2656 Beach Chair Setups: 1-888-775-2473 Hotel Information: (850) 534-5000 Sign up for Our Hotel Offers Join Us Book Now"
    },
    {
      "url": "https://www.watercolorresort.com/about-us/contact-us",
      "text": "Contact WaterColor Inn & Resort | Santa Rosa Beach FL Hotel Instagram Tripadvisor Youtube Google Business facebook google_business skip to main content Subscribe Reservations Gallery Accommodations Guest Rooms Rotunda Suites 1-Bedroom Family Suites 2-Bedroom Family Suites Offers Dining Fish Out Of Water Gather Kitchen + Bar WaterColor Grill Costa Chica Beach Cow The Canteen In-Room Dining Experience Special Events Beach Life WaterColor Beach Club Camp WaterColor Amenities Town Center Recreation St. Joe Experiences Groups Meetings Weddings Home Catering Beach Setups Retail Location About Us Contact Us Awards Mountainfilm on Tour Gallery Accommodations Guest Rooms Rotunda Suites 1-Bedroom Family Suites 2-Bedroom Family Suites Offers Dining Fish Out Of Water Gather Kitchen + Bar WaterColor Grill Costa Chica Beach Cow The Canteen In-Room Dining Experience Special Events Beach Life WaterColor Beach Club Camp WaterColor Amenities Town Center Recreation St. Joe Experiences Groups Meetings Weddings Home Catering Beach Setups Retail Location About Us Contact Us Awards Mountainfilm on Tour Reservations: 1-866-426-2656 Beach Chair Setups: 1-888-775-2473 Hotel Information : (850) 534-5000 Stay Social Book now Contact WaterColor Inn & Resort Our Luxury Santa Rosa Beach Hotel Request Media Visit Thank you for your interest in the WaterColor Inn. If you require more information about the hotel, would like to make arrangements for an upcoming visit or have a comment or suggestion regarding a recent stay, please contact us and we will be happy to assist you. For social media collaborations and media visit requests, please complete our Media Visit Request Form . WaterColor Inn Room Reservations (888) 991-8878 | reservations@stjoe.com Concierge & Dining (850) 534-5000 | wciconcierge@stjoe.com Meetings, Events & Weddings (850) 231-7773 | sales@stjoe.com Press & Media (MMGY PR) stjoe@mmgy.com Request Media Visit WaterColor Inn Gift Cards Give a loved one, friend or colleague a wonderful gift in the amount of your choice. WaterColor Inn gift cards may also be used at the following WaterColor Inn & Resort locations:  Fish Out of Water, Gather Kitchen + Bar, WaterColor Grill, Costa Chica, Beach Cow and The Canteen. Visit our WaterColor Package Store , located on the lower level of Fish Out Water restaurant to arrange your gift card or call (850) 534- 5020 to purchase a gift card. Contact Us Careers Terms of use Privacy + Cookie Policy Accessibility St. Joe Hotels Back to top Contact Us Careers Terms of use Privacy + Cookie Policy Accessibility St. Joe Hotels WaterColor Inn & Resort 34 Goldenrod Circle Santa Rosa Beach, FL, 32459 Reservations: 1-866-426-2656 Beach Chair Setups: 1-888-775-2473 Hotel Information: (850) 534-5000 Sign up for Our Hotel Offers Join Us Book Now"
    },
    {
      "url": "https://www.watercolorresort.com/experience/beach-life",
      "text": "Experience | Things to Do in Santa Rosa Beach FL | WaterColor Inn Instagram Tripadvisor Youtube Google Business facebook google_business skip to main content Subscribe Reservations Gallery Accommodations Guest Rooms Rotunda Suites 1-Bedroom Family Suites 2-Bedroom Family Suites Offers Dining Fish Out Of Water Gather Kitchen + Bar WaterColor Grill Costa Chica Beach Cow The Canteen In-Room Dining Experience Special Events Beach Life WaterColor Beach Club Camp WaterColor Amenities Town Center Recreation St. Joe Experiences Groups Meetings Weddings Home Catering Beach Setups Retail Location About Us Contact Us Awards Mountainfilm on Tour Gallery Accommodations Guest Rooms Rotunda Suites 1-Bedroom Family Suites 2-Bedroom Family Suites Offers Dining Fish Out Of Water Gather Kitchen + Bar WaterColor Grill Costa Chica Beach Cow The Canteen In-Room Dining Experience Special Events Beach Life WaterColor Beach Club Camp WaterColor Amenities Town Center Recreation St. Joe Experiences Groups Meetings Weddings Home Catering Beach Setups Retail Location About Us Contact Us Awards Mountainfilm on Tour Reservations: 1-866-426-2656 Beach Chair Setups: 1-888-775-2473 Hotel Information : (850) 534-5000 Stay Social Book now Florida Beach Life Florida’s Emerald Coast Offers Popular Beaches & Watersports With 80 miles of impeccable beaches winding along the Gulf of Mexico, Florida's Emerald Coast is one of the country’s most beautiful vacation destinations. Its name is derived from the emerald-green hue of the water, which is a result of the sand – made of pure Appalachian quartz – reflecting the sunlight through the surf. Boasting a wide expanse of its own private beach, WaterColor Inn provides the perfect setting for your Emerald Coast adventure. Spend a day relaxing on the beach or at WaterColor Beach Club, or rent a paddleboard and go exploring. In the evening, gather with family and friends for a memorable beach bonfire, complete with s’mores! Guest of WaterColor Inn never have to go far to find the perfect way to enjoy their beach vacation. Please note that there is a ADA accessible ramp available on the west boardwalk at WaterColor Beach Club to access the WaterColor Beach. Click Here for information on Beach Safety in South Walton . Enjoy WaterColor Beach Views Anytime! The sugar-white sand and emerald-green water of WaterColor is only ever a click away. Tune into SoWal Beach Cams to see WaterColor Beach anytime you want – before, during or long after your trip. View Beach Cam-West View Beach Cam-East Beach Setups Sit back and relax with the convenience of our beach setups, which consist of two canvas chairs and a large shady umbrella. Due to tides and weather conditions, their placement may vary without notice. WaterColor Beach Setups are only available to guests renting in WaterColor Resort and may be booked online at your convenience; advance reservations are strongly recommended. All WaterColor Inn guests and WaterColor Homeowners receive $15 off the daily rate. Please call beach setup reservation line at 1-888-775-2473 or email reservations@stjoe.com to apply discount. For details on beach setup locations and pricing, please visit our Beach Setups page. If advance beach setup reservations are sold out for your requested dates, guests may reserve setups each morning at the West Boardwalk, beginning at 8 a.m. (first-come, first-served basis). Beach Bonfires Beach Bonfire packages include 2 hours of bonfire fun for up to 29 guests per bonfire. Beach chairs, s’mores, and bottled waters are provided. Bonfires take place on the beach behind WaterColor Beach Club and WaterColor Inn. We recommend bringing flashlights as there is no existing light on the beach after sunset due to sea turtle nesting. Additional food & beverage packages are available for purchase through our WaterColor Bonfire Team.  Please email WCBonfires@stjoe.com Before Sunset– $750* 6:00 - 8:00 PM 6:30 - 8:30 PM 7:00 - 9:00 PM After Sunset- $750* 7:30 - 9:30 PM *All additional fees and bonfire package pricing are subject to a 24% service charge and 7% tax. BOOK BEACH BONFIRE Policies: All bonfires must be booked with a 48-hour notice. 100% cancellation fee for any bonfire cancelled within 24 hours of event due to weather. A weather call must be made by 3 p.m. on the day of the bonfire. In the event that the contact cannot be reached to make the call and the forecast is greater than 60% chance of rain or winds of 10mph or greater, the beach club reserves the right to relocate the event to the designated backup space or cancel. There is no charge for a cancelled bonfire due to inclement weather. We reserve the right to use our discretion in the service of alcoholic beverages. No outside food or beverage is permitted. Glass is prohibited on the beach. WaterColor Beach Club (WCBC) The WaterColor Beach Club includes a main pool with seating and lounge areas, a second pool deck with lounge seating and a third pool with zero-entry – all with unobstructed views of the Gulf. Guests also have the chance to indulge in an array of resort dining venues, including Beach Cow , Costa Chica and the WaterColor Grill , which also serves the first- and second-level pool decks. Private access to the adjacent sugar-white sand beach and Gulf of Mexico is provided via a picturesque dune crossover, as well as an additional ADA accessible ramp available on the west boardwalk, located at WaterColor Beach Club. Visit our WaterColor Beach Club page to learn more. WaterColor Beach Club is a shared community amenity for WaterColor residents and guests of WaterColor Inn & Resort; it is not open to the general public. Water Sport Beach Rentals Water sport beach rentals are available at WaterColor Beach, based on weather conditions.  Reservations may be made directly on the beach. Please provide a copy of your driver’s license at time of rental.  In addition, a liability waiver will need to be signed by adults; children under the age of 18 will require an adult to sign. Rentals are available March 1 - December 1, from 9 a.m. - 3p.m. Rentals Rental Rates Surf Board $20 per hour Kayak $40 per hour Yolo Yak $30 per hour Paddle Board $40 per hour Boogie Board $15 per hour *rates do not include gratuities, service fees or tax; credit cards accepted; no cash. Contact Us Careers Terms of use Privacy + Cookie Policy Accessibility St. Joe Hotels Back to top Contact Us Careers Terms of use Privacy + Cookie Policy Accessibility St. Joe Hotels WaterColor Inn & Resort 34 Goldenrod Circle Santa Rosa Beach, FL, 32459 Reservations: 1-866-426-2656 Beach Chair Setups: 1-888-775-2473 Hotel Information: (850) 534-5000 Sign up for Our Hotel Offers Join Us Book Now"
    },
    {
      "url": "https://www.watercolorresort.com/groups/meetings",
      "text": "Meetings | Beach Event Venues Florida | WaterColor Inn Instagram Tripadvisor Youtube Google Business facebook google_business skip to main content Subscribe Reservations Gallery Accommodations Guest Rooms Rotunda Suites 1-Bedroom Family Suites 2-Bedroom Family Suites Offers Dining Fish Out Of Water Gather Kitchen + Bar WaterColor Grill Costa Chica Beach Cow The Canteen In-Room Dining Experience Special Events Beach Life WaterColor Beach Club Camp WaterColor Amenities Town Center Recreation St. Joe Experiences Groups Meetings Weddings Home Catering Beach Setups Retail Location About Us Contact Us Awards Mountainfilm on Tour Gallery Accommodations Guest Rooms Rotunda Suites 1-Bedroom Family Suites 2-Bedroom Family Suites Offers Dining Fish Out Of Water Gather Kitchen + Bar WaterColor Grill Costa Chica Beach Cow The Canteen In-Room Dining Experience Special Events Beach Life WaterColor Beach Club Camp WaterColor Amenities Town Center Recreation St. Joe Experiences Groups Meetings Weddings Home Catering Beach Setups Retail Location About Us Contact Us Awards Mountainfilm on Tour Reservations: 1-866-426-2656 Beach Chair Setups: 1-888-775-2473 Hotel Information : (850) 534-5000 Stay Social Book now Meeting Venues Enjoy a Memorable Group Experience at Our Resort PLAN YOUR EVENT Overlooking the Gulf of Mexico in Santa Rosa Beach, Florida, WaterColor Inn provides an unforgettable setting for meetings and group events. Tucked between the soft, white sands of a private beach and a coastal dune lake framed by a longleaf pine forest, our nearly 500 acres of coastal beauty – combined with 5,500+ square feet of flexible indoor function space – provides an inspiring backdrop for connecting with your guests. WaterColor Inn & Resort is the ideal setting for executive board meetings, client events, corporate retreats and incentive programs for 50 or more guests. Our experienced team ensure a signature occasion with professional execution, carefully crafted cuisine, local activities and beautifully designed venues that will bring your vision to life. PLAN YOUR EVENT Each event we host enjoys: Exquisite Indoor and outdoor venues Complimentary Wi-Fi in all rooms, suites and social areas Expert Event Staff Customized catering menus featuring gourmet cuisine The latest audiovisual arrays and professional technical support Creative teambuilding and recreational opportunities through our preferred DMC provider Group rates for meeting guests staying at the hotel To learn more about hosting your company event at WaterColor Inn, please email Sales@stjoe.com or call (850) 231-7773 . Event Venues WaterColor® LakeHouse 3700.00 Sq. Ft Max Capacity 300 people The sky is the limit in this breathtaking venue with cedar-lined walls and large windows featuring views of Western Lake and a fully equipped catering kitchen.  The WaterColor Lakehouse is the perfect venue for a meeting or special gathering. View Venue Detail WaterColor® BoatHouse 1839.00 Sq. Ft Max Capacity 160 people Full of rustic charm, there is no need to wear a tie at this timeless cottage-style venue overlooking Western Lake. Its distinctive and comfortable layout makes it ideal for separate meal functions, welcome receptions and special dinners, as well as for fun teambuilding events looking to add a little personality. View Venue Detail Marina Park North 17712.00 Sq. Ft Max Capacity 450 people This open greenspace – the largest within the WaterColor® resort – provides a blank canvas that allows for your event to be centerstage. The options are only limited by your imagination! With a charming walkover bridge and a sweeping view of Western Lake, Marina Park is a stunning setting for any outdoor event and can be tented for up to 400 people. View Venue Detail Marina Park South 9152.00 Sq. Ft Max Capacity 450 people This open greenspace – the largest within the WaterColor® resort – provides a blank canvas that allows for your event to be centerstage. The options are only limited by your imagination! With a charming walkover bridge and a sweeping view of Western Lake, Marina Park is a stunning setting for any outdoor event and can be tented for up to 400 people. View Venue Detail Request for Proposal Contact Details Ms. Mr. Mrs. Dr. Title * First Name * Last Name * Email Address * Organization or Company Job Title * Phone Address City Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming State Zipcode * This RFP is being sent on behalf of a client as a professional planner. Yes No * Commissionable Yes No Step 1/2 Next Event Details * Event Name Organization or Company * Arrival * Departure Yes No My dates are flexible Yes No Will your guests need overnight accommodations? # of Guest rooms needed Yes No * Will you require event space? # of Guests expected Additional Details or Comments Upload document GDPR Notice - I consent to having this website store my submitted information so they can respond to my inquiry. Back Step 2/2 SUBMIT Contact Us Careers Terms of use Privacy + Cookie Policy Accessibility St. Joe Hotels Back to top Contact Us Careers Terms of use Privacy + Cookie Policy Accessibility St. Joe Hotels WaterColor Inn & Resort 34 Goldenrod Circle Santa Rosa Beach, FL, 32459 Reservations: 1-866-426-2656 Beach Chair Setups: 1-888-775-2473 Hotel Information: (850) 534-5000 Sign up for Our Hotel Offers Join Us Book Now"
    },
    {
      "url": "https://www.watercolorresort.com/groups/weddings/weddings-gallery",
      "text": "Weddings Gallery | WaterColor Inn & Resort Instagram Tripadvisor Youtube Google Business facebook google_business skip to main content Subscribe Reservations Gallery Accommodations Guest Rooms Rotunda Suites 1-Bedroom Family Suites 2-Bedroom Family Suites Offers Dining Fish Out Of Water Gather Kitchen + Bar WaterColor Grill Costa Chica Beach Cow The Canteen In-Room Dining Experience Special Events Beach Life WaterColor Beach Club Camp WaterColor Amenities Town Center Recreation St. Joe Experiences Groups Meetings Weddings Home Catering Beach Setups Retail Location About Us Contact Us Awards Mountainfilm on Tour Gallery Accommodations Guest Rooms Rotunda Suites 1-Bedroom Family Suites 2-Bedroom Family Suites Offers Dining Fish Out Of Water Gather Kitchen + Bar WaterColor Grill Costa Chica Beach Cow The Canteen In-Room Dining Experience Special Events Beach Life WaterColor Beach Club Camp WaterColor Amenities Town Center Recreation St. Joe Experiences Groups Meetings Weddings Home Catering Beach Setups Retail Location About Us Contact Us Awards Mountainfilm on Tour Reservations: 1-866-426-2656 Beach Chair Setups: 1-888-775-2473 Hotel Information : (850) 534-5000 Stay Social Book now WaterColor Weddings Gallery Picture Your Special Day... A stunning coastal setting, elegant touches, a variety of indoor and outdoor venues, delectable cuisine, an unforgettable backdrop… Wedding dreams really do come true at WaterColor Inn! From lush parks and lawns and coastal settings to rustic elegance and whimsical indoor venues, weddings at WaterColor Inn cater to every imagination and possibility. We believe your focus should be on the dreaming, so we invite you to picture your special day with this virtual photo album of some recent WaterColor Weddings… And when you’re ready to get to the doing, our team is here. Contact us at WaterColor Weddings or (850) 231-7773. Contact Us Careers Terms of use Privacy + Cookie Policy Accessibility St. Joe Hotels Back to top Contact Us Careers Terms of use Privacy + Cookie Policy Accessibility St. Joe Hotels WaterColor Inn & Resort 34 Goldenrod Circle Santa Rosa Beach, FL, 32459 Reservations: 1-866-426-2656 Beach Chair Setups: 1-888-775-2473 Hotel Information: (850) 534-5000 Sign up for Our Hotel Offers Join Us Book Now"
    },
    {
      "url": "https://www.watercolorresort.com/experience/recreation",
      "text": "Recreation | Things to Do in Santa Rosa Beach FL | WaterColor Inn Instagram Tripadvisor Youtube Google Business facebook google_business skip to main content Subscribe Reservations Gallery Accommodations Guest Rooms Rotunda Suites 1-Bedroom Family Suites 2-Bedroom Family Suites Offers Dining Fish Out Of Water Gather Kitchen + Bar WaterColor Grill Costa Chica Beach Cow The Canteen In-Room Dining Experience Special Events Beach Life WaterColor Beach Club Camp WaterColor Amenities Town Center Recreation St. Joe Experiences Groups Meetings Weddings Home Catering Beach Setups Retail Location About Us Contact Us Awards Mountainfilm on Tour Gallery Accommodations Guest Rooms Rotunda Suites 1-Bedroom Family Suites 2-Bedroom Family Suites Offers Dining Fish Out Of Water Gather Kitchen + Bar WaterColor Grill Costa Chica Beach Cow The Canteen In-Room Dining Experience Special Events Beach Life WaterColor Beach Club Camp WaterColor Amenities Town Center Recreation St. Joe Experiences Groups Meetings Weddings Home Catering Beach Setups Retail Location About Us Contact Us Awards Mountainfilm on Tour Reservations: 1-866-426-2656 Beach Chair Setups: 1-888-775-2473 Hotel Information : (850) 534-5000 Stay Social Book now Arrival Departure Rooms & Guests Adults field is required 1 Room - 1 Adults , 0 Children Rooms 1 Adults 1 Children 0 Book now Recreation Santa Rosa Beach Attractions & Watersports With nearly five hundred beachfront acres framed by the Gulf of Mexico, a coastal dune lake, a longleaf pine forest and a private white-sand beach, WaterColor Inn is the perfect gateway to exhilarating adventures. Rediscover what family time truly means as you explore our timeless vacation resort just steps from the warm, gentle surf. Spend glorious, sun-splashed days paddleboarding, kayaking, boating or fishing. As the sun sets, gather the family for a beach bonfire and s’mores roast or an outdoor movie. Whether you seek to speed your pulse or slow your heart rate to the unhurried rhythms of the Gulf Coast, each experience offers you the chance to enjoy the best of our pristine natural surroundings. Kayaks & SUP Rentals at WaterColor BoatHouse Explore more Kayaks & SUP Rentals at WaterColor BoatHouse The WaterColor BoatHouse, managed by The BoatHouse Paddle Club, offers several ways to explore the natural wildlife that inhabits our area on Western Lake, one of several coastal dune lakes in this area. The BoatHouse is open daily from 9 AM - 4 PM (seasonal hours apply) and is located directly on the banks of Western Lake; just a short walk from WaterColor Inn through Cerulean Park. WaterColor Inn guests have access to kayaks (one-hour complimentary rental(s) each day; based on availability and are not required to be reserved in advance. The BoatHouse also offers stand up paddleboarding (SUP), an easy-to-learn, low impact activity suitable for anyone from children to seniors wanting to to explore the natural beauty of WaterColor from a unique vantage point.  SUP rentals are available for a discounted fee for hotel guests. Be sure to check out a variety of classes being offered, including including Bootcamps, TRX Suspension, Girls Sweat, and more, as well as weekly nature kayak tours and rentals, and training classes for eFoil surfboards that guests can sign up for (additional fees apply). Visit BoatHouse Paddle Club or call (850) 419-6188 for additional information. Biking & Hiking Explore more Biking & Hiking Whether you have plans for a day of hiking or biking, the WaterColor Bike Barn staff will be happy to help out with maps and excursion information on the extensive woodland trail system, where you can explore miles of scenic nature trails on winding paths through preserved state park forests, picturesque gardens and around rare coastal dune lakes. Adjacent to the WaterColor BoatHouse, the Bike Barn is located at 533 Western Lake Drive; and provides bicycles of all sizes and bike trailers (two-kid capacity).  Call 1-866-651-1869 for more information. Pools Explore more Pools All WaterColor Inn guests have access to the following hotel and resort community pools: WaterColor Inn Hotel Pool- Enjoy a 2,800 sq. ft. zero-entry family pool with expanded pool deck. WaterColor Beach Club Pools (3)- The beach club boasts a main pool with expanded seating and lounge areas, a second adults-only infinity pool with lounge seating and a third pool with zero-entry – all with unobstructed views of the Gulf of Mexico. Camp WaterColor Pools (3)- Located within Camp WaterColor, guests have access to three pools:  Main Butterfly Pool with Monarch Slide, Caterpillar Pool (Zero-Entry, Children's Area with Skipper Slide) and the Lazy Lizard Pool (Zero-Entry, Lazy River).  Lifeguard on duty. Sandhill “Frog” Pool- This pool is a guest favorite, featuring giant mosaic fogs as fountains that cascade into the pool on two sides.  A fun place for kids to play in the fountain, this pool is centrally located in the Lake District and offers both sunbathing and shaded lounges. Dragonfly Pool- The perfect way to spend the day.  Beautifully detailed with ample room for sunbathing and swimming.  Enjoy the outdoor grilling area for evening BBQ’s and summer gatherings.  Located in the Crossings II District. Marina Pool- With Western Lake as a backdrop, the serene views and sounds of lake life will lull you to relax and unwind.  Take a leisurely kayak on the lake and then cool off under the canopy of palm trees.  Located in the Park District near the WaterColor LakeHouse and BoatHouse. For more information on WaterColor Resort Community Pools, CLICK HERE . Fitness Explore more Fitness WaterColor Inn guests and Watersound Club® Lifestyle members can enjoy special complimentary fitness sessions provided by the Watersound Club® Wellness Center team: Power Yoga | Wednesdays, 9:15- 10:15 AM (April- October) Join us on the WaterColor Inn pool deck for poolside Power Yoga with Registered Yoga Teacher (RYT) Heidi Fowler. Power Yoga is  a powerful, energetic form of Yoga where students move fluidly from one posture to the next, connecting breath to the movements while incorporating strength, flexibility, balance with both physical and mental stamina. Mats will be provided. Hotel guests may register by contacting the WaterColor Inn Front Desk at (850) 534-5000. Watersound Club® members may register 7 days prior to class time through the member app. *Should the temperature drop below 55 degrees or inclement weather prevent the class from being held outdoors, the location will be amended to the WaterColor LakeHouse. Please call ahead of the class or check member app for availability. Fishing Explore more Fishing Discover some of the most complex waterways and ecosystems in the world with several species of game fish, birds and reptiles. Pair its meandering creeks, underground springs and rare coastal dune lakes with the renowned saltwater offerings of the Gulf, and it provides anglers with a unique combination of fishing opportunities. Located in the heart of WaterColor’s Town Center, Old Florida Outfitters is home to the finest outdoor apparel and specializes in conventional, as well as fly-fishing and light tackle with a network of premiere guides. Whether you are a veteran fly-fisherman hunting Tarpon on the fly or a novice who is looking for a patient introduction to the sport, our partner, Old Florida Outfitters, will accommodate you. Their goal is to deliver an enjoyable, relaxing, productive day on the water.  For more information, call 850-534-4343 or visit their website . Tennis Explore more Tennis The WaterColor Tennis Center, managed by the WaterColor Community Association, is located in the heart of the WaterColor Community along Western Lake Drive. This premier facility offers five Har-Tru clay courts — including a stadium court with seating and three courts equipped with LED lighting — plus two dedicated pickleball courts for fast-paced fun. The on-site Pro Shop is stocked with essentials to elevate your game, from stylish tennis apparel and accessories to racquet and paddle rentals, tennis balls, and expert racquet stringing services. Whether you're gearing up for a friendly match or perfecting your serve, you’ll find everything you need right here. Call The WaterColor Tennis Center at (850) 231-3015, email watercolortennis@ccmcnet.com or visit their website for more information. For inquiries about private tennis lessons, please reach out to Drew Machholz, Tennis Center Director, at (303) 827-4059. Contact Us Careers Terms of use Privacy + Cookie Policy Accessibility St. Joe Hotels Back to top Contact Us Careers Terms of use Privacy + Cookie Policy Accessibility St. Joe Hotels WaterColor Inn & Resort 34 Goldenrod Circle Santa Rosa Beach, FL, 32459 Reservations: 1-866-426-2656 Beach Chair Setups: 1-888-775-2473 Hotel Information: (850) 534-5000 Sign up for Our Hotel Offers Join Us Book Now"
    }
  ]
}