{
  "fuentes": [
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://web.bulverdespringbranchchamber.com/list/member/devine-wine-bar-and-bistro-4302",
      "email": "office@bsbchamber.com"
    },
    {
      "url": "https://tastingdevinewheaton.com/",
      "email": "dave@lab6.com"
    },
    {
      "url": "https://tastingdevinewheaton.com/",
      "email": "hi@typemade.mx"
    },
    {
      "url": "https://www.brookswine.com/contact-us/",
      "email": "info@brookswine.com"
    },
    {
      "url": "https://www.theaustralianwinecompany.com/pages/contact-us",
      "email": "adam@theaustralianwinecompany.com"
    }
  ],
  "mails": [
    "adam@theaustralianwinecompany.com",
    "dave@lab6.com",
    "hi@typemade.mx",
    "info@brookswine.com",
    "office@bsbchamber.com",
    "sales@finewineliquors.com"
  ],
  "nombre_sitio": "weebly.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://web.bulverdespringbranchchamber.com/list/member/devine-wine-bar-and-bistro-4302",
      "text": "Devine Wine Bar and Bistro | WINE BAR | CATERING | COFFEE SHOP | RESTAURANT | RESTAURANT/MARTINI BAR Skip to content The Chamber Join Us/Benefits Awards and Recognitions Board Members & Staff Ambassadors Councils & Committees BSB Chamber Foundation Contact Us Chamber Programs Educational Initiatives Leadership Networking Public Service Events Signature Events Veteran Events Best of BSB Collette Travel Program Directories Member Directory BSB Community Deals 2021 Community Guide Business Resources Member Login News & Events Community Calendar Chamber Calendar News/Press Releases Chamber Blog Community Deals Ribbon Cuttings Newsletter Archive Gun Raffle Calendar Visit the Area Community Map Highway 46 Expansion History of the Area Flag Status Places to Eat Things to Do Places to Stay Relocation Resources Volunteer Opportunities Job Postings Devine Wine Bar and Bistro Categories WINE BAR CATERING COFFEE SHOP RESTAURANT RESTAURANT/MARTINI BAR 17130 Hwy 46 West, Suite 3-4 Spring Branch TX 78070 (830) 460-3317 Visit Website Hours: Tues & Wed  11 am – 9 pm, Thur & Fri  11 am – 10 pm, Sat noon - 9 pm, Closed Sunday & Monday Driving Directions: Located in the Faithville Park Shopping Center on Highway 46 West in Spring Branch. 30 miles from downtown San Antonio & 18 miles from New Braunfels About Us Devine Wine Bar features delicious food & desserts, an outstanding wine selection, and a full bar, complete with craft cocktails. Live music, wine tastings, events, private parties & catering. Rep/Contact Info Tina Zillmann × Close Tina Zillmann Phone: (830) 460-3317 Send an Email 17130 Hwy 46 West, Suite 3-4 Spring Branch TX 78070 Share × Print Email Facebook Twitter LinkedIn Pinterest Close Tell a Friend × Send Request Cancel © 2025 Bulverde Chamber of Commerce | Site by GrowthZone Get In Touch! phone (830) 438-4285 location 121 Bulverde Crossing Suite 115 Bulverde TX 78163 email Email Us Resources City of Bulverde City of Spring Branch BSB Fire and EMS BSB Economic Development Socialize Facebook Instagram YouTube Icon blog © 2025 Bulverde Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://tastingdevinewheaton.com/",
      "text": "Tasting deVine Tasting deVine\nCheers to 25 Years! Tasting deVine\nCheers to 25 Years! Tasting deVine\nCheers to 25 Years! Tasting deVine\nCheers to 25 Years! Enjoy Local Wine & Beer at a Wine Tasting Room in the Heart of Downtown Wheaton About Us Where it all began... Where it all began... Where it all began... Tasting deVine in Wheaton was opened as Lynfred Winery's first tasting room location outside of the winery in 1999; serving wines from Lynfred along with beer from local breweries, in a comfortable atmosphere. Wine & Beer Where it all began... Where it all began... Enjoy a wine tasting, wine by the glass or cold beer inside our tasting room or outside at our sidewalk seating, April through October. Join the Wine Club Where it all began... Join the Wine Club Membership has its benefits! 10% off all bottle purchases 20% off all case purchases Exclusive Sales & Special Member Events! September Tasting Tastings & Flights Change Monthly Tasting of 6 Wines Sauvignon Blanc 2024 Vinde City White Symphony 2024 Pinot Noir 2023 Teroldego 2022 Syrah 2019 Premium Wines Viognier 2019 Reserve & Merlot 2016 Reserve Enjoy by the glass or a 2 oz. taste Sweet Tasting Oktoberfest Mango Cherry Blueberry Sangria Blanc Sangria Rouge Local Craft Beers Enjoy a cold beer in a frosted glass or take it to-go Crystal Lake Brewing Co. Hoptopus - Imperial Hazy IPA Oktoberfest - German Style Lager Penrose Goofy Boots - Juicy Hazy IPA Lemon Seltz-Up Pink Lemonade Seltz-Up Summer Crush - Hazy IPA with Orange Zest Oktofest - Marzen Pollyanna Brewing Co. Lite Thinking - American Lager Summerly - Raspberry Wheat Ale Blind Corner Brewing Booter -  Hazy IPA XPA - Extra Pale Ale Go Brewing - NA New School Berry Sour Sunshine State Tropical IPA Specials Wine by the Glass & Tasting Specials Member Mondays Stock your wine rack! Wine Club Member's save 20% on bottles to-go each Monday! Wine Down Wednesday Enjoy $6 glasses of the Vinde City White, Vinde City Red, Rosé, Oktoberfest, Sangria Blanc & Sangria Rouge All Day! Thirsty Thursday ﻿ Join us on Thursdays for a Staff Pick of the Week! Each week one of our staff members will choose their favorite wine for our glass special! Follow our Instagram and/or Facebook to find out what we are pouring each week! September Glass & Flight Specials Spiced Apple Mule Pair the crisp Fall weather with a Spiced Apple Mule! Spiced Apple Wine, Apple Cider & Ginger beer, by the Glass for $14 ($12 members) (Available soon!) Teroldego Vertical Flight Taste 3 - 3oz pours of the Teroldego 2020, 2021 & 2022 side by side! Sample each vintage to discover your favorite! Flight of 3 for $14 ($10 members) Monthly Red Glass Special Each month we will choose a special wine to be featured all month at a discounted glass price! Enjoy the Merlot 2019 all month! (End of batch, get it before it's gone!) By the Glass for $10 ($8 members) Cheese Plates Compliment your wine or beer with a cheese plate Small Cheese Plate Three cheeses, grapes & crackers, sausage may be added Perfect for 1-2 Large Snack Plate Three cheeses, sausage, grapes, mixed nuts, crackers & pretzels Serves 2 - 4 Artisan Cheese Plate Three premium, aged cheeses, marinated olives & crackers Events 9/6 Live Music Event Details 9/6 Live Music Enjoy live music by Robbie Grabowski from 6-8pm while sipping on a glass of wine! Reserve a table by calling 630-752-9463. 9/10 Sip & Stitch Event Details 9/10 Sip & Stitch Wednesday, September 10th, 6-8pm Grab your yarn and thread and join us for a relaxing evening of crafting and sipping on wine! Call to reserv... Event Details 9/16 Perfume Blending Class Event Details 9/16 Perfume Blending Class Tuesday, September 16th, 6 pm A hands-on sensory journey, blending your own custom perfume in a beautiful roller ball bottle! $30 pp - RSVP R... Event Details 9/23 Bingo Game Night Event Details 9/23 Bingo Game Night Tuesday, September 23rd, 6:00pm Enjoy a fun night of playing bingo and sipping on wine! $20 pp includes 2 glasses of wine and a bingo card! Ear... Event Details 9/24 Wine of the Month Varietal Class Event Details 9/24 Wine of the Month Varietal Class Wednesday, September 24th, 6:00pm Sip and learn about the wines of the month! Our very own Dick Westall will guide your taste buds through d... Event Details More Events Join the Wine Club at Tasting deVine New Release Wine Club Members receive one bottle of the newly released wine, which alternates between red and white every month     $21.50 / month Red Wine of the Month Members receive the new red wine that is released every month $21.50 / month White Wine of the Month Members receive the new white wine that is released every month $21.50 / month Fruit Wine Club Members choose their 'club' wine from any of our 18 delicious fruit wines with a charge of $14 / month Sparkling Wine Club Members choose their 'club' wine from any of our Sparkling wines with a charge of $21.50 / month Premium Wine Club Members choose their 'club' wine from any of our Reserve or Port wines with a charge of $31.50 / month Member Benefits Include: 10% off bottle purchases 20% off case purchases (12 + bottles) Exclusive member events and SALES! Join 2 Clubs and receive a '2 glasses of wine for a penny' monthly coupon (Limit 1 per visit, Fruit Club excluded) Join today to enjoy the September Wines of the Month! The New Release and White Wine of the Month is the Symphony 2024. This vintage is 100% Symphony with grapes from Lodi, California. The Symphony has aromas of gardenia, tropical fruits, pineapple & passion fruit with a fruity & floral palate of lychee, grapefruit, mango, peach & guava juice. Enjoy with fish, spicy chicken or Asian cuisine. The Red Wine of the Month is the Teroldego 2022. This vintage of Teroldego is 92% Teroldego and 8% Petite Sirah grapes from Clarksburg, California. This full bodied wine has aromas of raspberry, cedar, cloves & earthy notes with a palate of blackberry, tart plum, vanilla, spices, dark chocolate & toasted oak. Pair this wine with lasagna, roast beef or aged cheeses. Photo Gallery Subscribe Sign up to hear from us about specials, sales, and events. Email Sign up Social Featured on WGN Celebrating our 25th Anniversary June 2024! Contact Us Contact Us Enjoy a glass! Don't just read about us, come on in and try our monthly wine tasting, local craft beers, special flights or enjoy a glass! Tasting deVine 127 West Front Street, Wheaton, IL 60187 630.752.9463 tastingdevine@gmail.com Hours Monday - Thursday: 11am - 8pm Friday - Saturday: 11am - 9pm Sunday: 12 - 8pm Send a Message Send a Message Name Email* This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Send Copyright © 2025 Tasting deVine - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.brookswine.com/contact-us/",
      "text": "Contact Us - Brooks Wine Skip to content See what’s on this month in the Tasting Room! Shop Riesling Pinot Noir Club Exclusives Other Wines Library Wines Brooks Swag Join Visit In the Tasting Room this Month Summer Tours and Special Tastings Brooks University Upcoming Events Private Events Travel with Brooks About Us Artisans in Residency Our Story Our People Our Impact Our Blog Take the Quiz My Account How can we help? We’re always here to answer your questions. Get in touch and one of our team members will get back to you as soon as possible. Customer Care For questions about orders, reservations, or general inquiries, email us at [email protected] and we’ll respond asap. For questions about wine clubs and shipping, get in touch with [email protected] or [email protected] . Trade & Media Looking for technical sheets and approved assets? You’ll find everything you need in our Brooks Tech Sheet folder . Partnerships Brands, influencers, and ambassadors wanting more information on partnering with Brooks, please reach out directly at [email protected] . Or, complete our form and we will respond by email shortly Skip Footer Visit Brooks Open daily 11:00 a.m. to 5:00 p.m. 21101 SE Cherry Blossom Lane Amity, OR 97101 Phone: (503) 435-1278 Email: [email protected] In the Tasting Room Book a Table Wine Tastings This Month Spring Tours and Special Tastings Upcoming Events Brooks Recipes Shop our wine All Wines All Red Wines All White Wines Find your perfect wine Wine Clubs Distributors Get to know us About Us Our Impact American Wine Story Strange Inheritance Jimi’s Legacy Series Our Blog Get help Contact Us Shipping & Returns Accessibility Statement Facebook Instagram X YouTube © 2025            Brooks Wine Privacy Policy | Terms and Conditions | Site by 5forests ↑ × Search Looking for a specific wine, experience, or story? Looking for a specific wine, experience, or story?"
    },
    {
      "url": "https://www.theaustralianwinecompany.com/pages/contact-us",
      "text": "Contact us – The Australian Wine Company Skip to content Pause slideshow Play slideshow Deliveries in The Netherlands and to countries across mainland Europe Deliveries in The Netherlands and to countries across mainland Europe Facebook Instagram LinkedIn Language English English Nederlands Deutsch . . . Site navigation The Australian Wine Company Search Search Search Account 0 Cart . . . Site navigation Close Search Search Home Wines Red Wines Australian Shiraz Australian Cabernet Australian Red Blends Australian Pinot Noir White Wines Australian Chardonnay Australian Semillon and Blends Regions New South Wales Canberra District Hunter Valley South Australia Adelaide Hills Barossa Valley Clare Valley Coonawarra Eden Valley McLaren Vale Langhorne Creek Victoria Geelong Yarra Valley Beechworth Western Australia Margaret River Great Southern Tasmania Winemakers New South Wales Brokenwood Tyrrells South Australia d'Arenberg Wines Ashton Hills Bondar Wines Fox Creek Wines Torbreck Glaetzer Wines Hardys Wines Head Henschke Langmeil Penfolds Penfolds Cellar Reserve Collection Petaluma wines Penley Estate Pikes RedHeads Shaw + Smith The Standish Wine Company Spinifex Wynns Coonawarra Estate Yalumba Heartland Wines Western Australia Domain Naturaliste Leeuwin Estate McHenry Hohnen Moss Wood Xanadu Wines Vasse Felix Churchview Estate Swinney Wines Cherubino Wines Nocturne Wines Victoria By Farr Mount Mary Vineyards Yering Station Yarra Yering Hoddles Creek Estate Giant Steps Tahbilk Winery Irrewarra Tasmania Tolpuddle Dalrymple Vineyards About Us & FAQ's News Search Search Subtotal €0,00 Check out Taxes included. Shipping and discount codes calculated at checkout. Your cart is currently empty. Home Wines Expand submenu Wines View all Red Wines Expand submenu Red Wines View all Australian Shiraz Australian Cabernet Australian Red Blends Australian Pinot Noir White Wines Expand submenu White Wines View all Australian Chardonnay Australian Semillon and Blends Regions Expand submenu Regions View all New South Wales Expand submenu New South Wales View all Canberra District Hunter Valley South Australia Expand submenu South Australia View all Adelaide Hills Barossa Valley Clare Valley Coonawarra Eden Valley McLaren Vale Langhorne Creek Victoria Expand submenu Victoria View all Geelong Yarra Valley Beechworth Western Australia Expand submenu Western Australia View all Margaret River Great Southern Tasmania Winemakers Expand submenu Winemakers View all New South Wales Expand submenu New South Wales View all Brokenwood Tyrrells South Australia Expand submenu South Australia View all d'Arenberg Wines Ashton Hills Bondar Wines Fox Creek Wines Torbreck Glaetzer Wines Hardys Wines Head Henschke Langmeil Penfolds Penfolds Cellar Reserve Collection Petaluma wines Penley Estate Pikes RedHeads Shaw + Smith The Standish Wine Company Spinifex Wynns Coonawarra Estate Yalumba Heartland Wines Western Australia Expand submenu Western Australia View all Domain Naturaliste Leeuwin Estate McHenry Hohnen Moss Wood Xanadu Wines Vasse Felix Churchview Estate Swinney Wines Cherubino Wines Nocturne Wines Victoria Expand submenu Victoria View all By Farr Mount Mary Vineyards Yering Station Yarra Yering Hoddles Creek Estate Giant Steps Tahbilk Winery Irrewarra Tasmania Expand submenu Tasmania View all Tolpuddle Dalrymple Vineyards About Us & FAQ's News Want to Know More About Australian Wines? If you would like further information about our wines and how they suit your style of drinking then please get in touch and we'd be happy to help you further in your selection adam@theaustralianwinecompany.com Get in Touch \"Close (esc)\" Are you 18 years or Older? No I'm not Yes I am Come back when you're older Sorry, the content of this store can't be seen by a younger audience. Come back when you're older. Oops, I entered incorrectly Get in Touch The Australian Wine Company would love to hear your comments, recommendations or if you would like to know more about our wines or just to chat about Australia and the wine industry please get in touch we'd be glad to help out The Australian Wine Company Diependaalse Drift 11, Hilversum 1213CM North Holland, The Netherlands +31 682 4090 61 adam@theaustralianwinecompany.com Customer Service Shipping Policy Refund Policy My account Menu Home Red Wines White Wines Terms of Service Refund policy About Contact us About us Wine Tastings Get in touch +31 682 4090 61 Follow us Facebook Instagram LinkedIn We accept Bancontact iDEAL Klarna Maestro Mastercard PayPal Shop Pay Visa © 2025\n              The Australian Wine Company Privacy Policy Terms of Service Powered by Shopify \"Close (esc)\" Contact us"
    }
  ]
}