{
  "fuentes": [
    {
      "url": "https://www.kuilsriviergolfclub.co.za/contact-us/",
      "email": "info@krgc.co.za"
    },
    {
      "url": "https://www.whittlebury.com/contact-us/",
      "email": "reception@whittlebury.com"
    },
    {
      "url": "https://www.sevenoaksgolf.com/contact-us",
      "email": "dpylinski@sevenoaksgolf.com"
    },
    {
      "url": "https://staffboard.com/",
      "email": "contact@staffboard.de"
    },
    {
      "url": "https://www.wekivagc.com/contactus/",
      "email": "tony.miller@golfgroupfl.com"
    },
    {
      "url": "https://www.wapicada.com/contact",
      "email": "info@wapicada.com"
    }
  ],
  "mails": [
    "contact@staffboard.de",
    "dpylinski@sevenoaksgolf.com",
    "info@krgc.co.za",
    "info@wapicada.com",
    "reception@whittlebury.com",
    "tony.miller@golfgroupfl.com"
  ],
  "nombre_sitio": "wekivagc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.kuilsriviergolfclub.co.za/contact-us/",
      "text": "Contact Us - Kuilsrivier Golf Club Skip to content Home Our Story Conferences / Events Facilities Catering Golf Greenfees Book your Tee Time Course Layout Professional Golf Lessons Junior Development Gallery Neon Photo Booth Ladies Cabernet Classic 24 Winelands classic 2021 Photobooth album classic 21 Members Zone Membership Fees Membership Benefits Greenfees Constitution Application Form Club News Letter Contact Us Home Our Story Conferences / Events Facilities Catering Golf Greenfees Book your Tee Time Course Layout Professional Golf Lessons Junior Development Gallery Neon Photo Booth Ladies Cabernet Classic 24 Winelands classic 2021 Photobooth album classic 21 Members Zone Membership Fees Membership Benefits Greenfees Constitution Application Form Club News Letter Contact Us Contact Us Contact us Get in touch and we’ll get back to you as soon as we can. We look forward to hearing from you! Have any questions? info@krgc.co.za Call us (021) 903 0222 Address Bottelary Road, Kuilsriver 7579 Interested in joining? Complete the form below Get in touch and we'll get back to you as soon as we can. We look forward to hearing from you! Name Phone Number Email Message Send Interested in hosting an Event? Complete the form below Get in touch and we'll get back to you as soon as we can. We look forward to hearing from you! Name Phone Number Email Please select Please Select Venue hire Golf day Catering can be arranged from our side… Please advise the type of meal you would like and we can quote specific. E.g. Spit Braai…. Etc. MEAL OPTIONS: Meal options 1.           Beef Lasagne, Greek Salad and cocktail roll 2.           Chicken Leg Quarter, Greek Salad and Garlic Potatoes 3.           Chicken Schnitzel served with cheese sauce and a Greek salad 4.            Other Message Send CONTACT US Email Address: info@krgc.co.za Phone: (021) 903 0222 Address: Bottelary Road Kuilsriver Cape Town Navigation Home Conferences / Events Golf Members Zone Contact Us Social media Facebook © 2019 Kuilsriver Golf Club. All Rights Reserved. This website uses cookies to ensure legal compliance on our website. Accept & Close"
    },
    {
      "url": "https://www.whittlebury.com/contact-us/",
      "text": "GOT HERE\n\t\t\t\tArray\n(\n    [strictly_necessary] => Array\n        (\n        )\n\n    [functional] => Array\n        (\n        )\n\n    [performance_analytics] => Array\n        (\n        )\n\n    [advertisement_targeting] => Array\n        (\n        )\n\n    [gtm] => Array\n        (\n            [0] => Google Tag Manager (Head)\n            [1] => [2] => on\n        )\n\n) Contact Us - Whittlebury Park We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept”, you consent to the use of ALL the cookies. View Options Accept All Close Cookie Preferences This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. View More Show Less View our Cookie Policy Accept All Strictly Necessary Always Enabled We use necessary cookies to ensure our website works properly and provide essential functionalities and security features. These cookies do not collect any personal information and are always enabled. By continuing to use our website, you agree to our use of these cookies. V:2 - 2025-04-29 01:28:12pm Functional Disabled Enabled Functional cookies enable specific functionalities such as social media sharing, feedback collection, and other third-party features. These cookies may collect anonymous data to improve user experience. V:2 - 2025-04-29 01:28:12pm Performance and Analytics Disabled Enabled To enhance user experience, we use performance and analytical cookies to understand and analyze the key performance indexes of our website. Performance cookies help us deliver better user experiences by tracking metrics such as load times and response times. Analytical cookies help us understand how visitors interact with our website by providing information on metrics like the number of visitors, bounce rate, traffic source, and more. Cookie _ga_*ID* Duration 2 years Description ID used to identify users Vendor Google Analytics Privacy Policy https://policies.google.com/privacy Cookie _ga Duration 2 years Description ID used to identify users Vendor Google Analytics Privacy Policy https://policies.google.com/privacy V:2 - 2025-04-29 01:28:12pm Advertisement and Targeting Disabled Enabled To personalize your online experience, we use advertisement cookies that track your activity across websites and gather information to display relevant ads and marketing campaigns. These cookies help us tailor our advertising to your interests and preferences. Cookie _gcl_au Duration 3 months Description Used by Google AdSense for experimenting with advertisement efficiency across websites using their services. Vendor Google Privacy Policy https://policies.google.com/privacy V:2 - 2025-04-29 01:28:12pm Reject All Accept Selected Powered by UP Hotel Agency Skip to content Menu Stay Spa Packages Christmas Shop Contact Book General Contact Us If you need to contact us for any reason please use the form below Continue Contact Us Form Name (Required) First Last Email (Required) Telephone (Required) Postcode (Required) Postcode Type of enquiry (Required) Hotel Meetings & Events The Day Spa The Leisure Club Dining Press Tribute Nights & Events Lost Property Weddings Comments (Required) CAPTCHA Have you viewed our essential information pages? Spa Spa Essential Information View here The Leisure Club The Leisure Club Essential Information View here Golf Golf Essential Information View here Motorsport Camping Essential Information View here Stays Room Information View here Dining Dining Options View here Customer Service Telephone Numbers Need to get in touch? Please note our reservation hours are: Monday – Sunday, 9:00am – 10:00pm Hotel and Dining reservations: 01327 850 489 Spa reservations: 01327 850 489 Conference and Events: 01327 850 490 Silverstone Hospitality Packages: 01327 850 438 Tribute Nights: 01327 850 489 The Leisure Club: 01327 850 450 Christmas reservations: 01327 850 490 Hotel reception and Guest Relations: 01327 857857 General Where to find us Whittlebury Park is easily accessible no matter what your preferred method of transport is, whether it be road, rail, or air. Situated in the heart of the country and within minutes of the M1 and M40, perfectly placed between London and Birmingham. Plus with 650 car park spaces, parking is extensive and complimentary for guests. Find us General Newsletter sign-up Be the first to hear about our news & offers, straight to your inbox. Sign-up Follow Us Whittleburypark instagram Stay in touch for the latest News & Offers By signing up, you agree to the Terms & Conditions and would like to be added to the mailing list. Useful Links Blog Contact Us Where to find us Careers Donations Sign-up to our newsletter Hotel Rooms & Suites Hotel Breaks Spa Breaks Golf Breaks Family Breaks Spa Spa Days Spa Breaks Treatments Spa & Leisure Facilities Essential Information Golf Book a tee time TopTracer Driving Range Groups & Society Memberships Packages Courses & Facilities Essential Information Contact us Whittlebury Park Whittlebury, Near Towcester Northamptonshire NN12 8QH T: 01327 857857 E: reception@whittlebury.com Legal Cookie Control Privacy Policy Terms & Conditions Accessibility facebook instagram linkedin © Whittlebury Hall and Spa Limited, Registered Number: 7839199. V.A.T. Registration Number: 257 6855 56 The Atrium, Whittlebury Park, Whittlebury, Towcester, Northamptonshire, NN12 8WP Website by Up Hotel Agency Make a Booking Close Package Finder Breaks Spa Day Packages Gift Cards Treatments Tee Times TopTracer Driving Range Small Meeting Rooms Afternoon Tea Murrays Day & Stay Packages Whittlebury Gift Cards Sign-up to our newsletter Contact Us Stay Spa Golf Dining Meeting & Events Weddings & Occasions Package Finder Shop Christmas The Leisure Club What's On Motorsports Go Back Hotel Breaks Spa Breaks Golf Breaks Family Breaks Rooms & Suites Go Back Spa Days Spa Breaks Treatments Spa & Leisure Facilities Essential Information Go Back Book a Tee Time TopTracer Driving Range Golf Membership Groups & Society Golf Packages Courses & Facilities Go Back Afternoon Tea Murrays Astons Restaurant Silverstone Bar Sunday Lunch Atrium Clubhouse & Driving Range Go Back Book a small meeting space Our Spaces Team Building Meet the Team Go Back Dry Hire Wedding Packages Enquire about our Weddings Go Back Spa Days Spa Breaks Hotel Breaks Family Breaks Golf Breaks Autumn at the Park Go Back Whittlebury Gift Cards Afternoon Tea For Two People Murrays Tasting Menu for Two People 18 Holes of Golf for Two People 3-Course Sunday Lunch for Two People Go Back Christmas Party Nights Christmas Three-Night Stay New Year's Eve Gala Ball Winter Spa-kle Retreat Go Back Facilities Membership Classes Timetable Essential Information Refer a friend Go Back Retro Electro 80s Murder Mystery Go Back British Grand Prix MotoGP Silverstone Festival Close 01327 857857 reception@whittlebury.com Whittlebury Park Whittlebury, Near Towcester Northamptonshire NN12 8QH Day & Stay Packages Whittlebury Gift Cards Sign-up to our newsletter Contact Us facebook instagram linkedin This browser is no longer supported In order to have the best experience, please update your browser. If you choose not to update, this website may not function as expected. Clicking the button below will help you to update your browser. Update Your Browser Continue Without Updating Close"
    },
    {
      "url": "https://www.sevenoaksgolf.com/contact-us",
      "text": "Contact Us, Directions | Seven Oaks Golf Club at Colgate University COLGATE UNIVERSITY | 315-824-1432 | CONTACT US Skip to main content Golf Download Our App Book A Tee Time Golf Rates Our History The Course Practice Facility Rules & Regulations Download Our App Book A Tee Time Golf Rates Our History The Course Practice Facility Rules & Regulations Join Students Events Outings Lessons Golf Instruction & Clinics Coaches Corner Golf Instruction & Clinics Coaches Corner Store Gift Cards Merchandise Gift Cards Merchandise Search Close Search Keyword Search Search Keyword Search 52° Wed 09/10 clear sky 72°/47° Thu 09/11 clear sky 71°/50° Fri 09/12 clear sky 72°/51° Book A Tee Time Contact Us Get in touch or find driving directions to Seven Oaks Golf Club at Colgate University. X CONTACT INFORMATION ADDRESS 2 E Lake Rd (East Lake & Payne Streets) Hamilton, NY 13346 PHONE Golf: 315.824.1432 Restaurant: 315.824.4420 FEEDBACK Comments & suggestions welcome Call 1.888.986.0699 to share comments HOURS OF OPERATION Currently Closed GET IN TOUCH OR FIND US Please submit your inquiry and a member from our team will in touch or utilize the map below for directions. We hope to see you soon! CONTACT US FORM First Name Last Name Email Phone Subject Message Submit MEET THE TEAM DALLAS C. PYLINSKI, PGA Director of Golf Email Dallas TYLER COWEN Assistant Golf Professional GOLF IS CALLING YOUR NAME Designed by the Legendary Robert Trent Jones Sr. Seven Oaks is a must play. PLUS avoid booking fees when you book direct! Book A Round MANAGED BY QUICK LINKS The Course Online Store Careers at Seven Oaks Colgate University Colgate Athletics Colgate Inn CONTACT US Golf: 315.824.1432 Restaurant: 315.824.4420 Submit an Inquiry facebook instagram twitter ADDRESS 2 E Lake Road Hamilton, NY 13346 Get Driving Directions PLAY GOLF CALL 315.824.1432 OR Book A Tee Time JOIN OUR EMAIL LIST SUBSCRIBE TO GET THE LATEST NEWS AND OFFERS I consent to receive emails from Seven Oaks Golf Club. I can unsubscribe anytime. Email Thank you for subscribing. Enter Another Email Subscribe Copyright © 2025. Seven Oaks Golf Club at Colgate University. All Rights Reserved. Privacy Policy Terms of Use Accessibility Sitemap"
    },
    {
      "url": "https://staffboard.com/",
      "text": "staffboard HR Software [has_children] [de] Dashboard [child] [de] HR-Exzellenz-Dashboard Recruiting (ATS) [child] [de] Gestalten Sie bewusst die Zukunft Ihrer Organisation! Digitale Personalakte [child] [de] Mit der digitalen Personalakte haben Sie die Daten Ihrer Mitarbeiter immer im Blick Abwesenheitsmanagement [child] [de] Organisieren Sie übersichtlich & schnell Ihre Abwesenheiten Feedback & Performance [child] [de] Fördern Sie aktiv die persönliche Entwicklung Ihrer Mitarbeiter durch konstruktives Feedback Learning [child] [de] Planen Sie die Weiterentwicklung Ihrer Mitarbeiter Zeiterfassung [child] [de] Optimieren Sie die HR-Zeiterfassung Lohnabrechnung [child] [de] Mit dem Modul für Lohn & Gehalt erhalten Sie eine guten Überblick für die nächste Lohnabrechnung. Organigramm [child] [de] Visualisieren die Hierarchie und Struktur Ihres Teams Preise [de] Reports [child] [de] Gewinnen Sie wertvolle Einblicke in Ihre Belegschaft mit anpassbaren Berichten, Echtzeitanalysen und Datenvisualisierungstools. HR Insights [de] Unternehmen [has_children] [de] Unternehmen [child] [de] Kooperationspartner [child] [de] Karriere [child] [de] FAQ [child] [de] Kontakt [de] Login [de] HR Software [has_children] [en] Dashboard [child] [en] HR Excellence Dashboard Recruiting (ATS) [child] [en] Consciously shape the future of your organization! Digital Personnel File [child] [en] With the digital personnel file, you always have an overview of your employees' data Absences [child] [en] Organize your absences clearly and quickly Feedback & Performance [child] [en] Actively promote the personal development of your employees through constructive feedback Learning [child] [en] Plan the development of your employees Time Tracking [child] [en] Streamline HR Time Tracking Payroll [child] [en] The module for wages and salaries gives you a good overview for the next payroll. Orgchart [child] [en] Visualize your team's hierarchy and structure Pricing [en] Reports [child] [en] Gain valuable insights into your workforce with customizable reports, real-time analytics, and data visualization tools. HR Insights [en] Company [has_children] [en] About Us [child] [en] Partners [child] [en] Career [child] [en] FAQ [child] [en] Contact [en] Login [en] DE EN ONLINE DEMO BUCHEN Die HR Software für Unternehmensgestalter Ihr Copilot im HR Team Mit staffboard gestalten Sie Ihr Personalwesen nach den Bedürfnissen Ihrer Organisation. Sie schaffen mehr Zeit und Transparenz für Ihr Team, in einer modernen HR Software. JETZT KOSTENLOS TESTEN Good Bye, Papier Chaos! Herzlich Willkommen, Digitale Personalakte! Mit Hilfe der digitalen Mitarbeiterverwaltung können Sie alle Informationen über Ihre Mitarbeiter übersichtlich an einem Ort abspeichern. Suchen Sie mühsam nach Arbeitsverträgen, Attesten oder sonstigen Mitarbeiterdokumenten und verlieren dadurch wertvolle Zeit? Mit unserer Digitalen Personalakte finden Sie alles auf einen Blick im Mitarbeiterprofil. Dank des Employee Self Service (ESS) können zahlreiche Daten eigenständig von den Mitarbeitern gepflegt werden. So sparen Sie Zeit, Geld und natürlich Nerven für andere wichtige Themen. Bewerbermanagement leicht gemacht Mit unserem übersichtlichen Recruiting Modul verlieren Sie nie mehr einen Bewerber aus den Augen. Durch intuitives Drag & Drop können Sie ihre Bewerber schnell durch die Phasen Ihres individuellen Bewerbungsprozesses leiten. Eingangsbestätigungen werden automatisiert versendet und personalisierte Terminvereinbarungen oder Absagen sind mit einem Klick möglich. Viele Funktionen wie das Abgeben von Bewertungen für Bewerber, schreiben von Kommentaren und die Einbindung weiterer Teammitglieder sind problemlos möglich. STAFFBOARD 30 TAGE KOSTENLOS TESTEN! JETZT ANMELDEN Eine kleine Auswahl unserer treuen Kunden. \"Wir sind an dem Punkt, an dem wir ohne dieses Tool schlicht nicht arbeiten könnten.\" Jakob Schoroth (Reparando GmbH) Managing Director ✔️ staffboard wurde in Deutschland gegründet und hat seinen Hauptsitz in München. ✔️ Die Daten werden ausschließlich in Deutschland verarbeitet und verschlüsselt gespeichert. ✔️ Regelmäßige Updates und Backups sorgen für größtmögliche Sicherheit. Zudem liegen ISO-Zertifizierungen der Hosting Provider vor. ✔️ Die staffboard HR Software und die Daten werden in Rechenzentren in Deutschland gehostet. ✔️ Unternehmen mit dem Siegel hinterlegen beim BITMi e.V. den Standard ihrer Maßnahmen bzgl. Datenschutz. ✔️ Für den Vertrag mit den Hosting Provider gilt ausschließlich deutsches Recht, insbesondere das deutsche Datenschutzrecht, das BGB und das HGB. ✔️ Wir unterliegen der Kontrolle eines externen und unabhängigen Datenschutzbeauftragten. ✔️ Eine AV-Vereinbarung mit jedem Kunden gewährleistet Datenschutz und Datensicherheit. ✔️ Unsere Mitarbeiter sind im Umgang mit sensiblen, personenbezogenen Daten geschult und erhalten regelmäßige Unterweisungen. ✔️ 100% Service: Bei Fragen zum Produkt finden Sie stets einen deutschsprachigen Ansprechpartner. ✔️ 100% Qualität: Die in Deutschland designte staffboard HR Software wird auch in Deutschland getestet. ✔️ 100% Zukunft: Die staffboard HR Software ist investitionssicher und wird kontinuierlich weiterentwickelt und aktualisiert. Melden Sie sich für unseren Newsletter an, um regelmäßig über neue Funktionen und Produkt Updates informiert zu werden. Registrien Email sent! Check your inbox to complete your signup. Digitalisieren Sie Ihre HR Prozesse Unsere staffboard HR Software automatisiert und vereinfacht alle wesentlichen Personalprozesse. Dashboard Recruiting (ATS) Digitale Personalakte Abwesenheitsmanagement Feedback & Performance Learning Zeiterfassung Lohnabrechnung Organigramm Reports Kostenlos & unverbindlich Tage testen * Ich akzeptiere die Datenschutzbestimmungen und die AGB . Jetzt anmelden Benutzerfreundlich Unser intuitives Design ermöglicht eine steile Lernkurve ohne große Einarbeitung. Flexibel Jedes Unternehmen ist anders – und das wissen wir. Darum lässt sich staffboard an Ihre Anforderungen anpassen. Online Greifen Sie von überall mit einer verschlüsselten Verbindung auf staffboard zu. SUPPORT Allgemeine Fragen zum Produkt? 089 - 1250 1458 contact@staffboard.de Für technischen Support innerhalb der Software steht Ihnen ein Ticketsystem zur Verfügung. UNTERSTÜTZER & PARTNER Karriere [de] Impressum [de] Datenschutz [de] AGB [de] Career [en] Imprint [en] Privacy Policy [en] Terms & Conditions [en] 2025 © staffboard | Ihr Copilot im HR Team"
    },
    {
      "url": "https://www.wekivagc.com/contactus/",
      "text": "Contact Us - Wekiva Golf Club Skip to main content Skip to primary sidebar Skip to footer Wekiva Golf Club Home Tee Times Book a Tee Time Course Course Details Rates Scorecard Course Photos Facilities ⛳ Junior Golf Programs at Wekiva Golf Club Events Host with Us! Banquets Memberships Contact Us Join our E-Club Text Club E-Club Signup Welcome to Wekiva Golf Club! Site Tagline Right Book Online Now! Contact Us Contact Us Wekiva Golf Club 4100 Wekiva Club Court, Longwood, Florida 32779 Tony Miller PGA Phone : (407) 862-5113 Email : tony.miller@golfgroupfl.com Map and Directions From I-4, East Take the exit 94 for State Hwy 434 toward Longwood/Winter Springs Turn left at FL-434/Sanlando Springs Rd/SR-434/W State Rd 434. Continue to follow FL-434/SR-434/W State Rd 434 (go 1 mile) Turn right at SR-434/Wekiva Springs Rd (go 3.3 miles Turn left at N Hunt Club Blvd (go 1.1 miles) Turn right at Wekiva Club House Dr Primary Sidebar Course News Welcome to Wekiva Golf Club! Come check out the Wekiva Grill Room Hours are Monday-Sunday 9-5pm --------------------------------------------------- Ladies Clinic Every Saturday from 10-11AM --------------------------------------------------- Footer A Down to Earth managed facility Wekiva Golf Club | 4100 Wekiva Club Court | Longwood, FL 32779 | 407-862-5113 Copyright © 2025 Wekiva Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.wapicada.com/contact",
      "text": "Contact Us - Wapicada Golf Club Get In Touch Name: Email: Message: Thank you! Your submission has been received! Oops! Something went wrong while submitting the form OURÂ COURSE Course Rates Course Tour Book Tee Time TEEÂ TIME Weddings LEAGUE EVENTS PHOTOS CONTACT CONTACTÂ Â US Employment Application LET'SÂ CHAT If you have questions not addressed in the information sections contained in this website, or need to arrange a wedding or party consultation, you can reach us by using the contact form below. Brad Deyak General Manager (320) 251-7804 ext. 2 info@wapicada.com Join Our Team If you would like to apply please fill out the form below and drop off at the course. Name: Email: PHONE: Message: Thank you! Your submission has been received! Oops! Something went wrong while submitting the form Call Today (320) 251-7804 4498 15th Street NE Sauk Rapids, MN 56379 Created by Jive Â© 2010 - 2025 Wapicada. All Rights Reserved."
    }
  ]
}