{
  "fuentes": [
    {
      "url": "https://westchestercc.com/contact/",
      "email": "info@westchestercc.com"
    },
    {
      "url": "https://counselingcenter.org/contact/",
      "email": "ccoffice@counselingcenter.org"
    },
    {
      "url": "https://westchestercc.com/request_membership/",
      "email": "info@westchestercc.com"
    },
    {
      "url": "https://westchestercc.com/course-details/",
      "email": "info@westchestercc.com"
    },
    {
      "url": "https://www.westchestercc.org/golf/golf-professionals",
      "email": "bhoffhine@westchestercc.org"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "email": "contact@clubcarwash.com"
    },
    {
      "url": "https://westchestercc.com/",
      "email": "info@westchestercc.com"
    },
    {
      "url": "https://westchestercc.com/rates/",
      "email": "info@westchestercc.com"
    }
  ],
  "mails": [
    "bhoffhine@westchestercc.org",
    "ccoffice@counselingcenter.org",
    "contact@clubcarwash.com",
    "info@westchestercc.com"
  ],
  "nombre_sitio": "westchestercc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://westchestercc.com/contact/",
      "text": "Contact Us - Westchester Country Club Home Golf Course Details Rates Lessons Dining The W Steakhouse The W Grill Room W Food Truck Memberships Driving Range Event Hosting Event Info Weddings Contact Contact Us Job Opportunities Select Page Contact Us Westchester Country Club  Call Us 561-369-1000  Email Us [email protected]  Find Us 12250 Westchester Club Dr, Boynton Beach, FL 33437 Play golf in Boynton Beach, Florida Business Hours Golf: 7:00 am -5:00pm Daily W Steakhouse: 4:00 pm to 9:00pm W Grill Room: Closed Monday, Tues-Sun 10:30 am to 6:00 pm daily. Open until 8:30 on Fridays  Clubhouse: 561-369-1000  Golf Shop:  561-734-6300  W Steakhouse: 561-736-7500  The Grill Room: 561-736-7509  [email protected]  12250 Westchester Club Dr Boynton Beach FL 33437 © Copyright Westchester Country Club Website by Lightspeed"
    },
    {
      "url": "https://counselingcenter.org/contact/",
      "text": "Contact | Counseling and Therapy in Westchester | The Counseling Center Skip to content (914) 793-3388 Contact DONATE Home Our Staff Events About Services Individual Psychotherapy Child and Family Therapy Marriage and Couples Psychotherapy Telehealth Therapy College Experience Life Transitions Group Psychotherapy Locations Eastchester Tuckahoe Bronx Pelham New Rochelle Yonkers Mount Vernon Subsidy Program and Insurance Blog Resources Home Our Staff Events About Services Individual Psychotherapy Child and Family Therapy Marriage and Couples Psychotherapy Telehealth Therapy College Experience Life Transitions Group Psychotherapy Locations Eastchester Tuckahoe Bronx Pelham New Rochelle Yonkers Mount Vernon Subsidy Program and Insurance Blog Resources Get in touch Take the first step toward your new life CALL NOW: (914) 793-3388 CONTACT US Reach out We are here for you Select a day from the calendar below to schedule a complimentary consultation with our Clinical Director, Dr. Jennifer Klein. She will listen to hear what’s on your mind and if appropriate, set you up with a therapist from our center who best fits your needs. You can also connect our office at (914) 793-3388 or via email . Alternatively, you may fill out the form below and we will contact you. Name * Phone number * Email address * Message 0 / 180 I allow this website to store my submission so they can respond to my inquiry. Submit About Services Subsidy Program and Insurance Blog Resources Schedule Appointment Contact About Services Subsidy Program and Insurance Blog Resources Schedule Appointment Contact About Services Subsidy Program and Insurance Blog Resources Schedule Appointment Contact About Services Subsidy Program and Insurance Blog Resources Schedule Appointment Contact 180 Pondfield Road Bronxville, NY 10708 US [email protected] (914) 793-3388 Facebook-f Map-marker-alt The Counseling Center is a 501(c)(3) non-profit organization. All donations are tax-deductible to the extent allowed by law. Site Credits Meet Our 2025 Gala Honoree Lia Gravier In 2022, I organized a panel for the Counseling Center about mental health featuring CNN correspondent SE Cupp.  SE is a friend of mine, and despite being a public figure, chose to be transparent in sharing her mental health struggles during COVID. SE served as a catalyst to create a panel to talk honestly and openly about real issues like hers, and Lia was suggested as a potential panellist who could offer a good perspective.  When contacted, Lia suggested we showcase her daughter Olivia instead, who proved to be spectacular in her honesty and humour around her ADHD and anxiety. You can see what I mean here . As a mother and local citizen, Lia’s sense of self and ability to get things done is impressive.  I’m betting I don’t need to tell you this!  She has played a pivotal role in creating the BOLD Council at the Bronxville School and has also been part of the Bronxville  PTA and DEI Committees.  We appreciate Lia’s work building community, fostering inclusion and offering a range of support to students and families over the years."
    },
    {
      "url": "https://westchestercc.com/request_membership/",
      "text": "Memberships - Westchester Country Club Home Golf Course Details Rates Lessons Dining The W Steakhouse The W Grill Room W Food Truck Memberships Driving Range Event Hosting Event Info Weddings Contact Contact Us Job Opportunities Select Page Memberships Memberships at Westchester Country Club 2025-2026 Membership Programs – Enrollment begins on September 1, 2025 Experience the best of golf and amenities at Westchester Country Club with our all-inclusive membership packages. All memberships include taxes, greens fees, golf carts, range balls, a free GHIN membership, and a 10% discount at our Pro Shop and restaurant. Restrictions Apply: Couples must reside in the same household. 2025-2026 Annual Membership Single: $9,300 Couple: $14,800 2025-2026 6-Month Membership Single: $7,400 Couple: $12,500 2025-2026 4-Month Membership (subject to availability) Single: $4,800 Couple: $7,500 Additional Amenities Customize your membership with these optional add-ons: Large Locker: $150 Small Locker: $100 Bag Storage: $130 Handicap Fee: $55 Why Join Westchester Country Club? Unlimited access to our 27-hole Karl Litten-designed course. Access to exclusive dining experiences and events. Discounts at the Pro Shop and restaurant. Comprehensive amenities for a seamless golfing experience. How to Join For inquiries or to enroll in one of our membership programs, please call the Golf Shop at  Call Us For Info Business Hours Golf: 7:00 am -5:00pm Daily W Steakhouse: 4:00 pm to 9:00pm W Grill Room: Closed Monday, Tues-Sun 10:30 am to 6:00 pm daily. Open until 8:30 on Fridays  Clubhouse: 561-369-1000  Golf Shop:  561-734-6300  W Steakhouse: 561-736-7500  The Grill Room: 561-736-7509  [email protected]  12250 Westchester Club Dr Boynton Beach FL 33437 © Copyright Westchester Country Club Website by Lightspeed"
    },
    {
      "url": "https://westchestercc.com/course-details/",
      "text": "Course Details - Westchester Country Club Home Golf Course Details Rates Lessons Dining The W Steakhouse The W Grill Room W Food Truck Memberships Driving Range Event Hosting Event Info Weddings Contact Contact Us Job Opportunities Select Page Course Details Our Club More than three decades later, Westchester Country Club is still, quite simply, one of a kind. Inspired by Karl Litten it is one of the top public golf courses in South Florida. We feature 27 holes spread out on three 9-hole courses. Westchester Country Club provides a serene setting that includes beautiful tropical vegetation along with a wide array of wildlife amongst the lushest greens. Located in the heart of Boynton Beach, Westchester Country Club offers a golfing experience like no other! The Layout Our 27 – Holes of Karl Litten designed Championship Golf Course offers seven different sets of tees allowing players of all skill sets the opportunity to be challenged and enjoy a tropical golf setting. Westchester offers three unique nine hole courses that will test your creativity off the tee and accuracy on the approach, it is your classic “risk and reward” design that will challenge you from start to finish. From our lush fairways to our manicured greens, Westchester Country Club is a true South Florida golfing experience. Course Photos Palm Beach Florida Weather Average Temperature in Palm Beach FL Palm Beach County’s moderate climate allows for year round outdoor activities such as golfing, tennis, hiking or exploring the county’s many parks and its 47 miles of Atlantic coastline and white sand beaches. Palm Beach County Florida Average Annual Air Temperature: 75 F average annual air temperature 83 F average annual high temperature 67 F average annual low temperature Course Layouts Red Course A forgiving course with wide fairways and minimal hazards, perfect for beginners or a relaxing round. Strategically placed bunkers add an element of challenge for more experienced players. Gold Course The most technical of the three layouts, featuring tighter fairways, water hazards, and a focus on precision. Ideal for golfers looking to test their skills. Blue Course A balanced layout that offers a mix of open fairways and challenging approaches. Known for its scenic beauty, the Blue Course provides a memorable experience for all. Driving Range Visit our Year-round driving range with grass hitting areas! Range balls available for purchase via credit card.  Learn More The Designer Karl Litten Renowned Golf Course Architect is a world renowned golf course architect and designed all 27-holes here at Westchester Country Club. Mr. Litton continues to turn out spectacular golf courses worldwide. Perhaps best known for his work in The Middle East, Karl has recently teamed up again with Jeffrey Myers, to form Litten Myers Golf Course Architects. The two met more than 28-years ago when Karl originally hired Jeffrey. Karl Litton has developed quiet a reputation in the industry for blending great golf courses with successful land planning and Westchester is a perfect example. Business Hours Golf: 7:00 am -5:00pm Daily W Steakhouse: 4:00 pm to 9:00pm W Grill Room: Closed Monday, Tues-Sun 10:30 am to 6:00 pm daily. Open until 8:30 on Fridays  Clubhouse: 561-369-1000  Golf Shop:  561-734-6300  W Steakhouse: 561-736-7500  The Grill Room: 561-736-7509  [email protected]  12250 Westchester Club Dr Boynton Beach FL 33437 © Copyright Westchester Country Club Website by Lightspeed"
    },
    {
      "url": "https://www.westchestercc.org/golf/golf-professionals",
      "text": "Golf Professionals - Westchester Country Club Skip to main content 914.967.6000 Call Us Login Member Login Menu Golf South Course West Course Golf Outings Sports Tennis Squash Paddle Fitness Center Hospitality Dining Mahogany Room The Travis Room The Bowman Room The Gun Club Grille Hotel Accommodations Overnight Guest Room Policies Banquets Meetings & Special Events Weddings Beach Club About Us History Contact Us Club Rules Contact Us Member Login Careers More ▾ South Course West Course Golf Outings Golf Professionals RSS Feed Ben Hoffhine Director of Golf bhoffhine@westchestercc.org 914-798-5326 Paul Selvaggio Director of Instruction Ian Orr Head Golf Professional Brian Fallon PGA, Head Golf Professional Austin Peluso Assistant Golf Professional Jaclyn Kelly Director of Merchandising Craig Hocknull PGA, Senior Teaching Professional Jenny Sullivan PGA- Assistant Golf Professional Peyton Hemme PGA- Assistant Golf Professional Brad Warren Tournament Director Anna Schwarze Assistant Golf Professional Chris Chao Assistant Golf Professional ©2023 Westchester Country Club Westchester Country Club 99 Biltmore Avenue, Rye, New York 10580 914.967.6000 | Contact Careers"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "text": "Contact Us | Club Car Wash We use cookies to help make our site better and make your experience on our site more enjoyable. Accept X Skip to content Washes Locations News Contact Us Washes Locations News Contact Us Search Manage Membership Reach out to us using the form below! We love to hear your feedback, and we are always looking to grow and improve! You're not able to cancel your membership through this form. To cancel your membership, click the manage membership button below! Manage Membership Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Preferred Location Select preferred location... 10084 Coors Blvd NW Albuquerque, NM 87114 1075 Diffley Rd Eagan, MN 55123 11200 Timberland Blvd Fort Worth, TX 76177 11611 S 73rd St Papillion, NE 68046 118 N Fox River Dr Appleton, WI 54915 1202 Getwell Rd Memphis, TN 38111 12035 O'Connor Rd San Antonio, TX 78233 12225 E US-290 Manor, TX 78653 12322 W US Highway 90, San Antonio, TX - Montgomery 13046 Four Star Blvd Austin, TX 78737 1305 E Imhoff Rd - Norman OK 73071 1317 N Moore Ave Moore, OK 73160 14109 Culebra Rd San Antonio, TX 78254 15490 E 120th Ave Commerce City, CO 80603 1721 N Veterans Blvd Pharr, TX 78589 1725 S Valley Mills Dr Waco, TX 76711 1821 W Tyler Ave Harlingen, TX 78550 2002 Gateway Center Dr Belvidere, IL 61008 206 N Kingshighway Cape Girardeau, MO 63701 2550 Coon Rapids Blvd NW Minneapolis, MN 55433 2651 Telegraph Rd St. Louis, MO 63125 2909 Ford St Beloit, WI 53511 3028 S Seneca St Wichita, KS 67217 3031 23rd Ave Greeley, CO 80631 307 Greenbriar Rd Normal, IL 61761 3091 Goodman Rd W Horn Lake, MS 38637 3131 S 72nd St Omaha, NE 68124 3521 S Broadway Edmond, OK 3581 Hickory Hill Rd Memphis, TN 38115 3715 Sandman Ln Columbia, MO 65201 3900 Southern Blvd SE Rio Rancho, NM 87124 3910 S McColl Rd Edinburg, TX 78539 4406 Western Ave Knoxville, TN 37921 4441 Fredricksburg Rd Balcones Heights, TX 78201 4620 Old Greenwood Rd Fort Smith, AR 72903 4675 TX-121 The Colony, TX 75056 505 E 53rd St, Davenport, IA 52807 5404 Rogers Ave Fort Smith, AR 72903 5762 Rufe Snow Dr N Richland Hills, TX 76180 6609 N 99th St Omaha, NE 68122 6627 Governors Pkwy Edwardsville, IL 62025 681 Sycamore Dr Sullivan, MO 63080 701 Hillsboro Blvd Manchester, TN 37355 7323 Fairlawn Dr San Antonio, TX 78223 7514 S Zarzamora St San Antonio, TX 78224 8274 Hwy 64 Bartlett, TN 38133 9600 Sage Rd SW Albuquerque, NM 87121 Appleton, WI - E College Ave Appleton, WI - E Longview Dr Appleton, WI - N123 Eisenhower Drive Arnold, MO - JeffCo Blvd Augusta, KS - W 7th Ave Ballwin, MO - Manchester Rd Bastrop, TX - Old Austin Hwy Bastrop, TX - State Hwy 71 Bee Cave, TX - State Hwy 71 Belleville, IL - Belleville Crossing Belleville, IL - N Green Mount Commons Dr Bellevue, NE - S 22nd St Bellevue, WI - Monroe Rd Bentonville, AR - SE Walton Blvd Bloomington, IL - E Oakland Ave Boerne, TX - 28353 IH-10 Boerne, TX - S Main St Boonville, MO - Boonslick Dr Bryan, TX - E William Joel Bryan Pkwy Bryan, TX - W Villa Maria Burleson, TX - 797 SW Wilshire Blvd Cape Girardeau, MO - N Kingshighway Cape Girardeau, MO - Siemers Dr Clarksville, TN - 1493 Madison St. Clarksville, TN - 2021 Needmore Rd College Station, TX - Farm to Market Rd 2154 Collinsville, IL - N Bluff Rd Colorado Springs, CO - 1378 Republic Dr. Colorado Springs, CO - 301 E. Fillmore St. Colorado Springs, CO - 6653 Dalby Dr. Columbia, MO - Clark Ln Columbia, MO - Conley Rd Columbia, MO - Grindstone Pkwy Columbia, MO - N Providence Rd Columbia, MO - S Scott Blvd Columbia, MO - W Worley St Coralville, IA - 2nd St Cottleville, MO - 6088 Mid Rivers Mall Dr Council Bluffs, IA - W Broadway Davenport, IA - E 53rd St Decatur, IL - E Pershing Rd Denton, TX - E University Dr Derby, KS - N Rock Rd Edinburg, TX - N Jackson Rd Edmond, OK - Kelly & Covell Edmond, OK - N Kelley Ave Edmond, OK - NW 178th St Eureka, MO - Legends Pkwy Fairview Heights, IL - 6118 Illinois Dr Farmington, MO - Maple St Fayetteville, AR - Joyce Blvd Fayetteville, AR - N College Ave Fayetteville, AR - N Crossover Rd Fayetteville, AR - W MLK Blvd Fenton, MO - Bowles Ave Fenton, MO - Majestic Dr Festus, MO - N Creek Dr Florissant, MO - N Hwy 67 Fond du Lac, WI - N Country Ln Fond du Lac, WI - N Pioneer Rd Fond du Lac, WI - W Pioneer Rd Fort Worth, TX - E Blue Mound Rd Garland, TX - Foster Rd Georgetown, TX - W University Ave Georgetown, TX - Williams Dr Grain Valley, MO - N Main St Grand Junction, CO - 2122 North Ave Grand Junction, CO - 691 24 Road Green Bay, WI - University Ave Green Bay, WI - W Mason St Hazelwood, MO - Howdershell Rd Headquarters Hewitt, TX - Hewitt Dr Houston, TX - Huffmeister Rd Hutchinson, KS - E 17th Ave Independence, MO - E 39th St Iowa City, IA - Hwy 6 Iowa City, IA - IA-1 Jacksonville, IL - W Morton Ave Kansas City, MO - Lees Summit Rd Katy, TX - Fulshear Kearney, MO - Watson Dr Kyle, TX - Kyle Centre Dr Lake St. Louis, MO - Hawk Ridge Trl Lake St. Louis, MO - Hwy N Lakewood, CO - Alameda Pkwy Lansing, KS - W Eisenhower Rd Lawrence, KS - Bauer Farm Dr Lawrence, KS - E 23rd St Leander, TX - Ronald Reagan Lebanon, MO - S Jefferson Ave Leon Valley, TX - Bandera Rd Liberty Hill, TX - W State Hwy 29 Loves Park, IL - Deery Dr Lowell, AR - N Bloomington Rd Manitowoc, WI - Calumet Ave Maplewood, MO - Maplewood Commons Dr McAllen, TX - 1300 E Jackson Rd McAllen, TX - E Ridge Rd McKinney, TX - Stacy Rd Mead, CO - Highland Dr Melissa, TX - Sam Rayburn Hwy Menasha, WI - Midway Rd Mesquite, TX - 2121 N Belt Line Rd Mesquite, TX - Buckner Blvd Mission, TX - E Griffin Pkwy Moberly, MO - Hwy 24 Moline, IL - 41st Ave Dr Moore, OK - S Eastern Ave Murfreesboro, TN - Rutherford Blvd Muscatine, IA - Park Ave Nashville, TN - 3131 Lebanon Pike Nashville, TN - 3600 Murfreesboro Pike Nashville, TN - Hwy 70 S Neenah, WI - W Winneconne Ave New Braunfels, TX - TX-46 Norman, OK - 36th Ave Norman, OK - Classen Blvd O'Fallon, IL - Frank Scott Pkwy O'Fallon, MO - Monticello Dr O'Fallon, MO - Veterans Memorial Pkwy O'Fallon, MO - W Terra Ln Oklahoma City - SE 44th St Oklahoma City, OK - N Council Rd Oklahoma City, OK - N Rockwell Ave Oklahoma City, OK - SW 89th St Oklahoma City, OK - W Reno Ave Oklahoma City, OK - Western Ave Olathe, KS - S Harrison St Omaha, NE - 18318 Evans St Omaha, NE - Gold St Omaha, NE - N 108th St Omaha, NE - N 72nd St Omaha, NE - S 72nd St Ottawa, KS - S Princeton St Overland Park, KS - W 121st St Overland Park, KS - W 95th St Pearland, TX - Pearland Pkwy Peoria, IL - N Centerway Dr Peoria, IL - Sterling Ave Peoria, IL - W Glen Ave Peoria, IL - W Holiday Dr Pflugerville, TX - TX-130 Prosper, TX - E University Dr Rogers, AR - W Hudson Rd Rolla, MO - Fairgrounds Rd Round Rock, TX - 1051 N A.W. Grimes Blvd Saginaw, TX - 100 E McLeroy Blvd Salina, KS - Market Place Salina, KS - S Broadway San Antonio, TX - 2815 SE Military Drive San Antonio, TX - Culebra Rd San Antonio, TX - Hwy 151 San Antonio, TX - Marbach Rd San Antonio, TX - Medina Base Rd San Antonio, TX - NW Military Hwy San Antonio, TX - Perrin Beitel San Antonio, TX - Potranco Rd San Antonio, TX - SW Military Dr San Antonio, TX - W Interstate 10 San Antonio, TX - W Loop 1604 San Marcos, TX - S I-35 Sedalia, MO - Wisconsin Ave Shawnee, KS - Silverheel St Shawnee, KS - W 65th St Sheboygan, WI - Vanguard Dr Sherman, TX - Texoma Pkwy Sikeston, MO - S Main St Siloam Springs, AR - E Main St Springdale, AR - 3500 S. 48th St. Springdale, AR - E Robinson Ave Springdale, AR - N 45th St Springdale, AR - N Thompson St Springfield, IL - 1640 W Jefferson St Springfield, IL - Lincolnshire Blvd Springfield, IL - N Dirksen Pkwy Springfield, IL - Veterans Pkwy Springfield, TN - Memorial Blvd St. Ann, MO - St. Charles Rock Rd St. Charles, MO - 1st Capitol Dr St. Charles, MO - Zumbehl Rd St. Louis, MO - Gravois Ave St. Louis, MO - Hampton Ave St. Louis, MO - Lusher Rd St. Louis, MO - S Lindbergh Blvd St. Robert - Hwy Z Sterling, IL - 35th Ave Stillwater, OK - E 6th Ave Stillwater, OK - N Perkins Rd Sussex, WI - W248N5221 Executive Dr Taylor, TX - N Main St Topeka, KS - NW 25th St Topeka, KS - SE California Ave Topeka, KS - SW 30th Terrace Topeka, KS - SW Topeka Blvd Troy, MO - Merlin Dr Waco, TX - N Valley Mills Dr Warehouse Warrenton, MO - N State Hwy 47 Washington, MO - Willows Ct Waterloo, IA - E San Marnan Dr Wentzville, MO - Wilmer Meadow Dr Wichita, KS - 2965 N Maize Rd Wichita, KS - 3610 N Maize Rd Wichita, KS - 47th & Broadway Wichita, KS - 7931 E 37th St N Wichita, KS - N 127th St E Wichita, KS - N Woodlawn Blvd Wichita, KS - S Rock Rd Wichita, KS - W 21st St Yukon, OK - N Mustang Rd Optional: FastPass # or Last 4 Digits of Payment Method Comment or Message * Send (833) 416 - 9975 CONTACT@CLUBCARWASH.COM COMPANY Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal COMMUNITY News Fundraising Community Donations Children’s Miracle Network Hospitals News Fundraising Community Donations Children’s Miracle Network Hospitals NEED HELP? Contact Us Survey Vehicle Restrictions Privacy Policy Contact Us Survey Vehicle Restrictions Privacy Policy CAREERS Our Story Careers Our Story Careers FOLLOW US X-twitter Facebook Instagram Youtube Tiktok Email us Fill out the form below and we will reach out as soon as possible. CLOSE"
    },
    {
      "url": "https://westchestercc.com/",
      "text": "Westchester Country Club - Experience our beautifully maintained course, perfect for golfers of all skill levels. Home Golf Course Details Rates Lessons Dining The W Steakhouse The W Grill Room W Food Truck Memberships Driving Range Event Hosting Event Info Weddings Contact Contact Us Job Opportunities Select Page Welcome to Westchester Country Club Public Welcome!  Book A Tee Time Golf Experience our beautifully maintained course, perfect for golfers of all skill levels. Our Championship designed golf course will provide the right challenge for you. Memberships Join our community and enjoy exceptional benefits, including greens fees, golf carts, range balls, a free GHIN membership, & exclusive discounts. Dining “The W” steakhouse offers Glatt Kosher cuisine with premium cuts, while “The W Grill Room” provides a relaxed atmosphere with a variety of dishes. For quick bites, visit our “W Food Truck” for convenient and delicious options. Welcome to Westchester Country Club Nestled in the heart of Boynton Beach, Florida, Westchester Country Club has been a South Florida gem for over 30 years. Designed by renowned architect Karl Litten, it stands as one of the region’s premier public golf courses. Our 27 holes are spread across three unique 9-hole courses, offering golfers a versatile and memorable experience. Surrounded by lush greens, Westchester is a serene oasis, featuring vibrant tropical vegetation and diverse wildlife. The tranquil setting provides the perfect backdrop for a round of golf. Whether you’re a seasoned player or a beginner, Westchester promises an unforgettable golfing experience.  About Us Plan Your Event With Us  Learn More The banquet facility at Westchester Country Club is one of Boynton Beach’s best-kept secrets. With a recently remodeled main dining room and elegant banquet spaces that accommodate up to 350 guests, our venue offers a fresh yet refined atmosphere that is sure to impress. We specialize in hosting: Weddings Bar/Bat Mitzvah Celebrations Corporate Meetings and Events Birthday Parties Anniversaries Retirement Parties Golf Outings And virtually any event you can imagine! Celebrating a special occasion with loved ones is one of life’s greatest joys, and you don’t need to be a member to take advantage of our exceptional facilities. From entertainment and décor to dietary needs, specialty lighting, and audio-visual setups, we handle every detail with care. Our experienced team ensures your event is seamless and unforgettable. Our cuisine rivals the finest country clubs in the area, and our customer service is second to none. For your next event, let us provide the perfect venue. Contact our team of professionals today to guide you through the planning process. Play Golf In Boynton Beach Memberships Experience the best of golf and amenities at Westchester Country Club with our all-inclusive membership packages  Learn More Lessons  Learn More Rates  Learn More Follow Us For More Follow Business Hours Golf: 7:00 am -5:00pm Daily W Steakhouse: 4:00 pm to 9:00pm W Grill Room: Closed Monday, Tues-Sun 10:30 am to 6:00 pm daily. Open until 8:30 on Fridays  Clubhouse: 561-369-1000  Golf Shop:  561-734-6300  W Steakhouse: 561-736-7500  The Grill Room: 561-736-7509  [email protected]  12250 Westchester Club Dr Boynton Beach FL 33437 © Copyright Westchester Country Club Website by Lightspeed"
    },
    {
      "url": "https://westchestercc.com/rates/",
      "text": "Rates - Westchester Country Club Home Golf Course Details Rates Lessons Dining The W Steakhouse The W Grill Room W Food Truck Memberships Driving Range Event Hosting Event Info Weddings Contact Contact Us Job Opportunities Select Page Rates Public Golf Rates Book online for the best rates!  Book Now Important Information ALL RATES INCLUDE TAX Carts must be returned 15 minutes before sunset. Rates are subject to change. All tee times must be booked in advance: 5 days in advance over the phone. 7 days in advance online. Prepaid tee times are non-refundable and cannot be modified. Rainchecks will not be offered for prepaid tee times. Group Bookings (12+ Players) Planning an outing with 12 or more players? Group bookings must be made by calling the Golf Shop directly. One payment is required for the entire group (cash or credit). Raincheck Policy At Westchester Country Club, we prioritize safety and player satisfaction during inclement weather. Here are the guidelines for our raincheck policy: Eligibility: Rainchecks are available only if excessive inclement weather occurs. Rainchecks are pro-rated based on the number of holes played. The monetary value credit will be issued in the form of a raincheck for use on your next round. Limitations: Rounds beginning after 3 PM are not eligible for rainchecks in the event of inclement weather. Whether you’re warming up for a round Or looking to sharpen your skills Westchester Country Club’s driving range is the perfect place to refine your game. Contact Us or visit us today to elevate your practice sessions!  Contact Us Business Hours Golf: 7:00 am -5:00pm Daily W Steakhouse: 4:00 pm to 9:00pm W Grill Room: Closed Monday, Tues-Sun 10:30 am to 6:00 pm daily. Open until 8:30 on Fridays  Clubhouse: 561-369-1000  Golf Shop:  561-734-6300  W Steakhouse: 561-736-7500  The Grill Room: 561-736-7509  [email protected]  12250 Westchester Club Dr Boynton Beach FL 33437 © Copyright Westchester Country Club Website by Lightspeed"
    }
  ]
}