{
  "fuentes": [
    {
      "url": "https://www.mhbo.com/mobile-home-park/44123-west-bay-oaks-mobile-home-and-rv-park-1610-w-bay-dr-largo-fl-33770",
      "email": "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/44123-west-bay-oaks-mobile-home-and-rv-park-1610-w-bay-dr-largo-fl-33770",
      "email": "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/44123-west-bay-oaks-mobile-home-and-rv-park-1610-w-bay-dr-largo-fl-33770",
      "email": "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/44123-west-bay-oaks-mobile-home-and-rv-park-1610-w-bay-dr-largo-fl-33770",
      "email": "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png"
    },
    {
      "url": "https://www.westbayoaks.com/contact-us/",
      "email": "dvatella@rivstone.com"
    },
    {
      "url": "https://staffgroupwest.com/",
      "email": "info@staffgroupwest.com"
    },
    {
      "url": "https://www.westbayri.org/",
      "email": "info@westbayri.org"
    }
  ],
  "mails": [
    "dvatella@rivstone.com",
    "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png",
    "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png",
    "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png",
    "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png",
    "info@staffgroupwest.com",
    "info@westbayri.org"
  ],
  "nombre_sitio": "westbayoaks.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.mhbo.com/mobile-home-park/44123-west-bay-oaks-mobile-home-and-rv-park-1610-w-bay-dr-largo-fl-33770",
      "text": "West Bay Oaks Mobile Home And Rv Park | 1610 W Bay Dr, Largo, FL 33770 | MHBO.com SEARCH Buy Rent Explore Parks My Property Feed favorite_border Favorites Sign Up or Login COMMUNITY PROFILE West Bay Oaks Mobile Home And Rv Park 1610 W Bay Dr location_on Map It Largo, FL 33770 | ID: 44123 hotel_class Review this Park Inquire About Homes Lot Rent Info Inquire About Homes Lot Rent Info 55 + PET FRIENDLY PHOTOS VIDEO STREET VIEW 27.9170589 -82.8052823 883202 1610 W Bay Dr, Largo, FL 33770 Details Name West Bay Oaks Mobile Home And Rv Park Type of community Age-restricted community ? Lot rent range $475 - $625 Office Phone (727) 586-2440 Total # of lots 99 Pet policy check Pet friendly Community owner type Company, privately held Community owner West Bay Oaks Water type Well Sewer type Septic Street width Average Parking Off-street Street type Paved MORE Schedule a Visit Check out West Bay Oaks Mob... Call Us (727) 586-2440 Sales & Leasing input SEND TO MY PHONE About lot rent The lot rent ranges from $475 - $625 per month and includes: check Trash pickup check Water check Sewer Disclaimer Lot rent and other fees can change at any time without notice. MHBO is not responsible for quoting current monthly fees,\n          lot rent, or any dues/fees associated with the community or home. Additional fees for certain amenity privileges may apply.\n          All applicable community fees are the responsibility of the buyer to obtain and community manager/owner to disclose prior to ownership or occupancy. Description West Bay Oaks Mobile Home And Rv Park is an age-restricted (55+) manufactured home community located in 1610 W Bay Dr, Largo, FL 33770. West Bay Oaks Mobile Home And Rv Park is a land-lease community and has a total of 99 home sites. Home site lot rent ranges from $475 - $625 per month and includes the following: Trash pickup Water Sewer The streets in the community are paved, and are of an average street width. The water in the community is sourced from the well and the sewer system is septic. Parking is off-street The community has 0 parking spaces available for RVs. Managed on-site by West Bay Oaks. West Bay Oaks Mobile Home And Rv Park is an affordable housing choice for active, friendly, age-qualified living. This well-maintained retirement community has easy access to local recreation, shopping and entertainment. Equal Housing Opportunity Amenities check Recreation facilities check Laundry facilities check Restrooms check Pavilion check Wireless Internet Access Inquire about this Community I was searching on MHBO.com and found your community. Please send me more information about West Bay Oaks Mobile Home And Rv Park at 1610 W Bay Dr, Largo, FL 33770 Send Message Share Share Email email Share on Facebook Share on Twitter Information Requested A detailed information sheet has been sent to your email. CLOSE Similar Mobile Home Parks You might be interested in these nearby communities. East Bay Oaks Largo, FL Community Type group_add Age Restricted Shangri La Largo, FL Features pool Pool Kakusha Estates Clearwater, FL Community Type group_add Age Restricted About Contact Accessibility Services Terms & Privacy Blog Sitemap © 2025 MHBO.com Equal Housing Opportunity Send Inquiry to Plant Prefab Model Type One Two Three Status One Two Three Create an alert for new models like this Send Message × Send to Your Phone"
    },
    {
      "url": "https://www.westbayoaks.com/contact-us/",
      "text": "Contact Us | West Bay Oaks Skip to Content Home Homes for Sale Attractions Tampa Bay Events Local Attractions Attractions Videos Dining Out Shopping Transportation Local Map Park Park Amenities Park Map RV Park RV Sites RV Inquiries RV Rules Contact Us Menu Home Homes for Sale Attractions Tampa Bay Events Local Attractions Attractions Videos Dining Out Shopping Transportation Local Map Park Park Amenities Park Map RV Park RV Sites RV Inquiries RV Rules Contact Us CALL: 727-586-2440 SUMMER SPECIAL! Contact Us We are happy to speak with you to answer all your questions. You can call from  9:00 AM to 9:00 PM seven days a week or email us anytime. Telephone 727-586-2440 Address West Bay Oaks LLC 1610 W Bay Dr – Office Largo FL 33770 Email dvatella@rivstone.com Send Us Your Question or Message Now You may use this form to send us a question or message right now. For RV Site rates and availability, please use the RV Inquiries form. Contact Us Name * Phone * Email * Message... * Email This field is for validation purposes and should be left unchanged. Home Local Attractions Attractions Videos Tampa Bay Events Transportation Local Map Park Map Park Amenities Dining Out Shopping RV Sites RV Inquiries RV Rules Homes for Sale Contact Us West Bay Oaks LLC 1610 W Bay Dr – Office Largo FL 33770 Copyright 2025. West Bay Oaks. Website Maintenance & Management . The owner of this website has made a commitment to accessibility and inclusion, please report any problems that you encounter using the contact form on this website. This site uses the WP ADA Compliance Check plugin to enhance accessibility."
    },
    {
      "url": "https://staffgroupwest.com/",
      "text": "Staff Group West Inc. Home Our Mission Need A Job? Recruiting Services About Staff Group West Inc. Property Management Customer Service Contact Us Welcome to Staff Group West Inc. Your first source in quality industry talent! Staff Group West, Inc has quickly  grown to become regarded as one of the premiere staffing industry leaders in  placing quality talent at some of the top companies across North America. Since the very beginning Staff Group West has been committed to offering our clients the  very best talent the industry has to offer. When you consider that we select only a quarter  of the overall candidates interviewed and from the hundreds of resumes  received. Experienced Recruiting Cost-Effective Methods and Quality You Can Rely Upon. Staff Group West, Inc. have sought out the top industry recruiters that are highly effective in locating and delivering skillful talent professionals right to your door! From the start you will recognize the extraordinary lengths our team goes to always offer our clients the most stellar service and committed professionals the industry has to offer.! NEED A JOB? We take care of our jobseekers by studying each employee and matching their needs to your background and capability. We also regard your career goals in pairing with a company. Property Management Industry Administrative Accounting Manufacturing Details ›› EMPLOYER Staff Group West, Inc. has an outstanding track record of matching the skills of our employees to those required by our clients. We take pride in how we work together with you to helping you determine your career goals while giving you opportunity to showcase your talent. We have what contacts and the right connections with Fortune 500 clients in order to help you find your \"right\" fit and the ideal employer.. OUR MISSION Our mission is always to attend to our clients needs with the highest level of integrity, professionalism and quality. We are here to help you bridge the gap between the help you so desperately require and the quality Staff Group West Inc. personnel you deserve. Our mission is simple, not to be the best at everything only at what matters most to you - having a qualified dependable team behind you! More about Staff Group West Inc. ›› Looking to Hire? Industries & Fields we service: Accounting & Finance Automotive Environmental Product Sales Administration Operations Clinical Labor Operations Real Estate Professionals Aerospace Call Center Manufacturing Sciences Architecture Energy Property Management Industry Light Industry Special Events Job Seeker Search Here State California Washington Arizona Georgia Texas Florida Virginia Maryland DC Call Us Now! (866) 481-9651 Info@staffgroupwest.com HOME | NEED A JOB? | STAFFING SERVICES | ABOUT STAFF GROUP WEST INC. | ACCOUNTABILITY | LOCATION | CONTACT US © Copyright 2009  •  Staff Group West Inc.  •  Web Design: Proweaver"
    },
    {
      "url": "https://www.westbayri.org/",
      "text": "HOME | westbayri top of page 401.738.9300 HOME ABOUT US Leadership History Mission | Core Values Vision Contact Us SERVICES Customized Employment Self Employment Community-Based Day Supports Transition Services for Youth Residential Services Supported Living Shared Living (SLA) NEWS & EVENTS Donations Archive Creative Works Network Calendar CAREERS Opportunities Apply Today Positions and Descriptions More Use tab to navigate through the menu items. Log In transforming Lives West Bay Welcome to WEST BAY RI Our mission is to provide innovative, person-centered supports to people with intellectual and developmental disabilities in ways that promote community inclusion, personal power, self-expression and life fulfillment. Learn more about our Mission & Values . Supporting individuals with intellectual & developmental disabilities across Rhode Island since 1981. Donate Help Support Our Mission You can change people's lives by making a donation Featured Services Customized Employment & Day Services ​ West Bay is committed to providing individuals with intellectual and developmental disabilities with the tools and resources needed to seek and secure gainful employment. We believe every person has distinct talents and strengths, as well as an inherent right to full inclusion in the workplace. Shared Living (SLA) West Bay offers SLA as an opportunity for individuals with intellectual and developmental disabilities to live in private homes with dedicated contractors who support people with their personal growth and development. Supported Living In order to foster growth, maintain an individual’s independence and encourage community inclusion, West Bay offers custom-designed services to those with an established range of life skills. Residential Services West Bay offers a variety of innovative, person-centered residential living options to support people with intellectual and developmental disabilities in their daily lives. Presently, we operate over 30 individualized Residential Supports across Rhode Island. Please reload Career Opportunities EMPLOYEE REFERRAL Program At West Bay RI, we’re committed to providing our employees with the best working environment possible. That’s why we’ve launched our new employee referral program, which allows employees to refer the best talent from their networks to join our team. We believe that having a diverse and well-rounded team helps create a strong and collaborative workplace, and our referral program is just one of the many ways we’re striving for this. Job Openings Include: DSP, Specialized Supports, Management, Nursing and Residential Coordinator Apply Now Our organization is built upon teamwork, respect, and integrity. We support the creative energy of our employees and encourage the development of innovative ideas. ​ ​ Supportive Team Environment Flexible Schedule Excellent Platinum Benefits Full Time / Part Time / Per Diem Employee Health & Wellness Programs Career Development Opportunities ​ Benefits include: Health, Dental, Vision, Agency Sponsored Life Insurance, Vacation, Sick, 401K Retirement, Supplemental Benefits (Aflac - Accident, Cancer & Life), Employee Assistance Program (EAP), Tuition Reimbursement, Pet Insurance, Identity Insurance News & Events Meet Bernadette & Brian Congratulations Bernadette for being chosen as September's Employee Spotlight. To apply or see more opportunities click here Donate Online Stay Current! Join our mailing list today! Subscribe Now HOME ABOUT US Leadership History Mission | Core Values Vision Contact Us SERVICES Customized Employment Self Employment Community-Based Day Supports Transition Services for Youth Residential Services Supported Living Shared Living (SLA) NEWS & EVENTS Donations Archive Creative Works Network Calendar CAREERS Opportunities Apply Today Positions and Descriptions More Use tab to navigate through the menu items. Tel: 401.738.9300   Email: info@westbayri.org 158 Knight St, Warwick RI, 02886 bottom of page"
    }
  ]
}