{
  "fuentes": [
    {
      "url": "https://www.camelotcommunitycare.org/golfclassic",
      "email": "rpayne@camelotcommunitycare.org"
    },
    {
      "url": "https://www.westwoodgolfclubleek.co.uk/contact-us/",
      "email": "catering@westwoodgolfclubleek.co.uk"
    },
    {
      "url": "https://www.westwoodgolfclubleek.co.uk/contact-us/",
      "email": "info@westwoodgolfclubleek.co.uk"
    },
    {
      "url": "https://www.westwoodgolfclubleek.co.uk/contact-us/",
      "email": "professional@westwoodgolfclubleek.co.uk"
    },
    {
      "url": "https://www.where2golf.com/usa-florida/westchase-golf-club/",
      "email": "info@westchasegc.com"
    },
    {
      "url": "https://www.sevenoaksgolf.com/contact-us",
      "email": "dpylinski@sevenoaksgolf.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/westchase-golf-club/",
      "email": "default-80@2x.png"
    },
    {
      "url": "https://www.1golf.eu/en/club/westchase-golf-club/",
      "email": "info@westchasegc.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/westchase-golf-club/",
      "email": "travel@albrecht.de"
    },
    {
      "url": "https://westchasewca.com/",
      "email": "manager@westchasewca.com"
    }
  ],
  "mails": [
    "catering@westwoodgolfclubleek.co.uk",
    "default-80@2x.png",
    "dpylinski@sevenoaksgolf.com",
    "info@westchasegc.com",
    "info@westwoodgolfclubleek.co.uk",
    "manager@westchasewca.com",
    "professional@westwoodgolfclubleek.co.uk",
    "rpayne@camelotcommunitycare.org",
    "travel@albrecht.de"
  ],
  "nombre_sitio": "westchasegc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.camelotcommunitycare.org/golfclassic",
      "text": "Camelot Community Care | Golf Classic 2025 Skip to main content Skip to main content Facebook Instagram LinkedIn Donate Home About Camelot History 50 Years of Camelot 50th Anniversary Dinner Board of Directors Leadership Contact Programs Locations Foster Parenting Become a Foster Parent Foster Parent Spotlight Foster Parent Resources Get Involved News Donate Volunteer Business Partnerships Support a Foster Family Careers at Camelot Events Golf Classic 2025 Cornhole Tournament 2025 Camelot Store Menu Facebook Instagram LinkedIn Donate Golf Classic 2025 About The Event OVERVIEW Camelot Community Care (CCC) proudly presents the 2025 Golf Classic present by Florida Insurance Trust and Bouchard Insurance, A Marsh and McLennan Agency LLC Company.  This annual tournament will be hosted at Westchase Golf Club. All golfers will enjoy 18 holes of play on this National Golf Foundation top 10 course which is one of Tampa Bay’s most beautiful public access courses! Join over 150 community partners and Camelot Community Care supporters in raising funds to assist serving children and families experiencing abuse, neglect, and behavioral health issues. Because of your participation, CCC can continue to accomplish the mission of enabling children and families to realize their fullest potential by stopping the cycle of abuse and neglect in families and in our community. Tot mai mulți utilizatori preferă platforme care oferă acces direct la bani fără costuri suplimentare. Acest tip de finanțare este perfect pentru acoperirea cheltuielilor neașteptate — fie că este vorba de reparații urgente, achitarea unei facturi sau chiar o scurtă vacanță planificată în grabă. Spre deosebire de creditele bancare tradiționale, aceste produse sunt gândite pentru a fi rapide, accesibile și, mai ales, transparente. Tot ce trebuie să faci este să completezi un formular scurt, să confirmi identitatea și să alegi suma dorită. Răspunsul vine repede, iar fondurile sunt transferate direct în cont. Este o metodă eficientă și modernă de a gestiona momentele neprevăzute din viață. WHEN Friday, March 7, 2025 WHERE Westchase Golf Club 11602 Westchase Golf Drive Westchase, FL 33626 TIMES 7:30 AM - Registration, Breakfast, and Driving Range Open 8:30 AM - Shotgun Start 1:00 PM - Reception Buffet, Awards & Auction INTERESTED IN VOLUNTEERING AT THE GOLF CLASSIC? We need compassionate and dedicated volunteers to ensure the success of our 2025 Golf Classic. From assisting with event logistics to providing a welcoming atmosphere, your contribution will help create an exceptional experience for all participants. Registration closes on February 21st. Secure your volunteer spot today and be part of something extraordinary! QUESTIONS? For additional  information, please contact Rebecca Payne, Chief Development Officer, at 407-607-6272 cell or rpayne@camelotcommunitycare.org . Una dintre cele mai apreciate caracteristici ale platformelor moderne de creditare este protejarea datelor personale și eliminarea verificărilor care nu sunt absolut necesare. Cei care au nevoie urgentă de fonduri, dar nu doresc ca ANAF să fie implicat în procesul de aprobare, pot opta pentru bani fără acces ANAF . Este o soluție eficientă, discretă și rapidă, care permite obținerea unei sume direct în cont, fără a transmite date despre veniturile declarate sau despre istoricul fiscal. Această metodă este din ce în ce mai populară în rândul celor care prețuiesc confidențialitatea și autonomia în gestionarea finanțelor. Cu un proces complet digitalizat, utilizatorul are control total asupra aplicației, fără a fi nevoit să ofere explicații suplimentare nimănui. Event Details Next Event Dates 03/07/2025 | 7:30am - 3:30pm Westchase Golf Club 11602 Westchase Golf Drive, Westchase, Florida 33626 Rebecca Payne 407-607-6272 | rpayne@camelotcommunitycare.org Register Your Team Sponsor the Tournament Download Sponsorship Form IN-KIND DONATION FORM IN-KIND LETTER SILENT AUCTION - IN-KIND DONATION FORM 501C3 TAX STATUS Locate Westchase Golf Club Westchase Golf Club 11602 Westchase Golf Drive Westchase , FL 33626 United States Category Fundraising Event Contact 15500 Roosevelt Boulevard, Suite 204 Clearwater, FL 33760 Phone: 727-593-0003 Fax: 727-595-0735 Send An Email Stay Connected Sign Me Up Facebook Instagram LinkedIn ADA Legal Funders Privacy Policy Employees Board 2025 © Camelot Community Care, All Rights Reserved. Home About Camelot History 50 Years of Camelot 50th Anniversary Dinner Board of Directors Leadership Contact Programs Locations Foster Parenting Become a Foster Parent Foster Parent Spotlight Foster Parent Resources Get Involved News Donate Volunteer Business Partnerships Support a Foster Family Careers at Camelot Events Golf Classic 2025 Cornhole Tournament 2025 Camelot Store Facebook Instagram LinkedIn"
    },
    {
      "url": "https://www.westwoodgolfclubleek.co.uk/contact-us/",
      "text": "Contact Us | Westwood Golf Club Westwood Golf Club Home Course Tour of the Course Course Report Scorecard World Handicap System Local Rules Dress Code Hole Sponsorship Membership Categories and Costs Membership Offers Golf Club Affiliation Spend to Save Visitors Green Fees Societies Society Packages Society Booking Form Society Diary Overview Captains Away Days Corporate Membership Open Competitions and Entry Forms Buggy and Trolley Hire Dress Code Local Rules Diary Clubhouse WGC Lookout Bar and Bistro What's on Weddings Parties, Celebrations and funerals Meeting Room Hire Members General Club Noticeboard Mens Mens Welcome Mens Club Competition Overview Mens Match Overview Mens Handicap Ladies Ladies Welcome Ladies Noticeboard Lady Captain's Winterball January 14th Pre-Season Get Togther Trentham Alliance New Lady Members New Mills Open Scratch Match Against Trentham Ladies Club Competition Overview Ladies Match Overview Ladies Handicap Ladies Majors Presidents Bogey Competition Past Captains Bogey Competition Watson Cup Hamilton / Halton Cup Godwin Cup Miss Brookes Stableford Memorial Trophy Ladies Captains Charity Trophy Ken Hodson Trophy Ladies Results Godwin Round 2 / Ladies EWGA Medal 6 Ladies EWGA Medal 7 Ladies EWGA Medal 8 Ladies EWGA Medal 9 Sroke Play Template Mixed Mixed Club Competition Overview Mixed Match Overview Seniors Seniors Welcome Seniors Results Noticeboard Seniors Club Competition Overview Seniors Match Overview Juniors Benefits of Junior Membership Safeguarding Children Policy Pro Golf Coaching Professional Notices and Offers About our Pro SafeGolf WGC Safeguarding Policies WGC Welfare Officer Contact Us Login Westwood Golf Club Westwood Golf Club You are here: Home Contact Us Contact Us Westwood Golf Club, Newcastle Road, Leek, Staffordshire, ST13 7AA Map and directions are available on our Map and Directions Page. Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. Professional, Mr. James Austerberry Tel: 01538 398897 Email: professional@westwoodgolfclubleek.co.uk Catering: Ms Ella Gillen Tel: 01538 398385 catering@westwoodgolfclubleek.co.uk Company Secretary, Mr. Keith Kirton Tel: 01538 398385 Twitter: @WestwoodGCLeek Facebook page: Westwood Golf Club Course conditions: Tel: 01538 398897 or visit our Course Report page. You may complete this form to send an email directly to Westwood Golf Club. Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Pro Shop Visitor Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Submit » News General Club Noticeboard Members Noticeboard Professional Notices and Offers RSS Feed Links Cookie and Privacy WGC Safeguarding Policies WGC Welfare Officer Contact Us Find Us Contact Westwood Golf Club, Newcastle Road, Leek, ST13 7AA tel. 01538 398 897 tel. 01538 398 385 info@westwoodgolfclubleek.co.uk Follow Us Copyright © Westwood Golf Club , 2016-2025. All Rights Reserved. Golf Club CMS with Cloud Hosting by"
    },
    {
      "url": "https://www.where2golf.com/usa-florida/westchase-golf-club/",
      "text": "Westchase Golf Club Tournaments Who's who Dictionary News Tournaments Who's who Dictionary News Find a course: Americas Europe Africa/ME Asia Oceania Overview Learn more Where2Stay Westchase Golf Club 11602 Westchase Golf Drive, Tampa, Florida FL 33626 Office +1 (813) 854 2331 Fax +1 (813) 854 5156 Email Email the course Website Visit website Golf pro Richard Veghte (Head PGA Golf Professional) About the course The Course: 18 holes. Tree-lined & open parkland. Relatively flat terrain. Surroundings: Woodland and residential. Designer: Lloyd Clifton Back tees Club tees Front tees Yards 6699 6233 5205 Par 72 72 72 SSS or slope 72.6 70.6 70.8 Location Latitude: 28.048124 Longitude: -82.616120 How to get there: 15 miles NW of downtown Tampa Americas / Tampa / Westchase Westchase Golf Club Est. 1992 Westchase Golf Club is home to a well-rated and always popular golf course. This tree-lined and open parkland layout should not disappoint, with many attractive features and several excellent holes to enjoy. Plenty of golfing challenge, a well-crafted design and usually good upkeep all contribute to the appeal of this course. One to include on your play list if you are in the area. List of courses: Around Tampa Map of courses: Around Tampa Visitors Who can play and when? Visitors welcome on weekdays and weekends. Must book in advance. Green fees Contact club for golf rates. Other information Non-metal spike facility. Golf carts compulsory; carts are fitted with GPS. Practice facilities Good (Aqua-range) Where2Stay Residence Inn by Marriott - NorthPointe Village AAA 3-Diamonds 2101 Northpointe Parkway, Lutz, FL33558 +1 (813) 792 8400 Visit website This five storey \"almost new\" suburban hotel is well positioned, and a short drive from Tampa, Land O Lakes, New Port Richey, Lutz, Odessa, Trinity, Clearwater, and St Petersburg. The hotel is within walking distance of several restaurants and shops, and has a 24-hour fitness center overlooking the hotel's patio, firepit and heated pool. Golf at this hotel: No Golf within 5 miles: TPC Tampa Bay Golf within 20 miles: Fox Hollow; Seven Springs; Plantation Palms; Saddlebrook; Westchase; Innisbrook. Hampton Inn & Suites Tarpon Springs 39284 US Hwy 19 N, Tarpon Springs, FL 34689 +1 (727) 945 7755 Visit website The 83-guest room Hampton Inn & Suites Tarpon Springs is located amid historic Tarpon Springs. Here you can take-in the historical and scientific intrigue of the world-famous Sponge Docks and its many restaurants and shops, tour the Sponge Museum or experience a live sponge-diving exhibition. The hotel has a large outdoor pool and a fitness center. Golf at this hotel: No Golf within 5 miles: Innisbrook; Golf within 20 miles: Dunedin; Bardmoor; Fox Hollow; Seven Springs; Westchase; TPC Tampa Bay. Find a course By country/region AMERICAS EUROPE AFRICA/ME ASIA OCEANIA By city AMERICAS EUROPE AFRICA/ME ASIA OCEANIA Or Search by maps Tournaments Women’s (British) Open : the last women’s major championship of the season is hosted by Royal Porthcawl GC . It’s the first time this fabulous seaside links course has hosted the event (July 31-Aug 3). Walker Cup : the 50th playing of this prestigious men’s amateur event sees the GB&I go head-to-head against the defending USA team at Cypress Point Club , California (Sept 6-7). After that, all eyes turn to Bethpage State Park on Long Island, NY , where the American and defending European professional teams engage in the 45th Ryder Cup (Sept 27-29). Who's Who Lottie Woad : 21-year-old Woad burst onto the professional scene in July, with wins in the Women’s Irish Open (as an amateur) and three weeks later in the Women’s Scottish Open (as a professional). She nearly picked-up a major championship, placing third in The Evian in the same month. Pádraig Harrington : the ever-likeable Irishman added the (British) Senior Open Championship title to his stellar array of tournament successes. His win came on Sunningdale’s spectacular Old Course. Harrington had already bagged the U.S. Senior Open title in June this year. The Dutch GC, The Netherlands The Dutch : \"It's no' just a game\", as they say in Scotland, and that's certainly true at The Dutch. With 5-star services throughout, a lavishly comfortable Loch Lomond -inspired clubhouse, and a superbly designed and presented golf course, one could not ask for more from this top-end private club. Join us at The Dutch from August 21–24 for the Festival of Golf, featuring the HotelPlanner Tour . Experience four days of top-tier sport, live music, incredible food, and unexpected surprises. Explore the grounds, connect with others, embrace new challenges, and dive into an unforgettable celebration. Click here to buy tickets . Prince's Golf Club, Kent (UK) Here at Prince’s Golf Club you'll find 27 excellent holes of links golf. Just over the fence and sharing similar terrain is Royal St George’s; but Prince’s is far from overshadowed by its venerable neighbour. The three nine-hole loops at Prince's, laid out over gently undulating terrain, are sure to bring a smile of satisfaction to all lovers of links golf. Stay&Play at Prince's : excellent onsite Lodge accommodation available Popular videos You can subscribe to the Where2Golf channel on YT if you like to see more video content. You'll find a \"Subscribe\" button on any of our YouTube videos. Or if you want a quick and direct access subscribe here . Once done, any new published videos will show up in your Subscriptions feed. Bethpage State Park (New York) host of the Ryder Cup 2025 Whistling Straits (Wisconsin, US) TPC Louisiana host of the Zurich Classic of New Orleans To receive updates on golf courses and destinations uncovered sign up for our monthly newsletter. About us / Contact Ratings & Definitions Terms & Conditions Privacy Policy Follow Copyright © 2025 where2golf.com. All rights reserved."
    },
    {
      "url": "https://www.sevenoaksgolf.com/contact-us",
      "text": "Contact Us, Directions | Seven Oaks Golf Club at Colgate University COLGATE UNIVERSITY | 315-824-1432 | CONTACT US Skip to main content Golf Download Our App Book A Tee Time Golf Rates Our History The Course Practice Facility Rules & Regulations Download Our App Book A Tee Time Golf Rates Our History The Course Practice Facility Rules & Regulations Join Students Events Outings Lessons Golf Instruction & Clinics Coaches Corner Golf Instruction & Clinics Coaches Corner Store Gift Cards Merchandise Gift Cards Merchandise Search Close Search Keyword Search Search Keyword Search 52° Wed 09/10 clear sky 72°/47° Thu 09/11 clear sky 71°/50° Fri 09/12 clear sky 72°/51° Book A Tee Time Contact Us Get in touch or find driving directions to Seven Oaks Golf Club at Colgate University. X CONTACT INFORMATION ADDRESS 2 E Lake Rd (East Lake & Payne Streets) Hamilton, NY 13346 PHONE Golf: 315.824.1432 Restaurant: 315.824.4420 FEEDBACK Comments & suggestions welcome Call 1.888.986.0699 to share comments HOURS OF OPERATION Currently Closed GET IN TOUCH OR FIND US Please submit your inquiry and a member from our team will in touch or utilize the map below for directions. We hope to see you soon! CONTACT US FORM First Name Last Name Email Phone Subject Message Submit MEET THE TEAM DALLAS C. PYLINSKI, PGA Director of Golf Email Dallas TYLER COWEN Assistant Golf Professional GOLF IS CALLING YOUR NAME Designed by the Legendary Robert Trent Jones Sr. Seven Oaks is a must play. PLUS avoid booking fees when you book direct! Book A Round MANAGED BY QUICK LINKS The Course Online Store Careers at Seven Oaks Colgate University Colgate Athletics Colgate Inn CONTACT US Golf: 315.824.1432 Restaurant: 315.824.4420 Submit an Inquiry facebook instagram twitter ADDRESS 2 E Lake Road Hamilton, NY 13346 Get Driving Directions PLAY GOLF CALL 315.824.1432 OR Book A Tee Time JOIN OUR EMAIL LIST SUBSCRIBE TO GET THE LATEST NEWS AND OFFERS I consent to receive emails from Seven Oaks Golf Club. I can unsubscribe anytime. Email Thank you for subscribing. Enter Another Email Subscribe Copyright © 2025. Seven Oaks Golf Club at Colgate University. All Rights Reserved. Privacy Policy Terms of Use Accessibility Sitemap"
    },
    {
      "url": "https://www.1golf.eu/en/club/westchase-golf-club/",
      "text": "Westchase Golf Club, Tampa, FL - Albrecht Golf Guide Golf Courses Golf Hotels Golf Packages Bookshop Apps Sign in / Sign up Saved Items Deutsch English Español Italiano Albrecht Golf Guide Golf courses in North America United States Florida Westchase Golf Club 18 Hole Public Overview Courses Visitors Prices Amenities Club Reviews Westchase Golf Club 11602 Westchase Golf Dr, Tampa, FL 33626-2563, USA Phone: +1 813-854-2331 , Fax: +1 813-854-5156 info@westchasegc.com www.westchasegc.com Map Save Share 3.0 of 5 stars 2 Reviews “ Beautiful ” 06/2024 “ Overrated ” 10/2022 Courses 18-Hole Westchase Course 18-Hole Westchase 2 Course Driving Range  &  Practice area Visitors welcome? Yes - every day. Season: Year round Green fees $89 - 94 (76-80 €) / 18 Holes Characteristics The Westchase golf course winds through acres of lakes and wetlands teeming with wildlife including an occasional alligator. Westchase offers a country club atmosphere and service. Ranked in the Top 10 nationally and #1 in Florida in customer satisfaction by the National Golf Foundation. Courses 18-Hole Westchase Course Opened in 1992. Design: Lloyd Clifton . Terrain: Flat with water hazards Technical difficulty: Moderate - Hard Scorecard Tee Par CR Slope Length Blue (Men) 72 72.6 131 6710 yards White (Men) 72 70.6 127 6233 yards Green (Men) 72 71 126 5801 yards Red (Women) 72 70.8 127 5205 yards 18-Hole Westchase 2 Course Opened in 2008 Terrain: Water hazards Practice Facilities Driving Range Putting Green Chipping Green Practice bunker Visitors Both Courses Visitors are welcome every day. Etiquette Softspikes required. Mobile phone permitted on course. GPS devices approved. Green Fees 18-Hole Westchase Course Green Fee Mon - Thu Fri - Sun, Holidays 18 Holes $89 (76 €) $94 (80 €) Prices incl. cart! Juniors up to the age of 18  receive a 50% discount. Driving Range Monday - Sunday Bucket (50 balls) $6 (5 €) Rates fluctuate throughout the year with the peak rates falling approximately between mid-January and April 1. Amenities Club Amenities Clubhouse Conference room Locker rooms Club accepts credit cards Pro Shop Restaurant Bar Snack Bar Beverage Cart Rentals Clubs for hire Trolley for hire Electro-cart for hire The Club Personnel Title Name Manager Clay Thomas Pro Richard Veghte Enlarge / get directions Nearby Courses Countryway GC Tampa (1.8 km) 18 Hole 10 € / 18 Holes Old Memorial GC Tampa (4 km) 18 Hole The Eagles GC Odessa (6.5 km) 36 Hole 13 € / 18 Holes See all User Reviews 3.0 of 5 stars 2 Reviews 5 Stars: 1 4 Stars: 0 3 Stars: 0 2 Stars: 0 1 star: 1 Write a Review Most Recent Reviews muzzillia 1 Review Beautiful 5.0 of 5 stars Reviewed June 4, 2024 Crazy that someone would give this course a 1! The staff is friendly, the course is challenging, and the scenery is beautiful! Definitely NOT overrated! As a bonus…they cater to amazing events such as my daughter’s graduation party and my parent’s renewal of vows ceremony. So grateful to live in walking distance! Sick of the rudeness 1 Review Overrated 1.0 of 5 stars Reviewed October 22, 2022 Loud music blasts from PA system around course and all golf carts. Very distracting and intrusive. Management says they are within the law for acceptable decibels and they therefore will not adjust volumes. Dense overgrowth of jungle like invasive plants around many fairways which makes ball retrieval impossible and dangerous. Overall attitude of disrespect for neighboring community. Been to Westchase Golf Club ? Share your experiences! Write a Review See all reviews Golf Packages Tenerife, Spain Tivoli La Caleta Tenerife Resort 5 stars Very good 8,4 / 10 7 Nights 5 green fees from € 1475 per person Tenerife, Spain Hacienda del Conde Meliá Collection Golf & Spa 5 stars Wonderful 9,1 / 10 7 Nights HB unlimited golf from € 1231 per person La Gomera, Spain Hotel Jardín Tecina 4 stars Excellent 8,7 / 10 7 Nights HB 5 green fees from € 833 per person Majorca, Spain Elba Sunset Mallorca 4 stars Very good 8,2 / 10 7 Nights 5 green fees from € 855 per person Majorca, Spain VIVA Golf Adults Only 18+ 4 stars Superior Very good 8,4 / 10 7 Nights HB 5 green fees from € 1083 per person Sicily, Italy Verdura Resort 5 stars Excellent 8,8 / 10 7 Nights 4 green fees from € 1269 per person Porto Cervo, Italy Cervo Hotel, Costa Smeralda Resort 5 stars Excellent 8,8 / 10 7 Nights unlimited golf from € 1042 per person Cyprus Almyra 5 stars Very good 8,2 / 10 7 Nights 4 green fees from € 928 per person All Packages Get a €20 discount on your golf vacation with our newsletter Sign up for our newsletter and be the first to discover new golf packages, special offers, and exclusive golf tours. As a bonus, you will receive a €20 discount code for your next golf vacation. Yes, please send me the newsletter You can change your mind at any time by clicking the unsubscribe link in the footer of any newsletter you receive from us, or by contacting us at travel@albrecht.de . We will treat your information with respect. You can find details about our privacy practices here . By clicking above, you agree that we may process your information in accordance with these terms. Follow us on Instagram New Golf Guide Africa Asia Caribbean Central America Europe Middle East North America Pacific South America Golf Packages Book Golf Holiday Travel Themes Golf Round Trips Group Golf Tours Early Booking Deals Majorca Canary Islands Tuscany Algarve Andalusia Greece All Destinations Mobile App Golf Guide for iPhone Golf Guide for iPad Info Contact/Imprint Media Information Privacy Policy Terms Feedback © 2025 Albrecht Golf Verlag GmbH"
    },
    {
      "url": "https://westchasewca.com/",
      "text": "Westchase Community Association (WCA) | Tampa Florida Menu Skip Navigation Menu Home Residential Info Neighborhoods Bennington Berkeley Square The Bridges The Enclave The Fords Glencliff Glenfield The Greens Harbor Links / The Estates Keswick Forest Radcliffe Saville Rowe The Shires The Vineyards West Park Village Woodbay Wycliff Westchase Street Directory S&T Facilities Facility Rules Activity Room Rental Tennis Program Information Tennis Court Reservations USTA Team Info Swim Team Information Aquatic Fitness Program Information Docs & Forms Proposed Amendments Governing Documents – CCR’s & Guidelines Policies / Rules & Regs Forms FAQ’s News & Events Calendar News & Events Job Opportunities Gallery Government Overview WCA – HOA WCA Board Minutes Voting Member Meeting Minutes Budgets CDD Committees Covenants Committee Document Review Committee Government Affairs Modifications Committee Nominating Committee Renovations Committee Stork Club Swim & Tennis Committee Variance Committee Welcome Committee Volunteer Contact Select Page westchase entrance walking bridge over pond rainbow over Westchase pool Tampa Florida downtown westpark village fountain westchase pool Sunset On Clearwater Beach westchase 50th birthday party glencliff park Welcome About Westchase Westchase is a master-planned, deed restricted community encompassing over 2,000 acres. Our community of 3,514 homes boasts hundreds of acres of preserved land, a public golf club, two parks and of course swimming and tennis. The two swim and tennis centers are maintained and operated by the Westchase Community Association (WCA), the homeowners association for Westchase. The conservation areas, neighborhoods monuments, landscape beds and roadway medians are maintained by the Westchase Development District (CDD). The World of Westchase Newsmagazine (WOW) is a primary source of information about Westchase. It is placed in the front yard of each home on the first of each month at no cost to homeowners. The WCA The WCA is a Florida not-for-profit corporation run by the Board of Directors. This Board refers to the elected body responsible for management and operation of the association having its normal meetings under Florida corporate law. The Board directs and is assisted by a professional management company. The Voting Members (VMs) are Westchase owners’ representatives, elected by the members of each neighborhood, to be responsible for casting all votes attributable to the units in the neighborhood for the election of directors, amending the Declaration of Covenants, Conditions and Restrictions (CCRs), By-Laws and Residential Guidelines. As Westchase homeowners, you will have an opportunity to elect or run for VM yourself biennially. To access the resident portal “Vantaca User Library” for training material/user manuals, please use this link: support.vantaca.com What is a Deed Restricted Community? The CCR’s, By-Laws and Residential Guidelines are the governing documents of the association and each homeowner agrees to abide by them when purchasing a home in Westchase. Your deed is restricted to observance of the governing documents of the community. Learn about Westchase government by reading the Government Primer in the back of each print edition of the WOW. Violations of Deed Restrictions Some common violations are: Dirty driveway or sidewalk Trash cans in view of public or neighbor Unkempt conditions (mildew, peeling paint, etc.) on home or mailbox Sports equipment left out after restricted hours No rental agreement on file with management office Pets off leash and/or owners not picking up after pets The CDD The CDD is a governmental agency specially created to manage some common elements of the neighborhoods as well as the conservation areas and ponds. CDD supervisors are elected during county elections by Westchase residents. CDD fees are collected by the Hillsborough County Tax Collector and included in your annual tax assessment. Estoppel Requests Meeting Dates Programs Login Up Coming Events September 2025 Sep 11 2025 6:00 pm - 8:00 pm WCA Board of Directors Meeting WCA Office Sep 23 2025 5:00 pm Modifications Committee October 2025 Oct 07 2025 4:00 pm - 6:00 pm CDD Meeting Maureen Gauzza Library Oct 07 2025 5:00 pm Modifications Committee Oct 09 2025 6:00 pm - 8:00 pm WCA Board of Directors Meeting WCA Office Oct 14 2025 6:30 pm - 8:00 pm Voting Members Meeting No event found! Load More September 2025 11 Sep WCA Board of Directors Meeting Thursday , WCA Office EVENT DETAIL 23 Sep Modifications Committee Tuesday EVENT DETAIL October 2025 07 Oct CDD Meeting Tuesday , Maureen Gauzza Library EVENT DETAIL 07 Oct Modifications Committee Tuesday EVENT DETAIL 09 Oct WCA Board of Directors Meeting Thursday , WCA Office EVENT DETAIL 14 Oct Voting Members Meeting Tuesday EVENT DETAIL 21 Oct Modifications Committee Tuesday EVENT DETAIL November 2025 04 Nov CDD Meeting Tuesday , Maureen Gauzza Library EVENT DETAIL 04 Nov Modifications Committee Tuesday EVENT DETAIL 11 Nov Voting Members Meeting Tuesday EVENT DETAIL 13 Nov WCA Board of Directors Meeting Thursday , WCA Office EVENT DETAIL 18 Nov Modifications Committee Tuesday EVENT DETAIL No event found! Load More The Latest News NOTICES: Upcoming Board/Voting Members Meeting Sep 9, 2025 The Voting Members Meeting scheduled for September 9, 2025 @ 6:30pm will take place at the Countryway Activity Room located at 10405 Countryway Blvd. Voting Member Agenda – Notice of 2025 Annual VM Meeting (002)(27452860.2) Voting Member July Meeting Minutes – Voting... read more « Older Entries PROGRAMS LOGIN PLEASE NOTE: We have launched a new website on May 11th. All users will need to register for a new account. You will receive a confirmation email from WordPress once you are registered. LOGIN Forgot Password Registration is free and only required to sign-up for swim/tennis programs. Registration is not required to view website. Not a Member? Register Now SIGNUP FOR NOTIFICATIONS Please choose areas of interest for notifications: Yes No Swim & Tennis Center News Yes No WCA Meetings Yes No Westchase Events Yes No Safety & Emergency Notifications Neighborhood Specific News: No Preference Bennington Berkeley Square The Bridges Stockbridge Stonebridge Woodbridge The Enclave Abbotsford Brentford Castleford Chelmsford Kingsford Stamford Glencliff Glenfield The Greens Harbor Links/The Estates Keswick Forest Radcliffe Saville Rowe The Shires The Vineyards WPV - Arlington Park WPV - Classic Townhomes WPV - Reserve at Westpark Village WPV - Single Family Homes WPV - Townhomes WPV - Traditional Townhomes WPV - Village Green WPV - Villas WPV - Worthington Woodbay Wycliff I prefer to receive notifications by: SMS Text Email Both Please note: By providing your phone number and checking 'SMS Text', you agree to receive text messages from Westchase Community Association. Message and data rates may apply. Message frequency varies. You may opt out at any time. Contact Info © Copyright 2025 Westchase Community Association (WCA) 10049 Parley Drive, Tampa, FL  33626 Phone: 813-926-6404 | Fax: 813-926-1821 Email: manager@westchasewca.com Helpful Info Westchase WCA (HOA) - 813-926-6404 Westchase CDD - 813-920-4268 - westchasecdd.com World of Westchase Newsmagazine - westchasewow.com Tampa Web Design - Off the Page Creations Quick Links Governing Documents – CCR’s & Guidelines Policies/Rules & Regs Forms Facilities Estoppel Requests Privacy Policy Job Opportunities Home Residential Info Neighborhoods Bennington Berkeley Square The Bridges The Enclave The Fords Glencliff Glenfield The Greens Harbor Links / The Estates Keswick Forest Radcliffe Saville Rowe The Shires The Vineyards West Park Village Woodbay Wycliff Westchase Street Directory Back S&T Facilities Facility Rules Activity Room Rental Tennis Program Information Tennis Court Reservations USTA Team Info Swim Team Information Aquatic Fitness Program Information Back Docs & Forms Proposed Amendments Governing Documents – CCR’s & Guidelines Policies / Rules & Regs Forms Back FAQ’s Back Back News & Events Calendar News & Events Job Opportunities Gallery Back Government Overview Back WCA – HOA WCA Board Minutes Voting Member Meeting Minutes Budgets Back CDD Back Back Committees Covenants Committee Document Review Committee Government Affairs Modifications Committee Nominating Committee Renovations Committee Stork Club Swim & Tennis Committee Variance Committee Welcome Committee Volunteer Back Contact × Close Panel"
    }
  ]
}