{
  "fuentes": [
    {
      "url": "https://www.mhbo.com/mobile-home-park/48720-oakwood-mobile-home-park-3989-woodville-highway-tallahassee-fl-32301",
      "email": "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/48720-oakwood-mobile-home-park-3989-woodville-highway-tallahassee-fl-32301",
      "email": "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/48720-oakwood-mobile-home-park-3989-woodville-highway-tallahassee-fl-32301",
      "email": "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/83696-tallahassee-oakwoods-mobile-home-rv-park-290-ada-ct-tallahassee-fl-32305",
      "email": "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/83696-tallahassee-oakwoods-mobile-home-rv-park-290-ada-ct-tallahassee-fl-32305",
      "email": "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/83696-tallahassee-oakwoods-mobile-home-rv-park-290-ada-ct-tallahassee-fl-32305",
      "email": "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/83696-tallahassee-oakwoods-mobile-home-rv-park-290-ada-ct-tallahassee-fl-32305",
      "email": "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png"
    },
    {
      "url": "https://tallahasseervpark.com/",
      "email": "manager@tallahasseervpark.com"
    },
    {
      "url": "https://theoaksmhrvpark.com/contact",
      "email": "eben@eyebytes.com"
    },
    {
      "url": "https://wgppm.com/community-details/edgewater-estates/",
      "email": "edgewatermhc@wgppm.com"
    },
    {
      "url": "https://www.tallasseemobilehomes.com/about-us/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://www.tallasseemobilehomes.com/about-us/",
      "email": "info@businessname.com"
    },
    {
      "url": "https://www.180039atlas.com/contactus",
      "email": "sales@180039atlas.com"
    },
    {
      "url": "https://estersonmhcteam.com/mobile-home-parks-for-sale/",
      "email": "estersonmhcteam@marcusmillichap.com"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    }
  ],
  "mails": [
    "chosen-sprite@2x.png",
    "eben@eyebytes.com",
    "edgewatermhc@wgppm.com",
    "estersonmhcteam@marcusmillichap.com",
    "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png",
    "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png",
    "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png",
    "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png",
    "info@businessname.com",
    "info@communityaccessnaperville.org",
    "manager@tallahasseervpark.com",
    "sales@180039atlas.com"
  ],
  "nombre_sitio": "wgppm.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.mhbo.com/mobile-home-park/48720-oakwood-mobile-home-park-3989-woodville-highway-tallahassee-fl-32301",
      "text": "Oakwood Mobile Home Park | 3989 Woodville Highway, Tallahassee, FL 32301 | MHBO.com SEARCH Buy Rent Explore Parks My Property Feed favorite_border Favorites Sign Up or Login COMMUNITY PROFILE Oakwood Mobile Home Park 3989 Woodville Highway location_on Map It Tallahassee, FL 32301 | ID: 48720 hotel_class Review this Park Inquire About Homes Lot Rent Info Inquire About Homes Lot Rent Info ALL AGES PHOTOS VIDEO STREET VIEW 30.3864048 -84.2738541 954186 3989 Woodville Highway, Tallahassee, FL 32301 Details Name Oakwood Mobile Home Park Type of community All-ages community ? Lot rent range $425 - $575 Community owner type Company, privately held Property manager on site check Water type City Sewer type City provided Street width Average Parking Off-street Street type Paved Climate Zone Rating HOT-HUMID MORE OWNER/MANAGER? CLAIM THIS COMMUNITY input SEND TO MY PHONE About lot rent The lot rent ranges from $425 - $575 per month and includes: check Trash pickup check Water check Sewer Disclaimer Lot rent and other fees can change at any time without notice. MHBO is not responsible for quoting current monthly fees,\n          lot rent, or any dues/fees associated with the community or home. Additional fees for certain amenity privileges may apply.\n          All applicable community fees are the responsibility of the buyer to obtain and community manager/owner to disclose prior to ownership or occupancy. Description Oakwood Mobile Home Park is an all-ages manufactured home community located in 3989 Woodville Highway, Tallahassee, FL 32301. Oakwood Mobile Home Park is a land-lease community Home site lot rent ranges from $425 - $575 per month and includes the following: Trash pickup Water Sewer The streets in the community are paved, and are of an average street width. The water in the community is sourced from the city and the sewer system is city provided. Parking is off-street The community has 0 parking spaces available for RVs. Oakwood Mobile Home Park is an affordable housing choice for active, family-friendly living. This well-maintained community has easy access to local schools, recreation, shopping and entertainment. Equal Housing Opportunity Local Climate HOT-HUMID Oakwood Mobile Home Park is located in Climate Zone 1.\n      A HOT-HUMID climate is defined as a region that receives more than 20 inches (50 cm) of annual precipitation, and where the monthly average outdoor temperature remains above 67°F (19.5°C) throughout the year. Knowing your area’s climate zone (as assigned by the U.S. Department of Energy’s Building America Program into one of eight zones), can help you predict your heating and cooling needs. Humidity and temperature can of course vary, even by county. The Building America HOT-HUMID climate zone corresponds to the portions of IECC zones 2 and 3 in the dry category. READ MORE ABOUT CLIMATE ZONES > Inquire about this Community I was searching on MHBO.com and found your community. Please send me more information about Oakwood Mobile Home Park at 3989 Woodville Highway, Tallahassee, FL 32301 Send Message Share Share Email email Share on Facebook Share on Twitter Information Requested A detailed information sheet has been sent to your email. CLOSE Similar Mobile Home Parks You might be interested in these nearby communities. Brittany Estates Tallahassee, FL Features pool Pool Oakwoods MH & RV ... Tallahassee, FL Community Type family_restroom All Ages Evergreen Mobile ... Perry, FL Community Type family_restroom All Ages About Contact Accessibility Services Terms & Privacy Blog Sitemap © 2025 MHBO.com Equal Housing Opportunity Send Inquiry to Plant Prefab Model Type One Two Three Status One Two Three Create an alert for new models like this Send Message × Send to Your Phone"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/83696-tallahassee-oakwoods-mobile-home-rv-park-290-ada-ct-tallahassee-fl-32305",
      "text": "Oakwoods MH & RV Community | 290 Ada Ct., Tallahassee, FL 32305 | MHBO.com SEARCH Buy Rent Explore Parks My Property Feed favorite_border Favorites Sign Up or Login COMMUNITY PROFILE Oakwoods MH & RV Community 290 Ada Ct. location_on Map It Tallahassee, FL 32305 | ID: 83696 Inquire About Homes Lot Rent Info Inquire About Homes Lot Rent Info ALL AGES PET FRIENDLY PHOTOS VIDEO STREET VIEW 30.388835 -84.270528 1013603 290 Ada Ct., Tallahassee, FL 32305 Details Name Oakwoods MH & RV Community Type of community All-ages community ? Lot rent range $475 - $725 Office Phone (850) 583-1949 Total # of lots 75 Pet policy check Pet friendly check Pet restrictions apply Community owner type Company, privately held Community owner Three Pillar Communities Property manager on site check Water type Well Sewer type Septic Street width Average Parking Off-street Street type Paved MORE Schedule a Visit Check out Oakwoods MH & RV ... Call Us (850) 583-1949 Jessica Bonet input SEND TO MY PHONE About lot rent The lot rent ranges from $475 - $725 per month and includes: check Trash pickup check Water check Sewer Disclaimer Lot rent and other fees can change at any time without notice. MHBO is not responsible for quoting current monthly fees,\n          lot rent, or any dues/fees associated with the community or home. Additional fees for certain amenity privileges may apply.\n          All applicable community fees are the responsibility of the buyer to obtain and community manager/owner to disclose prior to ownership or occupancy. Description Oakwoods MH & RV Community is an all-ages manufactured home community located in 290 Ada Ct., Tallahassee, FL 32305. Oakwoods MH & RV Community is a land-lease community and has a total of 75 home sites. Home site lot rent ranges from $475 - $725 per month and includes the following: Trash pickup Water Sewer The streets in the community are paved, and are of an average street width. The water in the community is sourced from the well and the sewer system is septic. Parking is off-street The community has 0 parking spaces available for RVs. Managed on-site by WGP Property Management. Oakwoods MH & RV Community is an affordable housing choice for active, family-friendly living. This well-maintained community has easy access to local schools, recreation, shopping and entertainment. Equal Housing Opportunity Amenities check WiFi check On-Site Sales Office Inquire about this Community I was searching on MHBO.com and found your community. Please send me more information about Oakwoods MH & RV Community at 290 Ada Ct., Tallahassee, FL 32305 Send Message Share Share Email email Share on Facebook Share on Twitter Information Requested A detailed information sheet has been sent to your email. CLOSE Similar Mobile Home Parks You might be interested in these nearby communities. Brittany Estates Tallahassee, FL Features pool Pool Devencrest MH & R... Albany, GA Community Type family_restroom All Ages Evergreen Mobile ... Perry, FL Community Type family_restroom All Ages About Contact Accessibility Services Terms & Privacy Blog Sitemap © 2025 MHBO.com Equal Housing Opportunity Send Inquiry to Plant Prefab Model Type One Two Three Status One Two Three Create an alert for new models like this Send Message × Send to Your Phone"
    },
    {
      "url": "https://tallahasseervpark.com/",
      "text": "Tallahassee RV | Tallahassee RV Park (850) 878-7641 manager@tallahasseervpark.com Reserve Now Reserve Now Home Amenities Location Photo Gallery Rates / Availability Rules / Policies Select Page Photo Gallery Pet Friendly Contact Us / Directions Park Rules & Policies Welcome to Tallahassee RV Park Tallahassee RV Park is located in the rolling hills of Florida’s Capital City, Tallahassee.  Giant pines, majestic oaks, flowering magnolia and dogwoods dot the landscape, as well as a large variety of flowering shrubs and plants, to create a quiet and relaxing country setting.  The Park is convenient to all of Tallahassee’s fine dining, entertainment, and numerous local and area attractions.  Only minutes away from Florida State University, Florida A&M University, the Florida State Capital, a variety of quaint shops and both regional malls.  Visit the Tallahassee RV Park for a taste of Southern Hospitality at its finest. After 15 years of ownership our goal remains the same, offer our guests a clean, fun, and safe place to live, visit and work.  Whether you stay over-night, a week, or for several months, our management and staff are here to ensure your stay at Tallahassee RV Park exceeds your expectations. Features of Our RV Park Long pull-through shaded or open sites Full-Service hook-ups with water, electric, and sewage 30/50 amp electric service Complimentary wifi Sparkling pool Laundry facilities open 24 hours Convenient to Florida State Capital, FSU, FAMU, fine dining, quaint shops and numerous local and area attractions Club house with full kitchen Dog walk area Towering pines, magnolias, dogwoods, and beautiful flowering plants Tallahassee RV Park 64 ° clear sky humidity: 89% wind: 3mph NNW H 90 • L 64 89 ° Fri 88 ° Sat 89 ° Sun 89 ° Mon 91 ° Tue Weather from OpenWeatherMap Proud Members of: Tallahassee RV Park 64 ° clear sky humidity: 89% wind: 3mph NNW H 90 • L 64 89 ° Fri 88 ° Sat 89 ° Sun 89 ° Mon 91 ° Tue Weather from OpenWeatherMap Proud Members of: Lake City RV Resort 3864 North U.S. Hwy. 441 Lake City, FL 32055 (386) 752-0830 office (386) 752-0837 fax Reserve Now Home Amenities Location Photo Gallery Rates / Availability Rules / Policies Tallahassee RV Park © 2025 6504 Mahan Drive Tallahassee, FL 32308 | (850) 878-7641 office Share This Facebook Twitter"
    },
    {
      "url": "https://theoaksmhrvpark.com/contact",
      "text": "Contact | The Oaks Mobile Home and RV Park (928) 473-9079 Home Rates Contact More Home Rates Contact (928) 473-9079 Home Rates Contact Settle in and stay awhile Contact Us Drop us a line! Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Better yet, see us in person! We love our customers, so feel free to visit during normal business hours. The Oaks Mobile Home and RV Park 52744 E Highway 60, Miami, Arizona 85539, United States (928) 473-9079 Hours Mon 10:00 am – 02:00 pm Tue 10:00 am – 02:00 pm Wed 10:00 am – 02:00 pm Thu 10:00 am – 02:00 pm Fri 10:00 am – 02:00 pm Sat 10:00 am – 02:00 pm Sun 10:00 am – 02:00 pm Home Rates Contact The Oaks Mobile Home and RV Park 52744 E Highway 60, Miami, Arizona 85539, United States (928) 473-9079 Copyright © 2024 The Oaks Mobile Home and RV Park - All Rights Reserved. This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://wgppm.com/community-details/edgewater-estates/",
      "text": "Community Details - WGP Property Management WGP Property Management Resident Login Our Communities Homes for Sale Homes For Rent About Us Third Party Management FAQs TRIO Program Careers Contact Edgewater Estates Want more information? Please complete our form below! This field is hidden when viewing the form Page URL First Name * Last Name * Phone Number * Email Address * Preferred Method of Communication * Call Text Email No preference Comments/Questions Privacy Policy Consent * I agree to the WGP Property Management Privacy Policy found in the footer of this page. SMS Consent By checking this box, you agree to receive SMS text messages from WGP Property Management. Reply STOP to opt out at any time. Reply Help for Customer Care Contact information. Messages and data rates may apply. Message frequency will vary. Community Community Email Manager Name Manager Email Manager Phone Company This field is for validation purposes and should be left unchanged. 7954 Birch Bay Dr. Blaine, WA 98230 Apply Online Schedule Showing Community Type All Ages Amenities Community Green Space, Scenic Views, Walking Paths Manager Kevin Barrow Phone (360)205-5939 Email EdgewaterMHC@wgppm.com About Edgewater Estates We are offering full hook-up RV spaces for $650 a month. 30-amp and 50-amp hookups are available. Please fill out the contact form below or call our community manager to learn more! Welcome to Edgewater MHC where the beach is your front yard! We have access to a private beach that's only a 3 min walk. If you like shopping, Bellingham is only 25 min south. If you feel like visiting Canada for a day, the border is only 13 min north. This is the perfect place to vacation if you are seeking peace and tranquility. Homes for Sale Current homes for sale: None WGP Property Management | Copyright 2025 Created by Rent Manager Our Communities Homes for Sale Homes For Rent About Us Third Party Management FAQs TRIO Program Careers Contact Terms and Conditions - Privacy Policy"
    },
    {
      "url": "https://www.tallasseemobilehomes.com/about-us/",
      "text": "About Us | Tallassee Mobile Homes | Mobile Home Ownership About Us | Tallassee Mobile Homes | Mobile Home Ownership Directions 334-257-2770 Call Us Today! 334-257-2770 About Financing Homes More Hide Home About Us Financing Homes Contact Contact About Us Our mission at Tallassee Mobile Home Sales is to provide quality homes at an affordable price.  We are a family owned and operated business and have been in the industry for over 30 years. We at Tallassee Mobile Home Sales are committed to making your home ownership dreams a reality for you and your family.  We will always be fair, honest and provide you with quality work at an affordable price that you and your family will be proud to call home. Our Team Randall Price Owner Office: 334-257-2770 Email: Randallpricetmhs@gmail.com David Price Owner Office: 334-257-2770 Email: 199price@gmail.com Jessica Price Manager/Sales Associate Office: 334-257-2770 Cell: 334-415-9739 Email: Jessmcghee86@gmail.com Rodney Hicks Office: 334-257-2770 Cell: 334-201-4532 Email: TMHSRodney@gmail.com Tallassee Mobile Homes 6889 Tallapoosa St, Notasulga, AL 36866 334-257-2770 Sitemap Home About Us Financing Homes Contact Sitemap Contact Us Name Phone Email Message CAPTCHA Δ © 2025 Copyright & Powered By Tallassee Mobile Homes"
    },
    {
      "url": "https://www.180039atlas.com/contactus",
      "text": "Contact Us — Atlas Mobile Home & RV Parts 0 Skip to Content Our Products Our Company Contact Us Open Menu Close Menu Our Products Our Company Contact Us Open Menu Close Menu Our Products Our Company Contact Us Contact Us Phone (713) 699-0276 Toll-Free Number (800) 392-8527 Fax (713) 699-2737 Toll-Free Fax (888) 600-2654 Email sales@180039atlas.com Visit Us 700 E. Parker Rd Houston, Tx 77076 Hours Monday–Friday 8 am–5 pm Saturday 9 am–1 pm Our Products Our Company Contact Us Follow us on Facebook!"
    },
    {
      "url": "https://estersonmhcteam.com/mobile-home-parks-for-sale/",
      "text": "Current MHC/RV Parks For Sale | Esterson MHC Facebook-f Linkedin (720) MHP-4YOU EstersonMHCteam@marcusmillichap.com Services Mobile Home Park Valuation Sell Your Mobile Home Park Mobile Home & RV Parks For Sale Team Closed Deals Contact Us Services Mobile Home Park Valuation Sell Your Mobile Home Park Mobile Home & RV Parks For Sale Team Closed Deals Contact Us Manufactured Home Communities & RV parks For Sale Loading Maps Please Wait... Exclusive Listings: Mobile Home & RV Parks Sort By Date Sort By Title Sort By Price : High to Low Sort By Price : Low to High Myers MHP – Eden, NC Address: 103 Teresa Ln, Eden, NC 27288 Property Lots: 24 Total Tenants: 13 MSA/ST: Greensboro - High Point, NC MSA Utility: Mixed POH: 21 Pineview MHC – Birmingham, AL Address: 62 Clover Drive, Adamsville, Alabama, USA Property Lots: 140 Total Tenants: MSA/ST: Birmingham AL MSA Utility: Public POH: Forestdale MHC – Birmingham, AL Address: 2926 Una St, Birmingham, AL 35214 Property Lots: 185 Total Tenants: 91 MSA/ST: Birmingham AL MSA Utility: Private POH: 6 Oakridge MHC – Marion, OH Address: 6605 Marion-Agosta Rd, Marion, OH Property Lots: 112 Total Tenants: 50 MSA/ST: Columbus OH MSA Utility: Mixed POH: 0 Melbourne 55+ MHP – Melbourne, FL Address: Melbourne, FL 32935, USA Property Lots: 37 Total Tenants: 37 MSA/ST: Melbourne FL MSA Utility: Public POH: 0 Denny Terrace MHC – Columbia, SC Address: 7219 Frost Ave, Columbia, SC, USA Property Lots: 21 Total Tenants: 18 MSA/ST: Columbia SC MSA Utility: Mixed POH: 1 Lawson’s Court – Tifton, GA Address: 104 Lawson Ct, Tifton, GA, USA Property Lots: 17 Total Tenants: 17 MSA/ST: Tifton GA MSA Utility: Public POH: 15 Sierra Meadows – Troy, AL Address: 296 Sandy Lane, Troy, AL Property Lots: 50 Total Tenants: 11 MSA/ST: Troy AL MSA Utility: Mixed POH: 0 2 Park Port – Tampa, FL Address: 6700 N Rome Ave Tampa, FL 33604 Property Lots: 125 Total Tenants: 124 MSA/ST: Tampa FL MSA Utility: Mixed POH: 20 Marysville MHP – Altavista, VA Address: 375 Marysville Rd, Altavista, VA Property Lots: 24 Total Tenants: 18 MSA/ST: Lynchburg VA MSA Utility: Mixed POH: 2 2 Park Port – Dixon & Rock Falls, IL Address: 900 Reagan Rd, Rock Falls, IL 61071 Property Lots: 183 Total Tenants: 120 MSA/ST: Rock Falls IL MSA Utility: Mixed POH: 13 Mountain MHP – Pikeville, KY Address: 548 Harolds Branch, Pikeville, KY 41501 Property Lots: 22 Total Tenants: 21 MSA/ST: Lexington KY MSA Utility: Public POH: 3 6 Park Port – VT Address: 195 Dorr Dr, Rutland, VT 05701, USA Property Lots: 116 Total Tenants: 115 MSA/ST: Burlington VT MSA Utility: Mixed POH: 4 Woodland Campgrounds – Somerset, PA Address: 290 Gilmour Rd, Somerset, PA, USA Property Lots: 97 Total Tenants: MSA/ST: Altoona/Johnstown PA Utility: Private POH: Main St. RV – Midland, TX Address: 10515 W County Rd 127, Odessa, TX 79765, USA Property Lots: 162 Total Tenants: 150 MSA/ST: Odessa TX MSA Utility: Public POH: Callahan Home Sites – Lumberton, NC Address: 3050 Alamac Rd, Lumberton, NC 28358, USA Property Lots: 20 Total Tenants: 18 MSA/ST: Lumberton NC MSA Utility: Mixed POH: 2 Off-Market Listings: Mobile Home & RV Parks Confidential Listing #1252.1 Address: Property Lots: 90 Total Tenants: 68 MSA/ST: Lynchburg VA MSA Utility: Private POH: Confidential Listing #1532 Address: Property Lots: 103 Total Tenants: 49 MSA/ST: Anniston AL MSA Utility: Public POH: 42 Confidential Listing #1516 Address: Property Lots: 52 Total Tenants: 4 MSA/ST: Lynchburg VA MSA Utility: Mixed POH: Confidential Listing #938.1 Address: Property Lots: 80 Total Tenants: 59 MSA/ST: Virginia Beach VA MSA Utility: Private POH: 15 Confidential Listing #1546 Address: Property Lots: 85 Total Tenants: 5 MSA/ST: Toledo OH MSA Utility: Public POH: 5 Confidential Listing #1274.2 Address: Property Lots: 120 Total Tenants: 108 MSA/ST: Morganton NC MSA Utility: Mixed POH: 3 Confidential Listing #783.1 Address: Property Lots: 40 Total Tenants: 33 MSA/ST: Pittsburgh PA MSA Utility: Private POH: 20 Parks & Services Mobile Home & RV Parks For Sale Mobile Home Park Valuation Sell Your Park Privacy Policy ABOUT Meet The Team Contact Us Sign Up For Our Most Recent Deals Email Address * Area of Interest * Buying a Park Selling a Park Facebook-f Linkedin Compare Listings Compare Clear Title Price Status Type Area Purpose Bedrooms Bathrooms We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings . Accept Close GDPR Cookie Settings Privacy Overview Strictly Necessary Cookies Powered by GDPR Cookie Compliance Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies Enabled Disabled Enable All Save Settings"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "text": "Our Team | CAN top of page Diego Reeb, Grants Manager Our day programs include service and fun with peers in our community. Join our Fall Fundraiser Donate Home About Us Our Team Photo Gallery Our Program Our Participants Our Schedule Consulting Services Let Us Help You CAN Store Join Our Team Internships Volunteer Careers Become a Friend of CAN Support CAN Donate Fundraising Events Recycle Your Old Crayons Let Us Help You Our Supporters 2024 CAN Sponsors Our Community Supporters More Use tab to navigate through the menu items. CAN Staff Members Hannah Klinnert, Executive Director Sarah VanStedum, Program Leader Brenda Hasler, Operations Director Dawn Callahan, Program Leader Jissell Cano, Program Assistant Gregory Zelasko, Program Assistant Vanessa Maduzia, Program Advisor Kimberly Nierman, Intern Supervisor & Program Leader Andrew Zelasko, Program Leader Christina Stauffer, Program Leader Delani Kosner, Program Assistant Joseph Kim, Program Assistant Gia Hanrahan, Intern Coordinator & Program Leader Diana Chrostowski, Community Relations Coordinator Amy Ranalli, Program Assistant CAN's Administrative Board of Directors: CAN's Advisory Board : Vivienne Venderley Jennifer Fairlamb Jeanette Edwards Sherry Healey Jama Wall Mark Brown Justin Elder Peggy Kulling Mary Muszynski Subscribe to Newsletter Recent Newsletter CAN's Annual Financial Report Like us on Facebook 25 E Benton Ave Naperville, IL  60540 Info@communityaccessnaperville.org 630-352-1928 Community Access Naperville is a 501c3 not-for-profit organization. Donations are tax-deductible to the full amount permitted by law. bottom of page"
    }
  ]
}