{
  "fuentes": [
    {
      "url": "https://www.whisperingpinesny.net/",
      "email": "wpines88@aol.com"
    },
    {
      "url": "https://www.whisperingpinescleelum.com/contact",
      "email": "info@whisperingpinescleelum.com"
    },
    {
      "url": "https://www.palmbeachschools.org/WhisperingPinesElementary",
      "email": "valerie.crenshaw@palmbeachschools.org"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/44046-whispering-pines-7900-lawrence-road-boynton-beach-fl-33436",
      "email": "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/44046-whispering-pines-7900-lawrence-road-boynton-beach-fl-33436",
      "email": "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/44046-whispering-pines-7900-lawrence-road-boynton-beach-fl-33436",
      "email": "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/44046-whispering-pines-7900-lawrence-road-boynton-beach-fl-33436",
      "email": "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png"
    },
    {
      "url": "https://www.whisperingpines.ab.ca/contactus/",
      "email": "administration@whisperingpines.ab.ca"
    },
    {
      "url": "https://www.whisperingpines.ab.ca/contactus/",
      "email": "proshop@whisperingpines.ab.ca"
    },
    {
      "url": "https://www.pineskernville.com/contact",
      "email": "frontdesk@pineskernville.com"
    },
    {
      "url": "https://www.whisperingpinelodge.com/contact",
      "email": "whisperingpinelodge@frontier.com"
    },
    {
      "url": "https://wprnc.com/contact/",
      "email": "cwysokowski@wprnc.com"
    },
    {
      "url": "https://wprnc.com/contact/",
      "email": "flags@2x.webp"
    },
    {
      "url": "https://wprnc.com/contact/",
      "email": "globe@2x.webp"
    },
    {
      "url": "https://whisperingpinescare.com/contact/",
      "email": "infowhisperingpines@csnhc.com"
    }
  ],
  "mails": [
    "administration@whisperingpines.ab.ca",
    "cwysokowski@wprnc.com",
    "flags@2x.webp",
    "frontdesk@pineskernville.com",
    "globe@2x.webp",
    "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png",
    "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png",
    "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png",
    "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png",
    "info@whisperingpinescleelum.com",
    "infowhisperingpines@csnhc.com",
    "proshop@whisperingpines.ab.ca",
    "valerie.crenshaw@palmbeachschools.org",
    "whisperingpinelodge@frontier.com",
    "wpines88@aol.com"
  ],
  "nombre_sitio": "whisperingpinesfl.net",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.whisperingpinesny.net/",
      "text": "Site and utility work Whispering Pines Development Home Home About Services Leadership Portfolio Projects Contact Ab out us Whispering Pines Development is a family owned construction contractor that was established in 1988.  Since then it has grown into the highly respected and reputable company that it is today.  In 2009, we entered our second generation of ownership and operation under brother and sister, John Leonette and Kim Leonette.  Whispering Pines Development prides itself in quality work and dependability, two essential elements in the construction industry. Whispering Pines Development specializes in commercial and government contract work with a concentration in site work, utility work, drainage, concrete curbs and sidewalks and pipe bursting.  Our core clientele for the past twenty years has been the United States Military Academy at West Point. As a well-established contractor within the industry, we are a strong asset to any project.  Lasting relationships is of utmost importance to us and you can count on a high level of professionalism and attentiveness.  We have a diverse and knowledgeable team of employees who are very proficient and create an exceptionally successful working environment.  No matter the scope of work, you can count on our crews to accomplish the tasks and remain a lifeline for future projects. READ IN THE NEWS × In The News READ MORE Pg 2 × × In The News READ MORE Pg 3 × × In The News ser vices Concrete Work Sidewalks Stamped Concrete Curbs Granite Curbs Retaining Walls Modular Walls Site Work Erosion Control Demolition Land Clearing Grading Landscaping Rain Gardens Excavation Utility Work Drainage Water Lines Sewer Lines Pipe Bursting Pipe Lining Gas Le adership John has 30 years in the construction/site development industry. Attended the University of South Florida for construction engineering and surveying. Director of Operations/Construction Manager â Responsible for overseeing on-site operations, bidding, cost analysis, scheduling John M. Leonette Vice President, Owner Director of Operations/Financial Manager. Responsible for financial reporting and analysis, AIA documents, LEED reporting, job budgets and cost analysis, contract review. Kim M. Leonette President, Owner con tact in fo EMail us wpines88@aol.com Call us 845-569-2590 845-569-2599 Fax Visit us P.O. Box 716 50 Mertes Lane Vails Gate, NY 12584 o n the ma p wr ite a mess age Send Message fo llow us Design by Stardom Design W3layouts"
    },
    {
      "url": "https://www.whisperingpinescleelum.com/contact",
      "text": "Contact | Whispering Pines | Cle Elum, WA top of page Reservations Home About Us Camping Glamping Things To Do Contact Blog Contact Us First name Last name Email Phone Message Submit Thanks for submitting! Questions? Comments? Get in touch! You can reach us by sending us an email, messaging us on Facebook or Instagram, or giving us a call during business hours. (509) 674-7278 info@whisperingpinescleelum.com Business Hours May-Oct: Mon to Sun 9am-5pm Nov-Apr: Mon to Fri 10am-4pm Office/Store Closed During Winter & on Major Holidays Winter Monthly Stay Application Application approval begins in August for the upcoming winter. Monthly stays go through November 1 to April 30th ONLY. Credit/Background check will be required for each adult. $200 refundable deposit. Rent is $750/month plus electric. First name * Last name * Email * Phone * Please upload a few photos of your RV/Camper * Upload File(s) Are there any other adults to add? * Yes No Submit © 2024 Whispering Pines | Site built & Maintained by Retro Violet Studios 100 Whispering Pines Dr Cle Elum, WA, 98922 (509) 674-7278 info@whisperingpinescleelum.com Business Hours May - Nov: 9am-5pm Nov - Apr: Phone Reservations Mon to Fri: 10am-4pm Convenience Store Closed Nov-Apr & on Major Holidays RV Park is Open 365 Days a Year! CLICK HERE to make reservations. Policies Map Contact Facebook Instagram Home About Us Camping Glamping Things To Do Contact Blog Map Policies & Rules bottom of page"
    },
    {
      "url": "https://www.palmbeachschools.org/WhisperingPinesElementary",
      "text": "Home - Whispering Pines Elementary School Skip To Main Content menu-trigger-container Close Menu Search Search Clear Search mobile-main-nav Home School Info 2024 Capacity Watch List (opens in new window/tab) Afterschool Program Dress Code Getting Ready for Kindergarten Media Center Supply List School Advisory Council (SAC) School Meals School Boundary Map (opens in new window/tab) Students & Parents Classroom Library Inventory Clubs and Extracurricular Activities Here Comes the Bus Information (opens in new window/tab) House System Information School Counseling Student and Parent Resources (opens in new window/tab) Schools (opens in new window/tab) District (opens in new window/tab) mobile-district-nav Elementary Schools Middle Schools High Schools Adult Education Alternative Education Regional Offices & Resources Find My School (opens in new window/tab) Schools & Principals List header-container header-top-container info-bar nav-main Home School Info 2024 Capacity Watch List (opens in new window/tab) Afterschool Program Dress Code Getting Ready for Kindergarten Media Center Supply List School Advisory Council (SAC) School Meals School Boundary Map (opens in new window/tab) Students & Parents Classroom Library Inventory Clubs and Extracurricular Activities Here Comes the Bus Information (opens in new window/tab) House System Information School Counseling Student and Parent Resources (opens in new window/tab) Schools (opens in new window/tab) District (opens in new window/tab) rss-icon menu-trigger-container Menu sing-in-nav Sign In (opens in new window/tab) header-middle-container logo-container logo-image logo-title Whispering Pines Elementary School Educate. Affirm. Inspire. right-container site-search District Home Search Clear Search right-bottom-container translate--links translate-container translate-trigger Translate google-translate-holder sing-in-nav Sign In (opens in new window/tab) header-bottom-container icons-nav District Calendar (opens in new window/tab) Registration (opens in new window/tab) Parent Information (opens in new window/tab) Classroom Libraries Caring First (opens in new window/tab) School Cash Online (opens in new window/tab) Transportation (opens in new window/tab) Family Resources (opens in new window/tab) In This Section Breadcrumb Home Home hero-banner Important Items School Programs Explore the Choice and in-house programs offered at schools throughout the county. School Meals School Food Service will continue to offer FREE breakfast and lunch during the school year. School Advisory Council (SAC) Each advisory council shall perform functions prescribed by regulations of the district school board. Getting Ready for Kindergarten Everything you need to know to enroll your child and set them on the path to a bright future. Announcements Showcase of Schools Showcase of Schools Tuesday, October 28, 2025 4:00-8:00 p.m. South Florida Fairgrounds - Expo Center This event features more than 125 elementary, middle, and high schools offering Choice and in-house programs. The Choice application period, opens on November 3, 2025, for the 2026–2027 school year. Restricted Student Use of Wireless Devices During School Restricted Student Use of Wireless Devices During School School Choice District Choice Programs Families with students entering pre-kindergarten through grade 12 have the opportunity to choose from an array of Choice Programs. About Us Our Mission Statement The mission of Whispering Pines Elementary School is to create a safe, nurturing, learning environment and provide appropriate instructional resources to ensure the success of our teachers and students. We will incorporate a variety of innovative strategies, including the use of technology that will meet the unique needs of the whole child promoting high academic standards set by the Florida Department of Education. The School District of Palm Beach County serves more than 189,000 students who speak 150 languages and dialects. We are a High-Performing School District with 335 Choice and Career Programs. Our mission is to educate, affirm, and inspire each student in an equity-embedded school system. Quick Links Campus District Campus Bullying & Department of Children and Families (DCF) Abuse Hotline (opens in new window/tab) Dress Code FortifyFL App (opens in new window/tab) School Supply List SIS Gateway (opens in new window/tab) Transition to Kindergarten (opens in new window/tab) Lease School Facilities (opens in new window/tab) District Adult & Community Education Bullying & Department of Children and Families (DCF) Abuse Hotline CareerSource Palm Beach County Learner Pathways (opens in new window/tab) CARES - Centralized Complaint Assessment & Referral Evaluation System Caring First (opens in new window/tab) Doing Business with the District FortifyFL (opens in new window/tab) Public Records (opens in new window/tab) Reproductive Health and Disease Education School Choice SIS Parent Gateway (opens in new window/tab) Volunteer in Our Schools What Not to Bring to School SDPBC Upcoming Events Sep 11 Construction Oversight and Review Committee (CORC) Meeting 9 : 00 AM - 11 : 30 AM Read More about Construction Oversight and Review Committee (CORC) Meeting Sep 12 Forms Review Committee (FRC) 8 : 30 AM - 11 : 00 AM Read More about  Forms Review Committee (FRC) Sep 12 PBA Collective Bargaining Session 1 1 : 15 PM - 4 : 05 PM Read More about PBA Collective Bargaining Session 1 Sep 16 CTA Bargaining Session #2 1 : 30 PM - 4 : 20 PM Read More about CTA Bargaining Session #2 Sep 17 TAC - Technology Advisory Committee 9 : 00 AM - 10 : 30 AM Read More about TAC - Technology Advisory Committee Sep 17 Closed Sessions 3 : 00 PM - 5 : 00 PM Read More about Closed Sessions Sep 17 Regular Board Meeting 5 : 00 PM - 7 : 30 PM Read More about Regular Board Meeting Sep 18 District Diversity & Equity Ad Hoc Subcommittee 9 : 00 AM - 10 : 00 AM Read More about District Diversity & Equity Ad Hoc Subcommittee Sep 18 DISTRICT DIVERSITY AND EQUITY COMMITTEE 10 : 00 AM - 12 : 00 PM Read More about DISTRICT DIVERSITY AND EQUITY COMMITTEE Sep 19 Audit Committee Mtg 9 : 00 AM - 10 : 30 AM Read More about Audit Committee Mtg Sep 23 School Holiday *Fall Holiday* all day Read More about School Holiday *Fall Holiday* Sep 23 PBA Collective Bargaining Session #2 2 : 00 PM - 4 : 00 PM Read More about PBA Collective Bargaining Session #2 Sep 30 CTA Bargaining Session #3 11 : 30 AM - 3 : 20 PM Read More about CTA Bargaining Session #3 Oct 2 School Holiday *Fall Holiday* all day Read More about School Holiday *Fall Holiday* Oct 2 PBA Collective Bargaining Session #3 12 : 00 PM - 2 : 00 PM Read More about PBA Collective Bargaining Session #3 Oct 7 PBA Collective Bargaining Session #4 11 : 00 AM - 2 : 00 PM Read More about PBA Collective Bargaining Session #4 Oct 8 Closed Sessions/Workshop/Special Meetings 2 : 00 PM - 6 : 30 PM Read More about Closed Sessions/Workshop/Special Meetings Oct 9 Construction Oversight and Review Committee (CORC) Meeting 9 : 00 AM - 11 : 45 AM Read More about Construction Oversight and Review Committee (CORC) Meeting Oct 13 Academic Advisory Committee 5 : 45 PM - 7 : 15 PM Read More about Academic Advisory Committee Oct 15 Closed Sessions 3 : 00 PM - 5 : 00 PM Read More about Closed Sessions View Calendar SDPBC At a Glance An A-Rated School District FL Department of Education 95.9% Graduation Rate 335 Choice & Career Programs 192 Countries Represented 10th Largest District in the U.S. 32.8 Million Meals School Food Service 171,261 Students in District-operated schools 22,801 Total employees Visit Us 9090 Spanish Isles Blvd. Boca Raton FL 33496 Get Directions (opens in new window/tab) Contact Us 561-672-2700 Email Us & Important Phone Numbers About the District (opens in new window/tab) Accessibility (opens in new window/tab) Board Policies (opens in new window/tab) Careers (opens in new window/tab) District Legal Notices (opens in new window/tab) Employee & Student Sign In (opens in new window/tab) Parent SIS Gateway Sign In (opens in new window/tab) Non-Discrimination (opens in new window/tab) Public Records (opens in new window/tab) Student Records (opens in new window/tab) Facebook (opens in new window/tab) Twitter (opens in new window/tab) YouTube (opens in new window/tab) Instagram (opens in new window/tab) NOTICE: Under Florida law, email addresses are public record. If you do not want your email addresses released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing. To report waste, fraud, corruption, or abuse, please call the Inspector General Hotline: (855) 561-1010. Questions or Feedback? | Privacy Policy Copyright © 2024 Finalsite - all rights reserved. Powered by Finalsite"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/44046-whispering-pines-7900-lawrence-road-boynton-beach-fl-33436",
      "text": "Whispering Pines | 7900 Lawrence Road, Boynton Beach, FL 33436 | MHBO.com SEARCH Buy Rent Explore Parks My Property Feed favorite_border Favorites Sign Up or Login COMMUNITY PROFILE Whispering Pines 7900 Lawrence Road location_on Map It Boynton Beach, FL 33436 | ID: 44046 hotel_class Review this Park Inquire About Homes Lot Rent Info Inquire About Homes Lot Rent Info ALL AGES PET FRIENDLY PHOTOS VIDEO STREET VIEW 26.558445 -80.103074 886149 7900 Lawrence Road, Boynton Beach, FL 33436 Details Name Whispering Pines Type of community All-ages community ? Lot rent range $400 - $800 Office Phone (561) 965-5552 Total # of lots 304 Pet policy check Pet friendly Community owner type Company, privately held Property manager on site check Year built 1973 Total number of vacancies 1 Average monthly HOA/Lot Rent fees $640 Water type City Sewer type City provided Street width Average Parking Off-street Street type Paved Climate Zone Rating HOT-HUMID MORE Schedule a Visit Check out Whispering Pines Call Us (561) 965-5552 Sales & Leasing input SEND TO MY PHONE About lot rent The lot rent ranges from $400 - $800 per month and includes: check Trash pickup check Water check Sewer Disclaimer Lot rent and other fees can change at any time without notice. MHBO is not responsible for quoting current monthly fees,\n          lot rent, or any dues/fees associated with the community or home. Additional fees for certain amenity privileges may apply.\n          All applicable community fees are the responsibility of the buyer to obtain and community manager/owner to disclose prior to ownership or occupancy. Description Whispering Pines is an all-ages manufactured home community located in 7900 Lawrence Road, Boynton Beach, FL 33436. Whispering Pines is a land-lease community was built in 1973. and has a total of 304 home sites. Home site lot rent ranges from $400 - $800 per month and includes the following: Trash pickup Water Sewer The streets in the community are paved, and are of an average street width. The water in the community is sourced from the city and the sewer system is city provided. Parking is off-street The community has 0 parking spaces available for RVs. Whispering Pines is an affordable housing choice for active, family-friendly living. This well-maintained community has easy access to local schools, recreation, shopping and entertainment. Equal Housing Opportunity Amenities check Basketball court check Billiards check Boat storage check Fitness center check Clubhouse check Recreation facilities check Shuffleboard courts check Swimming pool check Laundry facilities check Sidewalks Local Climate HOT-HUMID Whispering Pines is located in Climate Zone 1.\n      A HOT-HUMID climate is defined as a region that receives more than 20 inches (50 cm) of annual precipitation, and where the monthly average outdoor temperature remains above 67°F (19.5°C) throughout the year. Knowing your area’s climate zone (as assigned by the U.S. Department of Energy’s Building America Program into one of eight zones), can help you predict your heating and cooling needs. Humidity and temperature can of course vary, even by county. The Building America HOT-HUMID climate zone corresponds to the portions of IECC zones 2 and 3 in the dry category. READ MORE ABOUT CLIMATE ZONES > Inquire about this Community I was searching on MHBO.com and found your community. Please send me more information about Whispering Pines at 7900 Lawrence Road, Boynton Beach, FL 33436 Send Message Share Share Email email Share on Facebook Share on Twitter Information Requested A detailed information sheet has been sent to your email. CLOSE Similar Mobile Home Parks You might be interested in these nearby communities. Sea Meadow Boynton Beach, FL Homes Ranging From $25K - $195K Maralago Cay Lantana, FL Features pool Pool Lake Worth Village Lake Worth, FL Features pool Pool About Contact Accessibility Services Terms & Privacy Blog Sitemap © 2025 MHBO.com Equal Housing Opportunity Send Inquiry to Plant Prefab Model Type One Two Three Status One Two Three Create an alert for new models like this Send Message × Send to Your Phone"
    },
    {
      "url": "https://www.whisperingpines.ab.ca/contactus/",
      "text": "Contact Us - Whispering Pines Golf Skip to primary navigation Skip to main content Skip to primary sidebar Skip to footer Whispering Pines Golf Red Deer County, Alberta Whispering Pines Golf Home GOLF Book a Tee Time Golf Rates Lessons & Programs Corporate Tournaments LIFESTYLE OPPORTUNITIES Phase 7 Updates Living At WP Amenities & more RESTAURANT Our Menu EVENTS & PROGRAMS Events & Programs GALLERY CONTACT US Contact Us Whispering Pines Golf & Country Club Resort Mailing Address 25054 South Pine Lake Road Pine Lake, Red Deer County, Alberta Canada T0M 1R0 Phone: (403) 886-5111 Tee Times: (403) 886-5111 Clubhouse/Restaurant: (403) 886-5111 Fax: (403) 886-4503 Main Office Email: administration@whisperingpines.ab.ca General Email Whispering Pines Golf & Country Club Resort Jeff Willmer Director Of Golf Bruce Greening Facility Maintenance Brad Frunchak Course Superintendent Larry Dyck General Manager Charlene Dyck Operations Manager Lat : 52.083033 Long : -113.444910 Please enable JavaScript in your browser to complete this form. Name: Email: Subject: Message: Message Submit Primary Sidebar Follow Us Footer Follow Us Address Whispering Pines Golf and Country Club Resort 25054 South Pine Lake Road, Pine Lake, AB T0M 1R0 Contact Us (403) 886-5111 Golf Course: proshop@whisperingpines.ab.ca Whispering Pines Administration: administration@whisperingpines.ab.ca Copyright © 2025 Whispering Pines Golf All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.pineskernville.com/contact",
      "text": "Contact Us | Whispering Pines Lodge Home About Accommodations Rooms & Suites Policies Attractions Gallery Contact BOOK NOW Home About Accommodations Rooms & Suites Policies Attractions Gallery Contact BOOK NOW Contact Us Slider Caption Book Now Contact Us at Whispering Pines Lodge Need more information about a stay with us at Whispering Pines Lodge. Send us a message using the form below, or simply give us a call at your convenience. We're happy to answer any questions you have. pine-super-wide (3) Contact 760-376-3733 frontdesk@pineskernville.com Locate 13745 Sierra Way Kernville, CA 93238 Connect Contact Us Name: Email: Phone: Message: Thank you for contacting us. We will get back to you as soon as possible. Oops, there was an error sending your message. Please try again later. © 2025 All Rights Reserved | Whispering Pines Lodge Website Design & Reservation Software by Resnexus Privacy Policy Terms of Use ADA Share by:"
    },
    {
      "url": "https://www.whisperingpinelodge.com/contact",
      "text": "CONTACT US — Whispering Pine Lodge 0 Skip to Content LODGING THE LODGE LOG SIDE-BY-SIDES VACATION HOMES & CABINS RATES AMENITIES CONTACT ABOUT RENTAL POLICIES PROPERTY MAP PICKEREL LAKE OUR STORY LOCAL INFO Open Menu Close Menu LODGING THE LODGE LOG SIDE-BY-SIDES VACATION HOMES & CABINS RATES AMENITIES CONTACT ABOUT RENTAL POLICIES PROPERTY MAP PICKEREL LAKE OUR STORY LOCAL INFO Open Menu Close Menu Folder: LODGING Back THE LODGE LOG SIDE-BY-SIDES VACATION HOMES & CABINS RATES AMENITIES CONTACT Folder: ABOUT Back RENTAL POLICIES PROPERTY MAP PICKEREL LAKE OUR STORY LOCAL INFO CONTACT US Request a Reservation Interested in visiting us?  We’d love to have you!  Submit a reservation request and we’ll get in touch!  You can also call us or send an email . CONTACT INFO (715) 479-4828 whisperingpinelodge@frontier.com Location 8440 Pinewood Drive Saint Germain, WI 54558 Get Directions Name * First Name Last Name Address * Address 1 Address 2 City State/Province Zip/Postal Code Country Email * Phone * (###) ### #### Inquiring about * The Lodge Cottage Log Side-By-Sides Vacation Homes Norway Cabin Check-In Date * MM DD YYYY Check-Out Date * MM DD YYYY Number of Guests * 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 Message * Thank you for your inquiry!  We’ll check on our availability and will be in touch as soon as we can. Sincerely, Whispering Pine Lodge Never Miss A Beat. LODGING THE LODGE LOG SIDE-BY-SIDES VACATION HOMES & CABINS LINKS RATES AMENITIES RESERVATIONS RENTAL POLICIES RESORT MAP PRIVACY ​ Copyright © Whispering Pine Lodge. All Rights Reserved. Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://wprnc.com/contact/",
      "text": "Contact | Whispering Pines EMAIL US: cwysokowski@wprnc.com CALL US: 203-469-2316 Our Center Medical Services Post Acute/Short Stay Care Long Stay Care Palliative/Hospice Care Respite Care About Us Our Mission & Values Meet Our Team Blog Gallery Careers Reviews Contact ▴ Contact Us Thank you for your interest in Whispering Pines Rehabilitation and Nursing Center; we hope you found our website easy to navigate and came by all the information you need. If you would like to know more about our services or provide us with feedback, please do not hesitate to contact us; one of our staff members will be glad to answer your queries. 38 Talmadge Ave, East Haven, CT 06512 203-469-2316 Office: cwysokowski@wprnc.com Contact us Email Address * Name * Phone Number * Interested In Interested In Post Acute/Short Stay Care Long Stay Care Palliative/Hospice Care Respite Care Other Message 0 / 180 Submit Please do not fill in this field. Our Center Gallery Volunteers Careers Medical Services Post Acute/Short Stay Care Long Stay Care Palliative/Hospice Care Respite Care About Us Our Mission & Values Meet Our Team Reviews Contact cwysokowski@wprnc.com 203-469-2316 38 Talmadge Ave, East Haven, CT 06512 ©2025 - Whispering Pines Rehabilitation and Nursing Center | All right reserved Privacy Policy Privacy Policy ©2022 - Whispering Pines Rehabilitation and Nursing Center | All right reserved Our Center Medical Services ← Back Post Acute/Short Stay Care Long Stay Care Palliative/Hospice Care Respite Care About Us ← Back Our Mission & Values Meet Our Team Blog Gallery Careers Reviews Contact"
    },
    {
      "url": "https://whisperingpinescare.com/contact/",
      "text": "Contact - Whispering Pines Lodge Care Portal Payment Portal About Us About Memory Care Admissions FAQ Careers Contact 903-757-8786 Whispering Pines Lodge Address: 2131 Alpine Rd, Longview, TX 75601 Main Phone: 903.757.8786 E-Fax: 682.258.0801 Email: infowhisperingpines@csnhc.com Customer Care Line Our skilled care team continually seeks ways to improve the quality of care we offer our residents. As a resident or family member, please feel free to contact our customer care line at any time to express concerns, offer advice, or seek assistance with a problem you may have. Your call can be anonymous, and all concerns are reviewed by our customer care team and followed-up on. 866.391.6123 Fill out our contact form below and a representative from our team will be in touch shortly. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Comment or Message * Captcha * = Submit Directions Connect With Us 903.757.8786 Explore Our Other Communities We are a part of the Creative Solutions in Healthcare family network. Quality care, outstanding customer service, and creating a caring and compassionate atmosphere for your loved one are among the many qualities of this long-term-care network. Being a part of this network means your loved one has the best possible care and support system. Use the map below to locate other care options in our network. The filter dropdown option will allow you to select the type of care that you need. Store locator is loading from StoreRocket Store Locator Widget .. About Us | Admissions | FAQ | Careers | Contact Follow Privacy Policy | Terms of Use Site Design by Teleos Marketing Facebook Twitter Instagram RSS Designed by Elegant Themes | Powered by WordPress English Spanish English Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Reset Reset We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok"
    }
  ]
}