{
  "fuentes": [
    {
      "url": "https://teamwhistle.com/",
      "email": "getintouch@teamwhistle.com"
    },
    {
      "url": "https://teamwhistle.com/press/team-whistle-ups-michael-cohen-to-ceo-sets-long-form-partnership-with-ex-electus-chief-chris-grant",
      "email": "getintouch@teamwhistle.com"
    },
    {
      "url": "https://teamwhistle.com/contact",
      "email": "getintouch@teamwhistle.com"
    },
    {
      "url": "https://www.whistlestoppers.com",
      "email": "info@whistlestoppers.com"
    },
    {
      "url": "https://www.thewhistlestop.com/",
      "email": "info@thewhistlestop.com"
    },
    {
      "url": "https://www.thewhistlestop.com/",
      "email": "info@thewhistlestop.com"
    },
    {
      "url": "https://www.thewhistlestop.com/",
      "email": "trainmaster@thewhistlestop.com"
    },
    {
      "url": "https://wewhistle.com/contact-us/",
      "email": "info@wewhistle.com"
    },
    {
      "url": "https://wewhistle.com/contact-us/",
      "email": "privacy@wewhistle.com"
    },
    {
      "url": "https://fortune.com/2024/09/23/linkedin-facebook-instagram-tiktok-data-ai-training/",
      "email": "dave.smith@fortune.com"
    },
    {
      "url": "https://fortune.com/2024/09/23/linkedin-facebook-instagram-tiktok-data-ai-training/",
      "email": "jeff.roberts@fortune.com"
    },
    {
      "url": "https://fortune.com/2024/09/23/linkedin-facebook-instagram-tiktok-data-ai-training/",
      "email": "marco.quiroz-gutierrez@fortune.com"
    },
    {
      "url": "https://fortune.com/2024/09/23/linkedin-facebook-instagram-tiktok-data-ai-training/",
      "email": "sharon.goldman@fortune.com"
    },
    {
      "url": "https://www.whistlestop.net/contact",
      "email": "info@whistlestop.net"
    }
  ],
  "mails": [
    "dave.smith@fortune.com",
    "getintouch@teamwhistle.com",
    "info@thewhistlestop.com",
    "info@wewhistle.com",
    "info@whistlestop.net",
    "info@whistlestoppers.com",
    "jeff.roberts@fortune.com",
    "marco.quiroz-gutierrez@fortune.com",
    "privacy@wewhistle.com",
    "sharon.goldman@fortune.com",
    "trainmaster@thewhistlestop.com"
  ],
  "nombre_sitio": "whistlestopboca.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://teamwhistle.com/",
      "text": "Team Whistle - Changing the sports and entertainment game for young audiences. | Site Name Skip to content Careers Press Contact Media Publisher Content Studio Insights Changing the sports and entertainment game We create and distribute engaging content experiences for today’s audiences. We play in the positive ⇢ Team Whistle We always play in the positive and resonate with what’s relatable We're on a mission to build a global sports and entertainment company at the dynamic intersection of media, technology and commerce that elevates and inspires our audience and community of partners. Every day. Every way. Media Publisher We have thousands of channels on the social, audio, and AVOD platforms that matter most to today’s audiences. Read more Content Studio We help global brands, sports leagues, and media companies activate and engage their audiences across today’s content ecosystem. Read more Originals We live to inspire. Here are some of our favorite series. Filter by theme Filter by format All Humor Inspiration Lifestyle Pop Culture Sports × All Long Form Short Form × Contact Us Talk to our team to find out how we can partner. Get in touch Team Whistle is an DAZN Group sports and entertainment media company built to engage and activate today’s generation, wherever they consume content globally. As a pioneer in data-driven content creation and distribution, Whistle has a positive and relatable original content slate of 50+ shows and a creator network that generates five billion views per month across digital and social platforms such as YouTube, TikTok, Snapchat, Instagram, and Facebook. With these deep ties to social and streaming platforms, Team Whistle’s internal agency “MAGNET,” provides platform-first content strategies to brands, leagues and platforms to attract audiences and create revenue opportunities. New York 285 Fulton Street, Floor 71, Suite G, New York, NY 10007 London 12 Hammersmith Grove, 6th Floor, London W6 7AP youtube instagram facebook twitter tiktok snapchat We are always on the lookout for new talent Join Team Whistle Privacy Policy Terms of Use Cookies Do not sell my personal data © Whistle Sports Inc, 2021. Website by Huxley ."
    },
    {
      "url": "https://teamwhistle.com/press/team-whistle-ups-michael-cohen-to-ceo-sets-long-form-partnership-with-ex-electus-chief-chris-grant",
      "text": "Team Whistle Ups Michael Cohen To CEO, Sets Long-Form Partnership With Ex-Electus Chief Chris Grant | Site Name Skip to content Careers Press Contact Media Publisher Content Studio Insights Press ⇠ View all press Whistle Team Whistle Ups Michael Cohen To CEO, Sets Long-Form Partnership With Ex-Electus Chief Chris Grant Team Whistle, parent of digital media operations such as Whistle, New Form, Tiny Horse and Vertical Networks, has promoted Michael Cohen to CEO, replacing company founder John West. Go to Press Team Whistle is an DAZN Group sports and entertainment media company built to engage and activate today’s generation, wherever they consume content globally. As a pioneer in data-driven content creation and distribution, Whistle has a positive and relatable original content slate of 50+ shows and a creator network that generates five billion views per month across digital and social platforms such as YouTube, TikTok, Snapchat, Instagram, and Facebook. With these deep ties to social and streaming platforms, Team Whistle’s internal agency “MAGNET,” provides platform-first content strategies to brands, leagues and platforms to attract audiences and create revenue opportunities. New York 285 Fulton Street, Floor 71, Suite G, New York, NY 10007 London 12 Hammersmith Grove, 6th Floor, London W6 7AP youtube instagram facebook twitter tiktok snapchat We are always on the lookout for new talent Join Team Whistle Privacy Policy Terms of Use Cookies Do not sell my personal data © Whistle Sports Inc, 2021. Website by Huxley ."
    },
    {
      "url": "https://teamwhistle.com/contact",
      "text": "Contact Whistle - Get in touch with our team - London, New York, L.A | Site Name Skip to content Careers Press Contact Media Publisher Content Studio Insights Contact Whistle Get in touch with our team: getintouch@teamwhistle.com Our Offices Enquiries YouTube Instagram Twitter Facebook TikTok Snapchat Our Offices We're a global media company New York One World Trade Center 71st Floor New York, NY 10007 ‍ tel: 646.661.5786 London 12 Hammersmith Grove 6th Floor London, W6 WAP Contact our Team Let's Talk Team Whistle is an DAZN Group sports and entertainment media company built to engage and activate today’s generation, wherever they consume content globally. As a pioneer in data-driven content creation and distribution, Whistle has a positive and relatable original content slate of 50+ shows and a creator network that generates five billion views per month across digital and social platforms such as YouTube, TikTok, Snapchat, Instagram, and Facebook. With these deep ties to social and streaming platforms, Team Whistle’s internal agency “MAGNET,” provides platform-first content strategies to brands, leagues and platforms to attract audiences and create revenue opportunities. New York 285 Fulton Street, Floor 71, Suite G, New York, NY 10007 London 12 Hammersmith Grove, 6th Floor, London W6 7AP youtube instagram facebook twitter tiktok snapchat We are always on the lookout for new talent Join Team Whistle Privacy Policy Terms of Use Cookies Do not sell my personal data © Whistle Sports Inc, 2021. Website by Huxley ."
    },
    {
      "url": "https://www.whistlestoppers.com",
      "text": "WHISTLESTOP BOOKSHOP WHISTLESTOP BOOKSHOP Welcome About Us Our History & Philosophy FAQ Authors Agatha Christie Albert Camus & His World Alistair MacLean Amy June Bates, Artist and Book Illustrator Anthony Burgess Arkady and Boris Strugatsky Arthur Conan Doyle Ayn Rand The Bronte Sisters Carl Hiaasen Charles Bukowski E.B. White, James Thurber, and Their World Eric Sloane G.K. Chesterton Georges Simenon Hunter S. Thompson & New Journalism James Baldwin Joan Didion John D. MacDonald John Le Carré J.R.R. Tolkien Jules Verne and H.G. Wells Kurt Vonnegut Lee Child Loren Eiseley Louise Erdrich Louise Penny Lovecraft and Howard Malcolm X Margaret Atwood Marianne Moore and Her World Mo Willems Neal Stephenson Neil Gaiman Norman Mailer Octavia Butler Pat LaMarche and the Charles Bruce Foundation P.G. Wodehouse Philip Roth Rachel Carson Ralph Ellison Randy Watts Ray Bradbury Robert A. Heinlein Robert B. Parker Ross Macdonald & Margaret Millar Shel Silverstein Stanislaw Lem Stephen King Toni Morrison Ursula K. Le Guin & Her Cohort Wendell Berry Willa Cather Zadie Smith Books & Subjects Anarchism Ancient Egypt Audiobooks:  Fiction, Poetry, & Drama Audiobooks:  Nonfiction Baby Shower Sampler The Beat Generation Bibles, Study Guides, and Accessories Books - New Fiction Books - New Fiction in Paperback Books - New & Notable Nonfiction Books - New & Selected Poetry & Drama Books -  Children's New & Notable Books in Original Languages or Translated from English Buddhism Carlisle Indian School Cats Civil War & Reconstruction Clearance, Sale Items, Bargains Cookbooks & Beverages Cricket Crosswords and Other Puzzles Dance Everyman's Library Everyman's Library Pocket Classics Series Fishing French & Indian War Ghost Stories & Supernatural Tales Graduation Graphic Lit:  Vintage, Independent, Marvel, and DC The Habsburg Empire Harry Potter Holidays! International Mystery Islam and its World Korean War The Library of America Local Authors Past & Present Outdoors/Nature Pandemic Literature Pennsylvania Outdoors Pennsylvania Plain People Politics & Current Events US Presidents Revived Writers Russia and its World Science Fiction and Fantasy Classics Scotland & the Scottish Diaspora Signed Copies Sports Staff Picks Tarot & Oracle Ukraine Vietnam War Vikings & Anglo-Saxons Westerns Western Mysteries World War I World War II Young Adult Young Adult Graphic Lit Nonbooks Boxed Notecards & Stationery Decomposition Notebooks DVDs Folkmanis Puppets and Other Toys Games Gift Cards, store totes, extra postage Honey Independent Bookstore Days 2017-2025 Notebooks Out of Print and Others:  Totes, Clothing, and Accessories Puzzles with 1000 pieces or more Puzzles with less than 1000 pieces Puzzles for Children Vintage Radio Events What Goes On Here . . . . New Events Location & Directions Blog Contact Us WHISTLESTOP BOOKSHOP Welcome / About Us / Our History & Philosophy FAQ Authors / Agatha Christie Albert Camus & His World Alistair MacLean Amy June Bates, Artist and Book Illustrator Anthony Burgess Arkady and Boris Strugatsky Arthur Conan Doyle Ayn Rand The Bronte Sisters Carl Hiaasen Charles Bukowski E.B. White, James Thurber, and Their World Eric Sloane G.K. Chesterton Georges Simenon Hunter S. Thompson & New Journalism James Baldwin Joan Didion John D. MacDonald John Le Carré J.R.R. Tolkien Jules Verne and H.G. Wells Kurt Vonnegut Lee Child Loren Eiseley Louise Erdrich Louise Penny Lovecraft and Howard Malcolm X Margaret Atwood Marianne Moore and Her World Mo Willems Neal Stephenson Neil Gaiman Norman Mailer Octavia Butler Pat LaMarche and the Charles Bruce Foundation P.G. Wodehouse Philip Roth Rachel Carson Ralph Ellison Randy Watts Ray Bradbury Robert A. Heinlein Robert B. Parker Ross Macdonald & Margaret Millar Shel Silverstein Stanislaw Lem Stephen King Toni Morrison Ursula K. Le Guin & Her Cohort Wendell Berry Willa Cather Zadie Smith Books & Subjects / Anarchism Ancient Egypt Audiobooks:  Fiction, Poetry, & Drama Audiobooks:  Nonfiction Baby Shower Sampler The Beat Generation Bibles, Study Guides, and Accessories Books - New Fiction Books - New Fiction in Paperback Books - New & Notable Nonfiction Books - New & Selected Poetry & Drama Books -  Children's New & Notable Books in Original Languages or Translated from English Buddhism Carlisle Indian School Cats Civil War & Reconstruction Clearance, Sale Items, Bargains Cookbooks & Beverages Cricket Crosswords and Other Puzzles Dance Everyman's Library Everyman's Library Pocket Classics Series Fishing French & Indian War Ghost Stories & Supernatural Tales Graduation Graphic Lit:  Vintage, Independent, Marvel, and DC The Habsburg Empire Harry Potter Holidays! International Mystery Islam and its World Korean War The Library of America Local Authors Past & Present Outdoors/Nature Pandemic Literature Pennsylvania Outdoors Pennsylvania Plain People Politics & Current Events US Presidents Revived Writers Russia and its World Science Fiction and Fantasy Classics Scotland & the Scottish Diaspora Signed Copies Sports Staff Picks Tarot & Oracle Ukraine Vietnam War Vikings & Anglo-Saxons Westerns Western Mysteries World War I World War II Young Adult Young Adult Graphic Lit Nonbooks / Boxed Notecards & Stationery Decomposition Notebooks DVDs Folkmanis Puppets and Other Toys Games Gift Cards, store totes, extra postage Honey Independent Bookstore Days 2017-2025 Notebooks Out of Print and Others:  Totes, Clothing, and Accessories Puzzles with 1000 pieces or more Puzzles with less than 1000 pieces Puzzles for Children Vintage Radio Events / What Goes On Here . . . . New Events Location & Directions / Blog / Contact Us / WHISTLESTOP BOOKSHOP Independent Bookseller since 1985. Welcome WHISTLESTOP BOOKSHOP Welcome / About Us / Our History & Philosophy FAQ Authors / Agatha Christie Albert Camus & His World Alistair MacLean Amy June Bates, Artist and Book Illustrator Anthony Burgess Arkady and Boris Strugatsky Arthur Conan Doyle Ayn Rand The Bronte Sisters Carl Hiaasen Charles Bukowski E.B. White, James Thurber, and Their World Eric Sloane G.K. Chesterton Georges Simenon Hunter S. Thompson & New Journalism James Baldwin Joan Didion John D. MacDonald John Le Carré J.R.R. Tolkien Jules Verne and H.G. Wells Kurt Vonnegut Lee Child Loren Eiseley Louise Erdrich Louise Penny Lovecraft and Howard Malcolm X Margaret Atwood Marianne Moore and Her World Mo Willems Neal Stephenson Neil Gaiman Norman Mailer Octavia Butler Pat LaMarche and the Charles Bruce Foundation P.G. Wodehouse Philip Roth Rachel Carson Ralph Ellison Randy Watts Ray Bradbury Robert A. Heinlein Robert B. Parker Ross Macdonald & Margaret Millar Shel Silverstein Stanislaw Lem Stephen King Toni Morrison Ursula K. Le Guin & Her Cohort Wendell Berry Willa Cather Zadie Smith Books & Subjects / Anarchism Ancient Egypt Audiobooks:  Fiction, Poetry, & Drama Audiobooks:  Nonfiction Baby Shower Sampler The Beat Generation Bibles, Study Guides, and Accessories Books - New Fiction Books - New Fiction in Paperback Books - New & Notable Nonfiction Books - New & Selected Poetry & Drama Books -  Children's New & Notable Books in Original Languages or Translated from English Buddhism Carlisle Indian School Cats Civil War & Reconstruction Clearance, Sale Items, Bargains Cookbooks & Beverages Cricket Crosswords and Other Puzzles Dance Everyman's Library Everyman's Library Pocket Classics Series Fishing French & Indian War Ghost Stories & Supernatural Tales Graduation Graphic Lit:  Vintage, Independent, Marvel, and DC The Habsburg Empire Harry Potter Holidays! International Mystery Islam and its World Korean War The Library of America Local Authors Past & Present Outdoors/Nature Pandemic Literature Pennsylvania Outdoors Pennsylvania Plain People Politics & Current Events US Presidents Revived Writers Russia and its World Science Fiction and Fantasy Classics Scotland & the Scottish Diaspora Signed Copies Sports Staff Picks Tarot & Oracle Ukraine Vietnam War Vikings & Anglo-Saxons Westerns Western Mysteries World War I World War II Young Adult Young Adult Graphic Lit Nonbooks / Boxed Notecards & Stationery Decomposition Notebooks DVDs Folkmanis Puppets and Other Toys Games Gift Cards, store totes, extra postage Honey Independent Bookstore Days 2017-2025 Notebooks Out of Print and Others:  Totes, Clothing, and Accessories Puzzles with 1000 pieces or more Puzzles with less than 1000 pieces Puzzles for Children Vintage Radio Events / What Goes On Here . . . . New Events Location & Directions / Blog / Contact Us / WELCOME! Whistlestop Bookshop is an independent bookseller in Carlisle, Pennsylvania, in the lovely and historic Cumberland Valley in southcentral Pennsylvania.  Our current hours are 10-6 Monday through Saturday . During other hours we welcome messages via our voicemail, e-mail, or via our website \"contact us\" boxes. Important Note to Searchers: the website lists only about 10% of store inventory .  If you do not find what you are looking for here, please send me an e-mail or call with your information! A new gift card design!  Gift cards are flexible, do not expire, and can be used partially or as part of a larger purchase.  They can be applied to an online purchase as well as used in the store.  They may be picked up in the store, mailed to the purchaser, or mailed to the recipient.  Customized in any manner requested.  Click through the picture below for a direct link.  Image courtesy of Jennifer Oswald Photography. The Welcome Home is Amy June Bates’s latest book, one for which she is both the author and illustrator.  You can see from the cover that many of Amy’s previous books and artistic interests are present (and even cozy on a chair) in her latest work of genius. Most recent Purple Lizard Map is Tuscarora State Forest!  Perfectly complements the Michaux State Forest Map, a revision of which is forthcoming soon! Has there ever been a better time for puzzles? We don’t think so! Check our puzzle page for selections from Galison, Pomegranate, Peter Pauper Press, Flame Tree Publishing, and more! Michael Storring’s A Day at the Bookstore (Galison) A collection of mostly early pieces that reveal what would become Joan Didion’s subjects, including the press, politics, California robber barons, women, and her own self-doubt. Let Me Tell You What I Mean has twelve pieces from 1968 to 2000, never before gathered together, offer an illuminating glimpse into the mind and process of a legendary author.  The two matchless Library of America volumes remind us why she is one of the best. View fullsize View fullsize View fullsize Our favorite author and illustrator Amy June Bates has a major release for 2023 with Hidden Hope: How a Toy and a Hero Saved Lives During the Holocaust .  It is written by Elisa Boxer and published by Abrams.  Her beautiful art graces the pages of these other titles as well!  We have an entire page devoted to her work. The only way to face the stresses and strains of modern life is with a cup of tea and a good book… bonus points if the book is about tea Be sure to check out our Instagram: We were honored and excited to host the book launch event for CRYSTAL OAKMAN, author of The Imprint: The Unintended Inheritance That’s Shaping Your Life .  Crystal has written an informal, intimate, and wise book on the complexity of factors that make us who we were, who we are, and who we may be if we understand this inheritance.  Click through the image below to be directed to the book! Heather Cox Richardson of Boston College began a daily Facebook post in 2019 in light of the impeachment crisis at the time.  Not only did it catch on and vault her into social media superstardom, it gave her room to address far-reaching topics in US history not usually brought up in the media.  Since the collection of the essays was published last September, it has remained my bestselling nonfiction hardcover. Kristin Hannah’s much-anticipated Vietnam War novel has received instant success upon publication. On April 4, 2023, an important book on the state of healthcare and doctors entangled therein was published: If I Betray These Words by Wendy Dean with Simon Talbot. It is a story-rich account of Dr. Dean's establishment of \"moral injury\" as diagnostic of the tensions between what doctors know is right and what hospital-owning corporations require of them. Wendy has been a friend of Whistlestop for many years.  All our copies are signed by Dr. Dean. Local author and friend of Whistlestop Eleanor Donald Alspaugh has brought the work of years to a big fascinating book about one man’s experience of training and combat in World War II.  Her father’s letters to her mother, along with other letters and a global-spanning context, make for riveting reading.  Click on the book cover below for more information and to order. NOW IN PAPERBACK!  David Maraniss’s big new biography of Jim Thorpe, Path Lit by Lightning, the first in the dozen years since Kate Buford’s Native American Son, was published in August.  Thorpe was Carlisle’s contribution to international sports fame, having begun his career at the Indian Industrial School at Carlisle.  He is almost universally considered one of the greatest modern athletes. My current favorite birding book. “ Slow Birding is the perfect guide for the birder looking to appreciate the beauty of the birds right in their own backyard, observing keenly how their behaviors change from day to day and season to season.” Jean-Jacques Sempé (1932 - 2022) Quick leaps to selected treasures! Cool Journals Literary fashion Boxed Notecards Audiobooks More of what we do, what we offer, and what we have: Since we are an independent bookstore, we do things differently.  Here you will find: new books carefully selected in a comprehensive and eclectic spirit fine journals and notebooks from DeComposition , Peter Pauper Press, Chronicle, and Discovery Press. cards from Earth Sky + Water , Notes & Queries (many UK lines), and Compendium stunning, high-qualit postcards by local photographer and historian Jennifer Oswald , including scenes of Carlisle and the Cumberland Valley calendars in season (September through January) jigsaw puzzles for adults and children educational card decks of all kinds local honey in a wide variety of packages from Tom Jones, the Happy Beekeeper bookmarks, totebags, and other gifts Customer service is our goal.  Among the ways we pay attention to our patrons in person or off-site are: quick, efficient special ordering (no extra charge) free giftwrap gift cards/certificates Thanks for visiting!  Check often for changes and enhancements. Above all, support your independents! An author interview with Kim van Alkemade(http://kimvanalkemade.com), author of the bestselling novel, Orphan #8 (http://www.whistlestoppers.com/new-products-2/orphan-8), and Jeff Wood on location at Whistlestop Bookshop (http://www.whistlestoppers.com). Video provided by Greg Bear/gbmediadesign (http://www.gbmediadesign.com). Ursula K. Le Guin sums it up in 6 minutes.  This wonderful, wise, brave, honest, articulate woman is a great writer.  We are honored to sell all of her work, from Catwings to the Earthsea books to her life-changing books of fantasy, science fiction, and lands-in-between.  Here she is accepting a lifetime achievement award from the National Book Award Foundation. Whistlestop Bookshop 129 W High St Carlisle, PA 17013 (717) 243-4744 Contact Us! Powered by Squarespace"
    },
    {
      "url": "https://www.thewhistlestop.com/",
      "text": "All Aboard ... - Skip to content The Original Whistle Stop and Online Store The Original Whistle Stop and Online Store Shop Online COMPLETE INVENTORY Cart   / $ 0.00 No products in the cart. Return to shop Cart No products in the cart. Return to shop Home | Hot Sheet Current Hot Sheets Industry News New Products TOWS Events All Hot Sheet Summary | APPRAISALS | Special Events | Contact | Our History Whistle Stop History – In The Beginning Whistlestop History – Part 2 Whistlestop History – Part 3 WhistleStop History – Part 4 Whistlestop History – Part 5 Whistlestop History – Part 6 All All Books Caboose DCC/DC Power Diesel Electric Freight Gift Cards Passenger Steam Vehicles Search for: THE WHISTLE STOP IS HIRING -💰 Are you looking for a part-time job to supplement your retirement? We are looking for a few good individuals who want to work on a flexible part-time schedule and love retail model trains. 🚂. Model Railroading knowledge a must – (we will train you for sales and customer service) 🚂. Reach out to info@thewhistlestop.com or call Fred: 626796-7791 THE CREW: Fred, Alex, Bill, Judy, Jerry, Paul, Sandra, John, Val, Tom, Dennis and Juan (left to right – bottom to top row) ______________________________________________________________________________ Store Hours:  Mon – Sat  10:00 – 5:00.  Sun 11:00-4:00 626-796-7791 trainmaster@thewhistlestop.com The Original Whistle Stop … your “local” model train store connection. Join us in celebrating 70 years of service! For nearly 70 years, “The Stop” has been the leading Model Hobby Store, both nationally and internationally. Most research for online purchases agree, “Mechanical and electronic toys” are the types of items that need to be seen and tested, before you purchase.  When you buy these items online or at a Big-Box store, you do not have the ability to inspect the product and ensure the quality of materials as well as the personal presence of an “expert” who can walk you through the product features, set up and maintenance”. ______________________________________________________________ Trains, Train Starter Sets, Books, Layout Products, Accessories and More! We pride ourselves on offering the BEST Customer Care ! We offer exceptional “expert” customer service, knowledgeable and friendly staff, and have everything you need to complete all your model projects. Our store is stocked with nearly every type of model material, railroad literature, kits, train sets, models and other railroading products. _____________________________________________________________________________ __________________________________________________________________________ THE TRAIN MAN – “A Small Scale Journey “ _________________________________ NOW AVAILABLE THROUGH THE ONLINE STORE! _____________________________________________________________________________ Model Trains for every model railroader from beginner to the seasoned expert! All scales O, HO, N, and Z – we are your source! We feature products by such industry leading manufacturers as: The Coach Yard, Overland Models, Key Imports, PSC,Division Point, and AZ L. We stock a full line of: Lionel, MTH, Athearn, Bachmann, Broadway Limited, Kato, Arrowhead, InterMountain, Tangent, Fox Valley, Atlas, Marklin, Micro-Trains. Featuring Model Trains, Brass Trains, Railroad Locomotives, Rolling Stock, Parts, Buildings, Scenery, Kits, Books and Train Sets.  Toy Trains. Railroad Memorabilia and Collectables. Model Repair and much more! And don’t forget – trains are for kids of all ages, and our Thomas the Tank play area and full line of merchandise is just what is needed to get you and your little one excited about trains. Creating Memories – Family and Community Connections – Encouraging, Motivating and Educating – …  since 1951! _______________________________________________________________ Check out our catalog to see the full line of trains and products for sale, including out-of-production, and very unique model railroading and train items https://www.thewhistlestop.com/catalog/ ______________________________________________________________________________ Why support your local Hobby Store – The Original Whistle Stop ? The relationship is created between you, the customer, and the Staff of The Original Whistle Stop. You are not just a purchase … you are family. The Original Whistle Stop, nearly 70 years young, is the character of Pasadena, and stands as a testament to your acknowledgment of the tremendous risk and challenges inherent in owning a small business. The Original Whistle Stop is run by people – not by boards, stockholders or algorithms. This means you get a different kind of CARE, QUALITY, and SERVICE because – what and how we sell – is a reflection of us. When you support an independent business, The Original Whistle Stop, you’re supporting a true reflection of the person behind it. New Product Announcements, Industry News, Fun Railroad Stories and Store Events! Don’t Miss A Single One. SIGN UP for our newsletter “The Hotsheet” Email address: First Name Last Name Leave this field empty if you're human: _________________________________________________________________________ We wanted to share a great video produced by Retail Archeology.  Enjoy __________________________________________________________________________ ______________________________________________ Past Hot Sheets THE MOST UNIQUE LOCOMOTIVE YOU WILL EVER FIND … This Denver, South Park & Pacific Steam Locomotive is “ HAND – BUILT ” by Joseph Murphy, one of Walt Disney’s most prominent Imagineer’s. His vision – scratch build a 100% Brass engine in a very unusual scale of 7/16”. This “ ONE OF A KIND ” “ PRICELESS ” piece is the MUST HAVE for any railroad enthusiast’s collection and for the Connoisseur of brass collectables. This item will not be on the shelf for long. Moderately priced to sell at $14,000. Contact:  Fred Hill 626-796-7791   E mail:  Info@thewhistlestop.com For store location, hours of operation and other information – please go to “Contact” page. ____________________________________________________ We would love to see your layouts, pictures, and hear your railroad thoughts … follow us on Facebook at: https://www.facebook.com/The-Original-Whistle-Stop-464014996971251/ Copyright 2025 © Flatsome Theme All All Books Caboose DCC/DC Power Diesel Electric Freight Gift Cards Passenger Steam Vehicles Search for: Home | Hot Sheet Current Hot Sheets Industry News New Products TOWS Events All Hot Sheet Summary | APPRAISALS | Special Events | Contact | Our History Whistle Stop History – In The Beginning Whistlestop History – Part 2 Whistlestop History – Part 3 WhistleStop History – Part 4 Whistlestop History – Part 5 Whistlestop History – Part 6 Login Newsletter Login Username or email address * Required Password * Required Remember me Log in Lost your password?"
    },
    {
      "url": "https://wewhistle.com/contact-us/",
      "text": "Contact Us - Whistle What We Do Spot Rewards Safety Incentives + Rewards Employee Recognition Employee Payments Culture Budgets Manager Training Rewards Automation Industries Construction Manufacturing Health Care Resources Blog White Papers Case Studies Procore Resources Pricing Contact Us Who We Are Scientific and Technical Advisors Partners Schedule a demo Sign In Search Menu Menu Contact us to learn how Whistle Rewards is helping the construction and manufacturing industries improve safety and engagement. Click video to play Whistle Rewards is the easiest way to launch a safety rewards program, improve technology adoption or send spot-rewards to any team member, subcontractor or vendor.  From building a culture of safety to improving Procore adoption , Whistle Rewards is the leading rewards and recognition partner in construction and manufacturing. Join our Community! * indicates required Email Address * First Name * Last Name * Company Name * Whistle is committed to protecting and respecting your privacy, and we’ll only use your contact information to administer your account and to provide the products and services you requested from us. From time to time, we would like to contact you about our products and services, as well as other content that may be of interest to you. You can unsubscribe from these communications at any time. Please visit our Terms and Conditions and Privacy Policy for additional information. By clicking submit, you consent to allow Whistle to store and process the personal information submitted above to provide you the content requested. Phone Email LinkedIn Twitter What we do Spot Rewards Employee Recognition Safety Incentives and Rewards Employee Payments Culture Budgets Manager Training Employee Onboarding Employee Loyalty Index Microlearning Whistle Payments API Resources Blog White Papers Case Studies Procore Resources Pricing NSC Members AGC Members Who we are Scientific and Technical Advisors Industries Construction Healthcare Manufacturing Financial Services Contact us Schedule a demo Press and Media Whistle Systems Inc. (c) 2024 Privacy Policy Terms And Conditions The Whistle Card is issued by Sutton Bank, Member FDIC, pursuant to a license from Visa U.S.A. Inc. The Whistle card is powered by Marqeta. Scroll to top We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings . Accept Close GDPR Cookie Settings Privacy Overview Strictly Necessary Cookies Powered by GDPR Cookie Compliance Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. See below for out full marketing website privacy policy. Privacy Policy - Marketing Website Version: 9-2-2021 Data collected on the basis of consent Upon your request and expression of consent, we collect the following data for the purpose of marketing to you. Your data is not used for any other purposes or shared with third parties. It is removed upon your withdrawal of consent or your request to stop being marketed to. Contact Information Email address, first name, last name, company name, and a description of how Whistle can help you: this data is collected when you fill out and submit the contact form displayed throughout the Website. The contact information is transmitted and stored in our contact management system so that we can keep track of our interactions (email, meeting notes, downloading resources from our website) over time. Periodically we will send product updates, policy changes or other information we feel is relevant to our clients or potential clients.  These updates are typically sent via email.  People receiving these emails can opt out of additional communication at any time. Retention period: the aforementioned data is retained indefinitely so we can continue to market to you according to our content and marketing strategy. Data collected on the basis of legitimate interest Based on our legitimate interests , we collect the following data for the purpose of running this website. Your data is not used for any other purposes or shared with third parties. It is removed upon your request. Statistics The website uses a minimal build of Google Analytics, a service which transmits website traffic data to Google Analytics servers in the United States and allows us to notice trends to improve the user experience on our website. This minimal build processes personal data such as: the unique User ID set by Google Analytics, the date and time, the title of the page being viewed, the URL of the page being viewed, the URL of the page that was viewed prior to the current page, the screen resolution, the time in local timezone, the files that were clicked on and downloaded, the links clicked on to an outside domain, the type of device, and the country, region, and city. You may opt out of this tracking at any time by activating the “Do Not Track” setting in your browser. Embedded content from other websites Articles on the Website may include embedded content (e.g. videos, charts, etc.). Embedded content from other websites behaves in the exact same way as if the visitor had visited the other website. These websites may collect data about you, use cookies, embed additional third-party tracking, and monitor your interaction with that embedded content, including tracing your interaction with the embedded content if you have an account and are logged in to that website. Your rights pertaining your data If you have filled out the contact form on this Website, you can request to receive an exported file of the personal data we hold about you, including any data you have provided to us. You can also request that we rectify or erase any personal data we hold about you. Please send your request to privacy@wewhistle.com The right to withdraw consent • The right of access • The right to erasure • The right to rectification • The right to data portability • The right to object • Notification of data breaches • The right to lodge a complaint with a supervisory authority Strictly Necessary Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. Enable All Save Settings"
    },
    {
      "url": "https://fortune.com/2024/09/23/linkedin-facebook-instagram-tiktok-data-ai-training/",
      "text": "LinkedIn, Facebook, and Instagram are hoovering up your data to train their AI. Here’s how to stop it | Fortune SEARCH Home News Fortune 500 Fortune Global 500 Fortune 500 Europe Fortune China 500 Fortune SEA 500 Great Place to Work Tech AI Innovation Cybersecurity Finance Personal Finance Real Estate Economy Investing Banking Crypto Leadership Success Future of Work Workplace Culture C-Suite CEO Initiative Lifestyle Arts & Entertainment Travel & Leisure Health Well Education Rankings Analytics Multimedia Live Media Magazine Newsletters Video Podcasts Home News FORTUNE 500 FORTUNE 500 FORTUNE SEA 500 Fortune 500 Europe Fortune Global 500 Fortune China 500 Great Place to Work Tech Tech AI Innovation Cybersecurity Finance Finance Personal Finance Real Estate Economy Banking Investing Crypto Leadership Leadership Success Future of Work Workplace Culture C-Suite CEO Initiative Lifestyle Lifestyle Arts & Entertainment Travel & Leisure Health Well Education Rankings Rankings Analytics Multimedia Multimedia Live Media Magazine Newsletters Video Podcasts Asia Europe Analytics Tech · LinkedIn LinkedIn, Facebook, and Instagram are hoovering up your data to train their AI.  Here’s how to stop it By Jenn Brice By Jenn Brice You don’t have to let social media services harvest your data to train their generative AI, as many companies do these days. You can opt out—if you can figure out how. The problem was hammered home last week when tech news site 404Media reported that LinkedIn had started training its AI on its users’ posts by default, without letting users know about the change. LinkedIn is relying on the data to train AI that will help users write their posts or to recommend content to them. A social media platform hoovering up posts and personal information for their AI system isn’t entirely new. Meta has been harvesting Facebook and Instagram user data since last year , while X, formerly Twitter, has done the same since July. TikTok, whose data policies are under scrutiny amid a possible U.S. ban, hasn’t clearly stated whether it harvests user data for any generative AI tools. Social media companies have long been criticized for how they collect, use, and share user data. In a report on Thursday, the Federal Trade Commission called out social media services for their “vast surveillance” of users and “woefully inadequate” data controls. What’s going on at LinkedIn LinkedIn opted hundreds of millions of its users outside of the EU and the UK into its AI training push without specifically telling users about it. The company told 404Media on Wednesday that it will add new language to its terms of service “shortly.” Earlier this month, LinkedIn made a broader update to its user policy, saying that when training AI, it will “seek to minimize personal data in the data sets used to train the models” by redacting or removing personal information such as suggested posts or messages, according to a LinkedIn explanation of the policy . LinkedIn said in a statement to Fortune that it doesn’t harvest direct messages, or messages sent privately between users. LinkedIn Spokesperson Greg Snapper told Fortune that the company believes users should have control over their data. “We’ve always used some form of automation in LinkedIn products, and we’ve always been clear that users have the choice about how their data is used,” he said. How to opt out of LinkedIn’s data harvesting for AI Opting out of LinkedIn’s data harvesting for AI requires visiting the service’s “Settings & Privacy” pages. They are accessible by clicking on your headshot in the upper right on a desktop computer, and then clicking on “Account.” You must then click on “Data privacy” on the left sidebar, which brings up several options including “Data for Generative AI improvement.” To opt out, you toggle the switch next to the line that reads “Use my data for training content creation AI models.” LinkedIn has turned on this option by default. It means your personal data and LinkedIn content is used to train “content creation AI models” — and not just for LinkedIn, but its “affiliates” as well. LinkedIn is owned by Microsoft , which has also partnered on AI with OpenAI through Microsoft’s multi-billion dollar investment in the maker of ChatGPT . Some of LinkedIn’s models are provided by Microsoft’s Azure OpenAI service, according to LinkedIn’s FAQ. But opting out of AI training does nothing to reverse the company’s collection of your data prior, and LinkedIn did not specify when it started harvesting user data to train AI. “Opting out means that LinkedIn and its affiliates won’t use your personal data or content on LinkedIn to train models going forward, but does not affect training that has already taken place,” according to LinkedIn’s FAQ page. If the multi-step process is too much, Cassie Kozyrkov, former chief decision scientist at Google , shared a one-click opt-out link with her followers that lets users avoid having to hunt for the appropriate page. In her post, Kozyrkov, who LinkedIn has designated a “top voice” with more than 600,000 followers, criticized LinkedIn for its data harvesting, saying it could “clone your posts without crediting you.” How to opt out of X and Meta’s data harvesting for AI As for other social media platforms, opting out of data harvesting involves a similarly complicated process to LinkedIn’s. To opt out of X using your data to train its AI chatbot Grok, go to “Settings” on a desktop computer and select “Privacy and safety.” Then, under “Data sharing and Personalization,” select Grok. Here you can uncheck the box that permits data sharing. You can also select an option to delete your conversation history with Grok. On this page, X explains that your posts, as well as interactions, prompts, and results with Grok are fair game for training and fine-tuning its AI model, and that they may be shared with Elon Musk’s xAI, which provides the chatbot to X. The chatbot is only available to paid users but is trained on any public posts. It’s a trickier situation for Meta, which just last week acknowledged that it has used every public Facebook and Instagram post from non-EU users since 2007 to train its AI. Since June, Meta has also been scraping interactions with chatbots on Facebook, Instagram, Threads, and WhatsApp to train AI. Currently, if you live in a country without a data privacy law, the only way to opt out of Meta using your posts for its AI training is to set your account to private. This does not protect against data harvesting of any public posts you appear in, or your own previous posts that were already scraped. TikTok’s silence about AI training TikTok did not respond to Fortune’s requests for comment about whether it builds generative AI models with user data. This summer, TikTok launched a genAI advertising tool for brands to create videos, and TikTok’s corporate owner, the Chinese tech company ByteDance, has launched various AI apps for users outside of China . Under “Account and privacy settings,” TikTok says that it collects and analyzes face and voice information “to improve safety and user experience, to recommend and moderate content, and for analytics and demographic classification.” To stop your face and voice from being used, TikTok tells users not to upload any photos or videos of yourself and delete any that you’ve already posted. Fortune Global Forum returns Oct. 26–27, 2025 in Riyadh. CEOs and global leaders will gather for a dynamic, invitation-only event shaping the future of business. Apply for an invitation. Rankings 100 Best Companies Fortune 500 Global 500 Fortune 500 Europe Most Powerful Women Future 50 World’s Most Admired Companies See All Rankings Sections Finance Leadership Success Tech Asia Europe Environment Fortune Crypto Health Retail Lifestyle Politics Newsletters Magazine Features Commentary MPW CEO Initiative Conferences Personal Finance Education Customer Support Frequently Asked Questions Customer Service Portal Privacy Policy Terms of Use Single Issues for Purchase International Print Commercial Services Advertising Fortune Brand Studio Fortune Analytics Fortune Conferences Business Development About Us About Us Editorial Calendar Press Center Work at Fortune Diversity and Inclusion Terms and Conditions Site Map © 2025 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal Information FORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice."
    },
    {
      "url": "https://www.whistlestop.net/contact",
      "text": "Contact Us | The WhistleStop - Trinidad, TX HOME MENUS BREAKFAST MENU LUNCH MENU DINNER MENU BRUNCH MENU WINE & COCKTAILS SPIRITS EVENT CALENDAR ABOUT US PRIVATE PARTIES CATERING CONTACT RESERVATIONS HOME MENUS BREAKFAST MENU LUNCH MENU DINNER MENU BRUNCH MENU WINE & COCKTAILS SPIRITS EVENT CALENDAR ABOUT US PRIVATE PARTIES CATERING CONTACT RESERVATIONS CONTACT THE WHISTLESTOP CALL US 903-778-5133 EMAIL US info@whistlestop.net FIND US 104 W. Front Street, Trinidad, TX, 75163 Business Hours Mon - Tue Closed Wed - Thu 7:00 am - 10:00 am 11:00 am - 9:00 pm Fri - Sat 7:00 am - 10:00 am 11:00 am - 10:00 pm Sunday 10:30 am - 2:30 pm RESERVATIONS CLICK HERE Contact Form Name: Email: Phone: Message: Thank you for contacting us. We will get back to you as soon as possible. Oops, there was an error sending your message. Please try again later. Join our mailing list for food specials & events! SIGN UP NOW! The Whistlestop, is an upscale American restaurant and bar nestled in Trinidad, Texas. Experience our one-of-a-kind menu in a charming rustic-chic setting, conveniently located near Cedar Creek Lake. From hosting special events to offering a variety of monthly happenings like live music and themed menu nights, we cater to everyone's taste! Bring your family, friends, or plan your perfect date night at The Whistlestop—the ultimate culinary destination at Cedar Creek Lake. NAVIGATE YOUR WAY HOME MENUS BREAKFAST MENU LUNCH MENU DINNER MENU BRUNCH MENU WINE & COCKTAILS SPIRITS EVENT CALENDAR ABOUT US PRIVATE PARTIES CATERING CONTACT FIND US 104 W. Front Street, Trinidad, TX, 75163 903-778-5133 Business Hours Mon - Tue Closed Wed - Thu 7:00 am - 9:00 pm Fri - Sat 7:00 am - 10:00 pm Sunday 10:30 am - 2:30 pm RESERVATIONS © 2025 The Whistlestop | Trinidad, Texas | All Rights Reserved Designed + Powered by Sugar Rock Share by:"
    }
  ]
}