{
  "fuentes": [
    {
      "url": "https://pinkelephant.co.uk/about/contact-us/",
      "email": "e.lawrence@pinkelephant.co.uk"
    },
    {
      "url": "https://pinkelephant.co.uk/about/contact-us/",
      "email": "info@pinkacademy.nl"
    },
    {
      "url": "https://pinkelephant.co.uk/about/contact-us/",
      "email": "info@pinkelephant.co.uk"
    },
    {
      "url": "https://www.drunkelephant.com/contact-us.html",
      "email": "drunkelephant@shiseido.com.tw"
    },
    {
      "url": "https://www.drunkelephant.com/contact-us.html",
      "email": "info@drunkelephant.ca"
    },
    {
      "url": "https://www.drunkelephant.com/contact-us.html",
      "email": "info@drunkelephant.com"
    },
    {
      "url": "https://www.drunkelephant.com/contact-us.html",
      "email": "press@drunkelephant.com"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "bus@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "caskmarque@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "cider@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "cluballowscamravisitors@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "disabledaccess@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "dogfriendly@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "eveningmeals@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "events@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "facebook@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "familyfriendly@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "functionroom@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "games@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "garden@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "livemusic@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "locale@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "lunchtimemeals@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "memberdiscountscheme@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "ocrpub@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "parking@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "quiet@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "realale@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "realfire@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "restaurant@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "smoking@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "sportstv@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "telephone@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "website@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "wifi@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "camra@camra.org.uk"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "close_button@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "club_corner@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "down_arrow_divider@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "logo-new-header@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "overlay_close_button@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "email": "white.elephant.0104@spiritpubcompany.com"
    },
    {
      "url": "https://www.aspentimes.com/news/new-aspen-hotel-brings-exclusive-art-bmws-and-landscape-luxury/",
      "email": "rstingray@aspentimes.com"
    },
    {
      "url": "https://redelephantway.com/contact-us/",
      "email": "goldman-sachs-10000-small-businesses@2x.png"
    },
    {
      "url": "https://redelephantway.com/contact-us/",
      "email": "sales@redelephantway.com"
    },
    {
      "url": "https://redelephantway.com/contact-us/",
      "email": "sales@redelephantway.com"
    }
  ],
  "mails": [
    "bus@2x.png",
    "camra@camra.org.uk",
    "caskmarque@2x.png",
    "cider@2x.png",
    "close_button@2x.png",
    "club_corner@2x.png",
    "cluballowscamravisitors@2x.png",
    "disabledaccess@2x.png",
    "dogfriendly@2x.png",
    "down_arrow_divider@2x.png",
    "drunkelephant@shiseido.com.tw",
    "e.lawrence@pinkelephant.co.uk",
    "eveningmeals@2x.png",
    "events@2x.png",
    "facebook@2x.png",
    "familyfriendly@2x.png",
    "functionroom@2x.png",
    "games@2x.png",
    "garden@2x.png",
    "goldman-sachs-10000-small-businesses@2x.png",
    "info@drunkelephant.ca",
    "info@drunkelephant.com",
    "info@pinkacademy.nl",
    "info@pinkelephant.co.uk",
    "livemusic@2x.png",
    "locale@2x.png",
    "logo-new-header@2x.png",
    "lunchtimemeals@2x.png",
    "memberdiscountscheme@2x.png",
    "ocrpub@2x.png",
    "overlay_close_button@2x.png",
    "parking@2x.png",
    "press@drunkelephant.com",
    "quiet@2x.png",
    "realale@2x.png",
    "realfire@2x.png",
    "restaurant@2x.png",
    "rstingray@aspentimes.com",
    "sales@redelephantway.com",
    "smoking@2x.png",
    "sportstv@2x.png",
    "telephone@2x.png",
    "website@2x.png",
    "white.elephant.0104@spiritpubcompany.com",
    "wifi@2x.png"
  ],
  "nombre_sitio": "whiteelephantpub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://pinkelephant.co.uk/about/contact-us/",
      "text": "Contact Pink Elephant EMEA | Get in Touch with ITSM Experts News Case Studies About Pink People at PINK Careers Resources Library Contact us X Skip To Keyboard Navigation Skip To Main Content Search About Contact Training Get your free trial Join 10.000+ IT professionals and experience the award-winning Pink e-Learning Portal today and get your free trial! Get your free trial E-Learning ITIL® 4 PRINCE2® COBIT® Agile Project Management Agile Scrum Lean IT DevOps Artificial Intelligence Service Automation Change Management IT Asset Management SIAM® IT Business Relationship Manager VeriSM Kanban Data Analytics MSP® Information Security SDI Service Desk Analyst Service Management Essentials Pink e-Learning Portal Classroom & Virtual Training ITIL® 4 PRINCE2 COBIT Agile Project Management Lean IT DevOps Service Automation Change Management IT Asset Management SIAM® IT Business Relationship Manager Cloud Service Manager Information Security@ISO27001 Customer Service Training Public Classroom Training Business Simulations MarsLander ITSM Virtual The Phoenix Project Challenge of Egypt Apollo 13 Consulting Unlock Business Value with trusted ITSM Experts Our multi-skilled thought leaders drive success by optimising and transforming your service operations. Speak to Our Experts Assessments ITSM Process Maturity Assessment IT Service Desk Assessment ISO/IEC 20000 Readiness Assessment ISO/IEC 27001 Readiness Assessment Software Asset Management Assessment Strategy and Implementation ITSM Visioning & Strategy Design ITSM Process Design and Implementation ITSM Tool Selection Value Stream Mapping Target Operating Model SIAM Strategy and Design Service Management Office CMDB Strategy and Design Service Catalogue Scoping and Strategy IT Support Tailored IT Support Solutions, Powered by Best Practices From a Managed Service Desk to onsite IT resourcing, we deliver bespoke solutions built on ITSM excellence. Get your instant quote now IT Support Services Managed IT Support Out of Hours IT Support ITSM Process Management IT Resourcing Get a Quotation Application Support Application Support Bespoke Application Support Application Administration Support Cloud Services Enterprise Application Support Azure Support Google Workspace Support Backup/Monitoring Veeam Backup / Restore Office 365 / Azure Monitoring Service Health Monitoring Alert Management Network Monitoring Technology Drive Digital Transformation with the right Service Management Tool Maximise your ITSM investment and drive operational excellence with custom-fit service management solutions. Request a demo Products ServiceNow ServiceNow MSP HaloITSM Ivanti Freshservice Cherwell Services Consulting Services Support Services X How can we help? Welcome to Pink Elephant EMEA! We offer a comprehensive range of ITSM and ESM services designed to support your organisation's digital transformation. Whether you're looking for expert ITSM consulting, cutting-edge technology solutions, award-winning training courses, or hands-on IT support, explore our website and use the search box to easily find the resources, insights, and services you need. back Home » Expect More. Expect Pink » Contact Us Contact Us Have a question or need assistance? Fill out the form below, and a member of our team will get back to you as soon as possible! Pink Elephant EMEA 6th Floor Reading Bridge House George Street, Reading RG1 8LS, United Kingdom +44(0) 118 324 0620 info@pinkelephant.co.uk Pink Elephant Education Straatweg 171 3054 AD Rotterdam Zuid Holland The Netherlands +31 (0)85 303 7872 info@pinkacademy.nl Blue Ocean IT Services 1st floor – 116 Oxford Road Rosebank Johannesburg South Africa +27 (0)10 753 1300 info@pinkelephant.co.uk \" * \" indicates required fields Name First Last Email * Phone Company * Message * Name This field is for validation purposes and should be left unchanged. Case studies All cases Growth powered by Pink Elephant’s SIAM IT Service Desk Corplex (formerly DS Smith Plastics, Extruded Products) is a leading manufacturer of innovative reusable packaging. With a history spanning 50 years, Corplex rebranded in 2020 after being acquired by Olympus Partners. The company is dedicated to sustainability and excellence, establishing itself as a trusted name in the Reusable Transport Packaging... View this Case Bespoke Customer Service training programme for GTT Pink Elephant EMEA builds on the success of a GTT’s customer service offering with a bespoke virtual training programme. Find out more below about the objectives, challenges, and successes of delivering a training programme to 250+ GTT employees, in three countries, across three time zones. Find Out More about Customer... View this Case AON optimises ITSM and UX Aon PLC, a leading British-American multinational professional services firm, offers a wide range of financial risk-mitigation products, including insurance, pension administration, and health insurance plans. To continue delivering exceptional service across its global operations, Aon sought to transform its IT Service Management (ITSM) practices and enhance the user experience. The... View this Case Find us on Pink Elephant EMEA Case Studies Careers Contact Us About Pink Elephant Newsletter signup Training Public Classroom Schedule Pink e-Learning Portal Business Simulations Training Courses IT Support Managed IT Support Out of Hours IT Support ITSM Process Management IT Resourcing Technology ServiceNow Ivanti Freshworks ITSM Tool Selection Terms and Conditions Human Trafficking Policy Privacy Statement Cookie Declaration Resources Library Locations"
    },
    {
      "url": "https://www.drunkelephant.com/contact-us.html",
      "text": "Contact: Get in Touch with Our Team | Drunk Elephant Skip to main content Skip to main content Shop Smoothie Bundles Our Guide to Vitamin C Shop Skincare Moisturizers Serums Masks + Treatments Cleansers Sun Protection Eyes + Lips Shop All Hair Care Shampoos Conditioners Treatments Leave-In + Styling Shop All Body Care Cleansers Lotions Exfoliants + Scrubs Deodorants Shop All Best Sellers Kits & Bundles Drunk Life Gift Card Learn Philosophy Smoothie Glossary Drunk Glossary Our Guide to Vitamin C The Moisturizer Edit The OG Color Serum Drops Find Your Hydrating Serum FAQ The Drunk Mag Contact Sign In/Register Quantity of items in cart is , 0 search You can use the tab key (or swipe left or right on your mobile device) to access the suggestions given as you type or submit this form to search for the keyword you have entered. search Back to main navigation Scroll to bottom Your browser's Javascript functionality is turned off. Please turn it on so that you can experience the full capabilities of this site. Contact Us have a question? great! that’s what we’re here for Our Customer Relations team knows everything there is to know about Drunk\r\n                    Elephant and could talk for hours about our products, but we promise they won’t (unless you want\r\n                    them to!). Our business hours: 8:00 am – 5:00 pm CST Monday – Thursday and 8:00 am – Noon CST Friday, excluding US Holidays Live Chat and Phone Summer Hours: 9:00 am – 5:00 pm CST Monday – Thursday, excluding US Holidays EMAIL US info@drunkelephant.com CHAT WITH US Chat with a real person,\r\n                            right now CALL US 1-800-604-1795 MEDIA INQUIRIES press@drunkelephant.com INTERNATIONAL INQUIRIES Canada inquiries, please contact: info@drunkelephant.ca For UK inquiries, please fill out this form or call: +44\r\n                            2038100777 For France inquiries, please fill out this form or call: +33186766000 For Germany inquiries, please fill out this form or call: +4921197554007 For Japan inquiries, please fill out this form or call: Toll-free: 0120-050-529 For Taiwan inquiries, please contact: drunkelephant@shiseido.com.tw or\r\n                        call 0800-001-080 drunkelephant Contact Us #barewithus @drunkelephant #barewithus @drunkelephant #barewithus @drunkelephant #barewithus @drunkelephant #barewithus @drunkelephant #barewithus @drunkelephant SIGN UP AND RECEIVE 15% OFF YOUR FIRST ORDER Enter your email Subscribe Bora Barrier™ Repair Cream Skincare Skincare Moisturizers Serums Masks + Treatments Cleansers Sun Protection Eyes + Lips Travel Hair Care Hair Care Shampoos Conditioners Treatments Leave-in + Styling Body Care Body Care Cleansers Lotions Exfoliants + Scrubs Deodorants Misc Misc Best Sellers Gifts Kits & Bundles Drunk Life Learn Learn Philosophy Our Story Smoothie Glossary The Drunk Mag Press Connect Connect Contact Us Stores Shipping & Returns FAQ Careers Discounts Student Teacher Military Medical Professional First Responder Check Gift Card Balance Live Chat Facebook Twitter Instagram Tik Tok Privacy Policy Terms & Conditions Do Not Sell or Share My Personal Information © Drunk Elephant Select Region United States Canada United Kingdom Japan Germany France Taiwan welcome to Drunk Elephant Thanks for stopping by! By the way, where are you? Canada United States Access the Website Close Newsletter Signup * First Name * Last Name * Email Address Mobile number Sign Up for Drunk Elephant Emails I agree that Drunk Elephant may collect my personal information – including contact information, payment, demographic or behavioral characteristics, technical computer, website usage and social network information or other categories permitted by our Privacy Policy – for the purposes of order fulfillment, marketing communications, account maintenance, website personalization & improvement, or other purposes permitted by our Privacy Policy. By visiting drunkelephant.com and by submitting my information, I agree with the Privacy Policy – including our policy on Financial Incentives – and the website’s Terms & Conditions . Sign Up for Drunk Elephant Text By submitting this form, I consent to receive recurring automated promotional and personalized marketing text messages (e.g. cart reminders) from Drunk Elephant at the cell number used when signing up. Consent not required to purchase. Reply STOP to cancel or reply HELP for information. Msg frequency varies. Msg & data rates may apply. I agree that the collection and processing of my personal data will be in compliance with the Drunk Elephant Privacy Policy – including our policy on Financial Incentives – and I agree to Drunk Elephant SMS Terms and Conditions . This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Sign Up"
    },
    {
      "url": "https://whatpub.com/pubs/NTH/248/white-elephant-northampton",
      "text": "White Elephant, Northampton • whatpub.com WhatPub will be shut down from 1st October 2025. You don’t have to do anything,\n                but after this date whatpub.com will automatically redirect you to the CAMRA website. Try the new CAMRA website WhatPub will be shut down from 1st October 2025 We’ve brought all our data and pub-going tools together, so you can get the best of everything CAMRA has to offer in one convenient place. You don’t have to do anything, but after this date whatpub.com will automatically redirect you to the CAMRA website. Try the CAMRA website Prefer to stay on this page? No problem! Click here to remain on the current site. Join CAMRA | Member Login Home About Search FAQs Cookies Service Announcement Search > White Elephant New Search About Location Submit Updates Nearby Recently Viewed (1) NOTICE :Opening hours and services may be different from those displayed here. Before visiting, we advise that you check ahead by phone or via social media to avoid disappointment. If you see any details here that need updating, please let us know by submitting updates on the pub . White Elephant (formerly Kingsley Park Tavern) Kingsley Park Terrace Kingsley Park Northampton NN2 7HG View on Map (01604) 711202 Send an email to the Pub greeneking.co.uk/pubs/northamptonshire/w... Social Links Visit White Elephant on Facebook Opening Times Regular Monday Noon - 11.00 pm Tuesday Noon - 11.00 pm Wednesday Noon - 11.00 pm Thursday Noon - 11.00 pm Friday Noon - Midnight Saturday Noon - Midnight Sunday Noon - 11.00 pm Meal Times Mon - Sun noon - 9pm Operator John Barras (Greene King) About\n                         the Pub Built in 1883 as a hotel and residential club for racegoers, and originally called the Kingsley Park Hotel, this large corner pub sits at the junction of Kingsley Road and Kettering Road opposite the old racecourse. The hotel closed in 1904 following a fatal racing accident involving spectators, and the Jockey Club left it empty for 18 years. It was during this time that local residents started to refer to it as 'The White Elephant'. The original name was retained upon reopening as part of the Northampton Brewery Co. estate. In 1955 NBC applied to change the name to the White Elephant, a name it carried until a short-lived change to the Kingsley Park Tavern in the early 1990s before reverting back to the White Elephant due to public demand. The pub, via various PubCo changes eventually became part of the Greene King estate. Regular ales This pub serves 3 regular\n                                                            beers. Greene King IPA Morland Old Speckled Hen Sharp's Doom Bar Changing ales This pub serves 3 changing\n                                                    beers. Source: Regional Updated on 04/10/2023 Last surveyed on 21/09/2023 Branch responsible is Northamptonshire Seen some incorrect or missing details? Send an email to the CAMRA branch with your updates. Email this pub to a friend Features Real Ale Available Member Discount Scheme 10% discount off cask beer for CAMRA members. Cask Marque Accredited Facilities Disabled Access Lunchtime Meals Evening Meals Garden Dog Friendly Family Friendly Traditional Pub Games Pool. Live Music Separate Bar Smoking Area Sports TV Wifi View on Larger Map White Elephant Kingsley Park Terrace Kingsley Park Northampton NN2 7HG Sat Nav Reference 52.250799, -0.880058 Transport Close to Bus Routes Nearby Bus Routes (< ½ mile) 2, 7, 8, 39, 52, 58 Submit Pub Updates to CAMRA We welcome the help of all users to contribute to this important campaigning project. Please use the form below to submit feedback or updates directly to the  CAMRA branch for consideration. Please note that any changes mentioned WILL NOT have an immediate effect on whatpub.com but will instead be emailed directly to the  CAMRA branch Pubs Officer for consideration. If you provide your name and/or email address this information will also be visible to the Pubs Officer, who may use this information to follow up your feedback. IF YOU WISH TO CONTACT THE PUB DIRECT, PLEASE DO NOT USE THIS FORM. Logged in CAMRA members do not need to enter their name, email or pass the captcha. Go to Login page Your Name:* Your Email Address:* Message:* Send to CAMRA Results are based on your filters selected. View or change them on the search page here Kingsley Park Working Men's Club 0.3 miles (0.5km) 120 Kingsley Park Terrace Kingsley Park Northampton NN2 7HJ Club Features Picturedrome 0.3 miles (0.5km) 222 Kettering Road Northampton NN1 4BN Pub Features Olde England 0.3 miles (0.5km) 199 Kettering Road Northampton NN1 4BP Pub Features County 0.3 miles (0.5km) 220 Abington Avenue Abington Northampton NN1 4PR Pub Features Artizan 0.5 miles (0.9km) 51 Artizan Road Northampton NN1 4HR Pub Features See all pubs White Elephant Kingsley Park Terrace Kingsley Park Northampton NN2 7HG Pub Features Submit Beer Scores The National Beer Scoring System has been upgraded and is now fully integrated with whatpub.com, making finding a pub and scoring your beers much easier. Beer scoring is only available to CAMRA members. To start scoring please login below or join CAMRA on the national website. Join CAMRA | Member Login Campaign for your local We campaign on a number of issues to help keep pubs open and pints affordable. If you love beer and pubs, get involved today! Find out more Nearby Pubs See All Kingsley Park Working Men's Club Northampton Read More Picturedrome Northampton Read More Olde England Northampton Read More County Northampton Read More Artizan Northampton Read More Features Real Ale Available Cask Marque Accredited Quiet Pub Family Friendly Separate Bar Disabled Access Traditional Pub Games Smoking Area Function Room Live Music Sports TV Wifi LocAle Accredited Close to Bus Routes Club Allows CAMRA Visitors Features Real Ale Available Family Friendly Lunchtime Meals Evening Meals Disabled Access Real Cider Available Smoking Area Restaurant Area Function Room Live Music Wifi Events Close to Bus Routes Features Real Ale Available Real Fire Quiet Pub Family Friendly Lunchtime Meals Evening Meals Traditional Pub Games Real Cider Available Function Room Dog Friendly Live Music Wifi LocAle Accredited Events Close to Bus Routes Pubs with Outstanding Conversions and Restorations Features Real Ale Available Garden Disabled Access Traditional Pub Games Dog Friendly Sports TV Wifi Close to Bus Routes Features Real Ale Available Real Fire Family Friendly Garden Lunchtime Meals Evening Meals Parking Smoking Area Dog Friendly Live Music Sports TV Member Discount Scheme Close to Bus Routes Features Home | About | Search | FAQs | Cookies | Service Announcement | Join CAMRA Campaign for Real Ale, 230 Hatfield Road, St Albans, Hertfordshire, AL1 4LW ( Map ) www.camra.org.uk | Email: camra@camra.org.uk | Tel: 01727 867201 | Fax: 01727 867670 This Web site is produced by the Campaign for Real Ale (CAMRA). All pages, their contents and related items are provided \"as is\". Thus no liability, consequential or otherwise, arising from them is accepted. Where not already belonging or assigned to others, all material remains our copyright."
    },
    {
      "url": "https://www.aspentimes.com/news/new-aspen-hotel-brings-exclusive-art-bmws-and-landscape-luxury/",
      "text": "New Aspen hotel brings exclusive art, BMWs, and landscape luxury | AspenTimes.com Serving Aspen and Snowmass Village, CO Login 9 Profile Newsletters Interests Bookmarks Reading History Logout News Local Snowmass Crime Business Coronavirus Silver Lining Series Faces of the Pandemic The Great Realization Project Education State/Regional Marijuana Weather Obituaries Nation/World Wildfires Election Opinion Columns Guest Commentary Editorials Letter to the Editor Sports Preps Snow League 2025 Outdoors X Games X Games 2025 X Games 2024 X Games 2023 World Cup 2024 Entertainment Aspen Times Weekly Calendar Food & Wine Video Magazines Art Best of Aspen, Snowmass, and Basalt CyclingMagazine Discover Basalt Eat Food & Wine Classic MidValley Holidays Roaring Fork Valley Heartbeat Summer in Aspen and Snowmass Winter in Aspen and Snowmass Photos Classifieds Celebrations Jobs Rentals Real Estate Autos Service Directory All Classifieds Place Ad Place Legal Ad Search Legal Ads Wolves Newsletters News Local Snowmass Crime Business Coronavirus Education State/Regional Marijuana Weather Obituaries Nation/World Wildfires Election Opinion Columns Guest Commentary Editorials Letter to the Editor Sports Preps Snow League 2025 Outdoors X Games World Cup 2024 Entertainment Aspen Times Weekly Calendar Food & Wine Video Magazines Art Best of Aspen, Snowmass, and Basalt CyclingMagazine Discover Basalt Eat Food & Wine Classic MidValley Holidays Roaring Fork Valley Heartbeat Summer in Aspen and Snowmass Winter in Aspen and Snowmass Photos Classifieds Celebrations Jobs Rentals Real Estate Autos Service Directory All Classifieds Place Ad Place Legal Ad Search Legal Ads Wolves Newsletters Sign In Register Profile Newsletters Interests Bookmarks Reading History Logout E-Edition | Submissions | Advertise | Contact Us | YOUR AD HERE » New Aspen hotel brings exclusive art, BMWs, and landscape luxury The White Elephant brand, which built a reputation on the East Coast, is personalizing its newest outpost for the Aspen guest News | May 8, 2025 River Stingray rstingray@aspentimes.com Share this story Share Share on Facebook Share on Twitter Share on LinkedIn Share on WhatsApp Share via Email Share via SMS Copy Link Construction for White Elephant Aspen (110 W. Main St.) continues on Wednesday, May 7, 2025, in downtown Aspen. Austin Colbert/The Aspen Times Aspen’s local moose, mountain lions, and bears can step aside — there’s a White Elephant coming to town. While Aspen has no shortage of hotels, White Elephant is taking the mountain aesthetic to a whole new level by blending it with the brand’s iconic modern design that infuses landscape into luxury. Slated to open in late fall at 110 West Main St., this will be the third White Elephant hotel in the country and the first one established out West; the other two are located in Nantucket and Palm Beach. “We are excited for the addition of 54 new guest rooms to Aspen’s lodging inventory with the opening of White Elephant Aspen,” said Eliza Voss, vice president of Destination Marketing for the Aspen Chamber Resort Association. “Managing Director Justin Todd is an ACRA Board member and no stranger to the Aspen hotel scene. We wish them a swift opening and look forward to checking it out once they are ready for us.” A rendering of the lobby in the White Elephant Aspen, scheduled to open late fall. White Elephant Aspen/Courtesy photo White Elephant Aspen is creating a new signature style for those looking to experience both Aspen’s outdoor playground and unique affluence, according to Todd. “This expansion allows us to bring White Elephant’s signature blend of service, design, and hospitality to a new landscape,” he said. “One that aligns beautifully with our brand DNA.” Michael Brown, co-founder of HayMax Capital (owner of MOLLIE Aspen) and an Aspen local, is also excited for MOLLIE’s new neighbor. “At MOLLIE, we’re looking forward to our guests experiencing the new restaurant across the street — and likewise, we hope to welcome their guests to MOLLIE,” Brown said. “The White Elephant team are first-class people, and we’re excited about the collaborative potential for larger group stays and other potential shared experiences.” White Elephant Aspen will welcome guests with personalized service and intentional design that includes an environment-inspired art collection with more than 125 original works. The hotel has also managed to lock in a special, first-time collaboration with Anderson Ranch Arts Center. Todd confirmed it will be the only hotel in town to showcase Anderson Ranch artists, with over 50 pieces on display. Elizabeth Ferrill, artistic director of Painting, Drawing, and Printmaking at Anderson Ranch, expressed her excitement that Roaring Fork Valley artists, and artists from all over the country who worked in the Ranch’s Patton Print Shop, will be represented in the acquisition. “We are thrilled that White Elephant Hotel in Aspen is showcasing the work of many artists who have worked with the Anderson Ranch Arts Center Editions program over the years,” Ferrill said. “Hotel guests will enjoy the colorful and experimental prints of artists who embody the Anderson Ranch tradition of innovative and cutting-edge printmaking.” A rendering of a guest suite bedroom in the White Elephant Aspen, scheduled to open late fall. White Elephant Aspen/Courtesy photo White Elephant Aspen will also be partnering with BMW to offer five complimentary vehicles to guests, available on a first-come, first-serve basis. This service is aimed at giving guests the opportunity to explore anywhere in town on their own time, according to Todd. The BMWs will also be used by the guest services team to transport guests to and from the Aspen Airport, the ski mountains, and local restaurants. While he also verified the property will be pet-friendly, specific details on amenities are not yet available. “Main Street Aspen continues to evolve in exciting ways,” Brown said. “We’re thrilled to see thoughtful additions like the White Elephant and Sant Ambroeus helping shape its westward energy.” Construction for White Elephant Aspen (110 W. Main St.) continues on Wednesday in Aspen. Austin Colbert/The Aspen Times Share this story Share Share on Facebook Share on Twitter Share on LinkedIn Share on WhatsApp Share via Email Share via SMS Copy Link Local Olympic skier Caldwell Hamilton named AVSC’s new Nordic program director Sep 5, 2025 She raced on the World Cup-level in cross-country skiing from 2013 to 2021, where she competed in two Winter Olympics. Fire hazards ground Snowmass Balloon Festival Sep 5, 2025 Pitkin County removing Colorado Highway 82 crossover near Aspen Sep 5, 2025 WineInk: Snowmass wine in the September sun Sep 5, 2025 Roaring Fork Valley close $2 million dollar gap for mobile homes park purchase Sep 5, 2025 See more Trending - News Update: Road open after bike accident closes Castle Creek Road Sep 1, 2025 Castle Creek Road will be closed around mile marker 6 following a bike accident, PitkinAlert announced at 2:54 p.m. Monday. Details released surrounding Aspen’s Castle Creek Road bike death Sep 3, 2025 Most expensive house for sale in America hits Aspen market Aug 28, 2025 Bike accident closes Castle Creek Road Sep 1, 2025 Colorado residents asked to turn out lights to help more than 3.5 million migrating birds Sep 1, 2025 See more YOUR AD HERE » Top Jobs Established 35 year Firm Super Assistant - Aspen, CO (81612) Top Aspen company seeking a dynamic Real Estate Assistant. The ideal candidate is intelligent, detail-oriented, and thrives in a fast-paced… Home Team BB! Executive Chef - Aspen, CO (81611) JOIN OUR BBQ CREW We are looking for an experienced Executive Chef to join our Home Team BBQ family at… Hansen Construction Staff Accountant - Aspen, CO (81611) Hansen Construction is hiring for a Staff Accountant . Please apply at www.hansenconst.com Group: Administration Department: Accounting Reports To:... Romero Group Real Estate Management Controller - Basalt, CO (81621) Exceptional opportunity to build your career with the most dynamic real estate management team in the Valley! Current opening: Controller… Savills Broker - Aspen, CO (81611) Broker – Savills Ski Aspen & Colorado Savills is seeking an experienced and highly motivated Broker to lead Savills Ski… James Perse Full Time Senior Client Advisor - Aspen, CO (81611) Location: Aspen, CO Department: Retail/ Aspen Type: Full Time Min. Experience: Entry Level WE ARE CURRENTLY HIRING A FULL TIME… Bandana Aspen SALES ASSOCIATES - Aspen, CO (81611) BANDANA ASPEN NOW HIRING: SALES ASSOCIATES Bandana Aspen - Elevated style for women and children. Bandana Aspen is seeking a… Colorado Mountain College Coordinator of Student Activities & Engagement - Glenwood Springs, CO (81601) Job Description: Primary Responsibility Under the general supervision of the Director of Student Life & Housing and Student Affairs campus… Goodlift Professional Black Car Limo Drivers - Glenwood Springs, CO (81601) Seeking Professional Black Car Limo Drivers $25/hr + gratuity Aspen/RFV CBI & FBI BG check required 970-445-4449 We are an… Hansen Construction Staff Accountant - Aspen, CO (81611) Hansen Construction is hiring for a Staff Accountant. Please apply at www.hansenconst.com Group: Administration Department: Accounting Reports To: Chief Financi... Previous Next View more listings YOUR AD HERE » Daily Newsletter Sign up for daily and breaking news headlines. Manage Subscriptions Subscribe Aspen Times E-Edition What do you think about the most expensive house for sale in America being listed in Aspen? I think it's a point of pride! I think it's a huge problem for our local housing crisis I don't care View Results Loading ... Home Trending Sections Marketplace Jobs Classifieds Autos Real Estate Rentals Service Directory Pets Merchandise Legals Place Legal Ad Search Legal Ads Farm & Ranch Recreation Announcements Reader Tools Contact Us Become a Carrier Submissions Submit an Obituary Advertise Archives Newsletters Buy Photos Commercial Print Sales RSS Aspen E-edition Snowmass E-edition Cookie List Do not sell my personal information News Neighbors Breckenridge - Summit County Craig - Moffat County Glenwood Springs - Rifle Lake Tahoe - California Steamboat Springs - Routt County Vail - Eagle Valley Winter Park - Granby - Grand County Printing Press Jobs About Us | Terms of Use | Privacy Policy | Terms and Conditions | Comment Policy | Careers | ©2005 - 2025 Swift Communications, Inc."
    },
    {
      "url": "https://redelephantway.com/contact-us/",
      "text": "Contact Red Elephant: Get in Touch with Our Expert Team Who We Serve Multifamily Signage What We Do All Services Our Work About About Us Our Credentials Blog Contact Us Contact Us Contact Us Name (Required) Company (Required) Email (Required) Phone (Required) How did you find us? Google / Internet Search LinkedIn Facebook Instagram Trade Show Networking Event Referral Other What's your industry? Select One... Commercial Multifamily Healthcare Government Other Other When is your desired completion date? MM slash DD slash YYYY How can we partner with you? (Required) Comments This field is for validation purposes and should be left unchanged. Our Location 972-267-3100 Sales@redelephantway.com 200 E Valley Ridge Blvd Lewisville, TX 75057 Subscribe to Red Elephant's Newsletter * indicates required Email Address * First Name * Last Name * Company Name Request a Quote About Us Our Certifications Contact Privacy Policy LinkedIn Facebook Twitter Instagram 200 E Valley Ridge Blvd Lewisville, TX 75057 972-267-3100 sales@redelephantway.com © Copyright Red Elephant. All Rights Reserved 2025 Search Submit Clear Who We Serve ← Back Multifamily Signage What We Do About ← Back About Our Certifications Blog Our Work Contact Us"
    }
  ]
}