{
  "fuentes": [
    {
      "url": "https://www.visitjacksonville.com/directory/wicked-barley-brewing-company-restaurant-nightlife-w-meeting-space/",
      "email": "info@visitjacksonville.com"
    },
    {
      "url": "https://ffcfc.com/First-Capital-Client-Corner-Wicked-Barley",
      "email": "info@ffcfc.com"
    },
    {
      "url": "https://ffcfc.com/First-Capital-Client-Corner-Wicked-Barley",
      "email": "kristen@ffcfc.com"
    },
    {
      "url": "https://www.wickes.co.uk/contactus",
      "email": "complaint.info@financial-ombudsman.org.uk"
    },
    {
      "url": "https://www.wickes.co.uk/contactus",
      "email": "customer.relations@wickes.co.uk"
    },
    {
      "url": "https://www.wickes.co.uk/contactus",
      "email": "wickes@clarioncomms.co.uk"
    }
  ],
  "mails": [
    "complaint.info@financial-ombudsman.org.uk",
    "customer.relations@wickes.co.uk",
    "info@ffcfc.com",
    "info@visitjacksonville.com",
    "kristen@ffcfc.com",
    "wickes@clarioncomms.co.uk"
  ],
  "nombre_sitio": "wickedbarley.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.visitjacksonville.com/directory/wicked-barley-brewing-company-restaurant-nightlife-w-meeting-space/",
      "text": "Wicked Barley Brewing Company | Visit Jacksonville Skip to content Newsletter Trip Planner 0 Saved 80 ° F Navigation Things to Do Beaches & Waterways Outdoors Family Fun Arts & Culture Shopping Sports Nightlife Dog-Friendly Tours Travel Guides and Itineraries Black Travel LGBTQ+ Travel Latino Travel Events Annual Events Submit Your Event Neighborhoods Beaches & Waterways Arlington Brooklyn Cathedral District Downtown Jacksonville Durkeeville Eastside Mandarin Murray Hill North Jacksonville & Airport Ortega Rail Yard District Riverside Avondale San Marco Southside Springfield Westside Food & Drink Jax Ale Trail Jax Coffee & Donuts Trail Mayport Shrimp Trail Distilleries Where to Stay Plan Your Trip Getting Here & Getting Around App & Brochures Newsletter Sign-Up Meeting Planners Newsletter Update Visitor Centers Jacksonville Webcams An Accessible Travel Guide Deals Weather Frequently Asked Questions Cruisin' for a Good Time Traveling to Jacksonville for Medical Treatment? Meetings & Events Submit a Meeting or Event RFP Meetings Incentives Venues Meet the Sales Team Destination Services Why Meet in Jax Virtual Site Visit Intellectual Capital Bring It Home! Jax Join Our Volunteer Database Meeting Planners Newsletter Sign-Up Newsletter Sign-Up Group Sports Media Who We Are Blog Stay in Touch with Everything Jacksonville View Our 2025 Visitor Guide Home Wicked Barley Brewing Company Share Interested in planning a Wicked event? Let the Wicked Barley Private Event team help you plan the perfect event! Whether you are celebrating a birthday, engagement, retirement or just want to throw a party- we can help! For more information about hosting and event at Wicked Barley, email events@wickedbarley.com. Website Email Wicked Barley Brewing Company 4100 Baymeadows Road Jacksonville, Florida 32217 Details Open in Google Maps Map Save Save Details Virtual Tour Amenities Meeting Spaces Details Address 4100 Baymeadows Road Jacksonville, Florida 32217 Phone (904) 379-7077 Virtual Tour Amenities Dining within walking distance Wheelchair Accessible Restaurant on site Meeting Spaces Patio Area : 0 square feet Private Event Space Area : 0 square feet Stay in Touch with Everything Jacksonville Sign Up View Our 2025 Visitor Guide Download Things to Do Beaches & Waterways Outdoors Family Fun Arts & Culture Shopping Sports Nightlife Dog-Friendly Tours Travel Guides and Itineraries Black Travel LGBTQ+ Travel Latino Travel Events Annual Events Submit Your Event Neighborhoods Beaches & Waterways Arlington Brooklyn Cathedral District Downtown Jacksonville Durkeeville Eastside Mandarin Murray Hill North Jacksonville & Airport Ortega Rail Yard District Riverside Avondale San Marco Southside Springfield Westside Food & Drink Jax Ale Trail Jax Coffee & Donuts Trail Mayport Shrimp Trail Distilleries Where to Stay Plan Your Trip Getting Here & Getting Around App & Brochures Newsletter Sign-Up Meeting Planners Newsletter Update Visitor Centers Jacksonville Webcams An Accessible Travel Guide Deals Weather Frequently Asked Questions Cruisin' for a Good Time Traveling to Jacksonville for Medical Treatment? Meetings & Events Submit a Meeting or Event RFP Meetings Incentives Venues Meet the Sales Team Destination Services Why Meet in Jax Virtual Site Visit Intellectual Capital Bring It Home! Jax Join Our Volunteer Database Meeting Planners Newsletter Sign-Up Newsletter Sign-Up Group Sports Media Who We Are Blog Visit Jacksonville 100 North Laura Street Suite 120 Jacksonville, FL 32202 (800) 733-2668 Industry Resources Newsletter Sign-Up Meet the Team Board of Directors Job Postings Privacy Policy ©2025 Visit Jacksonville, All Rights Reserved Cookies Policy This website uses cookies to optimize your visitor experience. Accept or Learn more Quick Search Search Location Map"
    },
    {
      "url": "https://ffcfc.com/First-Capital-Client-Corner-Wicked-Barley",
      "text": "First Capital Client Corner: Wicked Barley {meta_title} Increase Font Decrease Font Greyscale Highlight Links Regular Font Reset SBA 504 Loan Interest Rates August 2025 25-Year Fixed Rate Standard: 6.237% 25-Year Fixed Rate Refinance: 6.266% 20-Year Fixed Rate Standard: 6.255% 20-Year Fixed Rate Refinance: 6.285% 10-Year Fixed Rate Standard: 6.174% 10-Year Fixed Rate Refinance: 6.210% Official monthly SBA 504 effective interest rate tables can be found at Eagle\n        Compliance LLC . 25- and 20-year term loans fund every month; 10-year term loans fund every other month. Effective interest rates are inclusive of servicing fees, which are subject to\n        credit risk of the applicant. Search facebook twitter linkedin instagram Looking for some help? Call 800.504.LOAN or Email Us Loan Programs SBA 504 Loan Program for Borrowers 504 Overview & Eligibility 504 Commercial Real Estate Loans 504 Machinery & Equipment Loans 504 Green Loan Program 504 Commercial Debt Refinancing SBA 504 Loan Program for Lenders & Credit Unions SBA 504 Loan Program for Realtors & Brokers SBA 504 Loan Program for Economic Developers 504 Bridge Loan Program Overview Frequently Asked Questions Rebuild Florida Business Loan Fund Florida Recycling Loan Program Florida Finance Network News & Media FCF News Alabama News Florida News Georgia News Our Story About Florida First Capital Board of Directors Contact Us Talk to a Loan Expert Company Directory Interest Rates Menu Servicing the States of Alabama, Florida, and Georgia. Lending News Archives Lending News Archives Back to News First Capital Client Corner: Wicked Barley Aug 2024 Few things hit the spot like a cold beer…especially from a stellar Florida craft brewery like Wicked Barley Brewing Company. Add a view of the water and you truly have a recipe for success! How it All Came Together In 2014, Wicked Barley Brewing was founded by brothers-in-law, Philip Maple and Tobin Turney. Having more than 30 years combined experience in home brewing, Maple and Turney had extensive knowledge in recipe development and brewery operations. With friends Brett Baker and Bradley Sueflohn joining the venture, Wicked Barley was destined for greatness. Realizing the restrictive and financial uncertainties of leasing property, the Wicked Barley team opted for the security and stability of owning their own place. With assistance from First Capital Finance Business Development Officer and Vice-President, Kristen Tackett, Wicked Barley secured $3.1MM in funding through the SBA 504 Loan Program for the ground-up construction of the brewery and taproom. Additionally, they partnered the 504 loan with an SBA 7(a) loan to provide money for inventory and working capital. “The SBA 504 Loan Program reduces risk for both the lender and borrowers. It enables small business owners from all backgrounds and industries – agriculture, retail, manufacturing, and breweries – access to capital that otherwise wouldn’t be available to them,” said Tackett. If You Build It, They Will Come Perched on the banks of Goodby’s Creek, Wicked Barley Brewing Company is Jacksonville’s only waterfront craft brewery. Since opening its doors in July of 2016, Wicked Barley has become a favorite spot for anyone seeking chill vibes and cold craft beer. The property features a large outdoor (dog friendly) beer garden, kayak launch, and a 100′ boat dock. Yep - you can access the brewery by boat! The taproom provides ample seating and 20 taps with delicious house brewed beers, ciders, and meads. Wicked Good Beer and Bites In addition to the award-winning beer, with Sueflohn serving as Executive Chef, the from-scratch fare has gained tremendous attention. And no wonder! Sueflohn honed his skills in some of the best kitchens in Las Vegas, including the famed Le Cirque restaurant. In 2017, Wicked Barley was voted Best Brew Pub in the state of Florida by Best Florida Beer and in 2022, it ranked #9 on USA Today’s list of 10 best brew pubs across the country. Wicked Barley struck gold in 2022 at the prestigious Great American Beer Festival in Denver, Colorado. They brought home a gold medal from the 40th annual competition for their Amber Ale, \"Argument Starter.” Clearly, there was no argument from the judges. And That’s Not All… Having enjoyed the tremendous success of Wicked Brewing Company, Maple has left the day-to-day brewery operations to start a new venture – Barley and Pie, located in Fleming Island, Florida. Though he remains a silent partner in Wicked Barley, Maple’s Italian ancestry inspired him to start the new business. In an interview in the Jacksonville Business Journal, Maple said, \"Growing up, one thing my dad always did was brew craft beer and make pizza dough,” Maple said. “I’ve had a burning desire to do pizza recipes for 20 years.” Having experience with the benefits of the SBA 504 Loan Program, Maple turned again to First Capital Finance and Kristen Tackett to fund $902,334 in brewery and restaurant equipment. In addition to the incredible pizza, as its name suggests, Barley and Pie offers an array of beers brewed on site, continuing the excellent tradition Maple began at Wicked Barley. First Capital Finance applauds the innovation, persistence, and hard work exhibited by the founders of Wicked Barley Brewing and Barley and Pie. We are honored to assist in the launch and success of small businesses across Florida, Georgia, and Alabama! Connect with Kristen: kristen@ffcfc.com | 904.861.2270 First Capital Finance/Florida First Capital has an expert team of Business Development Officers working with small businesses throughout Florida, Georgia, and Alabama. To get in touch with a BDO in your area, visit ffcfc.com/talk-to-a-loan-exper Archived 2025 - June 2025 - April 2025 - March 2025 - February 2024 - October 2024 - August 2024 - June 2024 - May 2024 - April 2024 - January 2023 - November 2023 - October 2023 - September 2023 - August 2023 - July 2023 - June 2023 - April 2023 - March 2023 - February 2022 - November 2022 - October 2022 - August 2022 - July 2022 - June 2022 - May 2022 - April 2022 - March 2022 - February 2022 - January 2021 - December 2021 - November 2021 - October 2021 - September 2021 - August 2021 - July 2021 - June 2021 - May 2021 - April 2021 - March 2021 - February 2021 - January 2020 - December 2020 - November 2020 - October 2020 - September 2020 - August Contact Us facebook twitter linkedin instagram First Capital Finance/Florida First Capital First Capital Finance/Florida First Capital (FCF/FFC) is a non-profit certified development company promoting economic development and job creation.\n        Under the SBA 504 Loan Program , FCF/FFC works with private-sector lenders to provide eligible small\n        business owners in Alabama, Florida, and Georgia with below-market, fixed interest rate long-term financing to buy or build commercial property and/or purchase fixed heavy duty machinery and\n        equipment. Florida First Capital also lends under the Rebuild Florida Business Loan\n        Fund as well as the Florida Recycling Loan Program and other small business\n        assistance programs. Corporate Headquarters: 1351 N. Gadsden Street, Tallahassee, FL 32303.  Ph: 800.504.LOAN or 850.681.3601. © 2023 First Capital Finance/Florida First Capital Finance.  All Rights Reserved."
    },
    {
      "url": "https://www.wickes.co.uk/contactus",
      "text": "Get In Touch | Wickes.co.uk Online 0 Rapid Delivery within 3 hours* Skip to content Skip to navigation menu Sign-in / Register Track my order Project list Wickes Wickes Ideas & Advice Store Locator Basket Basket 0 Basket Basket 0 back to top Kitchens Wickes Bespoke Kitchens View all Ranges Kitchen Offers Kitchen Brochure Kitchen Finance View all Wickes Bespoke Kitchens Wickes Lifestyle Kitchens Shaker Kitchen Slab Kitchen J-pull Kitchen Kitchen Samples View More View all Wickes Lifestyle Kitchens Cabinets Kitchen Units Appliance Doors Decorative Panels Plinths & Cornices View More View all Cabinets Worktops & Upstands Laminate Worktops Solid Wood Worktops Splashbacks Upstands View all Worktops & Upstands Taps All Kitchen Taps Kitchen Mixer Taps Kitchen Monobloc Taps Boiling Water Taps View all Taps Sinks All Kitchen Sinks Ceramic Sinks Granite & Composite Sinks Stainless Steel Sinks View More View all Sinks Home Office Fitted Home Office Fitted Home Workspaces Home Office Design & Installation View all Home Office Accessories Cabinet Handles & Knobs Kitchen Lighting Kitchen Paint Kitchen Radiators View More View all Accessories Appliances Ovens Hobs Cooker Hoods Fridges & Freezers View More View all Appliances Design & Installation Kitchen Design & Installation Kitchen Ideas & Advice Tiling Ideas & Advice Flooring Ideas & Advice View all Design & Installation Bathrooms Wickes Bespoke Bathrooms View all Suites Bathroom Offers Book a Free Design Appointment Bathroom Finance View More View all Wickes Bespoke Bathrooms Bathroom Suites Cairo Scandi Miami Bathrooms Brochure View More View all Bathroom Suites Showers & Enclosures Showers Shower Accessories Shower Enclosures Shower Panels View More View all Showers & Enclosures Baths & Accessories All Baths Bath Panels Shower Baths Straight Baths View all Baths & Accessories Basins All Basins Cloakroom Basins Vanity Units Pedestal Basins View all Basins Furniture & Cabinets Cabinets & Storage Fitted Bathroom Furniture Modular Bathroom Furniture Vanity Units View all Furniture & Cabinets Toilets & Accessories All Toilets Back to Wall Toilets Toilet Seats Toilet Units View all Toilets & Accessories Taps All Bathroom Taps Bath Taps Basin Taps Tap Washers & Repairs View all Taps Accessories Bathroom Mirrors Bathroom Tiles Toilet Seats Towel Radiators View all Accessories Design & Installation Bathroom Design & Installation Bathroom Ideas & Advice Tiling Ideas & Advice Flooring Ideas & Advice View all Design & Installation Gardens & Landscaping Fencing & Gates Fence Panels Fence Posts Fencing Accessories Gates & Metal Railings View More View all Fencing & Gates Garden Maintenance Compost, Topsoil & Bark Lawn Seed & Feeds Compost Bins & Buckets Weed Membrane View More View all Garden Maintenance Garden Decor Trellis & Screening Sleepers & Raised Beds Edging & Logrolls Garden Planters View More View all Garden Decor Garden Tools Leaf Blowers Grass & Hedge Trimmers Garden Power Tools Garden Hand Tools View More View all Garden Tools Sheds Wooden Sheds Plastic Sheds Storage Boxes Greenhouses View More View all Sheds Paving & Walling Paving Slabs Block Paving Outdoor Tiles Wall Bricks View More View all Paving & Walling Decking Timber Deckboards Decking Joists & Supports Composite Decking Decking Tiles View More View all Decking Garden Watering Hose Pipes Water Butts Pressure Washers Watering Accessories View More View all Garden Watering Garden Supplies Plant Food Weedkiller Growing Accessories Weeding & Clearing View More View all Garden Supplies Garden Autumn Essentials Garden Tidy Firewood & Firelighters Patio Heaters Garden Furniture & BBQ Covers View More View all Garden Autumn Essentials Building Materials Timber Treated Sawn Planed Square Edge Treated Sawn C16 CLS Studwork View More View all Timber Sheet Materials Plywood Sheets MDF Sheets OSB Sheets Loft Boards View More View all Sheet Materials Cement & Aggregates Ballast & Sub Base Cement Sand Gravel View More View all Cement & Aggregates Plaster & Plasterboard Plasterboard Plaster Coving Plastering Adhesives View More View all Plaster & Plasterboard Insulation Loft Insulation Insulation Board Cavity Wall Insulation Insulation Foil View More View all Insulation Roofing PVC Corrugated Sheets Bitumen Sheets Roof Felt Roof Tiles View More View all Roofing Nails & Screws Screws Sealants Fixings Nails View More View all Nails & Screws Guttering & Drainage Round Line Guttering Square Line Guttering Soil Pipes & Fittings Channel Drainage View More View all Guttering & Drainage Bricks & Lintels Blocks Bricks Block Paving Concrete Lintels View More View all Bricks & Lintels Building Supplies Builders Metalwork Damp Proofing Protective Sheeting Fascias & Soffits View More View all Building Supplies Doors & Windows Internal Doors White Doors Oak Veneer Doors Pine Doors Glazed Internal Doors View More View all Internal Doors External Doors Front & Back Doors Exterior French Doors Bifold Patio Doors Garage Doors View More View all External Doors Hardware Door Handles Door Locks & Latches Door Hinges Door Knobs View More View all Hardware Windows uPVC Windows Roof Windows Velux Windows Window Security View More View all Windows Trending Internal Doors Cottage Internal Doors Black Internal Doors 1930s Internal Doors Grey Internal Doors View all Trending Internal Doors Window Accessories Window Sills Window Handles Curtain Poles Window Blinds View More View all Window Accessories Security Door Locks & Latches Door Bolts Padlocks Security Alarms View More View all Security Bedroom Furniture & Fitted Sliding Doors Sliding Wardrobe Doors Modular Wardrobes Click Fitted Furniture Bedroom Furniture View all Bedroom Furniture & Fitted Sliding Doors Fire Safety & Alarms Fire Doors Smoke Alarms Fire Door Hinges Carbon Monoxide Detectors View More View all Fire Safety & Alarms Conservatories Lean To Conservatories Edwardian Conservatories Solid roof Conservatories Victorian Conservatories View all Conservatories Flooring & Tiling Flooring by Type Laminate Flooring Luxury Vinyl Flooring Parquet & Herringbone Solid Wood Flooring View More View all Flooring by Type Laminate by Colour Grey Brown White Beige View More View all Laminate by Colour Flooring Accessories Underlay Skirting Boards Adhesives & Sealants Flooring Tools View More View all Flooring Accessories Price per m2 Flooring Offers Under £15m2 £15 to £20 per m2 £21 to £34 per m2 View all Price per m2 Flooring Samples Laminate Samples Luxury Vinyl Samples Engineered Wood Samples Solid Wood Samples View all Flooring Samples Tiles by Type Bathroom Tiles Kitchen Tiles Floor Tiles Wall Tiles View all Tiles by Type Tiles by Colour Grey White Mosaic Patterned View all Tiles by Colour Tile Accessories Tile Adhesives Tile Grout Tiling Tools Tile Trims View all Tile Accessories Tile Samples Ceramic Samples Porcelain Samples Boutique Samples View all Tile Samples Installation Services Tiling Ideas & Advice Tiling Services Flooring Ideas & Advice Flooring Services View all Installation Services Painting & Decorating Interior Paint Wall & Ceiling Paint Bathroom Paint Paint Mixing Kitchen Paint View More View all Interior Paint Brand Dulux Wickes Crown Cuprinol View More View all Brand Paint by Type Emulsion Trade Paint Metal Paint Undercoats & Primers View More View all Paint by Type Decorating Tools Paint Rollers & Trays Paint Brushes Dust Sheets Abrasive & Sanding Tools View More View all Decorating Tools Exterior Paint Masonry Paint Shed & Fence Paint Garden Furniture Paint Decking Paint View More View all Exterior Paint Wood Treatment Interior Wood Paint Varnish Wood Stain Wood Preservatives & Treatment View More View all Wood Treatment Wallpaper Bedroom & Living Room Wallpaper Decorative Wallpaper Lining Paper Wallpaper Paste & Tools View More View all Wallpaper Mouldings Wall Panelling Beading Architrave Decorative Mouldings View More View all Mouldings Shelving & Storage Storage Boxes Shelves Shelf Brackets Freestanding Shelves View More View all Shelving & Storage Samples Paint Visualiser Dulux Tester Pots Wickes Tester Pots Crown Tester Pots View More View all Samples Electrical & Lighting Interior Lights Ceiling Lights Downlights LED Tubes & Battens Spotlights View all Interior Lights Outdoor Lights Wall Lights Low Voltage Garden Lights Work Lights Security Lights View all Outdoor Lights Light Bulbs All Light Bulbs GU10 Light Bulbs Decorative Bulbs B22 Light Bulbs View all Light Bulbs Electrical Cable EV Charging Extension Leads Portable Heaters View all Electrical Switches & Sockets Dimmer Switches Indoor Sockets Indoor Switches Outdoor Switches & Sockets View all Switches & Sockets Smart Home Smart Appliances Smart Heating Smart Lighting Smart Security View all Smart Home Security & Alarms Home Security Alarms Safes & Key Safes Security Lights Safes View all Security & Alarms Portable Heating & Cooling Portable Heaters Smart Heaters Cooling Fans View all Portable Heating & Cooling Ventilation & Ducting Dehumidifiers Ducting, Vents & Airbricks Fans & Air Conditioning Extractor Fans View all Ventilation & Ducting Heating & Plumbing Plumbing Copper Pipes & Fittings Plastic Pipe & Fittings Plumbing Tools & Accessories Waste Pipes & Fittings View all Plumbing Radiators Designer Radiators Double Panel Radiators Single Panel Radiators Towel Radiators View More View all Radiators Central Heating Boilers & Boiler Packs Heating Controls Central Heating Treatment Smart Heating View all Central Heating Fires & Surrounds Coal & Logs Gas Fires Electric Fires Fire Suites View all Fires & Surrounds Portable Heating Portable Heaters Smart Heaters View all Portable Heating Tools & Workwear Power Tools Cordless Drills Power Saws Sanders Nail Guns View More View all Power Tools Hand Tools Brickworking Tools Hand Saws Plastering Tools Woodworking Tools View More View all Hand Tools Workwear & Safety Trousers & Shorts Footwear Work Gloves Dust Masks View More View all Workwear & Safety Power Tool Accessories Drill Bits Sanding Accessories Angle Grinder Discs Batteries & Chargers View More View all Power Tool Accessories Tool Storage Tool Storage Systems Tool Boxes Tool Bags Tool Chests View More View all Tool Storage Ladders & Platforms Step Ladders Extension Ladders Combination Ladders Loft Ladders View More View all Ladders & Platforms Construction & Landscaping Landscaping Tools Workbenches Wheelbarrows Cement Mixers View More View all Construction & Landscaping Cleaning Supplies Vacuum Cleaners Cleaning Tools Car & Window Cleaning Cleaning Fluids View More View all Cleaning Supplies Measuring Levelling Tools Spirit Levels Laser Measuring Tools Detectors Tape Measures View More View all Measuring Levelling Tools Equipment Motoring Hot Glue Guns Work Lights Generators View More View all Equipment Renewables & Energy Wickes Solar Why choose Wickes solar? Advantages of solar? Solar panel installation Book a free quote View all Wickes Solar Renewable Energy Products Solar Panels Air Source Heat Pumps EV Charging Stations View all Renewable Energy Products Energy Efficiency Energy Efficient Home Energy Ratings How To Improve Your Home’s EPC Rating Lighting View all Energy Efficiency Energy Saving Advice Insulation Heating Lighting Draught Proofing View all Energy Saving Advice Helpful Guides Solar PV Buying Guide Heat Pump Buying Guide How To Insulate A Loft Upcycling Furniture View all Helpful Guides Wickes Solar Solar Energy Advantages of solar View all Solar Energy Wickes Solar Why choose Wickes solar? Solar panel installation View all Wickes Solar Get a Free No Obligation Quote Solar finance Solar Panel Price Estimator View all Get a Free No Obligation Quote Help & Advice How do solar panels work? Solar energy- advantages & disadvantages Solar panel myth busting View all Help & Advice Offers The Big Event The Big Timber Event The Big Tiles Event The Big Flooring Event The Big Doors Event View all The Big Event Latest Offers The Big Kitchens Event The Big Loft Event The Big Gardens Event Building Materials Offers View More View all Latest Offers Clearance Tiles Kitchens Bathrooms Gardens View all Clearance Log In / Register Track Order Ideas & Advice Project list Home Get In Touch Get In Touch - We're Here to Help Whether you’re interested in a new Kitchen or Bathroom, want to talk about products, need help with an order or anything in between we’re here to help. Please choose which drop down option accurately describes your query and use the contact details set out within the drop down box or complete the Contact form below. Track your order Use our handy tool to see the status of your order. You can track its location whilst it is on its way to you - with or without a Wickes account. To track your Wickes kitchen, bathroom or home office order, please complete our contact form; selecting 'Kitchen & bathroom'. Scroll down, it's just below. With our handy order tracking tool you can see: The date your order will be delivered The delivery carrier Where each part of your order will be delivered from When your Click & Collect order is ready to collect from your local store We're unable to offer live order tracking just yet, but we'll send you a text the day before your delivery with further details on when you can expect your order to arrive. Contact our customer service team When getting in touch with us, we need to confirm we’re talking to the right person. We’ll ask you a few questions to confirm you’re the person that paid for the order. If you’d like someone else to speak on your behalf, please ensure they’ve all the information necessary to pass our required Data Protection checks. Any conversation about order amendments, including refund requests, must be with the person that paid for the order. We are open: Monday - Saturday: 8am - 6pm Sunday: 10am - 5pm Here's some hints to help you choose the best way to contact us for your enquiry: Complete our Contact Form, scroll down, it's just below. We aim to respond to all enquiries within 48 hours. If you've received a damaged delivery or a faulty product, we'll ask you to email us some photos Use Live Chat - click ‘Chat’ on the bottom right of this page If you're unsure about what you've ordered If you've a question about our stock If you're asking about a delivery that's due today You can also call us on 0330 123 4123 If there's a queue you'll be given the option to ask for a call back. We’ll call you back when it's your turn. Contact our designed kitchen and bathroom team Wickes kitchen, bathroom or home office enquiries For enquiries about a Wickes kitchen, bathroom or home office order, please complete our contact form; selecting 'Kitchen & bathroom' as your reason for contacting us. Scroll down, it's just below. If you’d like to talk, call us on 0344 892 2721 . If you’d prefer to use Live Chat - click ‘Chat’ on the bottom right of this page. When getting in touch with us, we need to confirm we’re talking to the right person. We’ll ask you a few questions to confirm you’re the person that paid for the order. If you’d like someone else to speak on your behalf, please ensure they’ve all the information necessary to pass our required Data Protection checks. Any conversation about order amendments, including refund requests, must be with the person that paid for the order. We’re open: Monday - Friday 8am - 6pm Saturday - 8am - 4pm To book a design appointment Whether you're looking for a new kitchen, bathroom or home office; our Design Consultants have the knowledge and expertise to help you plan your space perfectly. Complete our online form Call us on: 0800 011 3031 We’re open: Monday - Friday: 9am - 8pm Saturday & Sunday: 9am - 5:30pm Community programme and charity requests We support charities and local communities in two ways: Nationally, we’re proud to be supporting The Brain Tumour Charity as our corporate charity partner.  This means we’re unable to offer monetary support to other causes. Locally, we support  the community through our Wickes Community Programme by providing products to help local charities and not for profit community groups. To apply for a product donation just head in to your local store and speak to the manager. Terms and conditions Press and media Please contact the press office at Clarion Communications on (0)20 7479 0910 or email wickes@clarioncomms.co.uk . Please note, these contact details are for media enquiries only. Complaints Our Commitment We’re dedicated to providing a professional and valued service to our customers and partners. We strive to handle customer complaints promptly and fairly. Contacting Us If you're unhappy with something, the fastest way to reach us is through our online chat service. If you'd prefer to talk, call us at 0330 123 4123 : Choose option 1 for a Wickes kitchen, bathroom or home office complaint. Choose option 3 for all other complaints. To escalate your concern, use the contact form below. Select the relevant order type and choose \"Something went wrong and I want to raise a complaint.\" We will acknowledge your complaint within 48 hours and forward it to the appropriate team. Further information might be needed to fully investigate your complaint. Alternatively, you can write to us at our registered address: Complaints Team Wickes Building Supplies Limited Vision House 19 Colonial Way Watford WD24 4JL To help us respond to you as quickly as possible, please include: Your name and address A contact phone number and email Your order number Details of your complaint with supporting photos Actions you’d like us to consider In the event that the customer services team is unable to resolve your complaint, or if you’re unhappy with the outcome, you can escalate your complaint by emailing customer.relations@wickes.co.uk , who will acknowledge your complaint within 48 hours and send it to the appropriate team. Resolution We aim to resolve your complaint at the first point of contact. Once the investigation is complete, you will be informed of the outcome. If you remain unhappy with the outcome, you can refer the decision to The Furniture and Home Improvement Ombudsman . They will review your case and may request further information from you or from us. Their decision will be binding upon us. For more information, visit fhio.org . Complaints relating to financial agreements If your complaint relates to the lender, it will be forwarded to them within five days of receipt. We will inform you once it has been sent. If the complaint is partially about the lender's actions, that part will be sent to the lender to investigate, while we will investigate the part related to the sale of the financial product and service. We will conduct a thorough and independent investigation and agree on a suitable outcome with you. Once our investigation is complete, we will inform you of the outcome. If you’re unhappy with the outcome, you can refer your complaint to the Financial Ombudsman Service . They can be contacted at: Phone: 0800 023 4567 Email: complaint.info@financial-ombudsman.org.uk Mail: Financial Ombudsman Service, Exchange Tower, London E14 9SR Contact form Required Field Reason for contacting us Order & support enquiries How can we help? To place a new order To cancel my order and request a refund Was your order placed online or in store? Online Store Product or stock availability information Order delivery or collection To view or track the status of your order, click here . Was your order placed online or in store? Online Store Select one of the below to provide more detail about your query Enquiry about my delivery Enquiry about my click & collect order My delivery is late My delivery has failed My delivery had items missing, damaged, or an incorrect quantity Please select an option To make a product guarantee claim What is the reason for your claim? Damaged product Product fault I have an enquiry not related to a specific order Something went wrong and I want to raise a complaint Wickes installed project How can we help? Make an existing order enquiry Does your order include a premium solid surface worktop? Yes No Book or amend a delivery date Does your order include a premium solid surface worktop? Yes No Make a product guarantee claim Does your order include a premium solid surface worktop? Yes No What is the reason for your claim? Damaged product Product fault Make an Installation workmanship guarantee claim Does your order include a premium solid surface worktop? Yes No Something went wrong and I want to raise a complaint Bespoke kitchens & bathrooms How can we help? Make an existing order enquiry Is your project installed by Wickes? Yes No Does your order include a premium solid surface worktop? Yes No Book or amend a delivery date Is your project installed by Wickes? Yes No Does your order include a premium solid surface worktop? Yes No Make a product guarantee claim Is your project installed by Wickes? Yes No Does your order include a premium solid surface worktop? Yes No What is the reason for your claim? Damaged product Product fault Something went wrong and I want to raise a complaint Personal information First Name Last Name Email Phone Number Postcode Additional information Please help us to resolve your enquiry as quickly as possible by providing us with photos of the product showing any visible damage or fault, your order number (if known) and any other relevant details in the fields available. Order Number Attachments Add image or document Enquiry max 2500 characters ( 2500 characters left ) Sorry, something has gone wrong when trying to send your form. Please try submitting your form again or contact our customer service team on 0330 123 4123. Submit Please enter a valid email address Thank you for signing up for emails Ways to Pay About Wickes Careers at Wickes Company History Community Programme Responsible Business CALM Wickes Corporate PLC Help & Support Get In Touch Store Locator Accessibility Rate & Review FAQs Share Your Feedback Sitemap Our Policies Returns & Refunds Security Online Modern Slavery Corporate Governance Privacy Policy Cookie Policy Your cookie settings Terms & Conditions Our Services Payments Track My Order Delivery Information Click & Collect TradePro Membership Free Design Appointment Copyright © 2025 Wickes.co.uk Wickes Building Supplies Limited, Vision House, 19 Colonial Way, Watford, WD24 4JL Company Registration No. 1840419 VAT No. 336725881"
    }
  ]
}