{
  "fuentes": [
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://raptorbikes.cc/pages/contact",
      "email": "sales@raptorbikes.cc"
    },
    {
      "url": "https://asri.org/raptor-weekend/event-info.html",
      "email": "audubon@asri.org"
    },
    {
      "url": "https://www.raptorindustriesusa.com/contactus",
      "email": "sales@raptorindustriesusa.com"
    },
    {
      "url": "https://friendsofboydhillnaturepreserve.wildapricot.org/Donate/",
      "email": "jason@friendsofboydhill.org"
    },
    {
      "url": "https://www.raptorinc.org/about-us/about-us/history/",
      "email": "director@raptorinc.org"
    }
  ],
  "mails": [
    "audubon@asri.org",
    "director@raptorinc.org",
    "info@reception-plus.de",
    "jason@friendsofboydhill.org",
    "sales@raptorbikes.cc",
    "sales@raptorindustriesusa.com"
  ],
  "nombre_sitio": "wildapricot.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * name Nachricht E-Mail Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://raptorbikes.cc/pages/contact",
      "text": "Raptor Road Bikes | Contact Us\n– Raptor Bikes Skip to content Country United Kingdom (GBP £) Austria (EUR €) Belgium (EUR €) Bulgaria (BGN лв.) Croatia (EUR €) Cyprus (EUR €) Czechia (CZK Kč) Denmark (DKK kr.) Estonia (EUR €) Finland (EUR €) France (EUR €) Germany (EUR €) Greece (EUR €) Hungary (HUF Ft) Ireland (EUR €) Italy (EUR €) Latvia (EUR €) Lithuania (EUR €) Luxembourg (EUR €) Malta (EUR €) Netherlands (EUR €) Poland (PLN zł) Portugal (EUR €) Romania (RON Lei) Slovakia (EUR €) Slovenia (EUR €) Spain (EUR €) Sweden (SEK kr) United Kingdom (GBP £) Home RL1 SL1 GR1 About Us Blog Workshop The Clubhouse The Clubhouse Putney Our Events Host Your Event Contact Search Contact sales@raptorbikes.cc Instagram Menu Search Cart Home RL1 SL1 GR1 About Us Blog Workshop The Clubhouse The Clubhouse Putney Our Events Host Your Event Contact Country United Kingdom (GBP £) Austria (EUR €) Belgium (EUR €) Bulgaria (BGN лв.) Croatia (EUR €) Cyprus (EUR €) Czechia (CZK Kč) Denmark (DKK kr.) Estonia (EUR €) Finland (EUR €) France (EUR €) Germany (EUR €) Greece (EUR €) Hungary (HUF Ft) Ireland (EUR €) Italy (EUR €) Latvia (EUR €) Lithuania (EUR €) Luxembourg (EUR €) Malta (EUR €) Netherlands (EUR €) Poland (PLN zł) Portugal (EUR €) Romania (RON Lei) Slovakia (EUR €) Slovenia (EUR €) Spain (EUR €) Sweden (SEK kr) United Kingdom (GBP £) Cart ( 0 ) Search Get in touch. If you have any questions about our bikes, want to discuss a Raptor Custom dream build, or need your bike servicing. Get in touch with us below and we'll get back to you within 24 hours. Name Email Phone Number Message Buying a Raptor at The Clubhouse Interested in a Raptor? Book an appointment with one of our founders, Tristram Kelly, to find the right Raptor for you or if you know which bike you'd like buy now. Raptor RL1 SL1 GR1 The Clubhouse Our Events Host an Event Workshop About us Our Stories Customer Support Contact Us Find Your Perfect Bike Buying Guide Why Raptor? Size Guide Crash Replacement FAQs Privacy Policy Contact sales@raptorbikes.cc Instagram Country United Kingdom (GBP\n                    £) Austria (EUR\n                              €) Belgium (EUR\n                              €) Bulgaria (BGN\n                              лв.) Croatia (EUR\n                              €) Cyprus (EUR\n                              €) Czechia (CZK\n                              Kč) Denmark (DKK\n                              kr.) Estonia (EUR\n                              €) Finland (EUR\n                              €) France (EUR\n                              €) Germany (EUR\n                              €) Greece (EUR\n                              €) Hungary (HUF\n                              Ft) Ireland (EUR\n                              €) Italy (EUR\n                              €) Latvia (EUR\n                              €) Lithuania (EUR\n                              €) Luxembourg (EUR\n                              €) Malta (EUR\n                              €) Netherlands (EUR\n                              €) Poland (PLN\n                              zł) Portugal (EUR\n                              €) Romania (RON\n                              Lei) Slovakia (EUR\n                              €) Slovenia (EUR\n                              €) Spain (EUR\n                              €) Sweden (SEK\n                              kr) United Kingdom (GBP\n                              £) © 2025, Raptor Bikes Site design: DesignByPlay.co Close (esc) Popup Use this popup to embed a mailing list sign up form. Alternatively use it as a simple call to action with a link to a product or a page. Email Subscribe Age verification By clicking enter you are verifying that you are old enough to consume alcohol. Enter Search Search Main menu Home RL1 SL1 GR1 About Us Blog Workshop The Clubhouse Contact Shopping Cart Your cart is currently empty. Shop now"
    },
    {
      "url": "https://asri.org/raptor-weekend/event-info.html",
      "text": "Raptor Weekend | Audubon Society of Rhode Island Skip to main content MENU Hike Wildlife Refuges Our Wildlife Refuge Network Caratunk Claire D. McIntosh Davis Memorial Fisherville Brook Emilie Ruecker Fort Parker Woodland Powder Mill Ledges Lathrop Lewis-Dickens Farm Long Pond Woods Maxwell Mays Touisset Marsh Waterman Pond Conservation Efforts Nature Programs & Events Calendar Learn Education at Audubon Audubon at Home Animal Ambassadors Birthday Parties Community Group Programs Nature Center and Aquarium Providence Peregrine Livestream Public Programs & Events School Programs School Programs Afterschool Programs Discounts and Scholarships Links to Standards Professional Development Opportunities Schoolyard Habitats Taking Root: Nature-Based Learning for All Summer Camp Summer Outreach Programs Take Action Advocate Community Science Volunteer Report Bird Strikes Join the Pollinator Alliance Save Gould Island Membership Donate Donate Today Ways to Give CLOSE Facebook Instagram Bluesky YouTube Hike Wildlife Refuges Our Wildlife Refuge Network Caratunk Claire D. McIntosh Davis Memorial Fisherville Brook Emilie Ruecker Fort Parker Woodland Powder Mill Ledges Lathrop Lewis-Dickens Farm Long Pond Woods Maxwell Mays Touisset Marsh Waterman Pond Conservation Efforts Nature Programs & Events Calendar Learn Education at Audubon Audubon at Home Animal Ambassadors Birthday Parties Community Group Programs Nature Center and Aquarium Providence Peregrine Livestream Public Programs & Events School Programs School Programs Afterschool Programs Discounts and Scholarships Links to Standards Professional Development Opportunities Schoolyard Habitats Taking Root: Nature-Based Learning for All Summer Camp Summer Outreach Programs Take Action Advocate Community Science Volunteer Report Bird Strikes Join the Pollinator Alliance Save Gould Island Membership Donate Donate Today Ways to Give RAPTOR WEEKEND New England's Largest Celebration of Birds of Prey They are coming! Avian hunters with long sharp talons, hooked beaks, and highly developed eyesight and hearing are headed to Bristol. They’re raptors, the superior hunters of the avian world. Owls, hawks, and falcons will be featured in live presentations, educational programs, and activities for bird enthusiasts of all ages.  Audubon Raptor Weekend presents a unique opportunity for visitors to get up-close with many species and learn about their adaptations and habitats in this engaging, family-friendly weekend event. In addition to owl and hawk presentations by Audubon experts, wildlife rehabilitators from across the Northeast will bring their expertise with birds of prey to the event - see the presenter lineup below! PURCHASE TICKETS ONLINE: RAPTOR WEEKEND September 6 & 7, 2025; 10:00 am – 4:00 pm Audubon Nature Center and Aquarium 1401 Hope Street (Route 114), Bristol, RI PURCHASE TICKETS → BIRDS & BREWS Brewery Night Kick-Off Event for Raptor Weekend Friday, September 5, 2025; 5:30 – 8:30 pm Audubon Nature Center and Aquarium Learn More & Purchase Tickets → Make the Most of Raptor Weekend Raptor Weekend is a family-friendly, rain or shine event! Frequently Asked Questions Everything you need to know about Raptor Weekend can be found on our event FAQ page! If you still have questions, feel free to contact us. Read the event FAQ Volunteer at Raptor Weekend Help make this event a hoot! With help from our volunteers, New England's largest celebration of raptors is made possible. Join us for this exciting and unique volunteer opportunity; help with games, activities, crafts, and more! Become a Volunteer Share the Fun Help spread the word about this awesome event by tagging us in our event photos. Follow us on Facebook , Instagram and Twitter for Raptor Weekend updates and more. 2025 Schedule of Events Friday, September 5 Birds & Brews Brewery Night Raptor Weekend Kick-Off Event 5:30 – 8:30 pm ; Audubon Nature Center and Aquarium Enjoy live music, sip local beer, and try your luck in our raffle. Plus, get up close with live Audubon owl and hawk ambassadors and learn all about these amazing birds Learn More & Purchase Tickets → Saturday, September 6, 2025 10:00 am – 10:15 am Land Honoring – Tracey Dancing Star (main tent) 10:15 am – 11:15 am Audubon Avian Ambassadors (main tent) 11:30 am - 12:15 pm Raptors in Flight with Master of the Skies (back lawn) 12:30 pm – 1:00 pm Nature Family Sing-A-Long with Audubon’s Tracey Hall and Lisa Maloney (garden) 12:30 pm – 1:30 pm Sketching Raptors with Autumn Jencks (auditorium) 1:45 pm – 2:45 pm Audubon Avian Ambassadors (main tent) 3:00 pm – 3:45 pm Raptors in Flight with Master of the Skies (back lawn Sunday, September 7, 2025 9:30 am – 10:00 am Talkin' Birds with Ray Brown (Patio) - Guests are welcome to arrive early to Raptor Weekend to watch the live radio show! 10:15 am - 11:15 am Who’s Watching You? Owls of the World with Eyes on Owls (main tent) 11:30 am – 12:15 pm Raptors in Flight with Master of the Skies (back lawn) 12:30 pm – 1:00 pm Nature Family Sing-A-Long with Audubon’s Tracey Hall and Lisa Maloney (garden) 12:45 pm – 1:30 pm We Count! Raptor Migration Monitoring in the Americas Lecture by Julie Brown from Hawk Migration Association (auditorium) 1:45 pm – 2:45 pm Who’s Watching You? Owls of the World with Eyes on Owls (main tent) 3:00 pm – 3:45 pm Raptors in Flight with Master of the Skies (back lawn) Explore the 2025 Raptor Weekend Presenters, Artists, & Lecturers Click on each photo for more information! Audubon Society of RI Audubon Society of RI Audubon currently cares for 12 birds, including owls, hawks and a raven. Their extraordinary adaptations are sure to fascinate both children and adults alike. In addition to close-up visits from feathered friends, participants learn about raptor behaviors, predators, prey and habitats. Eyes on Owls Eyes on Owls Marcia and Mark Wilson founded Eyes On Owls in 1994 as an educational enterprise that brings owls to schools and other groups to teach about these wild “neighbors” and their habitats. eyesonowls.com Hawk Migration Association Hawk Migration Association Raptor Migration and Programs Director for the Hawk Migration Association (HMA), Julie Brown, will speak about HMA’s work and the impressive continental network of hawk watching sites, why collecting spring and fall migration data is important and what we’ve learned about raptor movements and populations. She’ll dive into some migration data from hawkwatches around New England and across the continent and share what it’s showing us about the health of raptor populations. Julie Brown is the Raptor Migration and Programs Director at the Hawk Migration Association. Before joining HMA in 2009, she migrated throughout the US and tropics working as a field biologist primarily with raptors, focusing on human impact studies, migration research and behavioral studies. She received her BS in Wildlife Ecology from the University of Maine and received her MS in Conservation Biology from Antioch University New England where she studied Peregrine Falcon migration in Costa Rica for her thesis. She lives in New Hampshire with her husband, whom she met hawkwatching, and her two bird-loving children, a flock of chickens, her dog and lots of fruit trees. She is a volunteer counter at the Pack Monadnock Raptor Migration Observatory each fall. https://www.hawkmigration.org/ Masters of the Skies Masters of the Skies French native Gregory Martel is a Master Falconer who has worked with more than 55 raptors since 2010. He trains and flies hawks, falcons and owls for a variety of purposes, including hunting, falconry abatement (bird control) and education. He created Masters of the Skies in 2014 to educate the general public about birds of prey and falconry, and he has been working as a full-time falconer and educator since 2016. http://www.mastersoftheskies.org/ Talkin' Birds Radio Show Talkin' Birds Radio Show Talkin' Birds is a live and interactive radio show about wild birds and the beauty of nature—attracting birds to your backyard, feeding them, and learning more about them. Expert guests and contests for prizes like bird feeders and other bird-related items are featured each week. talkinbirds.com Arianne Del Rios Artist and exhibit details coming soon! 2025 Raptor Weekend Ticket Pricing* All proceeds from Raptor Weekend benefit raptor care, school programs, and habitat conservation efforts by the Audubon Society of Rhode Island. Thank you for your support! There will be on-site parking for $5 , per availability. Visitors who ride their bike or take the bus to the event receive a Raptor Weekend Event button! Show a little extra support! VIP tickets include admission, preferred seating under the main tent, free on-site parking, and $10 lunch voucher. Limited to 40 VIP tickets each day. $60/person. *Tickets purchased online are subject to processing fees. Thank You to our 2025 Sponsors! To donate a raffle item or become a Raptor Weekend sponsor, please call (401) 949-5454 x3018. Stay Connected Share Your Photos Follow us on Facebook (@AudubonRI), Instagram and Bluesky (@RIAudubon). Share your photos by tagging us and using #RIAudubon and #RaptorWeekend! Subscribe to eWing Sign up for eWing, our email newsletter to learn about other exciting Audubon programs as well as natural history stories and news from Rhode Island. 7k48pk3xg5n2 Your Name First Name * Last Name * Your Email Audubon Headquarters 12 Sanderson Road, Smithfield, RI 02917 401-949-5454 x3000 Contact us online Trails Open Daily, Sunrise - Sunset | Administrative offices are open to guests by appointment only: Monday - Friday, 9:30 am - 4:00 pm. Audubon Nature Center and Aquarium 1401 Hope Street, Bristol, RI 02809 401 949-5454 x3118 Contact us online Exhibits and Nature Shop Open Daily 9:30 am - 4:30 pm | Trails Open Daily Sunrise - Sunset | Located on RIPTA Route 60. | Admission Info, Closings & Announcements: Click Here © Copyright 2025 Privacy Policy Privacy Policy Privacy Policy We do not sell or otherwise disclose information about our volunteers or supporters outside of our immediate organization. This policy has no exceptions. We do not sell or exchange your information with any other organization, public, private, or nonprofit. Our privacy policy was developed as an extension of our commitment to combine the excellent service with the highest level of integrity in dealing with our website users. The policy is designed to assist you in understanding how we collect, use, and safeguard the personal information you provide and to assist you in making informed decisions when using our site. This statement will be continuously assessed against new technologies, ethical practices, and the needs of our users. What Information Do We Collect? Personal Information You Choose to Provide Website Use Information How Do We Use The Information You Provide To Us? What Are Cookies? How Do We Use Information Collected From Cookies? Notice Of New Services And Changes How Do We Secure Information Transmissions? How Do We Protect Your Information? How Can You Access And Correct Your Information? Do We Disclose Information To Outside Parties? What About Legally Compelled Disclosure Of Information? Permission To Use Of Materials What Information Do We Collect? When you visit our website you may provide us with two types of information: personal information you knowingly choose to disclose that is collected on an individual basis and website use information collected on an aggregate basis as you and others browse our website. Personal Information You Choose to Provide We may request that you voluntarily supply us with personal information, including your e-mail address, postal address, home or work telephone number and other personal information for such purposes as correspondence, placing an order, requesting an estimate, or participating in online surveys. If you choose to correspond with us through e-mail, we may retain the content of your e-mail messages together with your e-mail address and our responses. We provide the same protections for these electronic communications that we employ in the maintenance of information received by mail and telephone. Website Use Information In order to help enhance the performance and functionality of the site, we utilize session, persistent and third-party “cookies” that store a small piece of data on a users’ computers and collect certain information about the users’ visit to our site (see explanation below, \"What Are Cookies?\"). We also use cookies to understand users’ browsing and buying activities so that we can measure the success of online advertising campaigns we run on the site. Our site also uses web beacons (either directly or from our partners), along with cookies, to determine if a user has visited a particular website. These beacons aid in providing more relevant advertising to the user, as well as measuring the success of an advertising campaign, but provide no personally identifiable information. How Do We Use The Information You Provide To Us? Broadly speaking, we use personal information for purposes of administering our business activities, providing service and support and making available other products and services to our customers and prospective customers. Occasionally, we may also use the information we collect to notify you about important changes to our website, new services and special offers we think you will find valuable. The lists used to send you product and service offers are developed and managed under our traditional standards designed to safeguard the security and privacy of all personal information provided by our users. You may at any time to notify us of your desire not to receive these offers. What Are Cookies? Cookies are small text files that web servers typically send to users’ computer when they visit a website. Cookies are stored as text files on users’ hard drive, and can be accessed by web servers when the user visits a website or views an advertisement. A session cookie is a cookie that stores information as a user is using the Site but is deleted once the browser session is finished. A persistent cookie is a cookie that stores information as a user utilizes the Site and stores and uses that information in connection with future visits of the user to the Site. Third-party cookies and/or web beacons are cookies or web beacons provided by our technology and/or advertising partners. Any third-party cookie or web beacon that we authorize for use on the Site only collects that information described below for the same stated purposes as if we were directly collecting the information. For a third-party cookie or web beacon, the third-party will have access to the collected information in order to provide us with information or services to enhance the performance and functionality of the Site. The cookies and web beacons we use collect non-personally identifiable information about users of the Site, including: browser used to access the site, date and time, the URL of the page being loaded, users who have visited a particular website(s), any previously assigned cookie identification (a unique identifier assigned to a user to identify repeat visitors), browser window size, the geographic location of the user, device and operating system used to access the Site. The information we collect from these cookies and web beacons is used to determine information about a user’s visit to our Site, including the number of visits, average time spent, pages viewed, navigation history through the website, and other statistics. This information is used to enhance the users experience while visiting our Site and to improve the performance of our Site by, among other things, allowing us to monitor Site performance, making the Site easier to use, measuring the effectiveness of promotional placements, and tailoring the Site (including the ads and offers a user receives) to better match a user’s interests and preferences. How Do We Use Information Collected From Cookies? We use website browser software tools such as cookies and web server logs to gather information about our website users' browsing activities, in order to constantly improve our website and better serve our users. This information assists us to design and arrange our web pages in the most user-friendly manner and to continually improve our website to better meet the needs of our users and prospective users. Cookies help us collect important business and technical statistics. The information in the cookies lets us trace the paths followed by users to our website as they move from one page to another. Web server logs allow us to count how many people visit our website and evaluate our website's visitor capacity. We work with third party vendors to provide a more customized experience for you. To do so, we disclose personally identifiable information about you (specifically, your name and email address) to those vendors, though we do not allow them to re-sell or use that information for their own purposes. Users who prefer not to accept cookies can set their Internet browser to notify them when they receive a cookie or to prevent cookies from being placed on their hard drive.If you consent to our collection of cookies and you subsequently wish to withdraw your consent, you will need to manage the settings on your web browser to delete all cookies and disallow further acceptance of cookies. Please note that disabling cookies on your browser will prevent us from tracking your activities in relations to our Site, however, it may also disable some of the functions and features of the Site and the Site may not work properly. If you would like to determine your consent status, please contact us at audubon@asri.org . By continuing to use our Site, you are agreeing to our placing cookies and/or web beacons on your computer in order to analyze the way you use our Site. Please read \"What are Cookies\" and \"How Do We Use Information Collected From Cookies?\" carefully for more details about the information we collect when you use the Site. If you do not wish to accept cookies or web beacons in connection with your use of this Site, please discontinue use of the Site. Notice Of New Services And Changes Occasionally, we may use the information we collect to notify you about important changes to our website, new services and special offers we think you will find valuable. As a user of our website, you will be given the opportunity to notify us of your desire not to receive these offers by clicking on a response box when you receive such an offer or by sending us an e-mail request. How Do We Secure Information Transmissions? When you send confidential personal information to us on our website, a secure server software which we have licensed encrypts all information you input before it is sent to us. The information is scrambled en route and decoded once it reaches our website. Other e-mail that you may send to us may not be secure unless we advise you that security measures will be in place prior to your transmitting the information. For that reason, we ask that you do not send confidential information such as Social Security, credit card, or account numbers to us through an unsecured e-mail. How Do We Protect Your Information? Information Security -- We utilize encryption/security software to safeguard the confidentiality of personal information we collect from unauthorized access or disclosure and accidental loss, alteration or destruction. Evaluation of Information Protection Practices -- Periodically, our operations and business practices are reviewed for compliance with organization policies and procedures governing the security, confidentiality and quality of our information. Employee Access, Training and Expectations -- Our organization values, ethical standards, policies and practices are committed to the protection of user information. In general, our business practices limit employee access to confidential information, and limit the use and disclosure of such information to authorized persons, processes and transactions. How Can You Access And Correct Your Information? You may request access to all your personally identifiable information that we collect online and maintain in our database by emailing us using our the contact form located on our website: https://asri.org/contact-us/ Do We Disclose Information To Outside Parties? We may provide aggregate information about our customers, sales, website traffic patterns and related website information as well as personally identifiable information about you (specifically, your name and email address) to our affiliates or reputable third parties, though we do not allow them to re-sell or use your personally identifiable information for their own purposes. What About Legally Compelled Disclosure Of Information? We may disclose information when legally compelled to do so, in other words, when we, in good faith, believe that the law requires it or for the protection of our legal rights. Permission To Use Of Materials The right to download and store or output the materials in our website is granted for the user's personal use only, and materials may not be reproduced in any edited form. Any other reproduction, transmission, performance, display or editing of these materials by any means mechanical or electronic without our express written permission is strictly prohibited. Users wishing to obtain permission to reprint or reproduce any materials appearing on this site may contact us directly. Terms & Conditions Terms & Conditions Donation Refund Policy We are grateful for your donation and support of our organization. If you have made an error in making your donation or change your mind about contributing to our organization please contact us.  Refunds are returned using the original method of payment. If you made your donation by credit card, your refund will be credited to that same credit card. Automated Recurring Donation Cancellation Ongoing support is important to enabling projects to continue their work, so we encourage donors to continue to contribute to projects over time. But if you must cancel your recurring donation, please notify us. Powered by Firespring"
    },
    {
      "url": "https://www.raptorindustriesusa.com/contactus",
      "text": "Contact | Raptor Industries top of page Request Quote Home Services Tube Laser Cutting Flat Laser Cutting Cut-to-Length Precision Bending About Contact Request A Quote FAQ More Use tab to navigate through the menu items. CONTACT US 14587 Day Rd, Hudson, MI 49247, USA sales@raptorindustriesusa.com 517-855-2319 Name Email Phone Address Subject Message Submit Thanks for submitting! sales@raptorindustriesusa.com ©2022 by RAPTOR Industries bottom of page"
    },
    {
      "url": "https://friendsofboydhillnaturepreserve.wildapricot.org/Donate/",
      "text": "Friends of Boyd Hill Nature Preserve - Donate Log in Who We Are Board of Directors Contact Us What We Do Events Camp Scholarships Birds of Prey Meet Our Birds Park Improvements Grants and Science About the Preserve This Quiet Corner Terry Tomalin Campground Become a member Raptor Fest Donate Warning: browser cookies disabled. Please enable them to use this website. Donation * Mandatory fields * First name * Last name Organization * e-Mail Invalid email This email is already in use. Home Phone Cell Phone * Mailing Address Please list full address with City, State and zipcode. * Amount ($USD) Amount is in invalid format Friend's Initiatives Merchandise Children's  Camp Scholarships Educational Exhibits Playground Improvements Unrestricted Gift Other (Please let us know below) Select one. Comments Length limit exceeded. Please let us know more about how you'd like your donation to be used. For corporate or large donation inquiries, contact Executive Director, Jason Cowen at jason@friendsofboydhill.org A COPY OF THE OFFICIAL REGISTRATION AND FINANCIAL INFORMATION MAY BE OBTAINED FROM THE DIVISION OF CONSUMER SERVICES BY CALLING TOLL-FREE WITHIN THE STATE 1-800-HELP-FLA (435-7352) OR BY VISITING WWW.FLORIDACONSUMERHELP.COM. REGISTRATION DOES NOT IMPLY ENDORSEMENT, APPROVAL, OR RECOMMENDATION BY THE STATE. Powered by Wild Apricot Membership Software"
    },
    {
      "url": "https://www.raptorinc.org/about-us/about-us/history/",
      "text": "About Us - About Us - History | RAPTOR Inc. Skip to Main Content Visit Our Facebook Page Visit Our Instagram Page 513.825.3325 director@raptorinc.org Injured Bird Help Donate Gift Shop About Us About Us Join Our Team Strategic Plan & Annual Reports Donor Privacy/Gift Policies Useful Links Rehabilitation & Rescue Rescue How You Can Help Raptors Education Formal Raptor Programs Informal Raptor Programs On-Site Programs Support Us Support Donate Become a Member Sponsor a Bird Under Care Sponsor an Avian Ambassador Volunteer Internships Planned Giving Legacy Society Purchase Jordan West Photography News Current Happenings 2025 2024 2023 2022 2021 2020 2019 Contact View Menu About Us Rehabilitation & Rescue Education Support Us News Contact History Categories About Us Mission Leadership Ambassadors Facility History Join Our Team Strategic Plan & Annual Reports Strategic Plan Annual Reports Donor Privacy/Gift Policies Donor Privacy Policy Gift Acceptance Policy Useful Links RAPTOR Inc. has been serving the Greater Cincinnati area for over 45 years, treating injured and orphaned raptors and providing educational programs with live birds of prey. Early Beginnings In the early 1970s, Scott Adamson and Jim Williams started a raptor rehabilitation group named “The Southwest Ohio Raptor Rehabilitation Clinic” or “SWORC”. The Hamilton County Park District allowed them to operate out of a garage located behind the house at Farbach-Werner Nature Preserve. Scott and Jim financed the entire operation out of their own pockets and with whatever donations they could obtain. Two veterinarians donated their time and facilities at little or no cost. Several cages were obtained from local research centers and others were built. Many birds were treated and released during this period. Several non-releasable birds became educational ambassadors, including the famed Barred Owl “Henry” and the infamous Great Horned Owl “Lazarus”. Scott was hired as the Director of the Lake Erie Nature and Science Center near Cleveland, OH and relocated his family. The cost of operating “SWORC” became too much for Jim to handle on his own and the decision was made to form a non-profit organization to carry on the work. RAPTOR Inc. Formed The new organization was incorporated in 1978 as RAPTOR Inc. RAPTOR is an acronym for the Regional Association for the Protection and Treatment Of Raptors. With the birth of RAPTOR Inc., a new board was created with Bill Moring serving as the first president. The operation was moved to Bill Moring’s residence in College Hill. The late Charley Harper, local wildlife artist extraordinaire, designed and donated the distinctive RAPTOR Inc. logo that is still used today. RAPTOR Inc. grew to several hundred members and became a respected rehabilitation and conservation organization in the Greater Cincinnati area. Outgrowing Bill and Ann’s house, RAPTOR Inc. entered into an agreement with the Hamilton County Park District to use the house and barn on Covered Bridge Rd. near Winton Woods. Sadly, Bill Moring passed away right before the move to “Covered Bridge”  in 1990. Volunteers carried on the vision. Enclosures were built and the house was rented to a caretaker who was responsible for feeding the birds during the week. For the first time there were large flight enclosures and plenty of room for freezers of food. Bird care was managed from a central location and there was housing for the resident birds used for educational programs. While RAPTOR Inc. became a more mature organization, thousands of injured raptors were admitted and treated. Also, hundreds of educational programs were provided to the community. In 1991, RAPTOR took part in the Peregrine Project, working with the Ohio Department of Natural Resources (ODNR) to re-establish the Peregrine falcon in the greater Cincinnati area. Peregrine falcon fledglings were hatched in captivity in Minnesota and then relocated to a “hack box” atop the Cincinnati Commerce Building downtown. RAPTOR Inc. volunteers monitored the young birds as they eventually struck out on their own. Peregrines continue to nest and feed their young from this nest box downtown. Thanks to this early conservation work the peregrine falcon population recovered, and they have been removed from Ohio’s threatened and endangered species lists. In 2002 there was a sudden outbreak of West Nile Virus, a disease spread by mosquitoes. The infection had a significant impact on local bird of prey populations, especially red-tailed hawks and great horned owls, with 117 birds admitted between July and September of that year. In 2005, RAPTOR purchased property adjacent to the Cincinnati Nature Center in Milford, Ohio to serve as the future site for a new raptor center. This was a considerable leap for the all-volunteer organization. The new property consisted of a large red barn located on 8 acres of land. Growth of RAPTOR Inc. In 2010, thanks in part to a large private donation, RAPTOR Inc. was able to begin conversion of the red barn into a new headquarters for the organization and center for rehabilitation activities. New enclosures were constructed, including multiple flight enclosures, the largest being 16 x 16 x 140 feet – suitable for eagles. RAPTOR Inc. moved into the new facility in March, 2012. RAPTOR Inc. continues to serve the greater Cincinnati area, rehabilitating injured birds of prey and providing educational programs to the public about raptors and their contribution to the ecosystem. With room to expand on the current property, RAPTOR Inc. plans to construct an educational facility that will be open to the public where people can visit to see and learn about raptors. RAPTOR Inc. is still primarily a volunteer organization. Specially trained volunteers perform duties including: coordination and pickup of injured raptors, rehabilitation and release of injured raptors, care and feeding of educational ambassadors, delivering educational programs, and maintenance and enhancement of RAPTOR Inc.’s facilities. RAPTOR Inc. continues to be governed by a 9-member Board of Trustees, with day to day operations managed by RAPTOR Inc.’s Executive Director - Steve Wesselkamper, Director of Avian Operations - Cindy Alverson, and Director of Education - Jackie Bray. RAPTOR Inc. is a 501 (c) 3 tax-exempt non-profit organization funded through educational programs, memberships, grants, and donations. Careful resource management ensures that RAPTOR Inc. will continue to serve our community far into the future. Visit Our Facebook Page Visit Our Instagram Page 513.825.3325 director@raptorinc.org Injured Bird Help Donate Gift Shop Address: 961 Barg Salt Run Rd. Milford, Ohio 45150 We are a 501 (c)(3) organization Unless otherwise specified, photography by Jordan West Photography About Us Rehabilitation & Rescue Education Support Us News Contact © Copyright 2025 Raptor Inc. Powered By Legend Web Works, LLC Privacy Policy | ADA Policy Copied! ^ TOP close ModalContent"
    }
  ]
}