{
  "fuentes": [
    {
      "url": "https://www.wildadventures.com/media-room/",
      "email": "asher.raymond@wildadventures.com"
    },
    {
      "url": "https://www.wildadventures.com/media-room/",
      "email": "waadvertising@alliedglobalmarketing.com"
    },
    {
      "url": "https://www.riverwild.com/contact/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://www.riverwild.com/contact/",
      "email": "info@riverwild.com"
    },
    {
      "url": "https://www.riverwild.com/contact/",
      "email": "info@wildriver.com"
    },
    {
      "url": "https://www.adventurebooks.com/",
      "email": "info@adventurebooks.com"
    },
    {
      "url": "https://www.adventurebooks.com/",
      "email": "orders@adventurebooks.com"
    },
    {
      "url": "https://www.wildadventures.com/accessibility/",
      "email": "contactus@wildadventures.com"
    },
    {
      "url": "https://getinthewild.com/contact-us/",
      "email": "info@getinthewild.com"
    },
    {
      "url": "https://www.share-it-forward.org/resources/wild-adventures/",
      "email": "marshall.reiser@wildadventures.com"
    },
    {
      "url": "https://www.wildadventures.com/groups/general-groups/",
      "email": "groups2@wildadventures.com"
    },
    {
      "url": "https://www.wildadventures.com/Media-Room",
      "email": "asher.raymond@wildadventures.com"
    },
    {
      "url": "https://www.wildadventures.com/Media-Room",
      "email": "waadvertising@alliedglobalmarketing.com"
    },
    {
      "url": "https://backtowildadventures.com/about-us/",
      "email": "info@backtowildadventures.com"
    },
    {
      "url": "https://www.riverwild.com/about-us/",
      "email": "info@riverwild.com"
    },
    {
      "url": "https://www.riverwild.com/about-us/",
      "email": "info@wildriver.com"
    },
    {
      "url": "https://oregonwild.org/contact-us/",
      "email": "ar@oregonwild.org"
    },
    {
      "url": "https://oregonwild.org/contact-us/",
      "email": "ef@oregonwild.org"
    },
    {
      "url": "https://oregonwild.org/contact-us/",
      "email": "info@oregonwild.org"
    },
    {
      "url": "https://oregonwild.org/contact-us/",
      "email": "rm@oregonwild.org"
    },
    {
      "url": "https://www.wildadventures.com/jobs/employment-contact/",
      "email": "wahr@wildadventures.com"
    }
  ],
  "mails": [
    "ar@oregonwild.org",
    "asher.raymond@wildadventures.com",
    "chosen-sprite@2x.png",
    "contactus@wildadventures.com",
    "ef@oregonwild.org",
    "groups2@wildadventures.com",
    "info@adventurebooks.com",
    "info@backtowildadventures.com",
    "info@getinthewild.com",
    "info@oregonwild.org",
    "info@riverwild.com",
    "info@wildriver.com",
    "marshall.reiser@wildadventures.com",
    "orders@adventurebooks.com",
    "rm@oregonwild.org",
    "waadvertising@alliedglobalmarketing.com",
    "wahr@wildadventures.com"
  ],
  "nombre_sitio": "wildadventures.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.wildadventures.com/media-room/",
      "text": "Media Room Park Hours Sign In | Register Accessibility Search Theme Park Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Events Special Events Events Special Events Special Events Splash Island Waterpark Splash Island Returns in 2026! Explore Slides Campground Campground Information Map FAQs Activities Campground Information Map FAQs Activities Book Now Campground Activities Calendar Season Passholder Campground Discounts Plan Your Visit Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Park Information Mobile App Blog Policies FAQs Park Information Mobile App Blog Policies FAQs Campground Now Open! Special Events Tickets & Passes Buy Tickets General Admission Special Offers Military Stay & Play Buy Tickets General Admission Special Offers Military Stay & Play Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends 2026 Season Passes Now Available! Get your FREE Pre K Pass Buy Tickets Theme Park Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Events Special Events Events Special Events Special Events Splash Island Waterpark Splash Island Returns in 2026! Explore Slides Campground Campground Information Map FAQs Activities Campground Information Map FAQs Activities Book Now Campground Activities Calendar Season Passholder Campground Discounts Plan Your Visit Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Park Information Mobile App Blog Policies FAQs Park Information Mobile App Blog Policies FAQs Campground Now Open! Special Events Tickets & Passes Buy Tickets General Admission Special Offers Military Stay & Play Buy Tickets General Admission Special Offers Military Stay & Play Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends 2026 Season Passes Now Available! Get your FREE Pre K Pass Buy Tickets Media LATEST NEWS New Water’s Edge Expansion Opens at Wild Adventures for 2025 Read More Thank you for your interest in Wild Adventures Theme Park! We are happy to share our news stories, photos and press releases. Please note that all images on our website and those provided for third-party use are copyrighted by us and permission must be granted for their use whether in print, broadcast or presentation media. Members of the news media are welcome to contact our Public Relations Office with any inquiries, especially those concerning promotional ticket requests and media partnerships: Asher Raymond Public Relations Specialist 3766 Old Clyattville Road Valdosta, GA 31601 Asher.Raymond@wildadventures.com Media Visits and Filming All members of the news media covering Wild Adventures must contact our Public Relations department to request interviews or filming access in advance. Members of the news media must be escorted by a Wild Adventures team member at all times while on assignment on the premises. Media Ticket Requests Working members of the news media may request up to four complimentary tickets per season to Wild Adventures. Please submit your requests in writing via email to Asher.Raymond@wildadventures.com two working days or more in advance of your visit. We cannot guarantee delivery of complimentary tickets requested less than two working days in advance. For Content Creators and Social Media Influencers who are interested in a collaboration, or are preparing to visit the park, fill out an application here . Your application will be reviewed in 3 to 5 business days. Photo and Video Requests To request high-resolution images and videos for media purposes, contact Asher.Raymond@wildadventures.com . Advertising Inquiries To inquire about advertising opportunities, please email Allied Global Marketing at WAadvertising@alliedglobalmarketing.com . In The News Great Pumpkin LumiNights Returns to Wild Adventures September 03, 2025 Family-Friendly Celebration Brings New Lights, Entertainment and Fall Flavors Read More Wild Adventures Offers Free Admission to First Responders and Teachers August 20, 2025 Guests’ Last Chance to Splash and Meet Dinosaurs for the 2025 Season Read More Wild Food Weekends Returns with “Tater Takeover” July 30, 2025 Fan-Favorite Event Returns with All-New Potato-Inspired Menu and Special Offers Read More Skillet to Take the Stage at Wild Adventures Theme Park July 23, 2025 Award-Winning Christian Rock Band Will Perform on August 2 Read More Drone Show Lights Up the Sky at Wild Adventures July 22, 2025 Weekend Event Includes Free Admission for Teachers Read More Wild Adventures Offers Free Admission to Teachers July 21, 2025 Weekend Event Includes Free Admission for Teachers Read More James \"Murr\" Murray to Perform at Wild Adventures Theme Park July 14, 2025 “Impractical Jokers” Comedian Take the Stage July 19 Read More Wild Adventures Promotes Water Safety With J.A.W.S. Program July 10, 2025 Weekend Programming Shows Children How to Enjoy the Water Safely Read More Doug E. Fresh and Rob Base to Perform at Wild Adventures Theme Park July 07, 2025 Hip-Hop Legends Take the Stage July 12 Read More Harlem Globetrotters Visit Community Ahead of Wild Adventures Performance June 27, 2025 Team Stops at Moody Air Force Base and Boys & Girls Club of Valdosta Read More Wild Adventures Joins Global Effort to Promote Water Safety June 27, 2025 World’s Largest Swim Lesson Part of Park’s Ongoing Commitment to Water Safety Read More Wild Adventures Named One of the Most Affordable Parks in the U.S. June 27, 2025 Annual Survey Highlights Value and Experience for Traveling Families Read More Celebrate America Fireworks Spectacular Coming to Wild Adventures June 25, 2025 Two Nights of Patriotic Lights Bedazzling the Park’s Skyline Read More Harlem Globetrotters Return to Wild Adventures June 27-29 June 23, 2025 Three Days of High Energy Shows During the Celebrate America Festival Read More Wild Adventures Celebrate America Event Returns June 17, 2025 Enjoy Fireworks and Free Military Admission, and See the Harlem Globetrotters Read More Ashley McBryde to Perform at Wild Adventures Theme Park June 12, 2025 Award-Winning Country Music Artist Takes the Stage June 21 Read More Wild Adventures Hosts World’s Largest Swim Lesson June 09, 2025 Park Partners with Local YMCA for June 26 Event Read More Zach Williams to Perform at Wild Adventures Theme Park June 05, 2025 Wild Adventures Theme Park in Valdosta, Ga., continues its 2025 Wild Adventures LIVE! Concert Series on Saturday, June 14, with a performance from GRAMMY® Award-winning Christian music artist Zach Williams. Read More Splash Island Nights Returns to Wild Adventures June 05, 2025 Friday Night Fun with Extended Hours, Live Entertainment, $25 Night Tickets, and New Summer Wild Card Offer Read More Big & Rich to Perform with Gretchen Wilson at Wild Adventures Theme Park May 29, 2025 Wild Adventures Theme Park will welcome country music icons Big & Rich and Gretchen Wilson to the stage on Saturday, June 7, as part of the 2025 Wild Adventures LIVE! Concert Series. Read More Wild Adventures Celebrates with Fireworks and Free Military Admission May 19, 2025 Wild Adventures Theme Park and Splash Island Waterpark will begin daily summer operations on Saturday, May 24, kicking off the season with a Memorial Day Weekend celebration packed with fireworks, live entertainment, special admission offers, and the chance to explore the park’s newest themed area. Read More Chris Tomlin to Perform at Wild Adventures May 15, 2025 One of the most influential worship leaders of our time, Chris Tomlin, will take the stage at Wild Adventures Theme Park in Valdosta, Ga., on Saturday, June 14, as part of the park’s 2025 Wild Adventures LIVE! concert series. Read More Wild Adventures Safari Campground Receives Perfect Score May 08, 2025 Wild Adventures Safari Campground has received a perfect 10/10★/10 rating from Good Sam, the nation’s most respected authority on campground excellence. The rating places the campground among fewer than 200 elite destinations across the country and one of only six in Georgia to achieve the distinction. Read More Sixth Annual Great Ping Pong Race Returns to Wild Adventures May 06, 2025 Wild Adventures Theme Park will once again host The Great Ping Pong Race, a high-energy charity event to benefit The Miracle League of Valdosta, on Saturday, May 10, at Splash Island Waterpark. Read More CeCe Winans to Perform at Wild Adventures Theme Park May 05, 2025 Wild Adventures Theme Park in Valdosta, Georgia, will welcome the most-awarded female gospel artist of all time, CeCe Winans, to the Wild Adventures LIVE! stage on Saturday, May 17. Read More 38 Special to Rock the Stage at Wild Adventures April 28, 2025 Wild Adventures Theme Park in Valdosta, Georgia, will turn up the volume on Saturday, May 10, as Southern rock legends 38 Special take the stage for an electrifying performance during the 2025 Wild Adventures LIVE! Concert Series. Read More Walker Hayes to Perform at Wild Adventures Theme Park April 23, 2025 Wild Adventures Theme Park in Valdosta, Georgia, continues its 2025 Wild Adventures LIVE! Concert Series on Saturday, May 3, with a performance from country music hitmaker Walker Hayes. Read More Wild Adventures Celebrates Waterpark Opening and Concert Season Kickoff March 25, 2025 Wild Adventures Theme Park in Valdosta, Georgia, kicks off Spring Break for local students with a weekend full of special events, the start of the Wild Adventures LIVE! Concert Series and the annual opening of Splash Island Waterpark. Read More New Water’s Edge Expansion Opens at Wild Adventures for 2025 March 11, 2025 Wild Adventures Theme Park in Valdosta, Georgia, launches its 2025 season on March 15 with exciting new rides, live entertainment and immersive experiences, offering unforgettable family adventures through December. Read More Wild Adventures Seeking 500 New Hires for 2025 Season March 06, 2025 Wild Adventures Theme Park in Valdosta, Ga. will open for its 2025 Season in March, and the park is hosting hiring events and offering unique benefits to fill hundreds of open positions.\n“When we open March 15, we will also be introducing Water’s Edge, a new expansion to Wild Adventures,” said Susan Pinkerton, director of administration. “We are hiring to fill the new positions created by Water’s Edge as well as hundreds of other positions throughout the park.” Read More Wild Adventures Announces 2025 Concerts and Event Lineup February 18, 2025 Wild Adventures Theme Park in Valdosta, Georgia, has announced its 2025 concert and special events schedule, featuring an exciting mix of new and returning artists, seasonal festivals, and exclusive events for season passholders. Read More Dinosaur Explore Roars Again at Wild Adventures in 2025 December 19, 2024 Live-sized dinosaurs are stomping their way back into Wild Adventures next Season when Dinosaur Explore returns for another year of immersive educational experiences. Read More Wild Adventures Offering Half Off Admission With Food Donation November 24, 2024 Wild Adventures Theme Park in Valdosta, Ga. is celebrating the opening of South Georgia’s largest holiday event, Wild Adventures Christmas Wild and Bright, by offering 50 percent off single-day admission with a food donation and free admission for military members, utility workers and more. Read More Wild Adventures Christmas Wild & Bright Holiday Menu Returns November 21, 2024 South Georgia’s largest Christmas celebration has returned to Wild Adventures Theme Park in Valdosta, Ga. along with a festive holiday menu and a unique way to try as many sweet and savory treats as possible. Read More Wild Adventures’ Invites Community to Support Greater Valdosta United Way November 12, 2024 This holiday season, Wild Adventures Theme Park is teaming up with Greater Valdosta United Way to raise funds for Impact Partner Nonprofits through the annual Christmas Tree Village with a new twist. Read More Wild Adventures Christmas Wild & Bright Returns November 05, 2024 South Georgia’s Biggest Christmas Event Features New Additions Read More Wild Adventures Announces Three Artists  for 2025 Concert Series October 28, 2024 Wild Adventures Theme Park in Valdosta, Ga. announced three performances of its 2025 Wild Adventures LIVE! Concert Series lineup, teasing a schedule packed with award-winning artists. Read More Wild Adventures Offers Free Admission to Kids 9 And Under October 22, 2024 Kids Can Play For Free on The Last Day of Great Pumpkin LumiNights Read More Chalk Artists Return To Create Fall Art This Weekend October 15, 2024 Wild Adventures Welcomes Professional Chalk Artists for Great Pumpkin LumiNights Read More Wild Adventures Offers Free Admission To Community Heroes October 08, 2024 First Responders and Power Line Workers to Receive Free Admission During Great Pumpkin LumiNights Read More Wild Adventures Hosts Valdosta’s First Drone Show October 07, 2024 300 Drones Will Celebrate the Resilience of South Georgia and Create Classic Fall Imagery in the Sky Read More Wild Adventures Reopens this Weekend October 03, 2024 South Georgia Theme Park Makes Donation to Second Harvest as Great Pumpkin LumiNights Returns Read More Master Pumpkin Carver Returns for Great Pumpkin LumiNights October 03, 2024 Wild Adventures Welcomes Back Jim Morey And His Live Carving Experience Read More Big New Additions Come to Great Pumpkin LumiNights at Wild Adventures September 19, 2024 Family-Friendly Celebration Returns with New Statues, Entertainment, Lights and More Read More Wild Adventures Announces New Rides and 2025 Expansion September 09, 2024 The New Water’s Edge Features Three New Rides, Eateries, Entertainment and More Read More Wild Adventures Offers Free Admission To Community Heroes August 19, 2024 Park Offers Free Admission for Military, First Responders, Healthcare Workers, Teachers and School Staff Read More Wild Adventures Offers Free Admission for Teachers July 23, 2024 Guests Can Donate School Supplies for Discount Admission Read More Wild Adventures Named One of the Most Affordable Parks in U.S. June 25, 2024 Wild Adventures Theme Park is proud to announce its recent accolade as the 4th most affordable park in the United States, according to HomeToGo’s 2024 U.S. Summer Travel Survey. Read More For King + Country to Perform at Wild Adventures June 20, 2024 Platinum-Selling Band Returns to South Georgia Theme Park July 20 Read More Colt Ford Concert Canceled; Wild Adventures Welcomes The LACS April 11, 2024 Georgia Country Rap Duo Performs April 20 at the Wild Adventures LIVE! Amphitheater Read More Wild Adventures Reveals Name, Breaks Ground on Campground December 12, 2023 Construction Is Officially Underway For One-Of-A-Kind Camping Experience Read More Life-Sized Dinosaurs Stomping Into Wild Adventures in 2024 November 03, 2023 Prehistoric creatures are making their way back to South Georgia as Dinosaur Explore debuts in the 2024 Season at Wild Adventures Theme Park. Read More Wild Adventures Announces Three 2024 Concerts October 23, 2023 Wild Adventures Theme Park in Valdosta, Ga. announced three performances of its 2024 Wild Adventures LIVE! Concert Series lineup Monday, teasing a schedule packed with award-winning acts. Read More Wild Adventures Provides Free Lunch for Hurricane Relief Workers September 05, 2023 Wild Adventures Theme Park in Valdosta, Georgia is offering complimentary lunches to hurricane relief workers in an effort to express gratitude for those who served the community in the wake of Hurricane Idalia. Read More Wild Adventures Named Top Theme Park in Georgia June 28, 2023 Wild Adventures Theme Park in Valdosta, Ga. has been named the top theme park attraction in Georgia in an annual ranking released by Tripadvisor, the world’s largest travel guidance platform. Read More Newsboys Perform During Celebrate America Festival June 22, 2023 Celebrated Christian band Newsboys will take the Wild Adventures LIVE! stage on Saturday, July 1 as the Celebrate America Festival continues at Wild Adventures Theme Park. Read More Military Free at Wild Adventures’ Celebrate America Festival June 13, 2023 Wild Adventures Theme Park is celebrating America’s Independence for two weeks by offering free admission for active and retired military, welcoming Christian rock band Newsboys, performances from the Harlem Globetrotters and a patriotic Fourth of July fireworks display during the Celebrate America Festival. Read More Miracle League to Race Ping Pong Balls at Wild Adventures June 07, 2023 Wild Adventures Theme Park is partnering with The Miracle League of Valdosta to support sports programs for children and adults with disabilities with the fourth annual Great Ping Pong Race. Read More Larry the Cable Guy Performs at Wild Adventures June 06, 2023 The Wild Adventures LIVE! concert series presented by Valdosta TKO Nissan continues Saturday, June 17 with Grammy-nominated comedian Larry the Cable Guy at the Wild Adventures LIVE! Amphitheater. Read More Sweet Summer Nights Kick Off Summer of Fun at Wild Adventures May 30, 2023 Wild Adventures Theme Park and Splash Island Waterpark in Valdosta, Georgia are kicking off the summer by opening seven days a week, hosting big name concerts and staying open late on Fridays for the second year of Sweet Summer Nights. Read More Rock and Roll Icons REO Speedwagon Take the Stage at Wild Adventures May 30, 2023 The Wild Adventures LIVE! concert series presented by Valdosta TKO Nissan continues Saturday, June 10 with iconic rockers REO Speedwagon at the Wild Adventures LIVE! Amphitheater. Read More Wild Adventures Welcomes Country Sensation Lee Brice May 02, 2023 The Wild Adventures LIVE! concert series presented by Valdosta TKO Nissan continues Saturday, May 13 as country music star Lee Brice takes the stage at the Wild Adventures LIVE! Amphitheater. Read More MercyMe Performs at Wild Adventures LIVE! Amphitheater April 25, 2023 Contemporary Christian music band and Grammy nominee MercyMe will take the Wild Adventures LIVE! Amphitheater stage on May 6. The group got its start in Texas in 1994 and has since released 48 multi-format number one hits, including four mainstream radio hits. Read More Wild Adventures Hosts Grammy Award-Winning Artist T.I. April 18, 2023 Georgia-native artist, actor, entrepreneur and activist T.I. is known for his many contributions in entertainment including releasing 10 hit albums, starring in blockbuster movies, and receiving multiple Grammy, Billboard, BET and American Music Awards. Read More “Healthcare Heroes” Free This Weekend at Wild Adventures March 21, 2023 Wild Adventures Theme Park in Valdosta, Ga. is offering free admission for all healthcare workers and first responders March 24-26. Read More Wild Adventures Begins Season With Multi-Million Dollar Expansions March 14, 2023 On Tuesday, Wild Adventures Theme Park in Valdosta, Ga. officially opened its latest addition and announced even more projects as part of the park’s multi-million dollar expansions in 2023. Read More Wild Adventures Seeking 500 New Hires for 2023 Season January 31, 2023 Wild Adventures Theme Park in Valdosta, Ga. will open for its 2023 Season in March, and the park is hosting hiring events and offering unique benefits to fill hundreds of open positions. Read More Wild Adventures Theme Park Hosts Fireworks Spectacular For Santa’s Send-Off December 15, 2022 Guests can enjoy a special fireworks display on December 23 Read More Wild Adventures Accepts Toy Donations for Half Off Admission November 21, 2022 South Georgia Park Collects Donations for Toys for Tots Read More Wild Adventures Christmas Begins  With Free Admission, New Additions & More Days November 18, 2022 Families Impacted by Storms, First Responders and More Free Opening Weekend Read More Wild Adventures Offers Free Admission to Hurricane Ian Evacuees September 28, 2022 Residents of Counties Under Evacuation Orders Can Visit This Weekend Read More Wild Adventures Announces 3-Acre Addition for 2023 September 12, 2022 Expansion Features New Attractions, Four New Animal Encounters, New Dining Experience and More Read More Jeff Foxworthy Returns to Wild Adventures This Saturday July 11, 2022 Wild Adventures Theme Park hosts one of the most recognizable American comedians for a night of laughs. Jeff Foxworthy performs at the park on Saturday, July 16 at 8 p.m. as part of the 2022 All-Star Concert Series. Read More Pop Culture Legends Perform Saturday at Wild Adventures June 16, 2022 Wild Adventures Theme Park hosts its annual Season Passholder Appreciation Concert with pop culture legends Three Dog Night as part of the 2022 All-Star Concert Series, presented by Valdosta TKO Nissan. Read More Wild Adventures Unveils Armed Services Honor Garden May 23, 2022 Wild Adventures Theme Park in Valdosta, Ga. hosted a ceremony recognizing all branches of the armed services to unveil an updated area of the park paying them tribute and to invite all active and retired military to receive free admission over the Memorial Day Weekend. Read More Teachers Free This Weekend at Wild Adventures May 17, 2022 Wild Adventures Theme Park in Valdosta, Ga. is offering free admission for teachers and all school employees during its Educator Appreciation Weekend this Saturday and Sunday. Read More Wild Adventures Hosts Country Superstar Gabby Barrett April 21, 2022 Wild Adventures Theme Park in Valdosta, Ga. will kick off the 2022 All-Star Concert Series on April 30 with country superstar and \"American Idol\" finalist Gabby Barrett. Read More Splash Island Waterpark Opens Saturday March 30, 2022 Wild Adventures Theme Park in Valdosta, Ga. will open Splash Island Waterpark for the 2022 Season on Saturday, featuring new entertainment and special summertime events. Read More Wild Adventures Kicks Off 2022 Season With New Event March 16, 2022 Wild Adventures Theme Park in Valdosta, Ga. will begin its 2022 Season this Saturday with a little “luck of the Irish'' and new attractions, including a large animal habitat and a new venue featuring weekly live music and locally brewed beer. Read More Wild Adventures’ Employees to Receive 100% Free Tuition February 09, 2022 Herschend Enterprises, Wild Adventure Theme Park’s parent company and the nation’s largest privately-owned themed attractions corporation, has announced it will cover 100 percent of tuition, fees and books for all 11,000 employees who choose to pursue further education. Read More Wild Adventures Seeking 500 New Hires for 2022 Season January 25, 2022 Wild Adventures Theme Park in Valdosta, Georgia is gearing up for an exciting season with events throughout February to hire more than 500 new team members. Read More New Glimmering Light Trail Illuminates Wild Adventures December 03, 2021 Wild Adventures Theme Park in Valdosta, Georgia, will kick off Christmas celebrations this Saturday with over one million lights, a five-story animated Christmas tree, festive food, Santa visits, and new light displays, including the Glimmering Light Trail. Read More Wild Adventures Announces New Additions for 2022 November 12, 2021 Wild Adventures Theme Park has announced additions that will be unveiled in 2022, including a new restaurant and live music venue, a partnership with Georgia Beer Company, new and expanded festivals, new nighttime events, a new animal attraction and more. Read More Wild Adventures Announces Leadership Changes October 06, 2021 Herschend Enterprises, parent company of Wild Adventures Theme Park in Valdosta, Ga,. announced today that the park’s Vice President and General Manager, Molly Deese, has been named the Executive Director and Vice President of Adventure Aquarium in Camden, New Jersey, and Jon Vigue has been promoted to the position of General Manager and Vice President of the park. Read More Media Statement on the Passing of Shirley the Elephant February 03, 2021 Tuesday morning, Shirley, a female Asian elephant living her retirement at Wild Adventures, passed away at the age of 78. Read More Get The Latest News and Special Offers Subscribe to our newsletter, special offers and promotional emails. Park Information Parking Maps Concerts Groups Allergen Guides Park Policies Media Room Blog Partners Now Hiring Jobs Great Pay Company Vision Employee Stories Employment Questions Great Benefits Help & Support Contact Us FAQs Accessibility Find Us Driving Directions Google Maps 3766 Old Clyattville Road Valdosta, GA 31601 Connect With Us Official Sponsors Manage My Cookie Preferences Do Not Sell My Information © 2025 All Rights Reserved Terms of Use Terms of Sale Privacy Policy"
    },
    {
      "url": "https://www.riverwild.com/contact/",
      "text": "Contact Us - Wild River Adventures Skip to content Buy Trip Photos info@riverwild.com 406-387-9453 Facebook Instagram Rafting Trips Close Rafting Trips Open Rafting Trips Whitewater Rafting Run some of the best rapids in the Glacier National Park Scenic Float Trip A fun and relaxing way to experience the beauty of Montana Evening Dinner Raft Combine our Half Day Whitewater Adventure with a tasty riverside barbecue dinner Wild Side Sport Rafting Offering experienced rafters extra thrills in our high performance rafts Kayaking Trips In an Inflatable Kayak, every rapid is a fun challenge! View All Overnight Trips Close Overnight Trips Open Overnight Trips Middle Fork Overnight Experience thrilling whitewater and stunning Glacier views on a Middle Fork overnight adventure! North Fork Overnight Enjoy a guided North Fork rafting adventure with stunning views, wildlife, and riverside camping—perfect for all! View All Fly Fishing Close Fly Fishing Open Fly Fishing Guided Half & Full Day Trips Discover a Montana fly fishing trip you won’t soon forget Day School Offers a hands-on introduction to fly fishing on the Middle Fork Multi-Day Trips For anglers seeking a deeper connection to the Flathead River Park-N-Paddle Planning Close Planning Open Planning Explore Glacier Np Area Info Flathead River Info Directions Faqs About Close About Open About About Wild River Adventures Employment Info Gift Certificates Contact Us Book Now CONTACT US We’re here to help you with any questions or concerns you may have about our tours, services, or anything else. Whether you’re looking to book an adventure, need assistance with your itinerary, or just want to learn more about what we offer, don’t hesitate to reach out. Our friendly and knowledgeable team is ready to assist you. info@riverwild.com 406-387-9453 Contact us Name: (Required) First Last Email: (Required) Message: (Required) Have a question for us? Ask away. OUR LOCATION Our Address: 11900 US-2 West Glacier, MT 59936 Our office is located on Highway 2 East, in West Glacier, MT, and one mile west of the junction to the west entrance of Glacier National Park. We are next door to Kruger Helicopter Tours to the East and the Rawhide Trading Post to the West. Watch for our log office building which has our name, Wild River, on the roof. info@riverwild.com 406-387-9453 GET DIRECTIONS DON’T WAIT TO BOOK YOUR TRIP TODAY Secure your spot for an adventure of a lifetime and create memories you’ll cherish forever. Book Now Address: 11900 US-2 West Glacier, MT 59936 info@riverwild.com 406-387-9453 Facebook Instagram Rafting Trips Overnight Trips Fishing Trips Park-N-Paddle Trip Planning About Us Buy Trip Photos Hours & Info (Memorial Day Weekend-Mid September) 8am-8pm Mountain Standard Time 7 days a week (October 1-May 1) 9am-5pm Mountain Standard Time Mon-Saturday © 2025 Wild River Adventures | All Rights Reserved. Made by TOMIS call FAQs trips BOOK"
    },
    {
      "url": "https://www.adventurebooks.com/",
      "text": "Adventure Books by Vertebrate Publishing - your adventures start here FREE SHIPPING ON ALL UK ORDERS! Menu Climbing Bouldering Mountaineering Training Guidebooks Non-fiction Stories Cycling Mountain Biking Gravel Biking Bikepacking Road Biking Family & Leisure Guidebooks Non-fiction Stories Walking Guidebooks Day Walks Big Trails Tips & Skills Non-fiction Stories Running Trail Running Training Guidebooks Non-fiction Stories Swimming Guidebooks Travel & Adventure Photography Guidebooks Travel writing Wildlife Nature Writing Photography Sandstone Press Children's Special offers About Us News & Blog Contact +44 (0) 114 267 9277 Login GBP USD CAD AUD GBP EUR JPY 0 FREE SHIPPING ON ALL UK ORDERS! +44 (0) 114 267 9277 About Us News & Blog Contact Currency GBP USD CAD AUD GBP EUR JPY Login 0 Your Cart is Empty Continue Shopping £0.00 Subtotal Tax included and shipping calculated at checkout Go to cart Climbing Bouldering Mountaineering Training Guidebooks Non-fiction Stories Cycling Mountain Biking Gravel Biking Bikepacking Road Biking Family & Leisure Guidebooks Non-fiction Stories Walking Guidebooks Day Walks Big Trails Tips & Skills Non-fiction Stories Running Trail Running Training Guidebooks Non-fiction Stories Swimming Guidebooks Travel & Adventure Photography Guidebooks Travel writing Wildlife Nature Writing Photography Sandstone Press Children's Special offers Shop Meet our lovely team! Meet our lovely team! Limited edition signed and numbered hardbacks ADVENTURES ON THE WATER The power of paddleboarding to change lives PRE-ORDER CLIMBING CYCLING WALKING RUNNING SWIMMING TRAVEL ADVENTURE WILDLIFE Our latest books PRE-ORDER Everest the Hard Way (50th anniversary edition) £25.00 PRE-ORDER Extreme Rock from £45.00 Mountain Walks Scafell Pike £14.95 Gravel Rides South West England £25.00 Gravel Rides Cairngorms & Perthshire £15.95 NEW TITLE Peak Bagging Munros Volume 1 £27.95 LIMITED EDITION SIGNED And So I Run from £14.95 Fontainebleau Climbs £25.00 PRE-ORDER Peak Bagging Peak District £22.00 PRE-ORDER Adventures on the Water from £14.95 PRE-ORDER Eat to Climb £25.00 Forged by Speed by Steve Peat In a little over two and a half minutes on 6 September 2009 Steve Peat cemented his place in mountain biking history, becoming downhill world champion at the seventeenth time of asking and by a winning margin of just five hundredths of a second. In Forged by Speed , Steve shares his incredible story, from the Steel City to the top step of the world championship podium. Honest, compelling and funny, it is the autobiography of a British sporting legend. ORDER NOW Guidebooks with GPX files Great British Gravel Rides £25.00 Gravel Rides Scotland £25.00 Gravel Rides South West England £25.00 Gravel Rides Cairngorms & Perthshire £15.95 Gravel Rides Peak District £15.95 Gravel Rides Lake District £15.95 Bikepacking England £20.00 Bikepacking Scotland £20.00 Bikepacking Wales £20.00 Britain's Best Bike Ride £20.00 Great British Bike Rides £25.00 2023 EDITION North York Moors Mountain Biking £16.95 Pennine Bridleway £15.95 NEW TITLE Peak Bagging Munros Volume 1 £27.95 Peak Bagging: Wainwrights £22.00 Walk Britain £20.00 Mountain Walks Ben Nevis £14.95 NEW TITLE Mountain Walks Helvellyn £14.95 Mountain Walks Scafell Pike £14.95 Mountain Walks Yr Wyddfa/Snowdon £14.95 Mountain Walks Yorkshire Three Peaks £14.95 Mountain Walks Kinder Scout £14.95 Tour du Mont Blanc £16.95 Tour du Mont Blanc £14.95 West Highland Way £14.95 Hadrian's Wall Path £14.95 South Downs Way £14.95 Running Adventures Scotland £20.00 PRE-ORDER Peak Bagging Peak District £22.00 The Climbing Bible Managing Injuries The Climbing Bible: Managing Injuries by Stian Christophersen is the indispensable guide to injury prevention and rehabilitation for climbers. It describes the most common climbing injuries that the author frequently encounters in his clinical practice, and examines how they can be diagnosed and treated – and even prevented from occurring in the first place. It is split into three sections: How to manage acute soft tissue injuries and overuse injuries. Detailed management, rehab and prevention information for common climbing injuries. An overview of pain science – what is pain, really? FIND OUT MORE Boardman Tasker Prize winners BOARDMAN TASKER AWARD WINNER Art of Freedom £14.95 BOARDMAN TASKER AWARD WINNER Cold Wars £12.99 BOARDMAN TASKER AWARD WINNER Deep Play £12.99 BOARDMAN TASKER AWARD WINNER Freedom Climbers £12.99 AWARD WINNER High Risk £14.95 Ron Fawcett – Rock Athlete £9.00 £12.99 We'd love to keep in touch! Sign up to be the first to find out about pre-order and special edition offers, author events, freebies, and receive 10% off your order ... Write to us: Adventure Books by Vertebrate Publishing Omega Court 352 Cemetery Road Sheffield S11 8FT United Kingdom Give us a call: +44 (0) 114 267 9277 Email: info@adventurebooks.com Books Climbing Cycling Walking Running Swimming Travel & Adventure Wildlife Sandstone Press Children's Special offers Info Contact Us Awards History The Team Trade Information Gift Cards Delivery & Returns Refund policy Submissions Terms of Service Terms & Conditions Privacy Policy Mobile Terms of Service © 2025 Adventure Books by Vertebrate Publishing . Site Design: Noovo Creative Search"
    },
    {
      "url": "https://www.wildadventures.com/accessibility/",
      "text": "Accessibility At Wild Adventures Theme Park Park Hours Sign In | Register Accessibility Search Theme Park Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Events Special Events Events Special Events Special Events Splash Island Waterpark Splash Island Returns in 2026! Explore Slides Campground Campground Information Map FAQs Activities Campground Information Map FAQs Activities Book Now Campground Activities Calendar Season Passholder Campground Discounts Plan Your Visit Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Park Information Mobile App Blog Policies FAQs Park Information Mobile App Blog Policies FAQs Campground Now Open! Special Events Tickets & Passes Buy Tickets General Admission Special Offers Military Stay & Play Buy Tickets General Admission Special Offers Military Stay & Play Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends 2026 Season Passes Now Available! Get your FREE Pre K Pass Buy Tickets Theme Park Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Events Special Events Events Special Events Special Events Splash Island Waterpark Splash Island Returns in 2026! Explore Slides Campground Campground Information Map FAQs Activities Campground Information Map FAQs Activities Book Now Campground Activities Calendar Season Passholder Campground Discounts Plan Your Visit Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Park Information Mobile App Blog Policies FAQs Park Information Mobile App Blog Policies FAQs Campground Now Open! Special Events Tickets & Passes Buy Tickets General Admission Special Offers Military Stay & Play Buy Tickets General Admission Special Offers Military Stay & Play Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends 2026 Season Passes Now Available! Get your FREE Pre K Pass Buy Tickets Welcome to Wild Adventures’ Accessibility Center At Wild Adventures Theme Park and Splash Island Water Park®, we strive to provide an inclusive experience for all guests and hosts, regardless of their abilities. The following web pages include downloadable accessibility guides and information on our physical, visual, hearing, cognitive, and dietary accessibility offerings, services, and supports at Wild Adventures. Download The Wild Adventures Theme Park Accessibility Guide Quick Links Planning Ahead As You Arrive During Your Visit Contact a Wild Adventures Accessibility Liaison Download The Official Wild Adventures Mobile App Quick Links Planning Ahead As You Arrive During Your Visit Contact a Wild Adventures Accessibility Liaison Download The Official Wild Adventures Mobile App Planning Ahead What to Know Before You Go Wheelchairs & ECVs Wheelchairs and Electric Convenience Vehicles (ECVs) are available for rent daily on a first-come, first-served basis. They may be rented and returned at the Expedition Market store located inside the park across from the turnstiles. Wheelchairs are $20 per day, and ECVs with sunshades are $75 per day. A security deposit and operator training are required for ECVs. Prices are subject to change without notice. Only one Guest per ECV or wheelchair. No passenger carriers and/or trailers of any type may be attached to ECVs. Guests must be 16 or older to rent an ECV in the Park. The Guest using the ECV must rent the ECV. Please note: All Guests using wheelchairs and ECVs, whether personal or rented at Wild Adventures, must follow all manufacturer’s operating guidelines and Park rules. Park rules are available at the Expedition Market store for Guests bringing their own wheelchairs or ECVs. Wild Adventures also reserves the right to deny entry to any ECV or wheelchair deemed unsafe for use on Park near other Guests. If walking or standing presents physical challenges, we strongly recommend the use of a wheelchair or ECV to navigate Wild Adventures. Please remember that the distance between various Park buildings and attractions is much greater than any wait in line. A pool lift chair is available for entrance into Paradise River. To use this chair, visit the First Aid Center in Splash Island Waterpark. Wheelchairs are allowed to enter the water up to seat depth at Catch-A-Wave Bay and Polynesian Adventure. A complete guide to Wheelchairs and ECVs at Wild Adventures can be found in our Accessibility Guide . Service Animals Service animals are welcome in most locations throughout Wild Adventures. Animals must be in the owner’s control and under control at all times Service animals must be on a harness or leash no longer than four feet. Owners are responsible for cleaning and disposing of any animal waste Service animals are not allowed on rides or attractions. If you wish to ride, we suggest a companion visit the Park with you to care for your service animal. Service animals must not be left unattended or with Wild Adventures Team Members. Service animals are allowed on trams as long as they meet the guidelines outlined in the Service Animals section of our Accessibility Guide . Due to live animals used in some shows, we ask that any service animal remain out of view so as not to distract animals and for the safety of our staff. Wild Adventures reserves the right to deny access to a service animal when safety is in question. No service animals are allowed during the Tiger Tales show. Requests for Interpretation Sign Language interpretation can be requested for special events and shows with a minimum of 14 days advance notice. To request performance schedule confirmation or to request Sign Language interpretation at a specific special event or show, please contact Guest Services at 229-219-7080 or the Accessibility Liaison for assistance. Guests will be contacted prior to their visit to verify arrangements, and they will receive an appropriate show schedule that lists the dates and times of the interpreted performances. Planning Ahead Resources: Park Map | Ride Accessibility Guide | Hours & Calendar | Driving Directions | Places to Stay | Accessibility Liaison | Ride Requirements As You Arrive ADA Accessible Parking The main parking area and van-accessible spaces for guests with disabilities are located in the accessible parking area adjacent to the Park entrance. Upon arrival at Wild Adventures, please advise the Toll Booth Team Members that you need accessible parking, and they will direct you to the accessible lot or the Guest Drop-Off & Pickup Area. Accessible parking is filled on a first-come, first-served basis and may reach capacity early on some days. If the accessible parking area is unavailable, the Guest Drop-Off & Pickup Area adjacent to the Park entrance may be utilized for ease of dropping off and picking up Guests with disabilities. Standard vehicle and RV parking fees apply unless the Guest is a Gold Season Passholder. All vehicles parked in a marked accessible parking space must have a government-issued license plate or displayed accessible parking tag. Without proper permits, violators may be subject to fines issued by the Lowndes County Sheriff’s Department and/or towing of the vehicle at the owner’s expense. For more information, including our security screening process, please contact our Accessibility Liaison. Start Your Visit at The Accessibility Center Our front-line hosts are trained to provide all guests with an inclusive experience while visiting Wild Adventures Theme Park. However, we encourage those with special needs to visit the on-property Accessibility Center at the start of their visit. This center is conveniently located at Guest Services, right at the park's entrance. Accessibility Center hosts can provide detailed information to help direct you to the rides and activities in which you can participate safely. Information you can access at the Center includes rider requirements, locations of accessibility entrances, wheelchair and ECV Rentals, and information on service animals. Accessibility Center team members can conduct additional screening for specific rides and provide a Ride Access Card, which may be required for access to certain attractions. The Accessibility Center team can also provide screening for a Ride Access Sheet, which is provided to individuals who are unable to wait in a queue line for a ride. The sheet allows the guest and up to six people in their party, to enter rides using the Exit Lines. During Your Visit Please review the below sections for information on accessibility services available during your visit. Physical Accessibility & Assistive Devices Accessibility Entrances Guests using wheelchairs or ECVs or those with other disabilities may use the marked accessible entrances to gain access to the ride or attraction. A ride admission sheet is required to access rides or attractions through the exit. Center located inside Guest Services . These entrances are designed to provide access to the ride, not to expedite wait times. You may have to wait once reaching the loading area. If you need assistance transferring from your ECV or wheelchair, you must visit the Park with a companion. Our Team Members may provide information or answer questions; however, they are not trained to assist you in transferring to and from a ride vehicle and will not be able to do so. A pool lift chair is available for entrance into Paradise River. To use this chair, visit the First Aid Center in Splash Island Waterpark. Wheelchairs are allowed to enter the water up to seat depth at Catch-A-Wave Bay and Polynesian Adventure. Wild Adventures shops and restaurants are all accessible. Please ask any Team Member if you need assistance reaching items or have special dietary needs. For our Guests’ convenience, we also offer accessible, companion-assist restrooms at Wild Adventures and Splash Island. For more information, please review our Accessibility Guide or contact our Accessibility Liaison . Supervising Companion Each of our ride and attraction experiences is uniquely different. Ride admission requirements are determined by the ride dynamics, the ride restraints, and manufacturer recommendations. Ride requirements, such as height, weight, and supervising companion procedures, apply to certain rides and attractions. A Supervising Companion is a responsible person who is at least 14 years of age and who meets all the rider requirements to ride alone. More information about our supervising companion policy and specific requirements for each ride and/or attraction can be found in the Accessibility Guide . Mobility Devices, Segways @ Golf Carts See the Wheelchairs and ECVs section of this webpage or the full Accessibility Guide for details. Prostheses & Restrictive Devices Guests with amputations or prosthetic devices may require additional screening for riding requirements. A ride access card can be issued once additional screening is complete to allow access to rides or attractions through the entrance. Ride access cards can be issued at Guest Services, First More information about ride requirements about each ride can be found in the Accessibility Guide . Oxygen Tanks and Medical Devices Due to the forces, speeds, and movements of our rides, oxygen tanks are not permitted on ride vehicles or boats. Oxygen tanks are allowed on the Safari Train and trams. Theater Seating For the convenience of Guests using wheelchairs or ECVs, early entry is available before doors open for general seating. Doors open at least 15 minutes prior to showtimes. The theater is equipped to provide one (1) companion seat at every wheelchair/ECV space.  Due to the layout and capacity of each theater, larger groups accompanying a Guest in a wheelchair or ECV may have to separate.  Ushers are available to assist with wheelchair/ECV parking and seating.  For additional assistance, please speak with a Theater Usher or Team Member. Due to Georgia State Fire Codes, Guests using ECVs or wheelchairs may not park in any theater aisle or row. Seating is limited in all theaters and is filled on a first-come, first-serve basis. All outdoor theaters are accessible to Guests with disabilities. All safety guidelines and fire codes for indoor theaters also apply to outdoor venues. If you have any questions, please notify a sound technician in the back of the theater or any other Team Member. Sensory Sensitive Calming Space Wild Adventures is in the process of constructing a Quiet Room that will be available to guests when the park opens in March 2025. Sensory-Sensitive Days & Events Periodically throughout the Season, Wild Adventures will host special Sensory-Sensitive Days in which efforts are made to reduce the volume of music and other noises in select areas throughout the park. Service Animals See the Service Animal section of this webpage or the full Accessibility Guide for details. Hearing/Vision Impairment Park Navigation Due to the nature and layout of our Park, Wild Adventures recommends that anyone legally blind or who has vision impairments enjoy the Park with a companion. Please review the companion section of this webpage or the full Accessibility Guide for more information. Interpretation Sign Language interpretation can be requested for special events and shows with a minimum of 14 days advance notice. To request performance schedule confirmation or to request Sign Language interpretation at a specific special event or show, please call Guest Services at 229-219-7080 or contact the accessibility liaison for assistance. Guests will be contacted prior to their visit to verify arrangements, and they will receive an appropriate show schedule that lists the dates and times of the interpreted performances. Transcripts Wild Adventures regular season show scripts are available for use during the show and must be returned at the end of the performance. Please see a Theater Usher for assistance. Scripts are also available on the Safari Train. Dietary Restrictions Aside from baby food, no outside food, drink, or large coolers may be brought into the park. Restaurants and concessions are available throughout the park with a variety of food and beverage options. We understand that our guests may have special dietary needs based on health or religion, and we provide picnic tables in the parking lot area to accommodate those who wish to bring and enjoy their own meals. Visit our dining page or download our official mobile app for a full list of food offerings and our allergen guide. Ride Requirements & Warnings Ride Signage Ride warning and accessibility signs are located at the entrance of each ride to help determine which attractions are suitable for guests based on their abilities. A key for access signage and symbols and information on accessibility for every ride at Wild Adventures can be found in the Accessibility Guide . Medical Restrictions All Ride Safety Information is posted at each ride entrance so that you may make informed decisions about your ability to participate safely. This brochure describes the ride’s movements and forces, while the ride safety signs include medical restrictions and special safety instructions. Remember: Wild Adventures does not know your medical history or restrictions. Please review all safety information prior to boarding. Please be aware of all medical and height restrictions. We also encourage you to watch the ride or attraction prior to choosing to ride. If in doubt, do not ride. Ride Restraints Guests must fit properly into all ride restraint systems to participate. All rides and attractions Some ride restraint systems may not accommodate Guests of larger weight and/or greater height. For the safety of all guests, those wearing casts, braces, or prostheses may be unable to ride if the restraint cannot be properly secured. Please review our Accessibility Guide for further information on ride and attraction requirements, including the loose articles and lost items policies. The physical requirements of all rides can also be accessed via the Rides & Attractions page , the official Mobile App , the on-property accessibility center, or by contacting a Wild Adventures Accessibility Liaison . A pool lift chair is available for entrance into Paradise River. To use this chair, visit the First Aid Center in Splash Island Waterpark. Wheelchairs are allowed to enter the water up to seat depth at Catch-A-Wave Bay and Polynesian Adventure. Download Our App To make the most of your visit, we encourage all guests to download our official App. The app offers easy ticket and pass management, custom lists for planned activities, convenient access to interactive maps and wayfinding, ride wait times and show schedules, and filter options to find the perfect attractions for every family member. Additional Questions? If you have additional questions about accessibility at Wild Adventures after reviewing the materials, we’re here to help. Request Information Get The Latest News and Special Offers Subscribe to our newsletter, special offers and promotional emails. Park Information Parking Maps Concerts Groups Allergen Guides Park Policies Media Room Blog Partners Now Hiring Jobs Great Pay Company Vision Employee Stories Employment Questions Great Benefits Help & Support Contact Us FAQs Accessibility Find Us Driving Directions Google Maps 3766 Old Clyattville Road Valdosta, GA 31601 Connect With Us Official Sponsors Manage My Cookie Preferences Do Not Sell My Information © 2025 All Rights Reserved Terms of Use Terms of Sale Privacy Policy"
    },
    {
      "url": "https://getinthewild.com/contact-us/",
      "text": "Contact Us | Get In The Wild Adventures Skip to main content info@getinthewild.com 1 (818) 381-9453 Open Facebook account in a new tab. Open Twitter account in a new tab. Open Instagram account in a new tab. Open Youtube account in a new tab. Open Linkedin account in a new tab. Contact Us Blog Utah Trips Canyoneering Adventures Half-Day Goblin’s Lair Canyoneering Adventure Half-Day Occulus Canyon Tour Classic Slot Canyoneering Adventure 127 Hours Canyoneering Adventure in Utah Ultimate Challenge Canyoneering Adventure Capitol Reef National Park Canyoneering Adventure Hiking Adventures Half-Day Hiking Adventure Full-Day Hiking Adventure Full-Day and Half-Day Wild West & Outlaw Tour Photography Adventures Canyon Photography Workshop Sunrise/Sunset Photography Tour Yoga In The Wild Capitol Reef National Park Yoga and Hiking Retreat Yoga In The Wild Yoga Class at Goblin Valley State Park Multi-Day Adventures Best of Canyoneering Adventure Tour Multi Day Canyoneering Adventure Best of Bears Ears and Beyond Discovery Tour Canyoneering Basecamp Expeditions Hidden Treasures of Canyon Country Hiking Tour Capitol Reef National Park Yoga and Hiking Retreat Backpacking – Utah Washington Trips North Cascades Canyoneering Adventure Backpacking & Mountaineering in Washington Yoga In The Wild Courses Utah Courses Introduction to Canyoneering Technical Canyoneering/Canyon Leadership Pothole Escape Course Advanced Anchors and Rigging Canyoneering Course Backcountry Navigation Course Washington Courses Introduction to Swiftwater Canyoneering Advanced Swiftwater Canyoneering Alpine Canyoneering Glacier Climbing Services Shuttles Groups Film Production Services Team Building, Leadership & Corporate Off-Sites Gift Cards About About Get In The Wild Why Go Wild Meet Our Guides Where We Guide Utah Washington Blog Contact Us Book Now Contact Us Open Facebook account in a new tab. Open Twitter account in a new tab. Open Instagram account in a new tab. Open Youtube account in a new tab. Open Linkedin account in a new tab. Open mobile menu Utah Trips Canyoneering Adventures Half-Day Goblin’s Lair Canyoneering Adventure Half-Day Occulus Canyon Tour Classic Slot Canyoneering Adventure 127 Hours Canyoneering Adventure in Utah Ultimate Challenge Canyoneering Adventure Capitol Reef National Park Canyoneering Adventure Hiking Adventures Half-Day Hiking Adventure Full-Day Hiking Adventure Full-Day and Half-Day Wild West & Outlaw Tour Photography Adventures Canyon Photography Workshop Sunrise/Sunset Photography Tour Yoga In The Wild Capitol Reef National Park Yoga and Hiking Retreat Yoga In The Wild Yoga Class at Goblin Valley State Park Multi-Day Adventures Best of Canyoneering Adventure Tour Multi Day Canyoneering Adventure Best of Bears Ears and Beyond Discovery Tour Canyoneering Basecamp Expeditions Hidden Treasures of Canyon Country Hiking Tour Capitol Reef National Park Yoga and Hiking Retreat Backpacking – Utah Washington Trips North Cascades Canyoneering Adventure Backpacking & Mountaineering in Washington Yoga In The Wild Courses Utah Courses Introduction to Canyoneering Technical Canyoneering/Canyon Leadership Pothole Escape Course Advanced Anchors and Rigging Canyoneering Course Backcountry Navigation Course Washington Courses Introduction to Swiftwater Canyoneering Advanced Swiftwater Canyoneering Alpine Canyoneering Glacier Climbing Services Shuttles Groups Film Production Services Team Building, Leadership & Corporate Off-Sites Gift Cards About About Get In The Wild Why Go Wild Meet Our Guides Where We Guide Utah Washington Blog Contact Us Book Now Contact Us Get In The Wild If you have any questions or would like to organize a custom tour, we look forward to hearing from you. Please get in touch with us by using one of the options provided here. Utah Mailing Address PO Box 29 Hanksville, Utah 84734 Washington Mailing Address 13110 NE 177th Place, #342 Woodinville, Washington 98072 Phone: +1(818)381-9453 Email: info@getinthewild.com Name Phone Email Message CAPTCHA Submit Get In The Wild 175 HWY 24 Hanksville, Utah 84734 13110 NE 177th Place, #342 Woodinville, Washington 98072 info@getinthewild.com 1 (818) 381-9453 FAQ Travel Agents Contact Us Guest Resources Media Coverage Newsletter Sign-up Travel Insurance Employment Opportunities Sitemap Privacy Policy Terms & Conditions PUBLIC LAND PERMITS Get In The Wild Proudly  Supports America's Public Lands Open Facebook account in a new tab. Open Twitter account in a new tab. Open Instagram account in a new tab. Open Youtube account in a new tab. Open Linkedin account in a new tab. COPYRIGHT © 2025"
    },
    {
      "url": "https://www.share-it-forward.org/resources/wild-adventures/",
      "text": "Wild Adventures Resources Assistance Programs Programs Hardship Assistance Child Assistance Interest-Free Loans Emergency Needs Additional Resources Programs Hardship Assistance Child Assistance Interest-Free Loans Emergency Needs Additional Resources Hardship Assistance Child Assistance Interest-Free Loans Donate Make A Donation Donate Options Paycheck Donation Form Credit Card Donation Make A Donation Donate Options Paycheck Donation Form Credit Card Donation Donation Options Paycheck Donation Form Credit Card Donation About Us About Us Board of Directors Share It Forward Staff Team Members by Property About Us Board of Directors Share It Forward Staff Team Members by Property Board of Directors Share It Forward Staff Team Members by Property Contact Us Assistance Programs Programs Hardship Assistance Child Assistance Interest-Free Loans Emergency Needs Additional Resources Programs Hardship Assistance Child Assistance Interest-Free Loans Emergency Needs Additional Resources Hardship Assistance Child Assistance Interest-Free Loans Donate Make A Donation Donate Options Paycheck Donation Form Credit Card Donation Make A Donation Donate Options Paycheck Donation Form Credit Card Donation Donation Options Paycheck Donation Form Credit Card Donation About Us About Us Board of Directors Share It Forward Staff Team Members by Property About Us Board of Directors Share It Forward Staff Team Members by Property Board of Directors Share It Forward Staff Team Members by Property Contact Us Wild Adventure Region You can contact Marshall Reiser for information on additional support resources. Marshall Reiser, Human Resource Generalist & Team Member Advocate marshall.reiser@wildadventures.com 229-219-7133 SHARE IT FORWARD Our Mission - Bridging Life’s Gaps With Love. For Real. Our Vision - Thousands of families thriving in community, fully engaged in life together. Share It Forward is a 501(c)3 non-profit organization that provides support to Herschend employees during times of need. EIN 20-1582086 QUICK LINKS Assistance Programs Pledge Support About Us Contact Us Herschend Herschend owns, operates, and manages family-oriented theme parks and attractions across North America. © 2025 All Rights Reserved Terms of Use Privacy Policy"
    },
    {
      "url": "https://www.wildadventures.com/groups/general-groups/",
      "text": "Groups 15 Plus Park Hours Sign In | Register Accessibility Search Theme Park Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Events Special Events Events Special Events Special Events Splash Island Waterpark Splash Island Returns in 2026! Explore Slides Campground Campground Information Map FAQs Activities Campground Information Map FAQs Activities Book Now Campground Activities Calendar Season Passholder Campground Discounts Plan Your Visit Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Park Information Mobile App Blog Policies FAQs Park Information Mobile App Blog Policies FAQs Campground Now Open! Special Events Tickets & Passes Buy Tickets General Admission Special Offers Military Stay & Play Buy Tickets General Admission Special Offers Military Stay & Play Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends 2026 Season Passes Now Available! Get your FREE Pre K Pass Buy Tickets Theme Park Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Events Special Events Events Special Events Special Events Splash Island Waterpark Splash Island Returns in 2026! Explore Slides Campground Campground Information Map FAQs Activities Campground Information Map FAQs Activities Book Now Campground Activities Calendar Season Passholder Campground Discounts Plan Your Visit Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Park Information Mobile App Blog Policies FAQs Park Information Mobile App Blog Policies FAQs Campground Now Open! Special Events Tickets & Passes Buy Tickets General Admission Special Offers Military Stay & Play Buy Tickets General Admission Special Offers Military Stay & Play Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends 2026 Season Passes Now Available! Get your FREE Pre K Pass Buy Tickets Groups / Groups 15 Plus Groups 15+ Wild Adventures and Splash Island Waterpark are the perfect locations for your group outing! With over 35 family and thrill rides, over 100 native and exotic animal species, and one of the Top 30 Waterparks in Country, we offer unforgettable experiences that are fun for all ages. Group admission rates are available for all parties of 15 or more when a reservation is made 72 hours in advance. Wild Adventures 1-Day Group Admission Groups of 15-99 $42.99 Save $17 Per Ticket Call (229) 219-7080 All prices subject to tax. Must purchase at least 72 hours before visit. Wild Adventures 2-Day Group Admission Groups of 15-99 $48.99 Save $11 Per Ticket Call (229) 219-7080 All prices subject to tax. Must purchase at least 72 hours before visit. Book Online AMAZING ADD-ONS Save even more and take your group visit to the next level with prepaid meal vouchers, unlimited soda, private space rentals and more. Meal Vouchers **BEST VALUE FOR SMALL GROUPS** Give your group the flexibility of eating where they want while saving time and money. Each $11 Meal Voucher is redeemable for a meal and a 24 oz. drink. Choose from: Cheeseburger w/ fries Chicken Tenders w/ fries (2) Slices of Pizza Pulled Pork Sandwich w/fries Unlimited Drink Wristbands Keep your group hydrated with unlimited soda throughout the day. $8.99 + tax Souvenir Cups Enjoy unlimited soda all day with a fun and convenient Wild Adventures Souvenir Cup. $19.99 + tax All-You-Can-Eat Buffets For groups over 100, we offer delicious buffet options at 3 incredible venues. Learn More Cabana Rentals Reserve private spaces for your small group to hangout together in Splash Island Waterpark. Learn More Lakeside Lodge Rentals Our lodges are the perfect homebase for your small group's visit. Learn More Bonuses and Requirements Bonuses Get 1 FREE admission for every 15 paid admissions when you pay for your trip, in full, at least two weeks in advance of your visit. Applies only to church and school groups. Complimentary park admission for your group's bus driver, with proper ID. One per bus. Van drivers do not qualify. Requirements Please keep these requirements in mind when booking your group's visit: You must book your group's visit in advance of your trip to receive the advance purchase pricing. If not, walkup group rates will apply. If paying the day of your visit, please plan to arrive early and bring your payment to the Group Sales building. Payment must be made in one transaction. Please note, payments not made in advance may cause a delay on the day of your arrival. Georgia law states that each admission is taxable unless the transaction is specifically exempt. The state sales tax rate is 8% and subject to change under Georgia law. To qualify for tax exemption, you must provide a copy of your ST-5, and the total must be paid with an organizational check or organizational credit card only. Accepted payment types are debit card, credit card, cash, and organizational checks. No personal checks are accepted. Parking for cars, trucks, and vans is $18 each. Only bus drivers receive complimentary parking. Georgia State Law dictates that we can only accept tax exemptions from schools, churches and organizations inside the State of Georgia. To book your group trip, please email groups2@wildadventures.com . Book Your Group's Trip Now For more information about group outings at Wild Adventures Theme Park, complete the online form below and contact the Groups Sales Department at (229) 219-7080 . Group rates apply to groups of 15 or more paid admissions. 72 hour advance reservation is required to receive these rates. Any reservation made less than 48 hours in advance will receive the group walk-up rate. Group tickets must be paid for together to receive group pricing. No individual payments will be accepted. If you wish to have your group tickets mailed, a UPS Shipping fee of $15 will apply. Need overnight Accommodations? Consider one of our preferred hotels. This is not a reservation. Your booking is not confirmed until confirmation of reservation is sent via email. Wild Adventures General 15+ Group Interest Thank you for your interest in visiting Wild Adventures with your group. By completing this form, you provide us with the information to create your reservation. Your reservation will not be complete until we contact you via phone to confirm your trip and process your payment. Group/Company Name * Type of Group Company/Business Non Profit Organization School Club Church Boy Scouts Girl Scouts Family Tour Group Other First Name * Last Name * Primary Phone * Email * Address 1 * Address 2 City * State * AL AK AR AZ CA CO CT DC DE FL GA HI IA ID IL IN KS KY LA MA MD ME MI MN MO MS MT NC ND NE NH NJ NM NV NY OH OK OR PA RI SC SD TN TX UT VT VA WA WI WV WY Zip Code * Anticipated Date of Visit * Number Attendees (minimum of 15 guests) * Interested in purchasing a meal option? Souvenir Cup & Unlimited Sodas - $12.99/guest Unlimited Sodas Wristband - $8.99/guest Group Meal Voucher - $11.00 +tax/guest Catering Options for Groups 100+ Please add any additional information here: Would you like to receive special offers and updates by email from Wild Adventures No, thank you. Yes, please subscribe me. Please Confirm * emailpreference emaildate webform webformdate webformurl Group_Sales Get The Latest News and Special Offers Subscribe to our newsletter, special offers and promotional emails. Park Information Parking Maps Concerts Groups Allergen Guides Park Policies Media Room Blog Partners Now Hiring Jobs Great Pay Company Vision Employee Stories Employment Questions Great Benefits Help & Support Contact Us FAQs Accessibility Find Us Driving Directions Google Maps 3766 Old Clyattville Road Valdosta, GA 31601 Connect With Us Official Sponsors Manage My Cookie Preferences Do Not Sell My Information © 2025 All Rights Reserved Terms of Use Terms of Sale Privacy Policy"
    },
    {
      "url": "https://www.wildadventures.com/Media-Room",
      "text": "Media Room Park Hours Sign In | Register Accessibility Search Theme Park Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Events Special Events Events Special Events Special Events Splash Island Waterpark Splash Island Returns in 2026! Explore Slides Campground Campground Information Map FAQs Activities Campground Information Map FAQs Activities Book Now Campground Activities Calendar Season Passholder Campground Discounts Plan Your Visit Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Park Information Mobile App Blog Policies FAQs Park Information Mobile App Blog Policies FAQs Campground Now Open! Special Events Tickets & Passes Buy Tickets General Admission Special Offers Military Stay & Play Buy Tickets General Admission Special Offers Military Stay & Play Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends 2026 Season Passes Now Available! Get your FREE Pre K Pass Buy Tickets Theme Park Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Events Special Events Events Special Events Special Events Splash Island Waterpark Splash Island Returns in 2026! Explore Slides Campground Campground Information Map FAQs Activities Campground Information Map FAQs Activities Book Now Campground Activities Calendar Season Passholder Campground Discounts Plan Your Visit Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Park Information Mobile App Blog Policies FAQs Park Information Mobile App Blog Policies FAQs Campground Now Open! Special Events Tickets & Passes Buy Tickets General Admission Special Offers Military Stay & Play Buy Tickets General Admission Special Offers Military Stay & Play Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends 2026 Season Passes Now Available! Get your FREE Pre K Pass Buy Tickets Media LATEST NEWS New Water’s Edge Expansion Opens at Wild Adventures for 2025 Read More Thank you for your interest in Wild Adventures Theme Park! We are happy to share our news stories, photos and press releases. Please note that all images on our website and those provided for third-party use are copyrighted by us and permission must be granted for their use whether in print, broadcast or presentation media. Members of the news media are welcome to contact our Public Relations Office with any inquiries, especially those concerning promotional ticket requests and media partnerships: Asher Raymond Public Relations Specialist 3766 Old Clyattville Road Valdosta, GA 31601 Asher.Raymond@wildadventures.com Media Visits and Filming All members of the news media covering Wild Adventures must contact our Public Relations department to request interviews or filming access in advance. Members of the news media must be escorted by a Wild Adventures team member at all times while on assignment on the premises. Media Ticket Requests Working members of the news media may request up to four complimentary tickets per season to Wild Adventures. Please submit your requests in writing via email to Asher.Raymond@wildadventures.com two working days or more in advance of your visit. We cannot guarantee delivery of complimentary tickets requested less than two working days in advance. For Content Creators and Social Media Influencers who are interested in a collaboration, or are preparing to visit the park, fill out an application here . Your application will be reviewed in 3 to 5 business days. Photo and Video Requests To request high-resolution images and videos for media purposes, contact Asher.Raymond@wildadventures.com . Advertising Inquiries To inquire about advertising opportunities, please email Allied Global Marketing at WAadvertising@alliedglobalmarketing.com . In The News Great Pumpkin LumiNights Returns to Wild Adventures September 03, 2025 Family-Friendly Celebration Brings New Lights, Entertainment and Fall Flavors Read More Wild Adventures Offers Free Admission to First Responders and Teachers August 20, 2025 Guests’ Last Chance to Splash and Meet Dinosaurs for the 2025 Season Read More Wild Food Weekends Returns with “Tater Takeover” July 30, 2025 Fan-Favorite Event Returns with All-New Potato-Inspired Menu and Special Offers Read More Skillet to Take the Stage at Wild Adventures Theme Park July 23, 2025 Award-Winning Christian Rock Band Will Perform on August 2 Read More Drone Show Lights Up the Sky at Wild Adventures July 22, 2025 Weekend Event Includes Free Admission for Teachers Read More Wild Adventures Offers Free Admission to Teachers July 21, 2025 Weekend Event Includes Free Admission for Teachers Read More James \"Murr\" Murray to Perform at Wild Adventures Theme Park July 14, 2025 “Impractical Jokers” Comedian Take the Stage July 19 Read More Wild Adventures Promotes Water Safety With J.A.W.S. Program July 10, 2025 Weekend Programming Shows Children How to Enjoy the Water Safely Read More Doug E. Fresh and Rob Base to Perform at Wild Adventures Theme Park July 07, 2025 Hip-Hop Legends Take the Stage July 12 Read More Harlem Globetrotters Visit Community Ahead of Wild Adventures Performance June 27, 2025 Team Stops at Moody Air Force Base and Boys & Girls Club of Valdosta Read More Wild Adventures Joins Global Effort to Promote Water Safety June 27, 2025 World’s Largest Swim Lesson Part of Park’s Ongoing Commitment to Water Safety Read More Wild Adventures Named One of the Most Affordable Parks in the U.S. June 27, 2025 Annual Survey Highlights Value and Experience for Traveling Families Read More Celebrate America Fireworks Spectacular Coming to Wild Adventures June 25, 2025 Two Nights of Patriotic Lights Bedazzling the Park’s Skyline Read More Harlem Globetrotters Return to Wild Adventures June 27-29 June 23, 2025 Three Days of High Energy Shows During the Celebrate America Festival Read More Wild Adventures Celebrate America Event Returns June 17, 2025 Enjoy Fireworks and Free Military Admission, and See the Harlem Globetrotters Read More Ashley McBryde to Perform at Wild Adventures Theme Park June 12, 2025 Award-Winning Country Music Artist Takes the Stage June 21 Read More Wild Adventures Hosts World’s Largest Swim Lesson June 09, 2025 Park Partners with Local YMCA for June 26 Event Read More Zach Williams to Perform at Wild Adventures Theme Park June 05, 2025 Wild Adventures Theme Park in Valdosta, Ga., continues its 2025 Wild Adventures LIVE! Concert Series on Saturday, June 14, with a performance from GRAMMY® Award-winning Christian music artist Zach Williams. Read More Splash Island Nights Returns to Wild Adventures June 05, 2025 Friday Night Fun with Extended Hours, Live Entertainment, $25 Night Tickets, and New Summer Wild Card Offer Read More Big & Rich to Perform with Gretchen Wilson at Wild Adventures Theme Park May 29, 2025 Wild Adventures Theme Park will welcome country music icons Big & Rich and Gretchen Wilson to the stage on Saturday, June 7, as part of the 2025 Wild Adventures LIVE! Concert Series. Read More Wild Adventures Celebrates with Fireworks and Free Military Admission May 19, 2025 Wild Adventures Theme Park and Splash Island Waterpark will begin daily summer operations on Saturday, May 24, kicking off the season with a Memorial Day Weekend celebration packed with fireworks, live entertainment, special admission offers, and the chance to explore the park’s newest themed area. Read More Chris Tomlin to Perform at Wild Adventures May 15, 2025 One of the most influential worship leaders of our time, Chris Tomlin, will take the stage at Wild Adventures Theme Park in Valdosta, Ga., on Saturday, June 14, as part of the park’s 2025 Wild Adventures LIVE! concert series. Read More Wild Adventures Safari Campground Receives Perfect Score May 08, 2025 Wild Adventures Safari Campground has received a perfect 10/10★/10 rating from Good Sam, the nation’s most respected authority on campground excellence. The rating places the campground among fewer than 200 elite destinations across the country and one of only six in Georgia to achieve the distinction. Read More Sixth Annual Great Ping Pong Race Returns to Wild Adventures May 06, 2025 Wild Adventures Theme Park will once again host The Great Ping Pong Race, a high-energy charity event to benefit The Miracle League of Valdosta, on Saturday, May 10, at Splash Island Waterpark. Read More CeCe Winans to Perform at Wild Adventures Theme Park May 05, 2025 Wild Adventures Theme Park in Valdosta, Georgia, will welcome the most-awarded female gospel artist of all time, CeCe Winans, to the Wild Adventures LIVE! stage on Saturday, May 17. Read More 38 Special to Rock the Stage at Wild Adventures April 28, 2025 Wild Adventures Theme Park in Valdosta, Georgia, will turn up the volume on Saturday, May 10, as Southern rock legends 38 Special take the stage for an electrifying performance during the 2025 Wild Adventures LIVE! Concert Series. Read More Walker Hayes to Perform at Wild Adventures Theme Park April 23, 2025 Wild Adventures Theme Park in Valdosta, Georgia, continues its 2025 Wild Adventures LIVE! Concert Series on Saturday, May 3, with a performance from country music hitmaker Walker Hayes. Read More Wild Adventures Celebrates Waterpark Opening and Concert Season Kickoff March 25, 2025 Wild Adventures Theme Park in Valdosta, Georgia, kicks off Spring Break for local students with a weekend full of special events, the start of the Wild Adventures LIVE! Concert Series and the annual opening of Splash Island Waterpark. Read More New Water’s Edge Expansion Opens at Wild Adventures for 2025 March 11, 2025 Wild Adventures Theme Park in Valdosta, Georgia, launches its 2025 season on March 15 with exciting new rides, live entertainment and immersive experiences, offering unforgettable family adventures through December. Read More Wild Adventures Seeking 500 New Hires for 2025 Season March 06, 2025 Wild Adventures Theme Park in Valdosta, Ga. will open for its 2025 Season in March, and the park is hosting hiring events and offering unique benefits to fill hundreds of open positions.\n“When we open March 15, we will also be introducing Water’s Edge, a new expansion to Wild Adventures,” said Susan Pinkerton, director of administration. “We are hiring to fill the new positions created by Water’s Edge as well as hundreds of other positions throughout the park.” Read More Wild Adventures Announces 2025 Concerts and Event Lineup February 18, 2025 Wild Adventures Theme Park in Valdosta, Georgia, has announced its 2025 concert and special events schedule, featuring an exciting mix of new and returning artists, seasonal festivals, and exclusive events for season passholders. Read More Dinosaur Explore Roars Again at Wild Adventures in 2025 December 19, 2024 Live-sized dinosaurs are stomping their way back into Wild Adventures next Season when Dinosaur Explore returns for another year of immersive educational experiences. Read More Wild Adventures Offering Half Off Admission With Food Donation November 24, 2024 Wild Adventures Theme Park in Valdosta, Ga. is celebrating the opening of South Georgia’s largest holiday event, Wild Adventures Christmas Wild and Bright, by offering 50 percent off single-day admission with a food donation and free admission for military members, utility workers and more. Read More Wild Adventures Christmas Wild & Bright Holiday Menu Returns November 21, 2024 South Georgia’s largest Christmas celebration has returned to Wild Adventures Theme Park in Valdosta, Ga. along with a festive holiday menu and a unique way to try as many sweet and savory treats as possible. Read More Wild Adventures’ Invites Community to Support Greater Valdosta United Way November 12, 2024 This holiday season, Wild Adventures Theme Park is teaming up with Greater Valdosta United Way to raise funds for Impact Partner Nonprofits through the annual Christmas Tree Village with a new twist. Read More Wild Adventures Christmas Wild & Bright Returns November 05, 2024 South Georgia’s Biggest Christmas Event Features New Additions Read More Wild Adventures Announces Three Artists  for 2025 Concert Series October 28, 2024 Wild Adventures Theme Park in Valdosta, Ga. announced three performances of its 2025 Wild Adventures LIVE! Concert Series lineup, teasing a schedule packed with award-winning artists. Read More Wild Adventures Offers Free Admission to Kids 9 And Under October 22, 2024 Kids Can Play For Free on The Last Day of Great Pumpkin LumiNights Read More Chalk Artists Return To Create Fall Art This Weekend October 15, 2024 Wild Adventures Welcomes Professional Chalk Artists for Great Pumpkin LumiNights Read More Wild Adventures Offers Free Admission To Community Heroes October 08, 2024 First Responders and Power Line Workers to Receive Free Admission During Great Pumpkin LumiNights Read More Wild Adventures Hosts Valdosta’s First Drone Show October 07, 2024 300 Drones Will Celebrate the Resilience of South Georgia and Create Classic Fall Imagery in the Sky Read More Wild Adventures Reopens this Weekend October 03, 2024 South Georgia Theme Park Makes Donation to Second Harvest as Great Pumpkin LumiNights Returns Read More Master Pumpkin Carver Returns for Great Pumpkin LumiNights October 03, 2024 Wild Adventures Welcomes Back Jim Morey And His Live Carving Experience Read More Big New Additions Come to Great Pumpkin LumiNights at Wild Adventures September 19, 2024 Family-Friendly Celebration Returns with New Statues, Entertainment, Lights and More Read More Wild Adventures Announces New Rides and 2025 Expansion September 09, 2024 The New Water’s Edge Features Three New Rides, Eateries, Entertainment and More Read More Wild Adventures Offers Free Admission To Community Heroes August 19, 2024 Park Offers Free Admission for Military, First Responders, Healthcare Workers, Teachers and School Staff Read More Wild Adventures Offers Free Admission for Teachers July 23, 2024 Guests Can Donate School Supplies for Discount Admission Read More Wild Adventures Named One of the Most Affordable Parks in U.S. June 25, 2024 Wild Adventures Theme Park is proud to announce its recent accolade as the 4th most affordable park in the United States, according to HomeToGo’s 2024 U.S. Summer Travel Survey. Read More For King + Country to Perform at Wild Adventures June 20, 2024 Platinum-Selling Band Returns to South Georgia Theme Park July 20 Read More Colt Ford Concert Canceled; Wild Adventures Welcomes The LACS April 11, 2024 Georgia Country Rap Duo Performs April 20 at the Wild Adventures LIVE! Amphitheater Read More Wild Adventures Reveals Name, Breaks Ground on Campground December 12, 2023 Construction Is Officially Underway For One-Of-A-Kind Camping Experience Read More Life-Sized Dinosaurs Stomping Into Wild Adventures in 2024 November 03, 2023 Prehistoric creatures are making their way back to South Georgia as Dinosaur Explore debuts in the 2024 Season at Wild Adventures Theme Park. Read More Wild Adventures Announces Three 2024 Concerts October 23, 2023 Wild Adventures Theme Park in Valdosta, Ga. announced three performances of its 2024 Wild Adventures LIVE! Concert Series lineup Monday, teasing a schedule packed with award-winning acts. Read More Wild Adventures Provides Free Lunch for Hurricane Relief Workers September 05, 2023 Wild Adventures Theme Park in Valdosta, Georgia is offering complimentary lunches to hurricane relief workers in an effort to express gratitude for those who served the community in the wake of Hurricane Idalia. Read More Wild Adventures Named Top Theme Park in Georgia June 28, 2023 Wild Adventures Theme Park in Valdosta, Ga. has been named the top theme park attraction in Georgia in an annual ranking released by Tripadvisor, the world’s largest travel guidance platform. Read More Newsboys Perform During Celebrate America Festival June 22, 2023 Celebrated Christian band Newsboys will take the Wild Adventures LIVE! stage on Saturday, July 1 as the Celebrate America Festival continues at Wild Adventures Theme Park. Read More Military Free at Wild Adventures’ Celebrate America Festival June 13, 2023 Wild Adventures Theme Park is celebrating America’s Independence for two weeks by offering free admission for active and retired military, welcoming Christian rock band Newsboys, performances from the Harlem Globetrotters and a patriotic Fourth of July fireworks display during the Celebrate America Festival. Read More Miracle League to Race Ping Pong Balls at Wild Adventures June 07, 2023 Wild Adventures Theme Park is partnering with The Miracle League of Valdosta to support sports programs for children and adults with disabilities with the fourth annual Great Ping Pong Race. Read More Larry the Cable Guy Performs at Wild Adventures June 06, 2023 The Wild Adventures LIVE! concert series presented by Valdosta TKO Nissan continues Saturday, June 17 with Grammy-nominated comedian Larry the Cable Guy at the Wild Adventures LIVE! Amphitheater. Read More Sweet Summer Nights Kick Off Summer of Fun at Wild Adventures May 30, 2023 Wild Adventures Theme Park and Splash Island Waterpark in Valdosta, Georgia are kicking off the summer by opening seven days a week, hosting big name concerts and staying open late on Fridays for the second year of Sweet Summer Nights. Read More Rock and Roll Icons REO Speedwagon Take the Stage at Wild Adventures May 30, 2023 The Wild Adventures LIVE! concert series presented by Valdosta TKO Nissan continues Saturday, June 10 with iconic rockers REO Speedwagon at the Wild Adventures LIVE! Amphitheater. Read More Wild Adventures Welcomes Country Sensation Lee Brice May 02, 2023 The Wild Adventures LIVE! concert series presented by Valdosta TKO Nissan continues Saturday, May 13 as country music star Lee Brice takes the stage at the Wild Adventures LIVE! Amphitheater. Read More MercyMe Performs at Wild Adventures LIVE! Amphitheater April 25, 2023 Contemporary Christian music band and Grammy nominee MercyMe will take the Wild Adventures LIVE! Amphitheater stage on May 6. The group got its start in Texas in 1994 and has since released 48 multi-format number one hits, including four mainstream radio hits. Read More Wild Adventures Hosts Grammy Award-Winning Artist T.I. April 18, 2023 Georgia-native artist, actor, entrepreneur and activist T.I. is known for his many contributions in entertainment including releasing 10 hit albums, starring in blockbuster movies, and receiving multiple Grammy, Billboard, BET and American Music Awards. Read More “Healthcare Heroes” Free This Weekend at Wild Adventures March 21, 2023 Wild Adventures Theme Park in Valdosta, Ga. is offering free admission for all healthcare workers and first responders March 24-26. Read More Wild Adventures Begins Season With Multi-Million Dollar Expansions March 14, 2023 On Tuesday, Wild Adventures Theme Park in Valdosta, Ga. officially opened its latest addition and announced even more projects as part of the park’s multi-million dollar expansions in 2023. Read More Wild Adventures Seeking 500 New Hires for 2023 Season January 31, 2023 Wild Adventures Theme Park in Valdosta, Ga. will open for its 2023 Season in March, and the park is hosting hiring events and offering unique benefits to fill hundreds of open positions. Read More Wild Adventures Theme Park Hosts Fireworks Spectacular For Santa’s Send-Off December 15, 2022 Guests can enjoy a special fireworks display on December 23 Read More Wild Adventures Accepts Toy Donations for Half Off Admission November 21, 2022 South Georgia Park Collects Donations for Toys for Tots Read More Wild Adventures Christmas Begins  With Free Admission, New Additions & More Days November 18, 2022 Families Impacted by Storms, First Responders and More Free Opening Weekend Read More Wild Adventures Offers Free Admission to Hurricane Ian Evacuees September 28, 2022 Residents of Counties Under Evacuation Orders Can Visit This Weekend Read More Wild Adventures Announces 3-Acre Addition for 2023 September 12, 2022 Expansion Features New Attractions, Four New Animal Encounters, New Dining Experience and More Read More Jeff Foxworthy Returns to Wild Adventures This Saturday July 11, 2022 Wild Adventures Theme Park hosts one of the most recognizable American comedians for a night of laughs. Jeff Foxworthy performs at the park on Saturday, July 16 at 8 p.m. as part of the 2022 All-Star Concert Series. Read More Pop Culture Legends Perform Saturday at Wild Adventures June 16, 2022 Wild Adventures Theme Park hosts its annual Season Passholder Appreciation Concert with pop culture legends Three Dog Night as part of the 2022 All-Star Concert Series, presented by Valdosta TKO Nissan. Read More Wild Adventures Unveils Armed Services Honor Garden May 23, 2022 Wild Adventures Theme Park in Valdosta, Ga. hosted a ceremony recognizing all branches of the armed services to unveil an updated area of the park paying them tribute and to invite all active and retired military to receive free admission over the Memorial Day Weekend. Read More Teachers Free This Weekend at Wild Adventures May 17, 2022 Wild Adventures Theme Park in Valdosta, Ga. is offering free admission for teachers and all school employees during its Educator Appreciation Weekend this Saturday and Sunday. Read More Wild Adventures Hosts Country Superstar Gabby Barrett April 21, 2022 Wild Adventures Theme Park in Valdosta, Ga. will kick off the 2022 All-Star Concert Series on April 30 with country superstar and \"American Idol\" finalist Gabby Barrett. Read More Splash Island Waterpark Opens Saturday March 30, 2022 Wild Adventures Theme Park in Valdosta, Ga. will open Splash Island Waterpark for the 2022 Season on Saturday, featuring new entertainment and special summertime events. Read More Wild Adventures Kicks Off 2022 Season With New Event March 16, 2022 Wild Adventures Theme Park in Valdosta, Ga. will begin its 2022 Season this Saturday with a little “luck of the Irish'' and new attractions, including a large animal habitat and a new venue featuring weekly live music and locally brewed beer. Read More Wild Adventures’ Employees to Receive 100% Free Tuition February 09, 2022 Herschend Enterprises, Wild Adventure Theme Park’s parent company and the nation’s largest privately-owned themed attractions corporation, has announced it will cover 100 percent of tuition, fees and books for all 11,000 employees who choose to pursue further education. Read More Wild Adventures Seeking 500 New Hires for 2022 Season January 25, 2022 Wild Adventures Theme Park in Valdosta, Georgia is gearing up for an exciting season with events throughout February to hire more than 500 new team members. Read More New Glimmering Light Trail Illuminates Wild Adventures December 03, 2021 Wild Adventures Theme Park in Valdosta, Georgia, will kick off Christmas celebrations this Saturday with over one million lights, a five-story animated Christmas tree, festive food, Santa visits, and new light displays, including the Glimmering Light Trail. Read More Wild Adventures Announces New Additions for 2022 November 12, 2021 Wild Adventures Theme Park has announced additions that will be unveiled in 2022, including a new restaurant and live music venue, a partnership with Georgia Beer Company, new and expanded festivals, new nighttime events, a new animal attraction and more. Read More Wild Adventures Announces Leadership Changes October 06, 2021 Herschend Enterprises, parent company of Wild Adventures Theme Park in Valdosta, Ga,. announced today that the park’s Vice President and General Manager, Molly Deese, has been named the Executive Director and Vice President of Adventure Aquarium in Camden, New Jersey, and Jon Vigue has been promoted to the position of General Manager and Vice President of the park. Read More Media Statement on the Passing of Shirley the Elephant February 03, 2021 Tuesday morning, Shirley, a female Asian elephant living her retirement at Wild Adventures, passed away at the age of 78. Read More Get The Latest News and Special Offers Subscribe to our newsletter, special offers and promotional emails. Park Information Parking Maps Concerts Groups Allergen Guides Park Policies Media Room Blog Partners Now Hiring Jobs Great Pay Company Vision Employee Stories Employment Questions Great Benefits Help & Support Contact Us FAQs Accessibility Find Us Driving Directions Google Maps 3766 Old Clyattville Road Valdosta, GA 31601 Connect With Us Official Sponsors Manage My Cookie Preferences Do Not Sell My Information © 2025 All Rights Reserved Terms of Use Terms of Sale Privacy Policy"
    },
    {
      "url": "https://backtowildadventures.com/about-us/",
      "text": "About Us - Back to Wild Adventures Skip to content About How It Works Hikes & Events Trips & Retreats Live As A Wildling Adventure Stories Contact About How It Works Hikes & Events Trips & Retreats Live As A Wildling Adventure Stories Contact We Bring The Gear, You Bring Your Adventurous  Spirit Facebook-f Twitter Instagram Tiktok There are two types of people in the world – those who need adventure and those who don’t know they need adventure. Back to Wild Adventures is an outdoor company focused on building confidence and community through outdoor experiences, so you can bring that back to your everyday life. Outdoor activities are healing, inspiring, and connecting; they don’t have to be overwhelming. We don’t want anything to keep you from (re)claiming your ‘wild.’ So, Back to Wild Adventures provides the gear and guidance you need to hit the trail or to enjoy a camping weekend. In fact, we do almost all the planning and packing –  from picking appropriate trails/ campgrounds to supplying the necessary equipment to providing weather-based clothing advice – so you can simply show up and get wild. We offer both shared and private group adventures that are inclusive of all body shapes and experience levels. Our shared experiences include Hiking and Yoga , Hiking and Watercolor Painting, Hike and Wine, Forest Bathing, Hiking and Meditation, Family Hike and Scavenger Hunt, Joyful Movement, and Hiking and Photography . One of our most popular shared experiences is the Ladies Hike Club (last Sunday of the month). Ladies Hike Club has a different theme each month and is open to all women, those who identify as women, and non-binary folx. Ready to soak up even more of nature’s magic? Try a weekend camping adventure! Back to Wild provides a curated experience without the hassle or expense of researching, purchasing, and packing all that expensive equipment. Our camper questionnaire will help us pick the perfect campsite and theme for a memorable two-night adventure. Back to Wild can also plan and supply meals for up to 10 campers with custom menus and pricing ranging from beans and franks to Bordeaux and filets. Best of all? We set up and take down your campsite! Join Us on a Hike! Join other wildlings on guided group journeys into the great outdoors! Book Now Our founder, Carlyn Morris is a country girl, turned city girl, turned country girl again . With strong roots in camping, fishing and animal husbandry, this Texas native first learned the wonders of nature and the outdoors from her dad and brothers. Carlyn remembers being a young chick-a-dee, fishing the White River without a wader in site. She might have been the only one who caught a trout that day, but she soon learned that the beauty of nature and the satisfaction of a great catch isn’t free when she looked down and saw her legs turned a bright purple from the cold water. Somehow, that didn’t bother Carlyn, it only inspired her love of the great outdoors. Everything’s bigger in Texas. Don’t believe us? Just ask Carlyn. Measuring in at 5’3”, what she lacks in height she makes us for in enough personality and ambition that could fill a 10-gallon hat. After earning her degree from the prestigious University of Texas School of Advertising, she made her way to the Ad Agency Epicenter of Chicago. Despite her ladder climbing, industry shaping, and brand building professional endeavors, Carlyn never lost her love of the outdoors. In fact, for more than a decade, she channeled her affection for camping and nature into another passion – giving the chance to leave outsized burdens behind to kids who need it the most. Carlyn went from volunteer counselor to camp lead quickly because of her creativity and tender mothering of the kids and families who attended Birch Family Camp. Fondly known as “Mama Carlyn,” she combined outdoorsy fun with theatrical fabulousness for a genuine escape from the heaviness the families endured living with HIV and AIDS. When that program ended, it wasn’t long until she found another way to bring kids into the woods to discover the magic of campfires and conifers as a volunteer counselor at Camp Trach Me Away. Providing a real summer camp experience to kids who live and breathe through a tracheostomy. During her Chicago years, Carlyn expanded her own outdoor experiences, too. From climbing Angel’s Landing (Zion National Park) and The Precipice (Acadia National Park), to sea kayaking with seals in Maine, to biking/ hiking trails throughout the Midwest, a spark was lit that and that flame eventually turned into Back to Wild Adventures. In 2017, a close encounter with Bighorn Sheep on a trail in Utah can only be described as a spiritual awakening. The proximity, the shock, the potential for injury, and finally, the spectacular departure of the sheep – one straight down the cliff, the other over the heads of seated hikers and down the cliff – remain so poignant, that her adrenaline spikes in the retelling of the adventure. Carlyn is a fierce destroyer of limitations – both her own and those of the people she loves best. The accomplishments and affluence of her urban circle of friends were at odds with the adamant call of the wild. Her friends, women especially, had denied themselves the soulful experiences of exploration and adventure, and she meant to do something about that. Through age and experience comes wisdom, and Carlyn found herself in a profoundly transformative life stage. It was in this moment of truth and honesty, that she began to go “Back to Wild.” Phase I of the adventure is nearly complete – Carlyn launched the foundational hikes and outdoor experiences for her business, and relocated her life and her business to the rustic charm of Dowagiac, Michigan. Phase II will add more to her mission of escaping the world to come home to yourself. Stay connected to learn more. Have Questions? Talk to Carlyn Before You Book Subscribe To The Wildlings Newsletter Every month (or so), we send out events, special offers, and discount codes to our Pack. You should totally join – all the cool kids are doing it. (Psst, we never share your info or send garbage SPAM, because *ew.*) Email SUBSCRIBE Contact us info@backtowildadventures.com Chicago, Illinois, United States 773-710-3211 Quick links LGBTQIA+ About How It Works Hikes & Events Live as a Wildling Adventure Stories Contact Us Follow us Facebook-f Twitter Instagram Tiktok © 2021 Back To Wild Adventures - All Rights RESERVED Website designed by Orpical Group"
    },
    {
      "url": "https://www.riverwild.com/about-us/",
      "text": "About Us - Wild River Adventures Skip to content Buy Trip Photos info@riverwild.com 406-387-9453 Facebook Instagram Rafting Trips Close Rafting Trips Open Rafting Trips Whitewater Rafting Run some of the best rapids in the Glacier National Park Scenic Float Trip A fun and relaxing way to experience the beauty of Montana Evening Dinner Raft Combine our Half Day Whitewater Adventure with a tasty riverside barbecue dinner Wild Side Sport Rafting Offering experienced rafters extra thrills in our high performance rafts Kayaking Trips In an Inflatable Kayak, every rapid is a fun challenge! View All Overnight Trips Close Overnight Trips Open Overnight Trips Middle Fork Overnight Experience thrilling whitewater and stunning Glacier views on a Middle Fork overnight adventure! North Fork Overnight Enjoy a guided North Fork rafting adventure with stunning views, wildlife, and riverside camping—perfect for all! View All Fly Fishing Close Fly Fishing Open Fly Fishing Guided Half & Full Day Trips Discover a Montana fly fishing trip you won’t soon forget Day School Offers a hands-on introduction to fly fishing on the Middle Fork Multi-Day Trips For anglers seeking a deeper connection to the Flathead River Park-N-Paddle Planning Close Planning Open Planning Explore Glacier Np Area Info Flathead River Info Directions Faqs About Close About Open About About Wild River Adventures Employment Info Gift Certificates Contact Us Book Now ABOUT US Wild River Adventures has been sharing the thrill of glacier rafting since 1974, with the most experienced guides who prioritize your safety and fun. Our unbeatable prices ensure everyone can experience the beauty of Montana’s rivers, with all gear included! OUR Story Wild River Adventures is a top-tier glacier rafting company. At Wild River Adventures our enthusiasm for the river is contagious. Our roots go back to 1974, making us one of the longest-standing glacier rafting companies, and most of our guides have been part of the family for years. They’re the best in the business and in addition to knowing the river like the back of their hand, they know how to keep you safe. All of our guides maintain their Wilderness First Aid, CPR, and River Rescue certifications and complete multiple training workshops throughout the year. We are here because we love these Montana rivers and enjoy sharing this special place with those who seek it out. We are committed to exceptional customer service and our experienced guides delight in sharing their passion for these rivers and knowledge of the area. We are grateful for the many kind letters we receive from guests each year complementing us on the quality of our service. A full-time recreation therapist is available to ensure that individuals with special needs can be accommodated on the majority of our trips. Lastly, our prices are the lowest in the industry because we think that everyone should be able to experience rafting Montana’s Glacier National Park at a reasonable cost. If you find a lower price with another West Glacier rafting company, we will gladly match it. Our prices include wetsuits and splash gear (should weather require them), neoprene booties, helmets, and life jackets. Plan a trip today. We look forward to taking you out on the river! OUR History Our roots go back to 1974 when George Mumalo founded the first commercial rafting at Glacier Park. George was a pioneer in the industry, and he had the honor of taking then Vice President George Bush on a float trip on the Flathead River through Glacier. George was a mentor and inspiration to a number of our guides and managers. Since then we’ve changed names and continued to grow. Over the years Wild River Adventures has taken thousands of satisfied customers down the Middle and North Forks of the Flathead River at Glacier National Park. In addition, we have branched out to provide horse/raft trips and are striving to become your one stop adventure outfitter here in Glacier Country. We feel blessed to assist our customers have the time of their lives during their visit to Glacier National Park. Why should we go with Wild River Adventures? Glad you asked. Here are the Top Ten Reasons to go with our rafting company 1. We Emphasize Quality Over Quantity We only put 8-10 passengers on our 16′ rafts; 6-7 on our 14’rafts and 4-5 on our 12’rafts. This insures our customers will have personalized service on all our trips. 2. Experienced, Professional Guides All of our guides have certifications and experience which exceed the regulatory standards set up by our governing agencies. They are certified in CPR and Wilderness First Aid. Many have their Wilderness First Responder and EMT’s. All have been trained in river rescue techniques and must pass a stringent river skill test each season. In addition, our guides are wonderful individuals who delight in sharing their knowledge of Glacier’s rivers with our customers. 3. Self Bailing Boats We pioneered the use of self bailing boats on Flathead, and guarantee the use of these safe and comfortable boats on all of our trips. 4. Convenient Location We are located one and a half miles from Glacier’s West entrance. Within walking distance from our shop are horse rides, hiking and mountain biking trails, helicopter scenic flights, restaurants and chalets. 5. Veteran and EMS Owned Owner, Lexi Woods, has proudly served in the Air National Guard since 2002 and is still actively serving. She has conducted three tours overseas and is currently a member of the Montana Air National Guard. Owner, Justin Woods, is a Captain at the Whitefish Fire Department. When they are not away helping people throughout the community, you will find them both helping around the company or out on the river. Both proudly serve their country, their community, and are honored to be able to serve you through their love of the outdoors. 6. Customized Adventures We offer a variety of custom trips and river workshops. Exclusive guided private boats and 12-foot sport rafts are available, as well as raft rentals and shuttles. We cater to groups such as reunions, weddings, and company parties. We will do everything we can to work within your schedule, and customize a trip, which will meet your needs. 7. Special Discounts Available Call us about pre-season and group discounts. We also have special rates for AAA members, youth 12 and under, senior citizens, Military and EMS employees! 8. Comfy Rafter Packages On our full-day, multi-day and wild side trips we provide, at no extra chare, a complete wetsuits package which includes a life jacket, farmer john wetsuit, neoprene booties, fleece jacket and guide style splash jacket. Wet suits are provided on half day trips when required by weather and water conditions. 9. Risk Management Our risk management program has been recognized as one of the best in the industry. 10. Glacier River Specialists For the last three decades, we have been offering whitewater rafting, scenic and fishing trips on the river of Glacier National Park. We have one mission: To provide high quality river trips at Glacier National Park. We have been featured in numerous national publications including Outside, Men’s Journal and Family Adventure. Please join us for an adventure, which you will long remember. OUR LOCATION Our Address: 11900 US-2 West Glacier, MT 59936 Our office is located on Highway 2 East, in West Glacier, MT, and one mile west of the junction to the west entrance of Glacier National Park. We are next door to Kruger Helicopter Tours to the East and the Rawhide Trading Post to the West. Watch for our log office building which has our name, Wild River, on the roof. info@riverwild.com 406-387-9453 GET DIRECTIONS DON’T WAIT TO BOOK YOUR TRIP TODAY Secure your spot for an adventure of a lifetime and create memories you’ll cherish forever. Book Now Address: 11900 US-2 West Glacier, MT 59936 info@riverwild.com 406-387-9453 Facebook Instagram Rafting Trips Overnight Trips Fishing Trips Park-N-Paddle Trip Planning About Us Buy Trip Photos Hours & Info (Memorial Day Weekend-Mid September) 8am-8pm Mountain Standard Time 7 days a week (October 1-May 1) 9am-5pm Mountain Standard Time Mon-Saturday © 2025 Wild River Adventures | All Rights Reserved. Made by TOMIS call FAQs trips BOOK"
    },
    {
      "url": "https://oregonwild.org/contact-us/",
      "text": "Contact Us - Oregon Wild Get your ticket to Call of the Wild 2025! × Skip to content Our Work Our Work Protecting the Wild Defending Forests & Public Lands Helping Wildlife Thrive Featured Campaign Defending Roadless Wildlands: Oregon’s Wild Heart Get Involved Donate Donate Evergreen Society Renew Membership Legacy Donation Take Action Action Center Get Involved Activist Toolkit Support Volunteer Business Support Other Ways to Support Merch Oregon Wild store Discover Oregon Hiking Oregon Sign Up for a Hike Suggested Hikes Outdoor Resources Resources Resource Library Webcasts Events All Events Photo Contest 2025 Photo Contest Details About About Us About Us Staff & Board Careers Equity, Diversity, and Inclusion Our History History & Impact Contact Us News Get Updates Donate One-Time Donation Give Monthly Renew Membership Get Updates Contact Us We’d like to hear from you! Reach out with any questions, comments, or concerns regarding Oregon Wild or our work. Cody Clark Main Office Portland 5825 N. Greeley Ave. Portland, OR 97217 Tel: 503-283-6343 Tel: Donor Inquiries – (503) 283-6343 Ext. 224 Field Offices Western Oregon 1238 Lincoln St. Eugene, OR 97401 Tel: 541-344-0675 Central Oregon 2843 NW Lolo Dr. #257 Bend, OR 97703 Tel: 541-382-2616 Northeast Oregon P.O. Box 48 Enterprise, OR 97828 Tel: 541-886-0212 To get in touch with Oregon Wild, please reach out to info@oregonwild.org or fill out the following form. Staff Contacts Membership Information: Rachel Mireles Media Inquiries: Arran Robertson Cartography Questions: Erik Fernandez Full Staff Directory General Inquiries First Name * Last Name * Email Address * Membership or General Donation Planned Giving or Major Gifts Whistleblower Public Lands Management Concern Private Lands Management Concern Other Message Submit *Oregon Wild is not an animal rescue organization. There are many great non-profits and government agencies that work to help stranded or injured animals. Please search for your local Humane Society or Audubon if you are concerned about the well-being of a wild animal at risk. Join Our Newsletter. Staying informed is the first step to becoming a public lands and native wildlife advocate. Our Work Protecting the Wild Defending Forests + Public Lands Helping Wildlife Thrive Support Join Oregon Wild Renew Membership Take Action About Contact Us Events News Financials ©2024 Oregon Wild | Privacy Policy Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://www.wildadventures.com/jobs/employment-contact/",
      "text": "Employment  Contact Park Hours Sign In | Register Accessibility Search Theme Park Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Events Special Events Events Special Events Special Events Splash Island Waterpark Splash Island Returns in 2026! Explore Slides Campground Campground Information Map FAQs Activities Campground Information Map FAQs Activities Book Now Campground Activities Calendar Season Passholder Campground Discounts Plan Your Visit Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Park Information Mobile App Blog Policies FAQs Park Information Mobile App Blog Policies FAQs Campground Now Open! Special Events Tickets & Passes Buy Tickets General Admission Special Offers Military Stay & Play Buy Tickets General Admission Special Offers Military Stay & Play Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends 2026 Season Passes Now Available! Get your FREE Pre K Pass Buy Tickets Theme Park Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Things To Do Rides Animals Shows Other Attractions Safari Seekers Scavenger Hunt Dining & Shopping Map Calendar Events Special Events Events Special Events Special Events Splash Island Waterpark Splash Island Returns in 2026! Explore Slides Campground Campground Information Map FAQs Activities Campground Information Map FAQs Activities Book Now Campground Activities Calendar Season Passholder Campground Discounts Plan Your Visit Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Plan Your Trip General Admission Hours & Calendar Campground Hotel Packages Places To Stay Weather Guarantee Driving Directions Parking Park Information Mobile App Blog Policies FAQs Park Information Mobile App Blog Policies FAQs Campground Now Open! Special Events Tickets & Passes Buy Tickets General Admission Special Offers Military Stay & Play Buy Tickets General Admission Special Offers Military Stay & Play Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Season Passes 2026 Season Pass Season Pass Renewal Current Passholders Season Pass FAQ Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Enhance Your Experience Pumpkin Spice Festival Lakeside Lodges Animal Feedings Unlimited Photo Card All Add-Ons Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends Groups Groups 15+ School Groups Business Groups Scout Adventure Weekends 2026 Season Passes Now Available! Get your FREE Pre K Pass Buy Tickets Jobs / Employment  Contact Contact Human Resources Email: wahr@wildadventures.com Office Hours: Monday-Friday 9 a.m. - 5 p.m. Saturdays & Sundays 9 a.m. - 5 p.m. when the park is open Address: 3766 Old Clyattville Rd. Valdosta, GA 31601 The Human Resources building is located in the Team Member Parking lot. If you are arriving for an interview, please check in at the Security Building first when you arrive. Download Printable Map & Directions Get The Latest News and Special Offers Subscribe to our newsletter, special offers and promotional emails. Park Information Parking Maps Concerts Groups Allergen Guides Park Policies Media Room Blog Partners Now Hiring Jobs Great Pay Company Vision Employee Stories Employment Questions Great Benefits Help & Support Contact Us FAQs Accessibility Find Us Driving Directions Google Maps 3766 Old Clyattville Road Valdosta, GA 31601 Connect With Us Official Sponsors Manage My Cookie Preferences Do Not Sell My Information © 2025 All Rights Reserved Terms of Use Terms of Sale Privacy Policy"
    }
  ]
}