{
  "fuentes": [
    {
      "url": "https://wileyhouseconcerts.org/artists",
      "email": "thaddeus@wileyhouseconcerts.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "gabe@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "info@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "leadershipboard@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "olivia@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "oliviac@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "scott@journeysherwood.org"
    },
    {
      "url": "https://www.projectaccessnow.org/about-us/staff",
      "email": "iepsconsultation@projectaccessnow.org"
    },
    {
      "url": "https://livingmusic.co.uk/contact-us/",
      "email": "info@livingmusic.co.uk"
    },
    {
      "url": "https://wileyhouseconcerts.org/book-your-event",
      "email": "thaddeus@wilethouseconcerts.org"
    },
    {
      "url": "https://wileyhouseconcerts.org/book-your-event",
      "email": "thaddeus@wileyhouseconcerts.org"
    },
    {
      "url": "https://music4life.org/about-music4life/about/birth-of-i-music4life-i",
      "email": "info@music4life.org"
    },
    {
      "url": "https://music4life.org/about-music4life/about/birth-of-i-music4life-i",
      "email": "info@music4life.org"
    },
    {
      "url": "https://www.music4life.org/about-music4life/governing-board",
      "email": "info@music4life.org"
    },
    {
      "url": "https://www.music4life.org/about-music4life/governing-board",
      "email": "info@music4life.org"
    },
    {
      "url": "https://www.artofliving.org/us-en/contact-us",
      "email": "kushal.choksi@artofliving.org"
    },
    {
      "url": "https://www.artofliving.org/us-en/contact-us",
      "email": "secretariat@artofliving.org"
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "email": "info@theatrenantucket.org"
    },
    {
      "url": "https://www.music4life.org/about-music4life/about/about-us",
      "email": "info@music4life.org"
    },
    {
      "url": "https://www.music4life.org/about-music4life/about/about-us",
      "email": "info@music4life.org"
    }
  ],
  "mails": [
    "gabe@journeysherwood.org",
    "iepsconsultation@projectaccessnow.org",
    "info@journeysherwood.org",
    "info@livingmusic.co.uk",
    "info@music4life.org",
    "info@theatrenantucket.org",
    "kushal.choksi@artofliving.org",
    "leadershipboard@journeysherwood.org",
    "olivia@journeysherwood.org",
    "oliviac@journeysherwood.org",
    "scott@journeysherwood.org",
    "secretariat@artofliving.org",
    "thaddeus@wilethouseconcerts.org",
    "thaddeus@wileyhouseconcerts.org"
  ],
  "nombre_sitio": "wileyhouseconcerts.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://wileyhouseconcerts.org/artists",
      "text": "Wiley House Concerts - Artists Home Calendar Artists Photos MEMBERSHIP & SUPPORT BOOK YOUR EVENT About Us Contact GIFT CERTIFICATES WHC Home Calendar Artists Photos MEMBERSHIP & SUPPORT BOOK YOUR EVENT About Us Contact GIFT CERTIFICATES Artists looking to be considered for Wiley House Concerts events OR looking to host their own privately ticketed event at the MUSIC4LIFE Living Arts Center in Clearwater please send your details and requirements via email to thaddeus@wileyhouseconcerts.org. Wiley House Concerts, Inc is a nonprofit 501(c)(3) charitable organization. Some images © Contact Edit profile Log in Log out"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "text": "Leadership Team — Journey Church New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream Leadership Team New Here Find Us Plan a Visit Leadership Team Journey Church Staff Team Scott Edinger Lead Pastor scott@journeysherwood.org Olivia Pothoff Pastor of Worship & Care olivia@journeysherwood.org Gabe Nielsen Director of Journey Youth gabe@journeysherwood.org Olivia Cuddeford Director of Journey Kids oliviac@journeysherwood.org Journey Church Leadership Board The Leadership Board at Journey Church is made up of six members of the Journey Church family and the Lead Pastor. They are assigned to help guide, equip, and empower the pastors and staff at Journey Church to fulfill the mission and vision that God has uniquely given us. Our current Leadership Board members: Megan O’Connell, Jon Burgi, Lacey McNay, Ed Hatch, Amy Schlapper, Josh Thoreson. If you have any questions for the Leadership Board please email: leadershipboard@journeysherwood.org Back to Top Events Messages FOLLOWING JESUS TOGETHER Phone 503.610.0759 Email info@journeysherwood.org Gather 22689 SW Pine Street, Sherwood, OR Mail PO Box 322, Sherwood, OR 97140 Subscribe To Our Weekly Update Sign up with your email address to receive our weekly email updates. First Name Last Name Email Address Sign Up We respect your privacy. Thank you for signing up for our Weekly Update!"
    },
    {
      "url": "https://www.projectaccessnow.org/about-us/staff",
      "text": "Project Access NOW Staff: Leadership & Dedicated Team Members | Portland, OR About Mission Learn about how and why we do what we do. People Get to know our staff, leadership, and board. Partners Learn who partners with us to achieve our mission. Impact Stories of success from clients and partners. News Keep up with the latest from Project Access NOW. View our Strategic Plan Click Here Get Involved Donate Your donations will support our efforts. Volunteer Give your time and energy to help people receive care they need. Board &Â Committee Service Become a core member of the leadership team. Employment Find out about current employment opportunities. Contact Get in touch with Project Access NOW. Seeking services? Click Here Refer a client Get Help About Mission People Partners Impact News Programs Donated Care Insurance Support Community Health Community Assistance Advocacy Get Involved Donate Volunteer Board & Committee Service Employment Contact In need of services? Click here Our Staff Leadership Executive Team Greg Sutliff âVice President Finance they/them Omar Al Rais, MBA, MBChB Senior Vice President Operations he/him/his Rebecca Raab, MS Vice President Development and Communications she/her/hers Tracy Carver, MPA President and CEO she/her/hers Leadership Joseph Nicoletti Director IT and Strategic Projects he/him/his Myrna Valdez Director Programs and People she/her/hers/ella Program Management Brennan Universe Manager Executive Assistant and Board Affairs they/them Chloe Dominguez Manager Program and Office Logistics she/her/hers Emma Holland Manager Operations she/her Erika Valdez Manager Donated Care (DC) she/her/hers Jina Kalberg Manager Finance she/her/they/them Julie Chu, PMP Senior Project Manager Strategic Projects (SP) she/her/hers Peter Merritt Manager Impact and Advocacy he/him Ranisha Isom, BS, CAC, CHW Manager Insurance Enrollment and Payment Support she/her/hers Sandra Rivera Manager Community Assistance Program (CAP) she/her/hers/ella We're hiring! Check out our employment opportunities now View Open Positions Subscribe to Updates Join our newsletter to stay up-to-date on news and events. About Mission People Partners Impact Annual Reports News Get Involved Donate Volunteer Employment Contact Resources Social Services Insurance Appointment Client Referral Follow us Facebook Instagram LinkedIn © Project Access NOW. All rights reserved. Privacy Policy Terms of Service Cookies Policy Site Map"
    },
    {
      "url": "https://livingmusic.co.uk/contact-us/",
      "text": "Contact Us – Living Music Skip to content Living Music Enriching Life Through Music Menu Welcome About Us Why Choose Living Music Benefits of Music Lessons Testimonials Gallery Useful Links Contact Us Contact Us Please do get in touch with us if you have any questions or queries. If you are looking for music lessons and would like further information, please contact us: info@livingmusic.co.uk You can contact on: 07899823450 Or use our contact form: Please enable JavaScript in your browser to complete this form. Name * First Last Email * Comment or Message Submit Copyright © 2025 Living Music . All rights reserved. Theme Spacious by ThemeGrill. Powered by: WordPress . Welcome About Us Why Choose Living Music Benefits of Music Lessons Testimonials Gallery Useful Links Contact Us"
    },
    {
      "url": "https://wileyhouseconcerts.org/book-your-event",
      "text": "Wiley House Concerts - BOOK YOUR EVENT Home Calendar Artists Photos MEMBERSHIP & SUPPORT BOOK YOUR EVENT About Us Contact GIFT CERTIFICATES WHC Home Calendar Artists Photos MEMBERSHIP & SUPPORT BOOK YOUR EVENT About Us Contact GIFT CERTIFICATES MUSIC4LIFE Living Arts Center The MUSIC4LIFE Living Arts Center is a private performance venue in Clearwater, FL.  Independently owned and operated, the center provides a unique space for all types of performing arts and activities.  Wiley House Concerts has permanent residence here and hosts most of their concerts and events in the Listening Room. Check the WHC calendar for a list of hosted events scheduled at the MUSIC4LIFE Living Arts Center. Artists looking to perform for WHC should submit their details, requirements, and EPK via email to thaddeus@wileyhouseconcerts.org . If you are looking to rent the space for your own event, please contact thaddeus@wileyhouseconcerts.org with details and questions. Standard Rental Pricing is as follows: Weekdays: $100 per hour/3 hours minimum Weekends:  $150 per hour/4 hour minimum MUSIC4LIFE Living Arts Center 1204 Rogers Street Clearwater, FL 33756 thaddeus@wileyhouseconcerts.org The Vibe Wiley House Concerts, Inc is a nonprofit 501(c)(3) charitable organization. Some images © Contact Edit profile Log in Log out"
    },
    {
      "url": "https://music4life.org/about-music4life/about/birth-of-i-music4life-i",
      "text": "About Us: How [i]Music4Life[/i]™ Began About Music4Life Overview About Us About Us How Music4Life Began What We Do Why Music4Life FAQ Tax Filings Annual Reports Donate Now Board of Directors Advisory Board Endorsements Our Sponsors Preferred Vendors Fundraising School District Chapters Snohomish County Edmonds Public Schools Everett Public Schools Marysville Public Schools Monroe Public Schools Sky Valley King County Auburn School District Highline Public Schools Issaquah Public School District Kent School District Lake Washington School District Northshore School District Riverview School District Seattle Public Schools Shoreline School District Kitsap County Bremerton School District Start a New Chapter News & More Events Friends News Photos & Videos Recorders Program About Music4Life How Music4Life Began A Tribute to Music4Life 's Co-Founder As Music4Life 's Co-Founder and Founding Chairman/CEO, David Endicott fulfilled a lifelong dream of honoring his childhood band director and assisting thousands of Western Washington public school students with the gift of music through their participation in instrumental music programs. David passed away in May 2025. He is greatly missed and admired by all who worked with him. David served as Press Secretary in Washington, DC to Republican U.S. Senator Slade Gorton from 1982–1987 and was subsequently appointed by Democratic Governor Mike Lowry as one of five full-time citizen members of theWashington State Health Care Policy Board in Olympia. He operated his own marketing consulting firm in Seattle. He was a graduate of the University of Wisconsin, Madison and co-founded Music4Life in 2007 as a memorial to his band director, Emory Nordness, in Viroqua, Wisconsin, where he was born and raised. How Music4Life Began Written by David Endicott, Co-Founder and Chairman/CEO (2007-2025) So Music4Life began as a demonstration project to help kids in Seattle Public Schools. Since then, additional programs have been started (in chronological order) at the request of the superintendents in the public school districts of Highline, Shoreline, Edmonds, Everett, Northshore, Bremerton, Auburn, Kent, Marysville, Riverview, Lake Washington, Issaquah, Sultan and Monroe. Numerous other requests to set-up local Music4Life Chapters are being considered. As a Rotarian I thought Rotary would be a good foundation from which to build. A year or so later, a couple of Rotary Distinct governors (each Rotary District is comprised of about 3,000 Rotarians) told me that we should remove the word “Rotary” from our name because it suggested an endorsement (by Rotary International) that we didn’t have. They said the lawyers at R.I. back at corporate headquarters jealously guard the integrity of the word “Rotary.” The governors also said that, while we were at it, we also should set-up a separate 501(c)(3) organization for liability and other legal purposes. Thus, Rotary Music4Life became just Music4Life and we set-up the separate non-profit organization that donated and repaired musical instruments for use by students in need. Music4Life is not just a double entendre, but a triple. First, we provide school-age kids with something meaningful to do with their time. Second, we help open the wonderful world of music to them for the rest of their lives. And third, we founded it with the blessing of 2007-08 Seattle Rotary (also known as “Seattle Number 4” because it was the fourth Rotary club chartered in the history of Rotary International) President John Iverson, also a former President of the Seattle Opera Guild. At that time, I was a member of Seattle #4.\r\n\r\nIn the last several years, Music4Life has enlisted the help of Kiwanis, Lions, Soroptimists and other community service organizations. Dick Lee was a star basketballer for the Washington Huskies and now pursuing his athletic interests. Through the good graces of supporters like the internationally prominent law firm of Foster Garvey (formerly Garvey Schubert Barer), that provides all Music4Life legal work on a pro bono basis, and many other enthusiasts, our work goes on. Donate Donate Via Simple Give Donate Via Paypal Donate Instrument Contact Us Music4Life Info@Music4Life.org P.O. Box 17728 Seattle, WA  98127 Sign Up Sign up for our e-newsletter, Quarter Notes ! We'll deliver news and updates right to your inbox about nine times a year. Email Sign Up Contact Us Mailing Address: P.O. Box 17728 Seattle, WA  98127 Email: Info@Music4Life.org Login Phone: 206.999.2388 Music4Life is a 501(c)(3 Phone: 206.999.2388 Music4Life is a 501(c)(3) Recent Music4Life News Quarter Notes - Mid Year 2025 Music4Life Adds Sultan Public Schools Quarter Notes - End of Year 2023 - 24 Edition Copyright © 2025 Music4Life Music4Life Privacy Policy | Terms & Conditions"
    },
    {
      "url": "https://www.music4life.org/about-music4life/governing-board",
      "text": "[i]Music4Life[/i]™ Board of Directors About Music4Life Overview About Us About Us How Music4Life Began What We Do Why Music4Life FAQ Tax Filings Annual Reports Donate Now Board of Directors Advisory Board Endorsements Our Sponsors Preferred Vendors Fundraising School District Chapters Snohomish County Edmonds Public Schools Everett Public Schools Marysville Public Schools Monroe Public Schools Sky Valley King County Auburn School District Highline Public Schools Issaquah Public School District Kent School District Lake Washington School District Northshore School District Riverview School District Seattle Public Schools Shoreline School District Kitsap County Bremerton School District Start a New Chapter News & More Events Friends News Photos & Videos Recorders Program About Music4Life Board of Directors Music4Life ™ Board of Directors Colleen Armstrong, Interim Managing Director Colleen served for many years as Chief of Staff of Seattle Opera and retired after 25 years with the organization. Gary Cohn, Ph.D., President Gary Cohn, Ph.D., was the 2017 Superintendent of the Year for Washington state, and served as superintendent of Everett Public Schools for 10 years and the Port Angeles School District for eight years.  His regional leadership helped eliminate barriers to student success so each might graduate career- and college-ready. He has served on many boards, including the United Way Boards of Snohomish County and Clallam County, Washington Alliance for Better Schools, the Eastside Leadership Institute, the Governor's Council for the Healthiest Next Generation and the state’s Professional Educator Standards Board.  Gary and Sue Cohn live most of the year in downtown Kirkland and spend time at a residence in Scottsdale.  They both are avid golfers and music and theater lovers. Cliff Lenz, Vice President Host of King TV’s Seattle Today program for 17 years.  Host and producer of Music Magic.... a program for children about music- cited by the National Education Association as one of the nation’s outstanding children’s programs, Emmy award winning composer, piano and guitar teacher in the Edmonds and Monroe School Districts and piano and guitar teacher in a private capacity. Gary Ryno, Treasurer Gary is a contract chief financial officer with MorganCFO and he wears many hats. In his 40-year career, Gary has deftly negotiated the roles of CFO, CEO andEVP in banking and finance. After successfully navigating his way from Yakima, Washington into the US Air Force, he turned his attention to earning a Bachelor of Arts degree fromCentral Washington University and a Certificate in Commercial Banking from the University of Washington — a native son done good. When he’s not elbow-deep in Excel spreadsheets or saving someone’s bottom line, he spends his time cycling, cooking, sailing and passionately studying world events: economic, humanistic and universal and its ultimate effect on the future of Sapiens. Alicia Edgar, Secretary Alicia Edgar brings considerable fundraising and community volunteer experience to the Music4Life Governing Board. In addition to her extensive career in higher education advancement, Alicia has led several music booster organizations within Seattle Public Schools and is passionate about providing access to music education. Alicia began playing the flute and piccolo in the sixth grade and continues to be an active musician in Puget Sound instrumental ensembles. Marli Iverson, Director Marli is a pianist, retired real estate professional, and a long-time member of the Rotary Club of Seattle (a.k.a. Seattle Downtown Rotary or Seattle #4). She served as Chair of Seattle Rotary’s Music Committee for many years. Marli also taught junior high school choral music in the Highline and Tacoma Public Schools. She and her late husband, John, have been involved with Music4Life since it was founded in 2007. Dean Petrich, Director Dean Petrich has deep experience with string instruments and pianos. After college he began studying to be a piano technician, which he pursued as a career from 1973 to this day. He has held many offices in the Seattle Chapter of the Piano Technicians Guild, including president, vice president, secretary, newsletter editor and librarian.  He is currently teaching several apprentices to become master technicians.  More information about his varied music background is available on his web site: PetrichsPianoShop.com . Donate Donate Via Simple Give Donate Via Paypal Donate Instrument Login Username Password Show Password Remember Me Sign in with a passkey Log in Forgot your password? Forgot your username? Contact Us Music4Life Info@Music4Life.org P.O. Box 17728 Seattle, WA  98127 Sign Up Sign up for our e-newsletter, Quarter Notes ! We'll deliver news and updates right to your inbox about nine times a year. Email Sign Up Contact Us Mailing Address: P.O. Box 17728 Seattle, WA  98127 Email: Info@Music4Life.org Login Phone: 206.999.2388 Music4Life is a 501(c)(3 Phone: 206.999.2388 Music4Life is a 501(c)(3) Recent Music4Life News Quarter Notes - Mid Year 2025 Music4Life Adds Sultan Public Schools Quarter Notes - End of Year 2023 - 24 Edition Copyright © 2025 Music4Life Music4Life Privacy Policy | Terms & Conditions"
    },
    {
      "url": "https://www.artofliving.org/us-en/contact-us",
      "text": "Contact Us | The Art of Living National Website Menu find a meetup Talk to a Teacher (855) 202-4400 Gurudev Explore Breathwork Meditation Wisdom Podcasts Courses BEGINNER'S COURSES Art of Living Part 1 Sahaj Samadhi Meditation Art of Living Premium Sri Sri Yoga Foundation ADVANCED COURSES Art of Living Part 2 Blessings Chakra Kriya Sanyam TRAINING COURSES Volunteer Training Teacher Training All Courses Help me choose Centers Art of Living Boone Retreat Local Centers Resources Meditations Wisdom Meetups App About Us Art of Living Service Projects Science Blog Press & Media Testimonials Contact Us Talk to a Certified Teacher Call (855) 202-4400 United States Find Your Local Center International What are you looking for? Find Courses US City Centers International Search Website Change Country Site International Change Country Website Retreat Centers Global Website Find Courses Search Courses By Name Search Courses By Location Search Courses By Location Search Courses By Name Select a Retreat Center Canada - Montreal Germany - Bad Antogast India - Bangalore USA - Boone, NC Find Courses Find a meetup Search This Website X Home › About Us About Us Contact Us Hello and welcome from the Art of Living! There are several ways to get in touch. For general inquiries, technical help, and other support requests, you can reach us at: Email: support@us.artofliving.org Phone: (855) 202-4400 For other inquiries: Media: kushal.choksi@artofliving.org . Healthcare Partnerships: Contact Form Higher Education Partnerships: Contact Form Primary & Secondary School Partnerships: Contact Form Office of Gurudev: secretariat@artofliving.org About Us One of the world’s largest volunteer-based non-profits, the Art of Living is dedicated to creating a stress-free, violence-free society. Read More About Us 15 Most Popular Lifestyle All The Vagus Nerve and the Healing Promise of The Sudarshan Kriya Yoga Video to Boost Your Body’s Lymphatic System Drainage and Immunity How to Improve Low Self-Esteem with Yoga and Meditation: Three Easy Poses to Lift Depression Ayurveda and Grief: 5 Self-CareTips To Help Your Heart Feel Lighter Beat the Heat with 5 Simple Ayurvedic Tips for a Cooler Summer Now! This Ayurveda Fall Cleanse Will Get Your Body in Shape for the Season An Ayurveda Expert Explains How the Ayurvedic Diet Transforms Your Body A Timely Mild Home Ayurvedic Spring Cleanse for Your Body and Mind Meditation The Ultimate Guide to Meditation for Beginners by The Art of Living Meditation Meditation for Sleep: Try Our Guide for Peaceful Sleep Tonight Meditation The Comprehensive Guide to Understanding and Balancing Your 7 Chakras Stress Comprehensive Guide: 25 Effective Strategies to Reduce Stress and Improve Well-Being Breathing Exercises The Beginner’s Guide to Pranayama: Yoga Breathing Exercises Yoga The Art of Living’s Comprehensive Yoga Poses Finder JOIN BREATHE STRONG A Free Interactive Session on Breath & Meditation with Our Certified Instructor Know more about SKY Breath Meditation TM practiced by millions worldwide to find calm, day after day. SELECT YOUR DATE connect (855) 202-4400 Follow @gurudev Find a course find a meetup Find a course find a meetup talk to a teacher: (855) 202-4400 main menu home contact us newsroom research donate online shop (855) 202-4400 Follow @gurudev Gurudev About Gurudev Accolades Blog courses Art of Living Part I Sahaj Samadhi Meditation Art of Living Part II Sri Sri Yoga Foundation Program All Courses Advanced Courses Healthcare Providers College Courses Destination Retreats About Us Art of Living Research Service Projects Press & Media Donate Endowment Bookstore Gift Card Refer a Friend Affiliates Contact Us blog Yoga Meditation Breathing Exercises Wisdom Spirituality Lifestyle Subscribe © 2025 Art of Living SMS Policy Privacy Policy Cookie Policy Terms of Use"
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "text": "Team SUPPORTÂ US BUY TICKETS SHOWS & TICKETS 2025 SEASON SEASON SUBSCRIPTIONS & GIFT CARDS WHAT TO EXPECT AT THE THEATRE PAST SEASONS GALLERY ABOUT US OUR MISSION & HISTORY STAFF AND BOARD OF DIRECTORS JOBS & VOLUNTEER OPPORTUNITIES AUDITIONS CONTACT US SPOTLIGHT ON SUPPORT SEASON PRODUCERS BUSINESS SPONSORS BUY TICKETS PRODUCING ARTISTIC DIRECTOR Justin Cerne EXECUTIVE DIRECTOR Bethany Oliver ARTISTIC DIRECTOR EMERITUS John Shea COMPANY MANAGER Emily Dunn THEATRE OPERATIONS Katy Feldhahn AUDIENCE ENGAGEMENT Johannah Johnson RESIDENT COSTUME DESIGNER Casey Sayre Boukus RESIDENT LIGHTING DESIGNER Stephen Petrelli RESIDENT SOUND DESIGNER Tony Wagner BOARD OF DIRECTORS Kay Bernon Beth English Ellie Gottwald, VP* David Handy Cecelia Johnson Holly Johnson David Kaytes, President* Karen Keelan Susan Lucier, Clerk* Linda Mason Jean Doyen de Montaillou Chris Mortenson, Treasurer* Helene Patterson Maureen Phillips, Treasurer Designate* Maria Roach, VP* Lisa Soeder* David Southwell, VP* * Executive Committee EMERITUS DIRECTORS Max N. Berry Barbara L. Elder Toby Greenberg Frank Morral Judith Greenberg Seinfeld THEATRE COUNCIL Rebecca Becker Bruce Beni Jane Forman Kathryn Garre-Ayars Victoria Girvan Jill Karp Peggy Kaufman Christina Rose Manca Terry Schubach Les Silverman FRIENDS OF THE THEATRE Amb. Elizabeth Frawley Bagley Jim Bennett Kate Brosnan Jane Condon Fritz Michel Join Our Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. EMAIL info@theatrenantucket.org PHONE 508-228-4305 MAILINGÂ ADDRESS POÂ BOX 1297 Nantucket, MA 02554 STAGE Bennett Hall 62 Centre Street VIRTUAL BOX OFFICE Online:Â Â Â www.theatrenantucket.org Email: info@theatrenantucket.org Tickets can be purchased one hour prior to showtime at Bennett Hall."
    },
    {
      "url": "https://www.music4life.org/about-music4life/about/about-us",
      "text": "About Us About Music4Life Overview About Us About Us How Music4Life Began What We Do Why Music4Life FAQ Tax Filings Annual Reports Donate Now Board of Directors Advisory Board Endorsements Our Sponsors Preferred Vendors Fundraising School District Chapters Snohomish County Edmonds Public Schools Everett Public Schools Marysville Public Schools Monroe Public Schools Sky Valley King County Auburn School District Highline Public Schools Issaquah Public School District Kent School District Lake Washington School District Northshore School District Riverview School District Seattle Public Schools Shoreline School District Kitsap County Bremerton School District Start a New Chapter News & More Events Friends News Photos & Videos Recorders Program About Music4Life About Us About Us The following bullet points either cover basic information about Music4Life™ or answer\r\nquestions we frequently get when asked about it. Music4Life is an education non-profit paying to provide donated-and-repaired musical instruments at no charge for use by the public school students of families in-need. Research  shows that students who participate in school-based\r\n    instrumental music  activities do better in math, science, history,\r\n    literature, international  languages, reading, writing, even in computer\r\n    science, in addition to what it  teaches in terms of teamwork and\r\n    self-discipline. Teachers, school nurses and  guidance counselors know this\r\n    as well as anyone. Therefore,  all students can benefit  --  UNLESS their families\r\n    can’t afford to get them a musical instrument. Music4Life helps families across the very first barrier they\r\n        encounter: The acquisition of the musical instrument in the first\r\n        place. Our current economy makes this unattainable for  many. Instruments are acquired from people who have them stored in\r\n    their garages, attics or closets and realize that their highest and best\r\n    use is to put them back into play.  We are largely dependent on the\r\n    instruments that donors provide to us. For  instrument donors, it is essential to fill-out a Donor Form with detailed information about the instrument being donated so\r\n    we can track it through the evaluation/repair process. We  encourage school districts to provide the instruments to the\r\n    youngest children  possible so we can get them off the streets, away from\r\n    gangs, drugs and other negative influences. All  local Music4Life programs are based  on local\r\n    chapters.  The more funds a chapter raises for Music4Life so we can\r\n    repair instruments, the more instruments that school district gets.\r\n    Bookkeeping discipline allows us to guarantee that funds raised by a\r\n    chapter will be used only to benefit the students attending that chapter’s\r\n    particular school district. We  work with Auburn, Bremerton, Edmonds, Everett, Highline,\r\n    Kent, Lake Washington,  Marysville, Northshore, Riverview, Seattle and\r\n    Shoreline Public Schools.  Other public school districts are being\r\n    considered. The student does not own the instrument. It is\r\n        “a loaner.” Music4Life provides instruments at no charge to\r\n        participating public school districts on a long-term loan basis. A  student may use the instrument of their choice as long as s/he\r\n    is enrolled in the school district.  If s/he leaves the school district\r\n    for any reason (such as graduation, parents move out of the school\r\n    district, etc.), the instrument must be returned to the school district so\r\n    another student of a family in-need can use it. Instruments have a useful life of 3-15 years or more.   So it’s\r\n    possible that numerous students may get the educational benefits  of\r\n    instrumental music from the same instrument. Music4Life may be available to work with any public school district to implement a local school district-based Music4Life program. For more information, contact Music4Life at P.O. Box 17728, Seattle, WA 98127, (206) 999-2388 or Info@Music4Life.org . Donate Donate Via Simple Give Donate Via Paypal Donate Instrument Contact Us Music4Life Info@Music4Life.org P.O. Box 17728 Seattle, WA  98127 Sign Up Sign up for our e-newsletter, Quarter Notes ! We'll deliver news and updates right to your inbox about nine times a year. Email Sign Up Contact Us Mailing Address: P.O. Box 17728 Seattle, WA  98127 Email: Info@Music4Life.org Login Phone: 206.999.2388 Music4Life is a 501(c)(3 Phone: 206.999.2388 Music4Life is a 501(c)(3) Recent Music4Life News Quarter Notes - Mid Year 2025 Music4Life Adds Sultan Public Schools Quarter Notes - End of Year 2023 - 24 Edition Copyright © 2025 Music4Life Music4Life Privacy Policy | Terms & Conditions"
    }
  ]
}