{
  "fuentes": [
    {
      "url": "https://www.mainstreetdailynews.com/local-living/35th-annual-central-florida-peanut-festival",
      "email": "editor@mainstreetdailynews.com"
    },
    {
      "url": "https://peanutgallerynews.com/contact-us/",
      "email": "investnews-dark@2x.png"
    },
    {
      "url": "https://peanutgalley.com/contact/",
      "email": "headnut@peanutgalley.com"
    },
    {
      "url": "https://www.flpeanuts.com/author/admin/",
      "email": "brittany@flpeanuts.com"
    },
    {
      "url": "https://www.chronicleonline.com/weeklies/marion_citizen/lifestyle/35th-central-florida-peanut-festival-comes-to-williston-saturday/article_d49a96a5-35c7-504a-8fbb-4fe89e232b87.html",
      "email": "home_delivery@chronicleonline.com"
    },
    {
      "url": "https://www.chronicleonline.com/weeklies/marion_citizen/lifestyle/35th-central-florida-peanut-festival-comes-to-williston-saturday/article_d49a96a5-35c7-504a-8fbb-4fe89e232b87.html",
      "email": "webadmin@chronicleonline.com"
    },
    {
      "url": "https://www.willistonchamber.com/meet-the-team",
      "email": "wchamber@willistonchamber.com"
    },
    {
      "url": "https://www.chronicleonline.com/weeklies/levy_county_citizen/local_news/35th-central-florida-peanut-festival-draws-hundreds-to-willistons-heritage-park/article_c469cd6b-1e3c-5040-8ca7-e1da2e64869d.html",
      "email": "webadmin@chronicleonline.com"
    },
    {
      "url": "https://www.wcjb.com/2020/07/20/fall-central-florida-peanut-festival-canceled/",
      "email": "publicfile@wcjb.com"
    },
    {
      "url": "https://www.cf.edu/about-cf/contact-us/",
      "email": "cfinfo@cf.edu"
    }
  ],
  "mails": [
    "brittany@flpeanuts.com",
    "cfinfo@cf.edu",
    "editor@mainstreetdailynews.com",
    "headnut@peanutgalley.com",
    "home_delivery@chronicleonline.com",
    "investnews-dark@2x.png",
    "publicfile@wcjb.com",
    "wchamber@willistonchamber.com",
    "webadmin@chronicleonline.com"
  ],
  "nombre_sitio": "willistonflchamber.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.mainstreetdailynews.com/local-living/35th-annual-central-florida-peanut-festival",
      "text": "35th annual Central Florida Peanut Festival slated for Saturday Skip to content Become a Member Become a Member Home Jobs 27 News All News Local News Business Government + Politics Elections Covid-19 Education Health Crime National News Sports All Sports News All Area Teams Athlete of the Week Local Sports Sports Live Stream High School Scoreboard The Prep Zone Local Living Food + Drink Citizens of the Month All Local Living Events Outdoors History Florida Finds Faith + Inspiration Obituaries Legals Browse Notices Place Notices Video Help Marketplace Cars For Sale Keepsakes About About Us Meet the Team Advertise Become A Member Careers Contact E-Edition Print edition locations Newspaper Delivery Search Jobs 27 News Local News Business Government + Politics Elections Education Covid-19 Health Crime National News Sports All Area Teams Athlete of the Week Sports Live Stream High School Scoreboard The Prep Zone Local Living Food + Drink Citizens of the Month Events Outdoors Health Faith + Inspiration History Florida Finds Obits Legals Browse Notices Place Notices Video Help Marketplace Cars For Sale Keepsakes About Us Meet the Team Advertise Become A Member Careers Contact E-Edition Print Edition Locations Newspaper Delivery Menu Jobs 27 Events News Sports Obits Cars close Get Our Free Newsletter Local Living 35th annual Central Florida Peanut Festival slated for Saturday Staff Reports Oct 1, 2024 2:45 pm Williston's Central Florida Peanut Festival will be held in Heritage Park on Saturday, Oct. 4. The 35 th annual Central Florida Peanut Festival cracks open on Saturday in Williston. The event is scheduled from 9 a.m. to 3 p.m. in Heritage Park (116 N. Main St.). More than 100 vendors will be on hand with booths featuring arts, crafts, food and more. Become A Member Mainstreet does not have a paywall, but pavement-pounding journalism is not free. Join your neighbors who make this vital work possible. See Member Benefits Music artists include Butch Batts and the Southbound Band and dancing will be performed by the Mustang Cloggers. Share this post: Share on X (Twitter) Share on Facebook Share on Email Related posts: Dance Alive National Ballet will open auditions for 60th anniversary season Gainesville Youth Chorus schedules open rehearsals Oak Hall School students earn College Board School Recognition Award Crowdfund campaign kicks off for High Springs bookstore Tags: Butch Batts and the Southbound Band Central Florida Peanut Festival Mustang Cloggers Williston Staff Reports View all posts Subscribe Notify of new follow-up comments new replies to my comments Label Name* Email* Website Label Name* Email* Website 0 Comments Oldest Newest Most Voted Inline Feedbacks View all comments Featured Local Savings Sign Up Local news in your inbox. Newsletter Form (#3) Newsletter Email Join Free Got a news tip or story? Let us know Recent Job Openings Part-time Police Officer Santa Fe College Conestogas – Night Grill Cook Conestogas Restaurant Pretrial Officer – Pretrial Services Alachua County Board of County Commissioners Senior Environmental Specialist (Land Conservation) Alachua County Board of County Commissioners Sustainability Manager Alachua County Board of County Commissioners Post A Job | View All Jobs Events Most Read High Springs teenager dies after motorcycle collides with car UF/IFAS to aid Florida farmers switching to bamboo crops Certain, Democrats criticize antisemite ‘on pedestal’ High Springs withdraws criticism of Alachua County Fire Rescue, cites misinformation Gainesville votes to demolish Thelma Boltin Center after price spike Chiefland teen dies in collision with semi Alachua County has 6 official scenic roads, Newnans Lake residents want another High Springs man sentenced to 10 years for child pornography distribution Motor Marketplace 2023 Nissan Altima 2.5 SV Sedan $ 19,985 51K Miles Tomlinson Motor Company View Vehicle 2024 Ford Bronco Sport Big Bend 4×4 $ 26,485 28K Miles Tomlinson Motor Company View Vehicle 2023 Toyota Camry XSE Automatic $ 23,985 60K Miles Tomlinson Motor Company View Vehicle 1 2 3 … 68 Next » View All Inventory Member-supported Mainstreet Daily News keeps you informed about news, sports and events, so you can stay safe, cast informed votes, and be a better neighbor in Alachua County and the surrounding area mainstreetdailynews.com 100 NW 76th Drive #2 Gainesville, FL 32607 Phone: 352-313-3150 Email: editor@mainstreetdailynews.com Discussion and Submission Guidelines Terms of Use Privacy Policy Contest Rules Cookie Notice 2024 Community Impact Report Public Notice Certification X Get Our Daily Newsletter Local news delivered right to your inbox Mobil Modal Newsletter Form Contact Email Submit Become a Member! Mainstreet does not have a paywall, but journalism is not free. Join your neighbors who make this work possible. See Member Benefits close arrow-circle-o-down chevron-left chevron-right facebook-square angle-down ellipsis-v instagram square-x-twitter cross menu wpDiscuz Insert"
    },
    {
      "url": "https://peanutgallerynews.com/contact-us/",
      "text": "Contact Us | Get in Touch with PeanutGalleryNews Home News Investigations Politics Voices World Affairs Business Careers Creators Markets Real Estate Startups Culture Entertainment Fashion Food Music Pageants Travel Wellness Sports Athletes Basketball Global Sports MMA Media Anchors Podcasts Reels Video Features People Changemakers Profiles Spotlight Home News Investigations Politics Voices World Affairs Business Careers Creators Markets Real Estate Startups Culture Entertainment Fashion Food Music Pageants Travel Wellness Sports Athletes Basketball Global Sports MMA Media Anchors Podcasts Reels Video Features People Changemakers Profiles Spotlight No Result View All Result Home Contact Us Contact Us Share on Facebook Share on Twitter We bring you the best Premium WordPress Themes that perfect for news, magazine, personal blog, etc. Check our landing page for details. © 2025 PGMN - Peanut Gallery Media News No Result View All Result Home Landing Page Buy JNews Support Forum Contact Us © 2025 PGMN - Peanut Gallery Media News Are you sure want to unlock this post? Unlock left : 0 Yes No Are you sure want to cancel subscription? Yes No"
    },
    {
      "url": "https://peanutgalley.com/contact/",
      "text": "Contact – Peanut Galley. Skip to content Peanut Galley. Observations from the galley. Menu + × expanded collapsed Home Blog About Contact Contact Don’t hesitate to reach out with the contact information below, or send a message using the form. Get in Touch HeadNut@peanutgalley.com Send Us a Message Go back Your message has been sent Name (required) Warning Email (required) Warning Website Warning Message (required) Warning Warning. Submit Δ Like Loading... Peanut Galley. , Blog at WordPress.com. Subscribe Subscribed Peanut Galley. Sign me up Already have a WordPress.com account? Log in now. Peanut Galley. Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar %d"
    },
    {
      "url": "https://www.flpeanuts.com/author/admin/",
      "text": "admin | Florida Peanut Producers Search for: Home About History of the FPPA FPPA Board Members Membership Info FPPA Calendar Industry At a Glance How Peanuts Grow Where Peanuts Grow Research Organizational Links News Contact Examples Search for: TOLL-FREE (850)526-2590 All posts by admin 2022 Southern Peanut Growers Conference May 23, 2022 FPPA News admin The 23rd Annual Southern Peanut Growers Conference will be held July 21-23, 2022 at the Edgewater Beach Resort in Panama City Beach, Florida. The three-day event provides farmers with information about peanut production, legislative issues, marketing, and promotions. For more information visit southernpeanutfarmers.org . Leave a comment Scholarship Money Available May 16, 2022 Uncategorized admin The Florida Peanut Producers Association is pleased to announce the opening of their 2022 Scholarship Award Program, effective May 2022. Two $1,200 scholarships will be awarded to deserving high school seniors and/or college students. The applicant or someone in the family must be a peanut grower in Florida, not necessarily a member of the FPPA. Each winner will receive $600 when the scholarship winners are announced. The remaining $600 will be awarded after completing one semester, and documentation of passing grades must be submitted to the FPPA Office. The Florida Peanut Producers Association is committed to helping further the education of young people in Florida. The scholarship program is evidence of our commitment. The committee will make the final selection, and all applicants will be notified by mail. For an application, contact the FPPA office at 2741 Penn Avenue, Suite 1, Marianna, FL 32448, call (850) 526-2590, or download an application on www.flpeanuts.com . The Scholarship applications must be postmarked no later than July 1, 2022. Leave a comment FLORIDA PEANUT PRODUCERS ASSOCIATION seeks National Peanut Board Nominees January 23, 2020 Uncategorized admin RELEASE DATE: January 15, 2020 Contact: Ken Barton Florida Peanut Producers Association 850-526-2590 FLORIDA PEANUT PRODUCERS ASSOCIATION seeks National Peanut Board Nominees MARIANNA, FL – The FLORIDA PEANUT PRODUCERS ASSOCIATION seeks eligible peanut producers who are interested in serving on the National Peanut Board.  FLORIDA PEANUT PRODUCERS ASSOCIATION will hold a nominations election to select two nominees each for member and alternate to the National Peanut Board during a meeting on Thursday, February 20, 2020 at 6:30 pm cst at the Jackson County Agricultural Complex and Conference Center on Penn Avenue in Marianna, FL, 32448. All eligible peanut producers are encouraged to participate. Eligible producers are those who are engaged in the production and sale of peanuts and who own or share the ownership and risk of loss of the crop. William Carte of Live Oak is the current Florida National Peanut Board member and Jeremy Rolling of Westville serves as the alternate. The term for the current Florida  board member and alternate expires Dec. 31, 2020. USDA requires two nominees from each state for each position of member and alternate. The National Peanut Board will submit Florida’s slate of nominees to the U.S. Secretary of Agriculture, who makes the appointments. The National Peanut Board encourages inclusion of persons of any race, color, national origin, gender, religion, age, disability, political beliefs, sexual orientation and marital or family status. NPB encourages all persons who qualify as peanut producers to attend the meeting and run for nomination. It is USDA’s policy that membership on industry-government boards and committees accurately reflect the diversity of individuals served by the programs. The Florida Peanut Producers Association is the state certified check-off organization for peanuts in Florida and represents Florida’s peanut producers in the areas of research, promotion and education. The National Peanut Board represents all USA peanut farmers and their families. The mission of the Board is to improve the economic condition of USA peanut farmers and their families through compelling promotion and groundbreaking research. ### Leave a comment Page 1 of 8 1 2 3 4 5 ... » Last » Florida Peanut Producers Association The Florida Peanut Producers Association is a grower check-off association that represents the interests of Florida’s peanut producers through research, promotion and educational programs. CONTACT INFO 2741 Penn Avenue Suite 1 Marianna, FL 32448 brittany@flpeanuts.com 850-718-6015 FPPA LINKS Photos FPPA Calendar Membership Info FPPA Board Members History of the FPPA Recipes Education Guide Facebook Contact Us We would love to hear from you, Click the link below to Contact Us Contact Us > COPYRIGHT 2014, FLORIDA PEANUT PRODUCERS, ALL RIGHTS RESERVED. WEB DESIGN: STRATEGY6"
    },
    {
      "url": "https://www.chronicleonline.com/weeklies/marion_citizen/lifestyle/35th-central-florida-peanut-festival-comes-to-williston-saturday/article_d49a96a5-35c7-504a-8fbb-4fe89e232b87.html",
      "text": "Please wait while we attempt to load the requested page"
    },
    {
      "url": "https://www.willistonchamber.com/meet-the-team",
      "text": "Meet the Team — Williston Area Chamber of Commerce 0 Skip to Content About Us About The Chamber Board of Directors Become a Board Member Meet the Team Chamber Highlights Contact Us Advocacy 68th Legislative Assembly Committees Agriculture Committee Ambassadors Leadership & Education Committee Policy Committee Workforce Committee Join a Committee Events & Programs Calendars Events Programs Membership About Membership Membership Benefits Membership Directory News Chamber in the News Press Releases Western Star Foundation About WSF Become a WSF Board Member WSF Board of Directors Donation to WEEA Commmunity Community Resources Discover Williston Relocation Career Opportunities Golden Path (Workforce) Solutions Hiring Resources Relocation Guide About Membership About Membership Become a Member Membership Benefits Business After Hours Milestone Celebration Relocation Concierge Better Culture Calendars Upcoming Chamber Events Community Calendar Programs Chamber Bucks Leadership Williston Holiday Retail Campaign National Civics Bee® Mental Health First Aid NonProfit Bootcamp Events Farm to Table Holiday Lights Parade Lemonade Day 2025 Stars of Williston Annual Awards Teacher Appreciation WiL Expo 2025 MEMBER LOGIN Open Menu Close Menu About Us About The Chamber Board of Directors Become a Board Member Meet the Team Chamber Highlights Contact Us Advocacy 68th Legislative Assembly Committees Agriculture Committee Ambassadors Leadership & Education Committee Policy Committee Workforce Committee Join a Committee Events & Programs Calendars Events Programs Membership About Membership Membership Benefits Membership Directory News Chamber in the News Press Releases Western Star Foundation About WSF Become a WSF Board Member WSF Board of Directors Donation to WEEA Commmunity Community Resources Discover Williston Relocation Career Opportunities Golden Path (Workforce) Solutions Hiring Resources Relocation Guide About Membership About Membership Become a Member Membership Benefits Business After Hours Milestone Celebration Relocation Concierge Better Culture Calendars Upcoming Chamber Events Community Calendar Programs Chamber Bucks Leadership Williston Holiday Retail Campaign National Civics Bee® Mental Health First Aid NonProfit Bootcamp Events Farm to Table Holiday Lights Parade Lemonade Day 2025 Stars of Williston Annual Awards Teacher Appreciation WiL Expo 2025 MEMBER LOGIN Open Menu Close Menu Folder: About Us Back About The Chamber Board of Directors Become a Board Member Meet the Team Chamber Highlights Contact Us Folder: Advocacy Back 68th Legislative Assembly Folder: Committees Back Agriculture Committee Ambassadors Leadership & Education Committee Policy Committee Workforce Committee Join a Committee Folder: Events & Programs Back Calendars Events Programs Folder: Membership Back About Membership Membership Benefits Membership Directory Folder: News Back Chamber in the News Press Releases Folder: Western Star Foundation Back About WSF Become a WSF Board Member WSF Board of Directors Donation to WEEA Folder: Commmunity Back Community Resources Discover Williston Folder: Relocation Back Career Opportunities Golden Path (Workforce) Solutions Hiring Resources Relocation Guide Folder: About Membership Back About Membership Become a Member Folder: Membership Benefits Back Business After Hours Milestone Celebration Relocation Concierge Better Culture Folder: Calendars Back Upcoming Chamber Events Community Calendar Folder: Programs Back Chamber Bucks Leadership Williston Holiday Retail Campaign National Civics Bee® Mental Health First Aid NonProfit Bootcamp Folder: Events Back Farm to Table Holiday Lights Parade Lemonade Day 2025 Stars of Williston Annual Awards Teacher Appreciation WiL Expo 2025 MEMBER LOGIN MEET THE TEAM Our team is tiny but mighty, constantly advocating on our members’ behalf and work to develop benefits, programs, events and initiatives that align with our mission and help us, our members, and our community: CONNECT. ENGAGE. GROW. LEAD. BROOKELLE OTTE, PRESIDENT & CEO A graduate from the University of Wyoming, Brookelle earned her Bachelor’s Degree in Entrepreneurship, and served as VP of Health and Wellness for her sorority, Alpha Phi. There she led multiple events for the students and community with a focus on increasing Mental Health Awareness and raising money for Women’s Heart Health. From dodgeball tournaments to fancy galas, Brookelle is becoming a seasoned event planner and is excited to cultivate her skills here at the Chamber. Hailing from the great centennial state of Colorado, Brookelle enjoys volunteering, hiking, traveling, practicing yoga, and spending time in nature with her dog and family. CARMEN DELANEY, MEMBER RELATIONS MANAGER Carmen was born and raised in Las Vegas, Nevada and attended Arizona State University where she completed a Bachelor’s Degree in Music Performance with a Minor in Business. She moved to Vermont where she taught music lessons, performed in community orchestras, and served in administrative roles for Nonprofit Organizations centered around Healthcare and Mental Health. These include the two largest in the state of Vermont, Howard Center and Community Health Centers of Burlington. She relocated to Williston in July of 2023 and has since taken a teaching role with the Harmonic Creative World music program and is the Music Director of First Lutheran Church. MEGAN LIS, EVENTS & ADMINISTRATIVE COORDINATOR Megan Lis is a natural creative who has spent majority of her time cultivating methods to contribute her passion and talents into everything she does. Originally from Massachusetts, Megan has spent most of her life traveling, exploring cities and meeting new people. Her love of family and connecting with others led her to participate in many social activities like theatre productions and volunteer work. Looking to start an education in art, Megan started her career taking classes at Massachusetts College of Art and Design, where she later became an editor and photographer of a magazine. She now specializes in illustration, photography, and graphic design. CHUNKY, OFFICE GREETER Chunky was born in San Tan Valley, Arizona in 2013 and finds joy baking in the sun on hot concrete or rolling around in the snow in the height of North Dakota winters. He likes long walks through the park or downtown with his favorite humans, treats, belly scratches, and attention of any kind. Tug is his favorite game to play, but he’ll occasionally play fetch and turn it into a game of keep-a-way. Chunky would love to greet you at our office. Stop by M-Th from 10am-3pm. You’ll get bonus points if you bring a treat. williston area chamber of commerce 10 Main Street, Williston, ND 58801 PO Box G, Williston, ND 58802 wchamber@willistonchamber.com (701)-577-6000 Follow links About Membership Events & Programs J oin A Committee Become A Member Member Login ©  2021-22 Williston Area Chamber of Commerce. All Rights Reserved."
    },
    {
      "url": "https://www.chronicleonline.com/weeklies/levy_county_citizen/local_news/35th-central-florida-peanut-festival-draws-hundreds-to-willistons-heritage-park/article_c469cd6b-1e3c-5040-8ca7-e1da2e64869d.html",
      "text": "Please wait while we attempt to load the requested page"
    },
    {
      "url": "https://www.wcjb.com/2020/07/20/fall-central-florida-peanut-festival-canceled/",
      "text": "Fall Central Florida Peanut Festival canceled Skip to content Download Apps Newsletter Tell Us Something Good Be Our Guest Meet the Team Advertise with Us Submit Photos and Videos Watch Live Video News First Alert Weather Sports Features Hurricane HQ Telemundo Contact Us Community InvestigateTV Home Watch Live News Gainesville Ocala Lake City State National Crime Politics Education Health Good News Sponsored First Alert Weather Hurricane HQ 24/7 Live Weather Radar Weather Maps Forecast Graphics Tropics Graphics First Alert Explained Weather 101 Sports Florida Gators High School Scholar Athlete Russell Report TV20 Coaches Spotlight Junior College Chomp List Submit Your Sports Photos Español Contact Us News Tips Meet the Team Download Our Apps Advertise Employment Advertise Features Bright Futures One Class at a Time Hometown Heroes Paige's Kitchen Tech Tuesday FL Man Adventures Adopt A Pet Wildlife Wednesday Fitness Community Community Calendar Contests TV20 Newsletter Sign-Up Submit Photos and Videos Tell Us Something Good Programming Schedule Zeam - News Streams Gray DC Bureau NextGen TV Zeam - News Streams InvestigateTV Watching Your Wallet Be Our Guest Sky20 Drone Your Local Chamber Your Local Experts HealthCARES Watch ABC Online PowerNation Circle Country Digital Marketing Fall Central Florida Peanut Festival canceled The festival normally takes place the first Saturday of October Williston residents enjoy peanut-themed booths, activities and music at the Annual Central Florida peanut festival. (WCJB Staff, Williston Chamber of Commerce) By WCJB Staff Published : Jul. 20, 2020 at 12:25 PM EDT Email This Link Share on Facebook Share on X (formerly Twitter) Share on Pinterest Share on LinkedIn GAINESVILLE, Fla. (WCJB) - Another local festival bites the dust due to COVID-19. Williston’s Chamber of Commerce canceled the 32nd annual Central Florida Peanut Festival after a lack of participation and concerns over the coronavirus pandemic. The festival normally takes place the first Saturday of October in Williston’s Heritage Park. This year the festival would have taken place on October 3. After the recent spike in COVID-19 cases in Florida, organizers feared they could not maintain adequate social distancing to protect vendors and attendees despite being an outdoor event, the executive director of the festival, Carolyn Broeck said. Vendors and festival-goers flock to the peanut festival from across the state of Florida among other southern states. Broeck also noted a significantly low vendor participation this year after the economic downturn of the pandemic forced sponsors to cancel. Two months into the vendor application process, the festival is 75 percent booked. In early July, the festival was only booked at 12 percent, Broeck said. She hopes that the festival can take place in December and once more in March. The local tradition offers peanut-themed rides, crafts and music. The Peanut royal family also makes an appearance. During the annual festival, Williston residents celebrate the crowning of a Little Peanut King, Queen and Baby Peanut. The cost of the festival is between $7,000 to $10,000 every year. Copyright 2020 WCJB. All rights reserved. Most Read 3 killed after semi-truck does U-turn on Florida Turnpike 9-year-old arrested for bringing loaded gun on school bus in Ocala 16-year-old girl dies after crashing into semi-truck on US Highway 19 Columbia County firefighter, wife arrested on child porn, bestiality charges Deputies break up fights after hundreds crowd Dixie County bar, investigation underway Students walk out in support of Gainesville High School teacher accused of bullying Accident on US Highway 19 claims life of 16-year-old Dixie County student Class action lawsuit against UF will now proceed after the University withdrew its request for an appeal Latest News Florida Board of Governors will vote on approval of UF interim president’s contract Florida Board of Governors will vote on approval of UF interim president’s contract School officials choose name for new public school in Marion County Alachua County man indicted on child porn charges Alachua County man arrested after being accused of inappropriately touching a child Marion County Sheriff’s deputies searching for sexual assault suspect School officials choose name for new public school in Marion County Alachua County man indicted on child porn charges News First Alert Weather Sports Livestream Contests Contact Us WCJB E-News WCJB 6220 NW 43rd Street Gainesville, FL 32653 (352) 377-2020 Public Inspection File publicfile@wcjb.com -  (352) 416-0610 Terms of Service Privacy Policy EEO Statement FCC Applications Advertising Digital Marketing Closed Captioning/Audio Description Click here to learn more about our approach to artificial intelligence. A Gray Local Media Station © 2002-2025"
    },
    {
      "url": "https://www.cf.edu/about-cf/contact-us/",
      "text": "Contact Us < College Of Central Florida Contact Us Apply Toggle navigation Admissions Expand Menu Explore our new interactive guide to CF! Get Viewbook Getting Started at CF Why CF? How to Apply Dates and Deadlines Schedule a Tour Placement Testing Admissions and Enrollment Forms New Student Orientation Contact Admissions Paying for College Types of Financial Aid Cost of Attendance Net Price Calculator Cashier’s Office Financial Aid Consumer Information Contact Financial Aid Information for Students Dual Enrollment / High School First Time in College International Transfer Transient Veteran Spanish Speakers Academics Expand Menu CF makes transferring to FAMU, UCF or USF easy! See How Degrees and Certificates Areas of Study Online Learning University Partners Workforce Programs Honors Noncredit Courses Adult Education / GED® Study Abroad Service Learning Academic Resources 2024-2025 Academic Calendar 2025-2026 Academic Calendar Academic Pathways Bookstore Canvas College Catalog Course Schedule Course Syllabi Library Program Code List Academic Services Academic Advising Testing and Assessment Tutoring Enrollment Services Career Pathways Graduation Student Life Expand Menu Tons of events and activities are in your future. See Calendar Get Involved Arts and Culture Athletics Campus Events Clubs and Organizations Wellness About Our Campuses Campus Amenities Student Housing Campus Dining Campus Safety Student Services Disability Services Career Services Counseling Services Veterans Affairs TRIO Programs About CF Expand Menu CF is ranked among the top 150 colleges in the nation for quality. Learn About CF Locations Appleton Museum of Art Citrus Campus Hampton Center Levy Campus Ocala Campus Vintage Farm Campus Venue Rentals and Catering CF at a Glance Accreditation Consumer Information HEERF Reporting Employee Directory Departments Directory Policies Procedures Employer Connection Work at CF Happening at CF Events Calendar News Administration Office of the President Board of Trustees Institutional Research I am a future student Expand Menu CF College of Central Florida. Learn About CF current student former student parent or guardian guidance counselor employer MyCF Patriots Mail Canvas A-Z Sitemap CF Careers CF Foundation I am a future student current student former student parent or guardian school counselor employer Contact Us Apply Please ensure Javascript is enabled for purposes of website accessibility Home > About CF > Contact Us Contact Us Thank you for your interest in the College of Central Florida. Please fill out the form below, email cfinfo@cf.edu or call 352-873-5800 to reach us. About CF CF at a Glance Awards & Recognition Consumer Information Social Security Collection, Usage, Release Website Privacy FERPA Identity Theft Title IX and Compliance Textbook Affordability Hazing Prevention and Awareness Employee Directory Departments Directory Human Resources Drug-Free Campus Policy Employee Benefits Veterans’ Preference Volunteer Program Job Descriptions Work at CF Marketing and Public Relations Postal Services Purchasing Child Care / Learning Lab School Facilities Printing Services AFC CF Chapter Policies Sustainability Procedures Accreditation Quality Enhancement Plan Student Achievement Data Higher Education Emergency Relief Fund (HEERF) Required Reporting Employer Connection CF Foundation Alumni Distinguished Alumni Alumni Board About CF Foundation Foundation News Volunteer Opportunities Board Members Publications and Financial Reports Foundation Events Giving Give Online Reaching Higher Campaign Establish a scholarship Patriot Fund Gift and Estate Planning STEPS to CF News Office of the President Board of Trustees Notice of Rule Adoption Notice of Rule Development Notice of Meeting Board of Trustees Minutes Archive Contact Us Locations Wilton Simpson Citrus Campus Hampton Center Levy Campus Ocala Campus Vintage Farm Campus Venue Rentals and Catering Citrus Campus Venues Levy Campus Venues Contact CF Conference Services Vintage Farm Rentals Ocala Campus Venues Institutional Research Institutional Research FAQs Fill out my online form . Learn More Receive an email with details about CF. Email First Name Last Name Apply to CF Take a Tour View Calendar Give to CF Departments at CF Campus Safety Conference Services Corporate College Facilities Human Resources Learning Lab School Marketing and Public Relations Postal Services Printing Services Purchasing © 2024 College of Central Florida  | 3001 S.W. College Road, Ocala, FL 34474 Accessibility | Title IX / Compliance | Work at CF"
    }
  ]
}