{
  "fuentes": [
    {
      "url": "https://www.golfontario.ca/golf-facility/the-winston-golf-club-en/",
      "email": "slavoie@thewinstongolfclub.com"
    },
    {
      "url": "https://www.pgaofcanada.com/job-board/general-manager/general-manager-the-winston-golf-club-calgary-ab-34500",
      "email": "execsearch@ggapartners.com"
    },
    {
      "url": "https://thewinstongolfclub.com/contact/",
      "email": "cbrown@thewinstongolfclub.com"
    },
    {
      "url": "https://thewinstongolfclub.com/contact/",
      "email": "connect@thewinstongolfclub.com"
    },
    {
      "url": "https://thewinstongolfclub.com/contact/",
      "email": "kvalleau@thewinstongolfclub.com"
    },
    {
      "url": "https://thewinstongolfclub.com/contact/",
      "email": "sbrown@thewinstongolfclub.com"
    },
    {
      "url": "https://thewinstongolfclub.com/contact/",
      "email": "sspenrath@thewinstongolfclub.com"
    },
    {
      "url": "https://thewinstongolfclub.com/contact/",
      "email": "whastings@thewinstongolfclub.com"
    },
    {
      "url": "https://thewinstongolfclub.com/contact/",
      "email": "whudyma@thewinstongolfclub.com"
    },
    {
      "url": "http://winstontrailshoa.com/",
      "email": "dwilson@campbellproperty.com"
    },
    {
      "url": "http://winstontrailshoa.com/",
      "email": "scheresko@campbellproperty.com"
    },
    {
      "url": "http://winstontrailshoa.com/",
      "email": "swolff@campbellproperty.com"
    },
    {
      "url": "http://winstontrailshoa.com/",
      "email": "tsantaite@campbellproperty.com"
    },
    {
      "url": "http://winstontrailshoa.com/",
      "email": "winstontrailspm@campbellproperty.com"
    }
  ],
  "mails": [
    "cbrown@thewinstongolfclub.com",
    "connect@thewinstongolfclub.com",
    "dwilson@campbellproperty.com",
    "execsearch@ggapartners.com",
    "kvalleau@thewinstongolfclub.com",
    "sbrown@thewinstongolfclub.com",
    "scheresko@campbellproperty.com",
    "slavoie@thewinstongolfclub.com",
    "sspenrath@thewinstongolfclub.com",
    "swolff@campbellproperty.com",
    "tsantaite@campbellproperty.com",
    "whastings@thewinstongolfclub.com",
    "whudyma@thewinstongolfclub.com",
    "winstontrailspm@campbellproperty.com"
  ],
  "nombre_sitio": "winston.golf",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.golfontario.ca/golf-facility/the-winston-golf-club-en/",
      "text": "The Winston Golf Club - Golf Ontario Join Contact Us Find A Course DONATE NOW EDI Participation Women’s Golf Youth Golf Indigenous Golf Adaptive Golf Adaptive Golf Month Golf Events Hub Find A Course Performance Provincial Championships 2025 Competitive Schedule Past Results & Champions Junior Golf Pathway Athlete Development Other Competitions DONATE TODAY Biosteel Player of the Year Rankings Team Ontario Support The Game SCHOLARSHIPS & AWARDS Volunteering VOLUNTEER LOGIN GOLF FOR ALL Resources Course Rating Handicapping Handicap Index Lookup Rules Programs Safe Sport Policies EDI About GO Annual General Meeting Partners About Us Staff & Board Members Job Opportunities Internship Program Ontario Golf Hall of Fame Wall of Recognition Membership Exclusive Member Benefits Member Categories & Benefits Become A Member Certificates & Achievements Login Post a Score . Participation Women’s Golf Youth Golf Indigenous Golf Adaptive Golf Adaptive Golf Month Golf Events Hub Find A Course Performance Provincial Championships 2025 Competitive Schedule Past Results & Champions Junior Golf Pathway Athlete Development Other Competitions DONATE TODAY Biosteel Player of the Year Rankings Team Ontario Support The Game SCHOLARSHIPS & AWARDS Volunteering VOLUNTEER LOGIN GOLF FOR ALL Resources Course Rating Handicapping Handicap Index Lookup Rules Programs Safe Sport Policies EDI About GO Annual General Meeting Partners About Us Staff & Board Members Job Opportunities Internship Program Ontario Golf Hall of Fame Wall of Recognition Membership Exclusive Member Benefits Member Categories & Benefits Become A Member Certificates & Achievements Join Contact Us Find A Course DONATE NOW EDI The Winston Golf Club Calgary, AB Course scorecard View Tee Time Booking Book General Facts # of Holes 18 Course Par Par 72 Total Yards 7037 Club Type Semi-private Website www.thewinstongolfclub.com Location Calgary, AB Phone (403) 984-1700 Address 2502-6 Street NE 2502-6 Street NE Calgary, AB T2E 3Z3 Amenities Pro shop Rental clubs Driving range Golf cart location Lessons Leagues Junior membership Tournament hosting Golf Ontario Contact Us About Us Photo Gallery Yearbooks Golf Links Golf Canada Golf Canada App Regional Associations Regional Junior Tours Newsletter Signup Sign up to receive email offers, promotions and news from Golf Ontario. Sign up × popup-newsletter-title popup-newsletter-text popup-newsletter-button Mobile app Tee-it-up with us Facebook Instagram Twitter TikTok LinkedIn 2025 Women's & Senior Women's Match Play https://www.golfgenius.com/pages/11291936410598164804 CLOSE"
    },
    {
      "url": "https://www.pgaofcanada.com/job-board/general-manager/general-manager-the-winston-golf-club-calgary-ab-34500",
      "text": "General Manager: The Winston Golf Club - Calgary, AB: General Manager - PGA of Canada Cookie Settings We respect your privacy We use cookies to help you navigate efficiently and perform certain functions. For more details,\r\nplease refer to our privacy policy. You can control these cookies or consent to their use by\r\nclicking \"Accept All.\" Accept All Cancel × Français Home Media Centre Sponsors Shop Safe Sport Find a Pro More Contact us About Sign In Join Search Join Education Championships Sport Development Benefits Employment Media Centre Français Contact us Shop Professional Golfers' Association of Canada Photos Jobs Post a Job Apprentice Professional Assistant Professional Associate Professional Coach Director of Golf General Manager Head Professional Industry Postings International Postings Teaching Professional Members on the Move Classified Section Find a Pro City and Province or Postal Code Search Radius km Name Facility Specializations Teaching Coaching Golf Operations Management and Leadership Search General Manager: The Winston Golf Club - Calgary, AB Facebook Twitter LinkedIn Email Text The Winston Golf Club Having celebrated its 100th anniversary as a club in 2023, The Winston Golf Club in Calgary, AB enters its second century on the precipice of transformational change and wants a dynamic General Manager to help shape and lead that initiative. Led by an engaged Board of Directors, The Winston is looking for a strategic and operational leader who can influence the Club’s internal and external culture while greatly increasing the Club’s shareholder members and potentially executing a near term $10MM+ clubhouse construction project. As the closest golf course to downtown Calgary and already home to an outstanding 18-hole layout with a highly motivated and committed membership base, this semi-private club position will appeal to a diverse range of Club Management professionals with a unique opportunity to affect change quickly. About the Club Members: 500 (210 Shareholders, 45 Spousal, 40 Annual, 110 Young Professional, 95 Junior) Initiation Fee: $8,000 Annual Dues: $4,888 Gross Volume: $5 Million F&B Volume: $1.5 Million Average Shareholder Age: 55 Years Old Club Facilities Amenities: 18 Hole Golf Course Driving Range & Practice Area Three Golf Simulators (Nov – Mar) Full Service Pro Shop Dining: Full Service Restaurant Two Banquet Rooms Two Board Rooms Snack Shack Location The Winston Golf Club - Calgary, AB Posted 2023-11-03 Deadline 2023-11-30 Job Summary General Manager Position Summary The General Manager of the Club (“GM”) is the leader of The Winston’s management team and is responsible for managing all facets of the Club’s operations. The GM manages the affairs, and directs the employees of the Club subject to and in accordance with the direction of the Board of Directors (the “Board”) acting through the President, who shall exercise supervisory authority over the GM. The GM shall attend all meetings of the Board and shall be an ex-officio member (i.e., non-voting member) of all Board committees. Responsibilities Skills, Experience and Attributes of the New GM Development and delivery of a consistently excellent member experience commensurate with specified member expectations. Coordinates and administers the Club’s policies as defined by the Board and the Articles of Association of the Club. Develops best-in-class and industry leading operating policies, programs, procedures and methods and directs the work and promotes the development of all department managers. Apprises the Board of industry and competitive trends, and assists the Board in the strategic planning process guiding the future direction of the Club. Establishes personnel policies, initiates and monitors policies relating to personnel actions and training and professional development programs. Performs annual performance and remuneration reviews of all department managers and recommends any changes to the Board. Monitors long and short-term financial objectives and reports and, in consultation with the Board, Finance Committee and Manager of Accounting, prepares the financial plan for the Club. Coordinates the development of the Club’s long-range and annual strategic plans consistent with the Club’s short and long-term strategic direction. Attends conferences, workshops and meetings to keep abreast of current information and developments in the industry, and brings to The Winston leading edge best practices to implement. Develops, maintains and administers a sound organizational plan and initiates improvements as necessary. Coordinates development of operating, cash, and capital budgets according to the applicable budget calendars; monitors monthly budget and other financial information; initiates effective corrective action as required; approves invoices and other arrangements before inception or payment; prepares and makes financial reports to the Board. Is authorized to incur expenses and capital expenditures in accordance with approved budgets or as otherwise directed by the Board. Develops ongoing dialogue and rapport with members through recognition, communication, and follow through, and is present at all major Club functions. Provides advice and recommendations to the President and committees about construction, alterations, maintenance, materials, supplies, equipment, and services not provided in approved plans or budgets. Provides reports of the work and affairs of the Club to the President and to the Board and committees as requested. Coordinates the marketing and member relations program to promote the Club’s services and facilities to present to potential members. Convenes and presides over meetings with department managers and conducts regular full staff meetings. Properly manages all aspects of the Club’s activities to ensure and maintain the highest standards and quality of products and services provided by the Club and to ensure a high level of member satisfaction. Maintains relations with police, fire, liquor control board, health department and other governmental agencies. Ensures that the Club is operated in accordance with all applicable local, provincial and federal laws. Performs competitive analyses on clubs and other businesses providing member alternatives through personal observations and historical reports. Oversees risk management programs to ensure that adequate safety measures are in place to protect members, employees, guests and club assets. Maintains relations with local, provincial and national associations that promote the games of golf. Oversees the care and maintenance of the Club’s physical assets and facilities. Establishes and monitors compliance with purchasing policies and procedures. Reviews and initiates programs to provide members with a variety of popular events. Participates in outside activities that are judged as appropriate and approved by the Board to enhance the prestige of the Club; broadens the scope of the Club’s operation by fulfilling the public obligations of the Club as a participating member of the community. Serves as a liaison between all management staff and the Board. Writes policy and rule directives or approves those written by department managers. Has ultimate authority over inter-departmental matters and implements policies concerning employee-employer relations. Develops, maintains, and disseminates a basic management philosophy to guide all Club personnel toward optimal operating results, employee morale and member satisfaction. Provides appropriate leadership and mentorship to direct reports and mid-level management. Negotiates and recommends Board approval for contracts. Directs purchasing, receiving, storage, issuing, preparation and control of all products, supplies and equipment. Gives direction to and works closely with vendors, outside contractors, firms and individuals providing services to the Club. Directs the writing and publishing of Club newsletters and communications with the Members. Performs other duties and functions as the Board may direct from time to time. Qualifications Minimum 5 to 7 years of progressive leadership and management experience in a private club or hospitality environment. Bachelor’s Degree from an accredited college or university, preferably in Hospitality Management or Business preferred. • A background check will be required. Disciplined follow through to ensure the vision and goals of the Club come to fruition. Ability to cultivate a high level of member services and satisfaction. A strong understanding of top notch operations and events that lead to an elevated experience for members and guests. Industry knowledge and creativity to elevate the food & beverage experiences. Highly focused and passionate about creating an environment of healthy Retention and being the employer of choice for Recruitment. Effective fiscal management through delivery of actual operational and capital results in alignment with approved budgets. Experience with significant facility renovations or construction would be an asset. Direct Reports: Head Golf Professional Turf Care Superintendent Manager, Hospitality & Catering Executive Chef Manager, Accounting & Information Systems Manager, Administration & Member Services Manager, Building Maintenance Measures of Performance: Membership satisfaction according to membership survey data, golf and social activity levels and support of the Club’s Food and Beverage program. Increase in number of shareholders and conversion of annual members to owners. Organizational financial performance against agreed upon goals, monitoring metrics and industry benchmarks. Development of department managers and employees and other Club personnel, including leadership skills, team building, employee motivation and service training. Promptness, quality of information, forecasts and creative consultative services to the club and its officers, to the Board of Directors and the Committees. Club’s general standing in the community. Compliance with known regulations of government agencies. Protection of Club assets. Compensation Salary is open and commensurate with qualifications and experience. The Club offers an excellent bonus and benefit package. Benefits/Perks To be discussed Course Website https://thewinstongolfclub.com/ Employment Duration Full-time Contact Information IMPORTANT: Interested candidates should submit a resume along with a detailed cover letter which addresses the position qualifications and describes your alignment with the position by November 30th, 2023 . Documents are required to be submitt ed in Word or PDF format (save as “Last Name, First Name, The Winston GM Cover Letter” and “Last Name, First Name, The Winston GM Resume”) respectively to: execsearch@ggapartners.com We thank all applicants for their interest but will only contact those selected for an interview. Join Education Jobs Events Hall of Fame Foundation © 2025  PGA of Canada 13450 Dublin Line Acton, ON   L7J 2W7 Phone:(800) 782-5764  \r\nFax: (519) 853-5449"
    },
    {
      "url": "https://thewinstongolfclub.com/contact/",
      "text": "Contact New - The Winston Golf Club JOIN PUBLIC GOLF COURSE CLUBHOUSE LESSONS EVENTS BLOG LOGIN JOIN PUBLIC GOLF COURSE CLUBHOUSE LESSONS EVENTS BLOG LOGIN Enhance Your Game Visit The Winston in the Heart of Calgary Book Tee Time Visit The Winston and enjoy our 18-hole golf course with a classic parkland style layout—nestled just north of the Calgary core in the prestigious Winston Heights community. Contact Information Phone: +1 403-984-1700 Email: connect@thewinstongolfclub.com Address Find The Winston Golf Club at: 2502 6 St NE Calgary, AB T2E 3Z3 Our Business Hours Course During the golf season the course is open Monday to Sunday.  As the days get shorter, our first tee times will be adjusted.  The Golf Shop will open one hour before the first tee time each day.  Please note that twilight times also change this time of year. Range 7:30AM – 1 hour before dusk. Lounge The lounge is currently closed due to clubhouse construction.  We look forward to welcoming you and your guests to our new facility in 2026. The Winston will have temporary services available during the 2025 golf season, these services will include a series of trailers housing, wash, golf, hospitality, and administration, with our central feature being an event tent and portable kitchen trailer.  Our event tent will accommodate up to 100 people.  Hours of operation for food & beverage service are 12pm – 8pm with extended hours when hosting events / tournaments. Dining Room Our dining room is currently closed due to clubhouse contruction.  We look forward to welcoming you and your guests in 2026. Menu unavailable Join As a Member for Exclusive Benefits Members of The Winston get access to: Club fittings by our in-house pros Vendor fit days when industry reps visit League play Priority and unlimited bookings Request Member Info Leadership Team Contacts Wade Hudyma General Manager whudyma@thewinstongolfclub.com 403-984-1711 Kim Valleau Head Professional kvalleau@thewinstongolfclub.com 403-984-1703 Sarah Brown Manager, Administration & Membership sbrown@thewinstongolfclub.com 403-984-1702 Sica Spenrath Manager, Food & Beverage sspenrath@thewinstongolfclub.com 403-984-1706 Warren Hastings Financial Controller whastings@thewinstongolfclub.com 825-257-5586 Cory Brown Turf Care Superintendent cbrown@thewinstongolfclub.com 403-984-1710 Book Your Next Visit to The Winston Today Book Tee Time Frequently Asked Questions about Visiting The Winston Find answers to the questions we get from new visitors most often. Is there parking available at The Winston? Yes—you’ll find ample parking in front of our clubhouse. Parking is available on a first come, first served basis. What time of year can I play golf at The Winston? Our golf season lasts from the start of April to the end of October. Does The Winston Golf Club have a dress code? Suitable dress is required at all times in all parts of the clubhouse and on the golf course. The General Manager will have the final decision on what constitutes suitable dress, in accordance with the following guidelines: Neat business or casual dress is mandatory. Shirts for men must have a collar or be an accepted golf shirt design. Women may have a collar with no sleeves or no collar with sleeves. All shorts must have an inseam of no less than six inches with a finished hem. Tailored joggers are permitted. Track pants, casual joggers, sweatpants, and jeans are not permitted. Will you have temporary services during clubhouse contruction? Yes, we will have modest temporary services. Graham construction is working closely with us to mobilize this village which will be located on the north side of the parking lot in the overflow area.  The small village will include a series of trailers housing, wash, golf, hospitality, and administration, with our central feature being an event tent and portable kitchen trailer.  Our event tent will accommodate up to 100 people.  We expect to operate food & beverage service daily from noon – 7PM with extended hours when hosting events / tournaments. JOIN COURSE CLUBHOUSE EVENTS LESSONS SIMULATORS EMPLOYMENT CONTACT The Winston Golf Club 2502 6 St NE, Calgary, AB T2E 3Z3, Canada Contact Us. +1 403-984-1700 connect@thewinstongolfclub.com Follow Us. © The Winston Golf Club. All Rights Reserved. Site designed by Matchplay Golf Marketing."
    },
    {
      "url": "http://winstontrailshoa.com/",
      "text": "Winston Trails HOA - Lake Worth, FL Home Barcodes & Gate Documents & Forms ARB Information Contact Us Homeowner Portal Winston Trails HOA 5980 Winston Trails Blvd. Lake Worth, FL 33463 Winston Trails is a premier residential community comprised of 1891 single family homes located in western Lake Worth, Florida.  Winston Trails homes surround the world class Winston Trails Public Golf Course and Club. Winston Trail residents enjoy an Olympic size temperature controlled pool, 6 tennis courts, an active tennis program, 2 pickle ball courts, a 2 mile long walk/bike path and a fitness park. Management Office Phone: 561-433-9050 Mon-Tue-Thur-Fri - 9:00 AM - 5:00 PM Wed - 8:00 AM - 5:00 PM Sale / Rental Applications Estoppel Information / Instructions Property Management Lauren Mollenberg , Property Manager - Winston Trails Foundation, Inc. - Barton Creek Village - Bay Hill Village - Bay Meadow Village/Newport Village - Shadow Creek Village - The Greens - Wedgewood Village Email: WinstonTrailsPM@campbellproperty.com Phone: 561-433-9050 Direct: 561-619-5564 Shelly Cheresko , Assistant Property Manager - Catalina on the Green - Fairway Village - Lake Nona Village - Indianwood Village - Lake Shore Village - Las Colinas Village - Muirfield Village - Oakmont Village - Prairie Dunes Village - Sand Hills Village - Village on the Greens / Golfview - Turnbury Village Email: SCheresko@campbellproperty.com Phone: 561-433-9050 Direct: 561-619-5562 Sara Wolff , Front Desk / Administrative Assistant Email: SWolff@campbellproperty.com Phone: 561-433-9050 Direct: 561-619-5561 Daniela-Djen Wilson , Administrative Assistant Email: DWilson@campbellproperty.com Phone: 561-433-9050 Direct: 561-619-5563 Tara Santaite, Bookkeeper Email: TSantaite@campbellproperty.com Phone: 561-433-9050 Direct: 561-619-5560 Winston Trails HOA is managed by: Campbell Property Management"
    }
  ]
}