{
  "fuentes": [
    {
      "url": "https://www.woieat.com/ocean-buffet-gainesville/menu",
      "email": "info@woieat.com"
    },
    {
      "url": "https://www.thebuffet-ny.com/",
      "email": "info@thebuffet-ny.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.woieat.com/buffet-city-brooksville",
      "email": "info@woieat.com"
    },
    {
      "url": "https://www.nrn.com/restaurant-insights/buffets-inc-names-anthony-wedo-ceo",
      "email": "mark.brandau@penton.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.buffetcityclive.com/contact-us",
      "email": "info@buffetcityclive.com"
    },
    {
      "url": "https://www.woieat.com/buffet-city-brooksville/menu",
      "email": "info@woieat.com"
    },
    {
      "url": "https://www.woieat.com/hokkaido-seafood-buffet/menu",
      "email": "info@woieat.com"
    },
    {
      "url": "https://www.biography.com/musicians/jimmy-buffett",
      "email": "editor@biography.com"
    }
  ],
  "mails": [
    "editor@biography.com",
    "info@buffetcityclive.com",
    "info@reception-plus.de",
    "info@scibpaints.com",
    "info@thebuffet-ny.com",
    "info@woieat.com",
    "mark.brandau@penton.com"
  ],
  "nombre_sitio": "woieat.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.woieat.com/ocean-buffet-gainesville/menu",
      "text": "Ocean Buffet Menu | Buffet Price | Sushi, Seafood, Chinese | Gainesville, FL 32605 top of page OCEAN BUFFET (Gainesville) All Your Favorite Dishes – All in One Place Where can you go in Gainesville, FL for all the Chinese, Hibachi Grill & American, you could ever possibly want? Welcome to Ocean Buffet, an all-you-can-eat Chinese buffet open 7 days a week. We offer more than 150 items of food to choose from. We guarantee you will never leave our restaurant hungry. If you're looking for a Chinese food restaurant, look no further. Stop in or call today to find out more details about our Chinese food restaurant. ​ Stop by for Chinese take out today! If you're in the mood for Chinese take out, let Ocean Buffet help. Here at Ocean Buffet, there is no need to separately order your soup, salad, appetizer, and main course. All you have to do is come in, pay one price, and start to dig in! From our fresh seafood buffet to our famous sushi bar and Hibachi grill to an amazing dessert selection, you’ll be completely amazed at the endless options! ​ Although our quantities are vast, we never skip out of the quality of food we serve. All of our dishes are made with premium ingredients and cooked with 100% vegetable oil. Everything is made to order, so you will be getting the freshest food possible. ​ Ocean Buffet also has a party room that is available for celebrations large and small. Don’t feel like sitting down to eat? We also offer a Chinese food takeout menu so you can bring our delicious cooking home with you. The next time hunger strikes, gather up your friends, your family, and head on down to Ocean Buffet! If you want to find Chinese restaurants near me, Contact Ocean Buffet, because we are the best Chinese buffet in Gainesville, FL . Looking forward to seeing you here. ​ Oyster & Crawfish available after 3:30pm Featuring Cantonese, Szechuan, Hunan & Mandarin Cuisine: Appetizer, Salad, Seafood, Sushi, Thai, American Delight, Fresh Fruit, Pastries, Dessert, Ice Cream...... and Much More Hibachi Grill. Select from the freshest meats, vegetables and seafood to create your own dish, then watch the chef's toss them on the grill skillfully Use Coupon Here Delicious Sushi Buffet in Gainesville, FL We understand that if you've never tried sushi, you may be skeptical of it. Sushi is a traditional Japanese food consisting of cooked rice and other ingredients including seafood, vegetables and more. When people think of sushi, they often think of raw fish- but there are so many more options available! From cooked crab to spicy tuna, the options are almost limitless! Some of the most popular rolls in American are Westernized varieties of traditional Japanese sushi rolls. From the very common to more obscure, there is sure to be a roll that will delight your taste buds! If you are trying sushi for the first time, we recommend you try a California Roll. This roll is made with raw or cooked crab, nori, cucumber and sesame seeds. Another popular roll is the Alaskan Roll which consists of smoked salmon, asparagus and avocado. Yum! Visit our Hibachi grill tonight! Whether you're a first time sushi experimenter or you enjoy sushi regularly, you have to try our sushi buffet in Gainesville, FL! Ocean Buffet offers fresh Chinese food in the buffet style you have come to know and love. Visit us tonight to check out what we have to offer! SEAFOOD Come discover wide selection of seafood such as Oyster, Jumbo Shrimp, Scallop, Salmon Steak, Fish, Crawfish, Squid and more seasonal choices throughout the year. HIBACHI Whether you're after hearty brunch ideas or want the classic teppan roasted beef dinner, our teppanyaki chefs will grill the food right in front of you. Our customers enjoy choices of steak, jumbo shrimp, chicken breast, seasonal veggies, noodles... and more POULTRY & MEAT Variation of the best quality meat with dishes such as bacon wrapped chicken, poultry over our special sauce, and more. Delight yourself with the best quality meat. SALAD & FRUIT Salad, Fusion Salad, Traditional Salads, Vegas Salad Fresh seasonal fruits. Salad, Fusion Salad, Traditional Salads, Vegas Salad Fresh seasonal fruits. SUSHI Each morning our sushi chefs carefully select the freshest seasonal fish & other ingredients, then prepares an assortment of Nigiri, Sushi and Sashimi. You always enjoy freshest & delicious sushi for anytimes. DESSERTS Freshly prepared Desserts: Crème brûlée, Napolean, Creme Puff, Cheesecake and etc. Frozen Yogurt: Different flavors of healthy yogurt complemented with toppings chocolate 44' fondue. LUNCH BUFFET Monday - Sunday 11am - 3:30pm ​ ​ Adult $10.99 Kids (3-5 yrs old) $6.99 Kids (6-10 yrs old) $8.99 DINNER BUFFET (Mon. - Thurs. 3:30pm -9:30pm) (Fri. & Sat. 3:30pm - 10:30pm) ​ (Sun. 3:30pm - 9pm) ​ Adult $14.99 Kids (3-5 yrs old) $6.99 Kids (6-10 yrs old) $8.99 HOLIDAY ALL DAY ​11:00am - Closed​ ​ Party Room Available (It's available for Wedding, Official Meetings, Birthday Parties. Up to 200 people.) CARRY OUT BUFET (Choose 3 items at least)​ ​ Lunch $5.29/lb. Dinner $5.99/lb. Seafood or Sushi $9.75 per Pound Soft Drink, Ice Tea, Coffee, Milk $2.29 Hot Tea $1.29 per person ​ ​ SPECIAL OFFER: Senior (65+) 10% OFF Military (Show ID) 10% OFF Choose App & Download to Get App ​ Get Online Ordering App for Client ​ Get Delivery App For Driver info@WoiEat.com Partner with us! Become Restaurant Partner? Contact us Click here to login online ordering account for restaurant owner only. Online Ordering for new restaurant/client? Watch the instruction video here Not find location? Add new location here Download & Install Online Ordering App for Client Browse By Location AK • AL • AR • AZ • CA • CO • CT • DC • DE • FL • GA • HI • IA • ID • IL • IN • KS • KY • LA • MA • MD • ME • MI • MN • MO • MS • MT • NC • ND • NE • NH • NJ • NM • NV • NY • OH • OK • OR • PA • RI • SC • TN • TX • UT • VA • VT • WA • WI • WV • WY Copyright © 2014-2025 WoiEat.com all rights reserved. Privacy Policy Do Not Sell My Personal Information bottom of page"
    },
    {
      "url": "https://www.thebuffet-ny.com/",
      "text": "The Buffet NY Home Our Menu Pricing About Us Media Contact Us Gallery Home Our Menu Pricing About Us Media Contact Us Gallery Welcome to THE\nBUFFET We are launching a Free loyal Meal Promotion to show our appreciation and thank our valued customers for all the support over the years. Here's how to redeem your free meal: • Load your Thank you gift card with 4 times the amount spent on the day. • We'll waive the current bill and put that 4 times the amount on your card for future dining. • The bill for that day will be completely waived. （It is the same way as buying five get one free） CALL NOW *Cash Only Welcome to THE\nBUFFET We are launching a Free loyal Meal Promotion to show our appreciation and thank our valued customers for all the support over the years. Here's how to redeem your free meal: • Load your Thank you gift card with 4 times the amount spent on the day. • We'll waive the current bill and put that 4 times the amount on your card for future dining. • The bill for that day will be completely waived. （It is the same way as buying five get one free） CALL NOW *Cash Only Welcome to THE\nBUFFET We are launching a Free loyal Meal Promotion to show our appreciation and thank our valued customers for all the support over the years. Here's how to redeem your free meal: • Load your Thank you gift card with 4 times the amount spent on the day. • We'll waive the current bill and put that 4 times the amount on your card for future dining. • The bill for that day will be completely waived. （It is the same way as buying five get one free） CALL NOW *Cash Only Discover OUR STORY In 2012, we sought out to create a restaurant that would showcase the best of Asian cuisine and at the same time, embody the warmth of Asian food-culture. There was no better way of sharing that vision than with a buffet. Since that day we’ve had over 7 years of experience bringing the best of Asian cuisine together into one extraordinary, all-inclusive dining experience. You’ll find everything from a fresh Japanese sushi bar & teppanyaki grill, to authentic regional cuisines from China such as hand-carved Peking duck or flavorful sautéed Dungeness crab. As we were often encouraged by our families, we too encourage our guests to try everything, and eat more! About Us There's so many items that range from so many different cuisines such as satay, peking duck buns, dim sum, sushi, seafood, and much more. The dessert station also has tons of options as well which range from fruits to cakes to freshly made crepes and a chocolate fountain! They also have green tea and vanilla soft serve which I actually really enjoyed because it was really creamy unlike other spots I've tried which came out as more grainy. Emily C Huge variety of food! Sushi, raw clams & oysters, meat dishes and dessert bar. Almost all of it, at least what I was able to try before I exploded, was very tasty. It was very crowded, which means a quick turnaround in the food being replenished, so it was very fresh. I will definitely come back. Worth the money. Sandy C This place is amazing!!! We just had our daughter's first birthday party here and it was a hit! They let us in an hour ahead of time to work on the decorations, arrange tables the way we want, and the staff was very accommodating and helpful. Our party had over 100 guests and everyone had a good time. Food was good, lighting was perfect with the large windows and made the decor look amazing. Nora L Contact 20-07 127th St 4th floor, College Point, NY 11356 info@thebuffet-ny.com Opening Times Sun - Thu 11:30 AM - 3:30 PM, 5:30 PM - 10 PM Fri - Sat 11:30 AM - 3:30 PM, 5:30 PM - 10:30 PM *Last seating is 45 minutes prior to closing. Book Table Mobile: (718) 886-3722 *We only take reservations for parties of 10 people or more. All people in your party must be present to be seated. Social Share Contact Us © 2024 The Buffet. All Rights Reserved. Designed By NXTFactor"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.woieat.com/buffet-city-brooksville",
      "text": "Buffet City Brooksville | All You Can Eat | Carry out Buffet | Brooksville, FL 34613 top of page Phone: (352) 592-9889 13235 Cortez Blvd, Brooksville, FL 34613 *WE OPEN ON CHRIST MAS DAY 2024 * Business Hours Sunday - Thursday. 11:00 AM - 9:00 PM Friday & Saturday 11:00 AM - 9:30 PM ​ Dine-in • Carry out • Pick up ​ Chinese • Sushi • Seafood • American • Hibachi ​ \"Brooksville's Largest & Best Asian Cuisine Res taurant\" Buffet City (Brooksville) What We Do 01 MENU 02 PRICE 03 GALLERY 04 LOCATION Choose App & Download to Get App ​ Get Online Ordering App for Client ​ Get Delivery App For Driver info@WoiEat.com Partner with us! Become Restaurant Partner? Contact us Click here to login online ordering account for restaurant owner only. Online Ordering for new restaurant/client? Watch the instruction video here Not find location? Add new location here Download & Install Online Ordering App for Client Browse By Location AK • AL • AR • AZ • CA • CO • CT • DC • DE • FL • GA • HI • IA • ID • IL • IN • KS • KY • LA • MA • MD • ME • MI • MN • MO • MS • MT • NC • ND • NE • NH • NJ • NM • NV • NY • OH • OK • OR • PA • RI • SC • TN • TX • UT • VA • VT • WA • WI • WV • WY Copyright © 2014-2025 WoiEat.com all rights reserved. Privacy Policy Do Not Sell My Personal Information bottom of page"
    },
    {
      "url": "https://www.nrn.com/restaurant-insights/buffets-inc-names-anthony-wedo-ceo",
      "text": "Buffets Inc. names Anthony Wedo CEO Nation's Restaurant News is part of the Informa Connect Division of Informa PLC INFORMA PLC | ABOUT US | INVESTOR RELATIONS | TALENT This site is operated by a business or businesses owned by Informa PLC and all copyright resides with them. Informa PLC's registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. Number 8860726. About Us Subscribe Advertise Multimedia Subscribe Subscribe Operations Related Topics Marketing & Branding Labor Delivery & Takeout Solutions Equipment Food Safety Executives Recent in Operations See All Fast Casual Smashburger’s new CEO, Jim Sullivan, plots brand reinvigoration Smashburger’s new CEO, Jim Sullivan, plots brand reinvigoration by Bret Thorn Sep 9, 2025 3 Min Read Family Dining Cracker Barrel suspends store remodel program amid continued brand backlash Cracker Barrel suspends store remodel program amid continued brand backlash by Joanna Fantozzi Sep 9, 2025 1 Min Read Technology Related Topics Automation Delivery Loyalty AI in Restaurants Recent in Technology See All Sponsored Content Serving Success: How Tommy Bahama is Driving Retention, Flexibility, and Performance Serving Success: How Tommy Bahama is Driving Retention, Flexibility, and Performance Sep 17, 2025 2:00 pm EDT Insights New FSTEC Technology Guide helps restaurants navigate complex tech landscape New FSTEC Technology Guide helps restaurants navigate complex tech landscape by NRN staff Sep 8, 2025 2 Min Read Segments Related Topics Fast Casual Casual Dining Fine Dining Independent Restaurants Emerging Chains Regional Chains Quick Service Eatertainment Family Dining Recent in Segments See All Fast Casual Smashburger’s new CEO, Jim Sullivan, plots brand reinvigoration Smashburger’s new CEO, Jim Sullivan, plots brand reinvigoration by Bret Thorn Sep 9, 2025 3 Min Read Quick Service Trending this week: McDonald’s splits with National Restaurant Association over tip policy See which stories readers couldn't get enough of Trending this week: McDonald’s splits with National Restaurant Association over tip policy See which stories readers couldn't get enough of by NRN staff Sep 9, 2025 10 Slides Finance Related Topics Mergers & Acquisitions Franchising Recent in Finance See All Eatertainment Pinstripes Holdings files for Chapter 11 Pinstripes Holdings files for Chapter 11 by Ron Ruggless Sep 9, 2025 1 Min Read Casual Dining TGI Fridays accelerates development plans in Peru and Japan TGI Fridays accelerates development plans in Peru and Japan by Ron Ruggless Sep 8, 2025 2 Min Read Menu Trends Related Topics Food Trends Beverage Trends Chef Trends Sandwich Trends MenuMasters Spotlight Recent in Menu Trends See All Sponsored Content Getting Saucy: How Cheese Sauce and Other Sauces are Trending on Menus Getting Saucy: How Cheese Sauce and Other Sauces are Trending on Menus Sep 10, 2025 2:00 pm EDT Fast Casual Smashburger’s new CEO, Jim Sullivan, plots brand reinvigoration Smashburger’s new CEO, Jim Sullivan, plots brand reinvigoration by Bret Thorn Sep 9, 2025 3 Min Read Insights Related Topics Restaurant Experience Expert Opinions Top 500 Restaurants Supplier News Recent in Insights See All Family Dining Cracker Barrel suspends store remodel program amid continued brand backlash Cracker Barrel suspends store remodel program amid continued brand backlash by Joanna Fantozzi Sep 9, 2025 1 Min Read Insights New FSTEC Technology Guide helps restaurants navigate complex tech landscape New FSTEC Technology Guide helps restaurants navigate complex tech landscape by NRN staff Sep 8, 2025 2 Min Read Multimedia Resources Related Topics 2025 FSTEC Restaurant Tech Guide Event Insider: FSTEC 2025 Restaurant Show Recap Event Insider: Restaurant Show Event Recap: RLC Sustainability Outlook 2025 Event Insider: CREATE Event Recap: CREATE 2025 Technology Outlook Report 2025 Data Insights Report Sponsored By Insights Executives Segments News Buffets Inc. names Anthony Wedo CEO Buffets Inc. names Anthony Wedo CEO Buffets Inc. names Anthony Wedo CEO The industry veteran plans to reinvigorate the company's brands after its exit from bankruptcy Mark Brandau , Associate editor December 5, 2012 4 Min Read Buffets Inc., the operator of 347 steak-buffet restaurants in 35 states, has named Anthony Wedo as its chief executive to lead the company on its post-bankruptcy \"Plan to Win.\" The parent company to Old Country Buffet, HomeTown Buffet, Ryan's, Fire Mountain and Tahoe Joe's exited Chapter 11 bankruptcy protection this summer. Wedo said his main task to prepare Buffets for renewed growth in the future would be to shore up unit economics, primarily through better execution and culinary innovation. \"Stay tuned,\" Wedo said in an exclusive interview with Nation's Restaurant News. \"We have a story here that will unfold in the next six to 12 months as we reinvite old guests back and bring in new guests. The company's spent a long time going through a painful process, and I want to lead them to a victory, which could include some new portfolio growth down the road.\" Wedo is replacing R. Michael Andrews Jr., who had been chief executive of the company since 2005. Most recently, Wedo was chief executive of Mainline Capital Advisors LLC, which consulted with private-equity firms on restaurant industry mergers and acquisitions and turnaround management. He began his hospitality career with PepsiCo, rising to vice president and general manager of the Southeast Division for KFC and overseeing more than 1,200 restaurants. RELATED • Buffets Inc. discloses details of Ch. 11 exit plan • Buffets Inc. may seek a buyer • More restaurant industry executive changes Wedo also founded Mid-Atlantic Restaurant Systems, the largest area developer and franchisee of Boston Market. Over a four-year period, he grew Mid-Atlantic to 160 restaurants generating more than $250 million in annual sales. Once Boston Market acquired Mid-Atlantic, Wedo then went to New World Restaurant Group as president and chief executive, overseeing 1,000 locations of six bagel-coffee brands, including Einstein Bros. Bagels, Noah's and Manhattan Bagel. \"Tony has demonstrated consistent success in a variety of settings ranging from growth concepts to brand turnarounds,\" Rob Webster, chairman of the board for Buffets, said in a statement. \"He has a proven track record in revitalizing brands. His unique background makes him the perfect leader for Buffets.\" Wedo said he and the new leadership team at Buffets, including new chief marketing officer Jason Abelkop and director of consumer insights Tama Looney, can hit the ground running since the bankruptcy proceedings largely cleared up the company's balance sheet, letting management focus on execution. \"There's been a lot of stabilization, and we feel good about the spot we're starting from,\" Wedo said. \"Our Plan to Win will move this thing forward, and I'm here to execute on the plan. Most specifically, I'm focused on recipes and the menu.\" He added that culinary innovation represents the biggest opportunity to build frequency with current guests and to attract traffic from new users, as people generally find the buffet chains' convenience, price points and variety to be as compelling as they could be. Wedo intends not only to review the chains' existing favorites and possibly reformulate some slow sellers, but he also would bring as many new culinary ideas to the buffet tables as possible. He noted that Buffets is keen on building upon ideas like its Mongolian stir-fry and steak products that recently rolled out. \"I want to do thorough testing on a market-by-market basis,\" he said. \"This is all about inviting our existing users in more frequently and inviting new guests. I'm very interested in getting young families back in.\" Aside from the occasional store closure, Wedo does not anticipate more large-scale downsizing that occurred during Buffets' bankruptcy process, but revitalizing the look of restaurants that remained in the company's portfolio would get renewed attention in the Plan to Win. At the time of the bankruptcy exit last summer, the company said much of the increased capital expenditures made possible by a $50 million exit-loan facility would be earmarked for refurbishing stores. Buffets already has completed about 30 remodels, primarily on restaurants on the West Coast, and Wedo said he would remain committed to deploying capital. \"Once we can take a look at these 25 to 30 restaurants, I want to scrub those results and come back with a refined plan on capital investment,\" he said. \"We're going to do it in a way to gain proper returns.\" Though no new unit growth is projected in the near term, Wedo remained confident that his entrepreneurial background of growing KFC within a Fortune 50 company and turning around several bagel chains would serve Buffets well and lay the groundwork for resumed growth. \"Frankly,\" he said, \"we need some entrepreneurship here to get some creative juices flowing to reinvigorate the brand for new users.\" Buffets Inc. is based in Eagan, Minn. For the company's June 27-ended fiscal 2012, restaurant sales were expected to decline 13 percent to $1.03 billion, from $1.18 billion in fiscal 2011, according to bankruptcy court documents. Contact Mark Brandau at [email protected] . Follow him on Twitter: @Mark_from_NRN Read more about: El Pollo Loco About the Author Mark Brandau Associate editor See more from Mark Brandau Subscribe Nation's Restaurant News Newsletters Get the latest breaking news in the industry, analysis, research, recipes, consumer trends, the latest products and more. Sign Up Now You May Also Like Insights Content Spotlight New FSTEC Technology Guide helps restaurants navigate complex tech landscape The FSTEC Restaurant Technology Guide is a free digital resource for operators Read More Featured Quick Service Dirty soda chain Fiiz Drinks looks to capitalize on beverage’s booming popularity Dirty soda chain Fiiz Drinks looks to capitalize on beverage’s booming popularity Sep 3, 2025 Casual Dining 7 take-aways from exclusive interview with Darden Restaurants CEO Rick Cardenas 7 take-aways from exclusive interview with Darden Restaurants CEO Rick Cardenas Aug 26, 2025 Sponsored Content Content Spotlight Enhance Your Loyalty Program: How Leading Restaurants Drive Revenue Through Loyalty Campaigns Read More Explore About Nation's Restaurant News Subscribe to NRN Company News Contact Us Partner With Us Our Capabilities Media Kit Conferences & Events Ad Specifications Our Brands CSP FoodService Director Nation’s Restaurant News Restaurant Business Restaurant Hospitality Technomic Join Us Subscribe Follow Us Copyright © 2025 Informa Connect Limited. Registered in England & Wales with number 01835199, registered office 5 Howick Place, London, SW1P 1WG. Website TOU | Code of conduct events | Group privacy policy | CCPA | Cookie Policy"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Nachricht Surname name Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.buffetcityclive.com/contact-us",
      "text": "Contact us | Buffet City | Order Food Online | Pick up | Clive, IA 50325 | Chinese - buffet-city Your browser does not support JavaScript, You should enable JavaScript to use this website. Home Menu Gallery Location Contact us Call Buffet City Asian Buffet Restaurant Carry Out, Dine-In Order Online Contact Us First name Last name Your email Email subject Your phone Your message By checking this box and submitting your information, you are granting us permission to email you. You may unsubscribe at any time. Send Message Message Sent! Your message has been sent successfully, I hope to respond within 24 hours. You can also contact us through Tel: (515) 222-0888 Buffet City Home Menu Gallery Location Contact us Address 8801 University Ave, Clive,  IA 50325 (515) 222-0888 Info@buffetcityclive.com Â© 2020 Buffet City"
    },
    {
      "url": "https://www.woieat.com/buffet-city-brooksville/menu",
      "text": "Menu | Buffet Price | Chinese, Seafood, Sushi Gallery | Brooksville, FL 34613 top of page Welcome to BUFFET CITY All Your Favorite Dishes – All in One Place Located in the beautiful city of Brooksville，our restaurant has been dedicated to offering the most memorable dining experience for you. ​ We pick ingredients carefully and use only the freshest and nature ones to prepare every dish, and have been trying to cook them in a healthier way to provide the most nutritious food. Much attention has been attached to ensure you a cozy and inviting ambiance where you could enjoy not only the great meal but also the authentic atmosphere. ​ The owner and all staffs in Buffet City will greet you with the warmest welcome, whether you are a habitual patron or come for the first time. We have made painstaking efforts to create the tidiest and cleanest dining place, and guarantee you with friendly and timely service. Every of your demand and feeling will be cared in our restaurant. ​ If you have any commend or suggestion, or want to get more specific information all you can eat buffet or about us, feel free to contact us - Buffet City Brooksville.  at 352-592-9889 ，or browse our’s Website http://www.flbuffetcity.com /we will be delight to hear from you any time! ​ Welcome to experience the best meals in our fairyland!​ SEAFOOD Come discover wide selection of seafood such as Oyster, Jumbo Shrimp, Scallop, Salmon Steak, Fish, Crawfish, Squid and more seasonal choices throughout the year. HIBACHI Whether you're after hearty brunch ideas or want the classic teppan roasted beef dinner, our teppanyaki chefs will grill the food right in front of you. Our customers enjoy choices of steak, jumbo shrimp, chicken breast, seasonal veggies, noodles... and more POULTRY & MEAT Variation of the best quality meat with dishes such as bacon wrapped chicken, poultry over our special sauce, and more. Delight yourself with the best quality meat. SALAD & FRUIT Salad, Fusion Salad, Traditional Salads, Vegas Salad Fresh seasonal fruits. Salad, Fusion Salad, Traditional Salads, Vegas Salad Fresh seasonal fruits. SUSHI Each morning our sushi chefs carefully select the freshest seasonal fish & other ingredients, then prepares an assortment of Nigiri, Sushi and Sashimi. You always enjoy freshest & delicious sushi for anytimes. DESSERTS Freshly prepared Desserts: Crème brûlée, Napolean, Creme Puff, Cheesecake and etc. Frozen Yogurt: Different flavors of healthy yogurt complemented with toppings chocolate 44' fondue. LUNCH BUFFET (Mon. - Sat. 11:00am - 4:00pm) ​ ​ DINNER BUFFET (Mon. - Thurs. 4:00pm - 9:30pm) (Fri. & Sat. 4:00pm - 10:30pm) ​ ​ SUNDAY ALL DAY (Sunday 11:00am - 9:30pm)​ ​ ​ SUNDAY ALL DAY (Choose 3 items at least)​ ​ ​​ Choose App & Download to Get App ​ Get Online Ordering App for Client ​ Get Delivery App For Driver info@WoiEat.com Partner with us! Become Restaurant Partner? Contact us Click here to login online ordering account for restaurant owner only. Online Ordering for new restaurant/client? Watch the instruction video here Not find location? Add new location here Download & Install Online Ordering App for Client Browse By Location AK • AL • AR • AZ • CA • CO • CT • DC • DE • FL • GA • HI • IA • ID • IL • IN • KS • KY • LA • MA • MD • ME • MI • MN • MO • MS • MT • NC • ND • NE • NH • NJ • NM • NV • NY • OH • OK • OR • PA • RI • SC • TN • TX • UT • VA • VT • WA • WI • WV • WY Copyright © 2014-2025 WoiEat.com all rights reserved. Privacy Policy Do Not Sell My Personal Information bottom of page"
    },
    {
      "url": "https://www.woieat.com/hokkaido-seafood-buffet/menu",
      "text": "Menu | Buffet Price | Seafood, Sushi Gallery | Pittsburgh, PA 15217 top of page Phone: (412) 421-1422 Hokkaido Seafood Buffet - Best Seafood in Pittsburgh Hokkaido is second largest island of Northern Japan. Hokkaido Restaurant founder Hiroshi Kubota had lived on Hokkaido Island for 15 years. Coming from a family of buffet style restaurant specialists Mr. Kubota know how to find best seafood restaurants near me or sushi restaurants. Contact Hokkaido Seafood Buffet in Pittsburgh. prepare food and to make them healthy. Hokkaido Restaurant serves mostly Japanese and Chinese gourmet dishes. The restaurant is a self-service buffet model, with friendly waiters and waitresses bringing the best customer dining experiences. The restaurant features Teppanyaki Grill (Hibachi), fresh vegetables, organic salads, and varieties of seafood and hot food. Birthday & anniversary parties Corporate & business events Social gathering, charitable events, ceremony, and more... Meetings or banquets 10% Refundable deposit required upon confirmation for group reservation More than 225 room capacity Reservations accepted for groups of more than 12 people Limit 2-2½ hours per table (Contact us for special conditions) SEAFOOD Come discover wide selection of seafood such as Oyster, Jumbo Shrimp, Scallop, Salmon Steak, Fish, Crawfish, Squid and more seasonal choices throughout the year. HIBACHI Whether you're after hearty brunch ideas or want the classic teppan roasted beef dinner, our teppanyaki chefs will grill the food right in front of you. Our customers enjoy choices of steak, jumbo shrimp, chicken breast, seasonal veggies, noodles... and more POULTRY & MEAT Variation of the best quality meat with dishes such as bacon wrapped chicken, poultry over our special sauce, and more. Delight yourself with the best quality meat. SALAD & FRUIT Salad, Fusion Salad, Traditional Salads, Vegas Salad Fresh seasonal fruits. Salad, Fusion Salad, Traditional Salads, Vegas Salad Fresh seasonal fruits. SUSHI & SASHIMI Each morning our sushi chefs carefully select the freshest seasonal fish & other ingredients, then prepares an assortment of Nigiri, Sushi and Sashimi. You always enjoy freshest & delicious sushi for anytimes. DESSERTS Freshly prepared Desserts: Crème brûlée, Napolean, Creme Puff, Cheesecake and etc. Frozen Yogurt: Different flavors of healthy yogurt complemented with toppings chocolate 44' fondue. FOOD BAR CATEGORY Buffet Bar SUSHI Sashimi California Roll Philadelphia Roll Salmon Roll Shrimp Roll 40 Choices & many more!! Buffet Bar CHINESE Chicken Broccoli Lo Mein, Fried Rice Egg Rolls Sesame Chicken Pepper Steak Salt Pepper Chicken Buffet Bar DESSERTS Ice Cream Pastries Fresh Fruits Cookies, Pudding and much more!!! Buffet Bar SEAFOOD Salmon Oysters Crab Legs Fried Shrimp Coconut Shrimp Cocktail Shrimp Mussels Buffet Bar AMERICAN Home made potatoes BBQ Ribs Fried Chicken Roast Beef Honey Ham Fried Catfish Cheese Spinach Buffet Bar KIDS MENU French Fries Sweet and Sour Chicken Mac and Cheese Chicken Nuggets Chicken Sticks Pizza Buffet Bar HIBACHI 40 items creative your own hibachi dish NOODLE BAR Creative your own noodle bowl with your choice of ingredients and soup base Buffet Bar SALAD Japanese Salad Full Salad Bar with farm Grown Vegetables Many dressings to choose from LUNCH BUFFET (Mon. - Fri. 11:00am - 3:30pm) ​ Adult $13.99 (Mon. - Fri.) Adult $15.99 (Sat. Brunch) DINNER BUFFET (Mon. - Sat. 3:30pm - Closed) ​ Adult $21.99 (Mon. - Thur.) Adult $21.99 (Fri. & Sat.) ​ SUNDAY ALL DAY DINNER $19.99 SENIOR & KIDS Kids under 36\"  FREE Kids Between 36\" - 55\"  HALF PRICE Senior Citizens 65 yrs & older  10% OFF 8:30 pm pay frist before dining Give Us Your Feedback Rate Us Poor Fair Good Very good Excellent Rate Us Send Feedback Thanks for submitting! Choose App & Download to Get App ​ Get Online Ordering App for Client ​ Get Delivery App For Driver info@WoiEat.com Partner with us! Become Restaurant Partner? Contact us Click here to login online ordering account for restaurant owner only. Online Ordering for new restaurant/client? Watch the instruction video here Not find location? Add new location here Download & Install Online Ordering App for Client Browse By Location AK • AL • AR • AZ • CA • CO • CT • DC • DE • FL • GA • HI • IA • ID • IL • IN • KS • KY • LA • MA • MD • ME • MI • MN • MO • MS • MT • NC • ND • NE • NH • NJ • NM • NV • NY • OH • OK • OR • PA • RI • SC • TN • TX • UT • VA • VT • WA • WI • WV • WY Copyright © 2014-2025 WoiEat.com all rights reserved. Privacy Policy Do Not Sell My Personal Information bottom of page"
    },
    {
      "url": "https://www.biography.com/musicians/jimmy-buffett",
      "text": "Jimmy Buffett: Biography, Musician, Businessman Search Newsletter History - Culture Musicians Athletes Movies - TV Artists Power - Politics Business Scientists Scholars - Educators Activists True Crime BIO Buys Privacy Notice Terms Of Use Skip to Content History & Culture Musicians Athletes Movies & TV Newsletter Charlie Sheen’s Addiction Lainey Wilson Rupert Murdoch Howard Stern Elvis & Tom Parker’s Feud Famous Musicians Folk Musicians Jimmy Buffett Jimmy Buffett Jimmy Buffett was a well-known folk-country singer and songwriter. He wrote the popular songs “Margaritaville” and “Cheeseburger in Paradise.” By Adrienne Donica and Biography.com Editors Updated: Nov 07, 2023 1:13 PM EST Getty Images We may earn commission from links on this page, but we only recommend products we back. Jump to: Latest News: Jimmy Buffett Died at Age 76 Who Was Jimmy Buffett? Quick Facts Early Life and Career Mainstream Musical Success with \"Margaritaville\" Margaritaville The Business More Songs and Albums Declining Health and Death Personal Life: Wife, Children, and Interests 1946-2023 Latest News: Jimmy Buffett Died at Age 76 “Margaritaville” singer-songwriter Jimmy Buffett died on September 1 at age 76, according to a statement on his website . He had been undergoing treatment for Merkel Cell skin cancer for four years. After being hospitalized in May for a then-undisclosed reason, Buffett had paused touring but continued working on a new album and made a surprise appearance onstage in Rhode Island this July. Who Was Jimmy Buffett? Jimmy Buffett was born in 1946 in Mississippi and grew up in Alabama. After college, he moved to Nashville, Tennessee, to pursue a career as a country singer and released his first album in 1970. He gained a loyal following within a few years and broke into the mainstream with his sixth album, containing the song “Margaritaville.” The 1977 hit became the namesake for Buffett’s sprawling business ventures and, more than four decades laters, entered the National Recording Registry. Buffett released some 40 albums over the course of his career and toured frequently. He died in September 2023 at age 76. Quick Facts FULL NAME: James William Buffett BORN: December 25, 1946 BIRTHPLACE: Pascagoula, Mississippi DIED: September 1, 2023 SPOUSE: Margie Washichek (1969-1972) and Jane Buffett (1977-2023) CHILDREN: Savannah, Sarah, and Cameron ASTROLOGICAL SIGN: Capricorn Early Life and Career Singer and songwriter Jimmy Buffett was born James William Buffett on December 25, 1946, in Pascagoula, Mississippi. He grew up in Mobile, Alabama, where he attended Catholic high school. He left Mobile and eventually attended the University of Southern Mississippi, where he took up the guitar to meet women. After college, Buffett moved to Nashville to pursue a career as a country singer but first worked as a journalist for Billboard magazine. Getty Images Jimmy Buffett, circa 1970, at the start of his musical career After working with a cover band called The Now Generation, Buffett landed his first record contract in 1970. Later that year, he released his folk-country debut, Down to Earth , followed by High Cumberland Jubilee , both of which went largely unnoticed. Mainstream Musical Success with \"Margaritaville\" Having always been drawn to the sea, Buffett moved to Key West in the early 1970s, where he adopted his trademark beachcombing persona. Under this new guise, he signed a contract with ABC-Dunhill and put out White Sport Coat and a Pink Crustacean in 1973. With instant party hits like “Why Don’t We Get Drunk,” Buffett gained a loyal following who appreciated the laid-back atmosphere of his live shows. Soon, his fans started wearing Hawaiian shirts, traveling Grateful Dead–style to his shows, and calling themselves “Parrotheads.” Getty Images Jimmy Buffett in August 1977, shortly after “Margaritaville” peaked at No. 8 on the Billboard Hot 100. Buffett broke into the mainstream with his sixth album, 1977’s Changes in Latitudes, Changes in Attitudes , containing the enduring party standard “Margaritaville.” He got the idea for the song after a night out while drinking margaritas at a bar in Austin, Texas. Initially scrawling on a cocktail napkin, Buffett finished the song later that day on his trip back to the Florida Keys and played it for the first that night at a bar in Key West. It was his only Top 10 song on the Billboard Hot 100 chart. His 1978 follow-up album, Son of a Son of a Sailor , featured another classic track “Cheeseburger in Paradise.” As with Changes , the album went platinum within a year of release. Margaritaville The Business After winning a lawsuit against Chi-Chi’s restaurant chain that attempted to trademark a “Margaritaville” drink special, the business-savvy performer decided to capitalize on his beach-bum image. In 1985, he opened a Margaritaville store in Key West. A restaurant followed two years later. Partnering with John Cohlan in the 1990s accelerated the business with more restaurant openings and the launch of a tequila brand and Land Shark beer. The Margaritaville name has since graced a beach apparel and footwear line, casinos, a chain of bars, a radio station, a cruise ship, a musical, and more. Today, there are 30 branded resorts and hotels across nine states and five tropical countries. The New York Times and Bloomberg have reported the company’s annual sales were $1.5 billion (before the COVID-19 pandemic). Buffett’s other entrepreneurial pursuits included starting his own custom record labels, Margaritaville Records in 1992 and Mailboat Records in 1999, and writing several books. More Songs and Albums Getty Images Jimmy Buffett and Alan Jackson won the CMA Award for Vocal Event of the Year for their song “It’s Five O’Clock Somewhere.” Margaritaville Records produced his two best-selling albums from the 1990s: Fruitcakes (1994) and Banana Wind (1996). In the 2000s, collaborating with other big-name country artists proved successful. “It’s Five O’Clock Somewhere” with Alan Jackson earned a CMA Award for Vocal Event of the Year in 2003, as well as a Grammy nomination. The duo teamed again the next year for “Hey Good Lookin’” that also featured Clint Black, Kenny Chesney , Toby Keith , and George Strait . A second Grammy nod followed. “Hey Good Lookin’” was also the lead track on 2004’s License to Chill . It was Buffett’s only No. 1 album on the Billboard 200. Buffett continued producing new records, including 2013’s Songs from St. Somewhere and, most recently, Life on the Flip Side (2020). In April 2023, the Library of Congress inducted “Margaritaville” into the National Recording Registry. It is one of 625 preserved songs. Buffett and his Coral Reefer Band played numerous concerts across the country every year up until months before his death. Declining Health and Death Buffett died on September 1, 2023, at age 76 at his home on Long Island, New York. A statement on his website said he had been undergoing treatment for Merkel Cell skin cancer for four years. The singer was hospitalized at least twice in the year before this death. In September 2022, he was briefly hospitalized for then-unspecified health issues. He postponed three concerts and canceled two others on his Life on the Flip Side Redux tour. A statement on his website read: “Jimmy will need to refrain from touring for the rest of the year. On doctor’s orders, he must take this time to recuperate and heal. Jimmy looks forward to getting back on stage next year.” He did just that on his Second Wind Tour, which began in February 2023. However, in May, he abruptly postponed a show in Charleston, South Carolina, two days before the scheduled date. Announcing the news on social media , Buffett wrote: “I had to stop in Boston for a check-up but wound up back in the hospital to address some issues that needed immediate attention. Growing old is not for sissies.” His final appearance onstage—in Rhode Island in early July—was a surprise . The barefoot performer played half a dozen songs at a Mac McAnally concert; McAnally is a longtime member of the Coral Reefer Band. Personal Life: Wife, Children, and Interests Getty Images Jimmy Buffett and his wife Jane in March 2023 In 1977, Buffett married Jane Slagsvol. Together, they had two daughters, Savannah and Sarah, and one son, Cameron. Jane was Buffett’s second wife. He had previously been married to Margie Washichek, from 1969 to 1972. Buffett had a home in Palm Beach, Florida, where he was an avid sailor and pilot, and an outspoken environmental activist. His Florida ties and environmental passion collided when scientists named a newly discovered crustacean after him . The tiny Gnathia jimmybuffetti inhabit the Florida Keys. Geffen Changes In Latitudes, Changes In Attitudes Vinyl $28 at Amazon $28 at Best Buy $31 at Walmart Margaritaville Neon Sign T-Shirt $19 at Amazon Dey Street Books Tales From Margaritaville by Jimmy Buffett Now 45% Off $10 at Amazon Geffen Son of a Son of a Sailor Vinyl $28 at Amazon $31 at Walmart Margaritaville Cheeseburger in Paradise T-Shirt $19 at Amazon Ballantine Books A Pirate Looks at Fifty by Jimmy Buffett Now 46% Off $12 at Amazon Fact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us ! Adrienne Donica Deputy Editor Adrienne directs the daily news operation and content production for Biography.com. She joined the staff in October 2022 and most recently worked as an editor for Popular Mechanics , Runner’s World , and Bicycling . Adrienne has served as editor-in-chief of two regional print magazines, and her work has won several awards, including the Best Explanatory Journalism award from the Alliance of Area Business Publishers. Her current working theory is that people are the point of life, and she’s fascinated by everyone who (and every system that) creates our societal norms. When she’s not behind the news desk, find her hiking, working on her latest cocktail project, or eating mint chocolate chip ice cream. Biography.com Editors Staff Editorial Team and Contributors The Biography.com staff is a team of people-obsessed and news-hungry editors with decades of collective experience. We have worked as daily newspaper reporters, major national magazine editors, and as editors-in-chief of regional media publications. Among our ranks are book authors and award-winning journalists. Our staff also works with freelance writers, researchers, and other contributors to produce the smart, compelling profiles and articles you see on our site. To meet the team, visit our About Us page: https://www.biography.com/about/a43602329/about-us Watch Next Advertisement - Continue Reading Below Folk Musicians 7 Musical Duos Who’ve Ended in Disaster Tyler Childers Inside Bob Dylan and Joan Baez’s Relationship Bob Dylan Advertisement - Continue Reading Below Zach Bryan The True Story of Bob Marley’s One Love Concert Joni Mitchell Tracy Chapman June Carter Cash Woody Guthrie Emmylou Harris This Shipwreck Inspired a Gordon Lightfoot Song Advertisement - Continue Reading Below About Biography.com Newsletter Contact Us Other Hearst Subscriptions A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2025 Hearst Magazine Media, Inc. Site contains certain content that is owned A&E Television Networks, LLC. All Rights Reserved. Biography and associated logos are trademarks of A+E Networks®protected in the US and other countries around the globe. Privacy Notice Terms of Use CA Notice at Collection DAA Industry Opt Out Your CA Privacy Rights/Shine the Light Cookies Choices"
    }
  ]
}