{
  "fuentes": [
    {
      "url": "https://woodmontcountryclub.net/meet-the-team/",
      "email": "kledbetter@woodmontcountryclub.net"
    },
    {
      "url": "https://woodmontcountryclub.net/meet-the-team/",
      "email": "cobrien@woodmontcountryclub.net"
    },
    {
      "url": "https://woodmontcountryclub.net/meet-the-team/",
      "email": "lshapes@woodmontcountryclub.net"
    },
    {
      "url": "https://woodmontcountryclub.net/meet-the-team/",
      "email": "rschmidt@woodmontcountryclub.net"
    },
    {
      "url": "https://woodmontcountryclub.net/contact/",
      "email": "kledbetter@woodmontcountryclub.net"
    },
    {
      "url": "https://woodmontcountryclub.net/contact/",
      "email": "cobrien@woodmontcountryclub.net"
    },
    {
      "url": "https://woodmontcountryclub.net/contact/",
      "email": "lshapes@woodmontcountryclub.net"
    },
    {
      "url": "https://woodmontcountryclub.net/contact/",
      "email": "rschmidt@woodmontcountryclub.net"
    },
    {
      "url": "https://woodmontcollege.edu/contact-us",
      "email": "contact@woodmontcollege.edu"
    },
    {
      "url": "https://woodmontcountryclub.net/services/",
      "email": "pedro.gomez@dtitrainingcenter.com"
    },
    {
      "url": "https://woodmontcountryclub.net/services/",
      "email": "rschmidt@woodmontcountryclub.net"
    },
    {
      "url": "https://woodmontcountryclub.net/",
      "email": "rschmidt@woodmontcountryclub.net"
    },
    {
      "url": "https://woodmontcountryclub.net/golf/",
      "email": "lshapes@woodmontcountryclub.net"
    },
    {
      "url": "https://woodmontcountryclub.net/golf/",
      "email": "rschmidt@woodmontcountryclub.net"
    },
    {
      "url": "https://woodmontcountryclub.net/course/",
      "email": "rschmidt@woodmontcountryclub.net"
    },
    {
      "url": "https://woodmontcountryclub.net/reviews",
      "email": "rschmidt@woodmontcountryclub.net"
    },
    {
      "url": "https://woodmontcountryclub.net/our-gallery/",
      "email": "rschmidt@woodmontcountryclub.net"
    }
  ],
  "mails": [
    "cobrien@woodmontcountryclub.net",
    "contact@woodmontcollege.edu",
    "kledbetter@woodmontcountryclub.net",
    "lshapes@woodmontcountryclub.net",
    "pedro.gomez@dtitrainingcenter.com",
    "rschmidt@woodmontcountryclub.net"
  ],
  "nombre_sitio": "woodmontcountryclub.net",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://woodmontcountryclub.net/meet-the-team/",
      "text": "Broward County Country Club - Woodmont Country Club Skip to content 7801 NW 80th Avenue, Tamarac, FL 33321 (954) 722-4300 Home About Services Tennis & PickleBall Course Memberships Golf Banquets & Events Facilities Gallery Reviews Contact Meet The Team Gift Cards BOOK NOW Meet The Team Courtney O’Brien Director of Events cobrien@woodmontcountryclub.net 954-722-4300 x7 941-807-4622 cell Lee Shapes Director of Golf lshapes@woodmontcountryclub.net 954-722-4300 x1 Rachel Schmidt VP of Operations rschmidt@woodmontcountryclub.net 954-722-4300 x5 Kellen Ledbetter Assistant Director of Golf and Membership 954-722-4300 X2 Kledbetter@woodmontcountryclub.net Erik Knudsen Golf Course Superintendent 954-722-4300 Deric Officer Executive Chef 954-722-4300 Get In Touch 7801 NW 80th Avenue Tamarac, FL 33321 (954) 722-4300 rschmidt@woodmontcountryclub.net Memberships Available! * Annual * Seasonal * Corporate * Sports * Tennis * Social * Under 40 * Join Now and all Initiation Fees are waived! Call Us Now © 2025 - All Rights Reserved - Disclaimer Website Design & Marketing by OMG National Home About Services Tennis & PickleBall Course Memberships Golf Banquets & Events Facilities Gallery Reviews Contact Meet The Team Gift Cards Close Call Us Today: (954) 722-4300"
    },
    {
      "url": "https://woodmontcountryclub.net/contact/",
      "text": "Contact Us - Woodmont Country Club Skip to content 7801 NW 80th Avenue, Tamarac, FL 33321 (954) 722-4300 Home About Services Tennis & PickleBall Course Memberships Golf Banquets & Events Facilities Gallery Reviews Contact Meet The Team Gift Cards BOOK NOW Contact Us 7801 NW 80th Avenue Tamarac, FL 33321 (954) 722-4300 Courtney O’Brien Director of Events cobrien@woodmontcountryclub.net 954-722-4300 x7 941-807-4622 cell Lee Shapes, Director of Golf lshapes@woodmontcountryclub.net 954-722-4300 x1 Rachel Schmidt, VP of Operations: rschmidt@woodmontcountryclub.net 954-722-4300 x5 Kellen Ledbetter Assistant Director of Golf and Membership 954-722-4300 X2 Kledbetter@woodmontcountryclub.net Erik Knudsen Golf Course Superintendent 954-722-4300 Deric Officer Executive Chef 954-722-4300 Connect with Us Whether you’re ready for a challenging golf game or a relaxing dip in the pool, you’ll find everything you need at Woodmont Country Club. Contact us today to get started. Name * Phone Email * Message CAPTCHA Get In Touch 7801 NW 80th Avenue Tamarac, FL 33321 (954) 722-4300 rschmidt@woodmontcountryclub.net Memberships Available! * Annual * Seasonal * Corporate * Sports * Tennis * Social * Under 40 * Join Now and all Initiation Fees are waived! Call Us Now © 2025 - All Rights Reserved - Disclaimer Website Design & Marketing by OMG National Home About Services Tennis & PickleBall Course Memberships Golf Banquets & Events Facilities Gallery Reviews Contact Meet The Team Gift Cards Close Call Us Today: (954) 722-4300"
    },
    {
      "url": "https://woodmontcollege.edu/contact-us",
      "text": "Contact Us - Woodmont College About Us History and Mission Administrative Staff Faculty Accreditation and Licensure Testimonials Meeting Our Mission Academics Bachelor of Arts in Judaic Studies BS in Computer Programming and Technology AS in Software and Web Development MA in Education-STEM  Concentration General Education Course Descriptions College Catalog Student Success Academic Advisement Center Transfer Credits Online Library Career Services Academic Calendar Disability Services Student Handbook Admissions Application Process Tuition and Fees Scholarships International Students FAQs Technology Requirements CreditUnite© Contact Us About History and Mission Administration Faculty Accreditation and Licensure Testimonials Meeting Our Mission Academics Bachelor of Arts in Judaic Studies BS in Computer Programming and Technology AS in Software and Web Development MA in Education-STEM  Concentration General Education Component Course Descriptions College Catalog Student Success Academic Advisement Center Transfer Credits Online Library Career Services Tech Internship Academic Calendar Student Handbook Order Transcript CreditUnite© Transcript Alumni Center Admissions Application Process Tuition and Fees Scholarships International Students FAQs Technology Requirements Accessibility Accessibility Statement Disability Services Contact Contact Us We’re here to answer your questions. This website is full of information to support your decision making – but if you can’t find what you need online, we offer several ways to contact us. Contact Us Now Email Us Use the form below to ask us any question and our admissions team will respond to you within 24 hours (Sunday to Friday). Email Us Now Call Us We’re available during US and IL work hours. We are shomer Shabbos. Admissions Office: US: +1 (786) 605-0614 IL: +972 (0)2 560-9512 Administrative Office: +1 (305) 944-0035 Fax us Fax: (305) 944-0335 Have Us Call You Fill out the form below and we’ll get in touch with you within 24 hours. Leave Details Social Media Follow us on our social media channels where we regularly post updates and news. WhatsApp Us Reach our Director of Admissions directly using the number below +1 (786) 605-0614 or click here Our Address 16375 N.E. 18th Avenue, Suite 304 North Miami Beach, FL 33162 USA Office Hours Administrative Office Hours: 9:00 AM – 5:00 PM Monday – Friday Offices are closed on legal and Jewish holidays Contact Us Now We will get back to you by email or by phone within the next 24 hours. I am interested in Name* Email* Phone Number I am interested in --- Computer Science Degree Judaic Studies Degree General Information Message Please leave this field empty. Δ Follow us on social media × Contact Us Now! Error: Contact form not found. contact@woodmontcollege.edu +1(786) 605-0614 +1(786) 605-0614 +972 (0)2 56-09-512 Fax: (305) 944-0335"
    },
    {
      "url": "https://woodmontcountryclub.net/services/",
      "text": "Country Club Offerings - Woodmont Country Club Skip to content 7801 NW 80th Avenue, Tamarac, FL 33321 (954) 722-4300 Home About Services Tennis & PickleBall Course Memberships Golf Banquets & Events Facilities Gallery Reviews Contact Meet The Team Gift Cards BOOK NOW Our Services Enjoy Exceptional Country Club Offerings Woodmont Country Club is a semi-private golf course and luxury country club in Tamarac, FL. Stop by for a challenging golf game, a swim in the pool, or a meal at our restaurant. For more information about our services and amenities, read a thorough breakdown before. Golf Woodmont Country Club offers practice areas and is the perfect place to improve your short game. What better way to take your game to the next level this year? Make time to perfect your swing and improve your golf game today. Just contact our pro shop to speak with our professional staff and schedule your lesson. Tennis & Pickleball DTI Training Center has high-quality training programs tailored to your specific needs. From weekend clinics and social events to local tournaments and competitions, we provide our players with an enjoyable on-court experience. We offer programs for all ages and skill levels, from beginners to advanced players. We have highly trained trainers and state-of-the-art facilities and equipment. We offer 8 Pickleball Permanent Courts, 10 Clay Tennis Courts and 2 Hard Tennis Courts. Contact us to schedule your first class! https://dtitrainingcenter.com Phone: (954) 722-4300 Ext 4 pedro.gomez@dtitrainingcenter.com Fitness Center Brand-new state-of-the-art Matrix equipment; complete cardio and weight gym. Protein smoothies are available before or after your workout. Pool 17,000 square foot pool and sundeck area with lounge chairs and tiki hut coming soon.  Food, drink, and catering services are available at the pool. Banquets and Events Consider the Woodmont Country Club for a worry-free event experience. We have a professional staff ready to help you with all the details and a range of services and partners to ensure your event is a grand success. Contact us and let us help you get the planning underway! The Woodmont Country Club boasts a beautifully furnished banquet facility with capacity for any group and dramatic views. Full-service professional catering staff will pamper you with semi-formal to formal dining packages, and we offer a dramatic sunset staging complete with a backdrop of our ninth hole and pool. Have your special occasion, corporate meeting, charity events, club gatherings, or family reunion at the Woodmont Country Club, and we’ll ensure it’s a success! We can help with any banquet or special meeting needs you may have. We have a complete set of services to make your meeting a success and have planners to assist you to ensure everything goes smoothly. Golf Tournaments and Fundraisers To begin planning your golf tournament at our Woodmont Country Club, just fill out the form on this page. A member of our professional staff will contact you in the coming days and answer all your questions. Woodmont Country Club in Tamarac is the hot spot for golf events in the area. Many local businesses and organizations host their outings and tournaments at our facility. Whatever your needs, we are equipped and ready to serve you. Woodmont Country Club is a full-service golf facility. From the standard outing packages—which include green fees and cart fees—to full catering of breakfast, lunch, dinner, and cocktail parties. When it comes to golf, our professionals know just what it takes to conduct a smooth event. Their years of experience will be evident from the moment you begin planning your event. The rolling terrain of Woodmont Country Club is the only “bump” you are likely to experience with your golf event at our facility. Wide-open spaces, accented by our lightly wooded surroundings make for a perfect backdrop to any outdoor activity. In combination with the simple beauty of our Woodmont Country Club, your guests are sure to remark on how much they enjoyed their time. Make your best impression year after year as you entertain family, friends, or clients in style and comfort at Woodmont Country Club. Use the form above to receive more information about our services. Restaurant and Bar Our restaurant is the perfect way to end your round of golf in our Brand New Clubhouse or at our outdoor patio & bar. Unwind with your favorite beverage from our fully stocked bar while you relax enjoying the natural surroundings. Get In Touch 7801 NW 80th Avenue Tamarac, FL 33321 (954) 722-4300 rschmidt@woodmontcountryclub.net Memberships Available! * Annual * Seasonal * Corporate * Sports * Tennis * Social * Under 40 * Join Now and all Initiation Fees are waived! Call Us Now © 2025 - All Rights Reserved - Disclaimer Website Design & Marketing by OMG National Home About Services Tennis & PickleBall Course Memberships Golf Banquets & Events Facilities Gallery Reviews Contact Meet The Team Gift Cards Close Call Us Today: (954) 722-4300"
    },
    {
      "url": "https://woodmontcountryclub.net/",
      "text": "Premium Golf Club Experience | Tamarac, FL | Woodmont Country Club Skip to content 7801 NW 80th Avenue, Tamarac, FL 33321 (954) 722-4300 Home About Services Tennis & PickleBall Course Memberships Golf Banquets & Events Facilities Gallery Reviews Contact Meet The Team Gift Cards BOOK NOW Your Luxury Country Club in Tamarac, FL Woodmont Country Club is a 27-hole golf and country club in the heart of Broward County. From golf practice facilities, a pool, a tennis center for recreational and high-performance players (13 Har Tru Clay and 1 Hard Court), and a fitness center to a restaurant and bar, you’ll find almost everything you need here. Book a tee time Our Services Golf Services and Other Amenities From golf and tennis to a state-of-the-art fitness center, Woodmont Country Club has everything you need. View our services and amenities below. Golf Tennis Fitness Center Pool Banquets and Events Golf Tournaments Restaurant and Bar Learn More Our Reviews What people are saying At Woodmont Country Club, we strive to provide an exceptional experience for all our guests. Please feel free to take a look at our reviews. View All \"One of the most beautiful golf courses! It is one of the oldest and best golf courses there is. With wonderful staff. I have a lot of memories from this place. My engagement party was held in the Woodmont Country Club banquet hall. Wow how time flies!\" Meryll H. \"Brand new Clubhouse. Food is great. Great bar. Friendly & helpful all around staff. Greens very fees reasonable for in season. Course is in good shape and the greens are immaculate and fast the way I like them. Highly recommend this course.\" Ted D. About Us Fort Lauderdale Fairways and Greens Prepare yourself for an unparalleled golfing experience. Our course is a pleasure for golfers of any skill level to play. Woodmont Country Club will challenge you while providing a relaxing, picturesque backdrop. Test your accuracy with our fairways, water hazards, and sand traps. Our undulating greens challenge your putting touch and reading ability. All in all, our goal is to provide you with a quality experience that includes exceptional service and a comfortable atmosphere. No matter what you’re looking for, chances are you’ll find it here. Woodmont Country Club offers event spaces for tournaments, parties, and even weddings. If you become a member, you’ll receive access to our resort pool, golf practice facilities, fitness center and more. Call us for more information! Learn More Woodmont Country Club Cypress - A Von Hagge and Devlin Designed Golf Course Golfers of any skill level will find something to love at our golf course. From fairways and hazards to sand traps and rolling greens, you’ll find plenty to challenge and delight you. Contact us to book your spot now. Woodmont Country Club Pines 9- A Von Hagge and Devlin Designed Golf Course and updated by Joe Jemsek A full par 36 course that can be played with any other 9 from our famed Cypress Championship Course.  This 9 is both narrow and challenging giving golfers the opportunity to use all their clubs in the bag.  The Pines 9 is perfect for corporate 2-hour golf outings and events. Host Events and Parties Want to host your next big event or party at Woodmont Country Club? We can accommodate a small casual get-together to a formal 300 person event.  If you’re planning a mitzvah, wedding, shower, quinceanera, or other celebration, we would love to host it. Our brand new clubhouse and country club provides luxurious amenities and a beautiful green golf course. Annual and Seasonal Memberships Become a member of Woodmont Country Club with an annual or seasonal membership. Benefits include advanced tee times, practice facilities, fitness center, resort pool access, and more. Join now, and all initiation fees will be waived! Get In Touch 7801 NW 80th Avenue Tamarac, FL 33321 (954) 722-4300 rschmidt@woodmontcountryclub.net Memberships Available! * Annual * Seasonal * Corporate * Sports * Tennis * Social * Under 40 * Join Now and all Initiation Fees are waived! Call Us Now © 2025 - All Rights Reserved - Disclaimer Website Design & Marketing by OMG National Home About Services Tennis & PickleBall Course Memberships Golf Banquets & Events Facilities Gallery Reviews Contact Meet The Team Gift Cards Close Call Us Today: (954) 722-4300 Close this module"
    },
    {
      "url": "https://woodmontcountryclub.net/golf/",
      "text": "Luxury Tamarac, FL, Country Club - Woodmont Country Club Skip to content 7801 NW 80th Avenue, Tamarac, FL 33321 (954) 722-4300 Home About Services Tennis & PickleBall Course Memberships Golf Banquets & Events Facilities Gallery Reviews Contact Meet The Team Gift Cards BOOK NOW Hosting Your Woodmont Golf Tournament Please contact Lee Shapes lshapes@woodmontcountryclub.net 954-722-4300 x1 Getting Started To begin planning your golf tournament at our Woodmont Country Club, just fill out the form on this page. A member of our professional staff will contact you in the coming days and answer all your questions. Woodmont Country Club in Tamarac is the hot spot for golf events in the area. Many local businesses and organizations host their outings and tournaments at our facility. Whatever your needs, we are equipped and ready to serve you. What you can expect Woodmont Country Club is a full-service golf facility. From the standard outing packages which include green fees, cart fees, and great snacks at our snack bar. When it comes to golf, our professionals know just what it takes to conduct a smooth event. Their years of experience will be evident from the moment you begin planning your event. The rolling terrain of Woodmont Country Club are the only “bumps” you are likely to experience with your golf event at our facility. Bringing the fun Wide-open spaces, accented by our lightly wooded surroundings make for a perfect backdrop to any outdoor activity. In combination with the simple beauty of our Woodmont Country Club, your guests are sure to remark on how much they enjoyed their time. Beyond great golf, Woodmont Country Club also offers excellent dining options through various providers in the area. Make your best impression year after year as you entertain family, friends, or clients in style and comfort at Woodmont Country Club. Use the form above to receive more information about our services. WOODMONT TUESDAY LEAGUE Spark is a 9-hole, social golf league organized to be casual and fun, with a touch of friendly competition. Every Tuesday at 5:00pm starting April, 16th by clicking the link below Learn More TOURNAMENT REQUEST Name * First Last Email * Subject * Tournament Inquiry Phone * Zip Code * Event Date * Group Size * Message * Get In Touch 7801 NW 80th Avenue Tamarac, FL 33321 (954) 722-4300 rschmidt@woodmontcountryclub.net Memberships Available! * Annual * Seasonal * Corporate * Sports * Tennis * Social * Under 40 * Join Now and all Initiation Fees are waived! Call Us Now © 2025 - All Rights Reserved - Disclaimer Website Design & Marketing by OMG National Home About Services Tennis & PickleBall Course Memberships Golf Banquets & Events Facilities Gallery Reviews Contact Meet The Team Gift Cards Close Call Us Today: (954) 722-4300"
    },
    {
      "url": "https://woodmontcountryclub.net/course/",
      "text": "Luxury Tamarac, FL, Country Club - Woodmont Country Club Skip to content 7801 NW 80th Avenue, Tamarac, FL 33321 (954) 722-4300 Home About Services Tennis & PickleBall Course Memberships Golf Banquets & Events Facilities Gallery Reviews Contact Meet The Team Gift Cards BOOK NOW Course Details The Tee Times Book Online WOODMONT COUNTRY CLUB CYPRESS Prepare yourself for an unparalleled golfing experience. Our course is a pleasure for golfers of any skill level to play. Woodmont Country Club will challenge you while providing a relaxing, picturesque backdrop. Test your accuracy with our fairways, water hazards and sand traps. Our undulating greens challenge your putting touch and reading ability. All in all, our goal is to provide you with a quality experience that includes exceptional service and a comfortable atmosphere. SCORECARD AND STATS RATES Summer Rates WEEKDAY Rates 7:00 AM – 11:59 AM $55 12:00 PM - 3:00 PM $45 3:00 PM - 4:30 PM $40 4:30 PM - Close $35 WEEKEND Rates. 7:00 AM – 10:59 AM $65 11:00 AM - 2:00 PM $55 2:00 PM - 3:00 PM $45 3:00 PM - 4:30 PM $40 4:30 PM - Close $35 Players age 15 and under receive the Super Twilight rate anytime on weekdays, and after 12:00 PM on weekends. Veterans & First Responders: Receive a special discount with valid credentials. Please contact the Pro Shop for more details. Get In Touch 7801 NW 80th Avenue Tamarac, FL 33321 (954) 722-4300 rschmidt@woodmontcountryclub.net Memberships Available! * Annual * Seasonal * Corporate * Sports * Tennis * Social * Under 40 * Join Now and all Initiation Fees are waived! Call Us Now © 2025 - All Rights Reserved - Disclaimer Website Design & Marketing by OMG National Home About Services Tennis & PickleBall Course Memberships Golf Banquets & Events Facilities Gallery Reviews Contact Meet The Team Gift Cards Close Call Us Today: (954) 722-4300"
    },
    {
      "url": "https://woodmontcountryclub.net/reviews",
      "text": "Reviews - Woodmont Country Club Skip to content 7801 NW 80th Avenue, Tamarac, FL 33321 (954) 722-4300 Home About Services Tennis & PickleBall Course Memberships Golf Banquets & Events Facilities Gallery Reviews Contact Meet The Team Gift Cards BOOK NOW Our Reviews What People Are Saying At Woodmont Country Club, we strive to provide an exceptional experience for all our guests. Please feel free to take a look at our reviews. If you’ve worked with us before, please leave a review to support our business. Thank you. Leave a Review Get In Touch 7801 NW 80th Avenue Tamarac, FL 33321 (954) 722-4300 rschmidt@woodmontcountryclub.net Memberships Available! * Annual * Seasonal * Corporate * Sports * Tennis * Social * Under 40 * Join Now and all Initiation Fees are waived! Call Us Now © 2025 - All Rights Reserved - Disclaimer Website Design & Marketing by OMG National Home About Services Tennis & PickleBall Course Memberships Golf Banquets & Events Facilities Gallery Reviews Contact Meet The Team Gift Cards Close Call Us Today: (954) 722-4300"
    },
    {
      "url": "https://woodmontcountryclub.net/our-gallery/",
      "text": "Gallery - Woodmont Country Club Skip to content 7801 NW 80th Avenue, Tamarac, FL 33321 (954) 722-4300 Home About Services Tennis & PickleBall Course Memberships Golf Banquets & Events Facilities Gallery Reviews Contact Meet The Team Gift Cards BOOK NOW Our Gallery Sneak a peek behind the scenes of Woodmont Country Club in our photo gallery. For more information, just give us a call. Get In Touch 7801 NW 80th Avenue Tamarac, FL 33321 (954) 722-4300 rschmidt@woodmontcountryclub.net Memberships Available! * Annual * Seasonal * Corporate * Sports * Tennis * Social * Under 40 * Join Now and all Initiation Fees are waived! Call Us Now © 2025 - All Rights Reserved - Disclaimer Website Design & Marketing by OMG National Home About Services Tennis & PickleBall Course Memberships Golf Banquets & Events Facilities Gallery Reviews Contact Meet The Team Gift Cards Close Call Us Today: (954) 722-4300"
    }
  ]
}