{
  "fuentes": [
    {
      "url": "https://www.wpsaf.org/about/schools-exhibits/",
      "email": "wpsaf@wpsaf.org"
    },
    {
      "url": "https://www.zapplication.org/event-info.php?ID=12565",
      "email": "contactzapp@wearecreativewest.org"
    },
    {
      "url": "https://www.zapplication.org/event-info.php?ID=12565",
      "email": "zappsales@wearecreativewest.org"
    },
    {
      "url": "https://www.wpsaf.org/info-for-artists/invited-artists/",
      "email": "wpsaf@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/info-for-artists/invited-artists/",
      "email": "artistinfo@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/about/foundation/",
      "email": "wpsaf@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/about/foundation/",
      "email": "foundation@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/support-us/patrons/",
      "email": "wpsaf@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/support-us/patrons/",
      "email": "patrons@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/info-for-artists/artist-application/",
      "email": "wpsaf@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/info-for-artists/artist-application/",
      "email": "artistinfo@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/info-for-artists/artist-application/",
      "email": "ea@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/info-for-artists/artist-application/",
      "email": "friendsofwpsaf@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/info-for-artists/artist-application/",
      "email": "wpsaf@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/info-for-artists/artist-application/",
      "email": "zapp@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/about/about-the-festival/",
      "email": "wpsaf@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/artists/?category=glass",
      "email": "info@axiomglass.com"
    },
    {
      "url": "https://www.wpsaf.org/artists/?category=glass",
      "email": "wpsaf@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/artists/?category=glass",
      "email": "info@andylibecki.com"
    },
    {
      "url": "https://www.wpsaf.org/artists/?category=glass",
      "email": "info@jeffriesglass.com"
    },
    {
      "url": "https://www.wpsaf.org/artists/?category=glass",
      "email": "me@delishglass.com"
    },
    {
      "url": "https://www.wpsaf.org/artists/?category=glass",
      "email": "mikulaglass@sbcglobal.net"
    },
    {
      "url": "https://www.wpsaf.org/artists/?category=glass",
      "email": "starglassworks@comcast.net"
    },
    {
      "url": "https://www.wpsaf.org/artists/?category=glass",
      "email": "vitreousmatter@yahoo.com"
    },
    {
      "url": "https://www.wpsaf.org/artists/?category=glass",
      "email": "warnerwhitfield@mac.com"
    },
    {
      "url": "https://www.wpsaf.org/legal/",
      "email": "wpsaf@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/about/judges/",
      "email": "wpsaf@wpsaf.org"
    },
    {
      "url": "https://the32789.com/2024/03/05/winter-park-sidewalk-art-festival-prepares-for-65th-show/",
      "email": "news@the32789.com"
    },
    {
      "url": "https://www.wpsaf.org/contact/",
      "email": "wpsaf@wpsaf.org"
    },
    {
      "url": "https://www.eventeny.com/events/wpsaf-914/",
      "email": "patrons@wpsaf.org"
    },
    {
      "url": "https://www.eventeny.com/events/wpsaf-914/",
      "email": "victorbokas@bellsouth.net"
    },
    {
      "url": "https://www.wpsaf.org/info-for-artists/dates-and-deadlines/",
      "email": "wpsaf@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/info-for-artists/dates-and-deadlines/",
      "email": "artistinfo@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/info-for-artists/dates-and-deadlines/",
      "email": "zapp@wpsaf.org"
    },
    {
      "url": "https://www.winterpark.org/aaf-plan-your-weekend/",
      "email": "gformosa@winterpark.org"
    },
    {
      "url": "https://www.winterpark.org/aaf-plan-your-weekend/",
      "email": "scox@winterpark.org"
    },
    {
      "url": "https://www.winterpark.org/aaf-plan-your-weekend/",
      "email": "wpcc@winterpark.org"
    },
    {
      "url": "https://www.tampabay.com/archive/1990/10/23/jean-oliphant-founder-of-winter-park-festival/?outputType=amp",
      "email": "licensing@zumapress.com"
    },
    {
      "url": "https://www.wpsaf.org/artists-info/index",
      "email": "wpsaf@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/store/",
      "email": "wpsaf@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/store/",
      "email": "wpsaf@yahoo.com"
    },
    {
      "url": "https://www.wpsaf.org/",
      "email": "wpsaf@wpsaf.org"
    },
    {
      "url": "https://www.wpsaf.org/about/2024-emerging-artists/",
      "email": "wpsaf@wpsaf.org"
    },
    {
      "url": "http://mail.wpsaf.org/artists/waitlist.html",
      "email": "wpsaf@wpsaf.org"
    },
    {
      "url": "https://business.winterpark.org/list/member/the-winter-park-sidewalk-art-festival-5007884",
      "email": "wpcc@winterpark.org"
    }
  ],
  "mails": [
    "artistinfo@wpsaf.org",
    "contactzapp@wearecreativewest.org",
    "ea@wpsaf.org",
    "foundation@wpsaf.org",
    "friendsofwpsaf@wpsaf.org",
    "gformosa@winterpark.org",
    "info@andylibecki.com",
    "info@axiomglass.com",
    "info@jeffriesglass.com",
    "licensing@zumapress.com",
    "me@delishglass.com",
    "mikulaglass@sbcglobal.net",
    "news@the32789.com",
    "patrons@wpsaf.org",
    "scox@winterpark.org",
    "starglassworks@comcast.net",
    "victorbokas@bellsouth.net",
    "vitreousmatter@yahoo.com",
    "warnerwhitfield@mac.com",
    "wpcc@winterpark.org",
    "wpsaf@wpsaf.org",
    "wpsaf@yahoo.com",
    "zapp@wpsaf.org",
    "zappsales@wearecreativewest.org"
  ],
  "nombre_sitio": "wpsaf.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.wpsaf.org/about/schools-exhibits/",
      "text": "Schools Exhibits - Winter Park Sidewalk Art Festival Skip to content Support The Winter Park Sidewalk Art Festival Foundation! Learn More. MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am – 6pm SUN 9am – 5pm Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Facebook-f Twitter Instagram Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact MARCH 21 – 23, 2025 WINTER PARK, FLORIDA MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am-6pm SUN 9am-5pm Home » About » Schools Exhibits Schools Exhibits About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News The Leon Theodore Schools Exhibit Enjoy a Celebration of Youthful Creativity The 2025 Leon Theodore Schools Exhibit Friday & Saturday 9am – 5pm Sunday 9am – 3:30pm Sponsored By: 2025 WINNERS High School Best in Show 2D: Artist: Girmay Buck School: Horizon High School Title: “Listening Completely High School Best in Show 3D: Artist: Livia Vitzel School: Freedom High School Title: “Clowning Around” Middle School Best in Show 2D: Artist: Josie Sylvester School: Trinity Preperatory Title: “Beauty All Around” Middle School Best in Show 3D: Artist: Chloe Jones School: Wedgefield K-8 Title: “Alligator Deer” Open the Complete 2025 Schools Exhibit Winners List! A special thank you to all the supporters of this exhibit, including the Joe and Sarah Galloway Foundation, Sam Flax, the Charles Hosmer Morse Museum of American Art, Orange County Public Schools and the Winter Park Sidewalk Art Festival Foundation. The Winter Park Sidewalk Art Festival has proudly showcased the artists and art programs of Orange County and Winter Park public and private schools since the first festival in 1960. The skillful and unique art works created by these talented students will amaze you. The exhibit is named in memory of Leon Theodore, an inspirational teacher, artist and former member and president of the art festival board. New this year , the student displays are located in the West Meadow between Morse Blvd and New York Ave. The judges for this year’s Schools Exhibit are: Kevin “KV” Abbott was born and raised in the mountains of Vermont. His formal training was in commercial photography and he worked as a studio photographer before serving as a photojournalist in the US Army. His major focus is sculpture and his works have been included in well over 100 solo and group exhibitions and. He maintains seasonal studios in New York and at the Gallery on First in Sanford, Fl. Patrick Noze is a third generation Haitian-born artist who came to the US in 1976. Patrick attended Pratt Institute majoring in fine art with a minor in education. He served as Crealdé School of Art Senior Gallery Curator and now spends his time on private commissions. His primary focus is painting and sculpting. He is involved in the community and serves on the Advisory Council for Art in Cultural Affairs. A central Florida girl, Barbara Tiffany’s background was in commercial art before joining the Crealdé School of Art faculty in 2012 and she served in multiple capacities including manager of the Painting & Drawing program and senior curator for the school’s gallery exhibitions. After retiring she continues teaching adult classes and workshops at the school. Her art is featured in many local public and private collections. PLEASE NOTE: SCHOOL EXHIBIT HOURS DIFFER FROM THE MAIN FESTIVAL! Display hours: Friday & Saturday, opens 9 AM-tent closure at 5 PM; Sunday opens 9 AM-tent closure at 3:30 PM. CLICK HERE TO SEE A LIST OF PARTICIPATING SCHOOLS FOR 2025! Full 2024 Winners List will be posted shortly! Who is Leon Theodore? Leon Theodore taught for Orange County Public Schools at Hungerford High School and then at Edgewater High School until his retirement. He was an exhibiting artist in The Winter Park Sidewalk Art Festival and developed the students’ section where artwork from Orange County private and public schools could be displayed. He was a long-time WPSAF board member and the 1983 president. In 2000, the WPSAF committee changed the name of the student section to the Leon Theodore Schools Exhibit in his honor and memory. He passed away in March, 1999 during the same weekend as the Festival. I began with Mr. Theodore at Edgewater in the 10th grade. I will never forget his first comment on the first day of his classes each year, “If you are sitting in one of my desks because you think this class is going to be an easy A, please get up and get out. I take teaching art very seriously.” I quickly learned that this teacher truly cared about each individual student and showed us how to gain confidence through our own expressions in art. He inspired me in so many ways but mostly because he believed in me.  He always encouraged me and pushed me to do my best. I went on to major in Art Education at Mercer University in Macon, Ga. so that I could give back to students all that he had given to me in my three years at EHS. I am a full-time 3rd – 5th-grade art teacher. And I have every intention of investing in each child just as Mr. Theodore invested in me! I look forward to encouraging them in my art room just as Mr. Theodore encouraged me and so many others that they are countless!  It is my desire to always keep a legacy like the one Mr. Leon Theodore left behind alive! Whenever I see The WPSAF Leon Theodore Schools Exhibit area each year, I am so proud to say, ‘That great man was always my favorite teacher!’ ” …Joanie Forbes, Art Teacher, Park Maitland School, former student of Leon Theodore Leon was a kind, soft-spoken man who was genuinely concerned about the welfare of his students. Though he was small in stature, he was well respected and admired by everyone. He and I were church ushers at St. Margaret Mary Catholic Church in the early 90’s. You might say, “He took care of his pews.” On several occasions, I would see his students’ artwork displayed at the Ronald Blocker Educational Leadership Center. I was impressed by the talent of his students at Edgewater High. He influenced other art teachers in the district to display their students’ work. To this day, veteran art teachers around Orange County reminisce about his integrity and craftsmanship. I considered him a renaissance man for his love and devotion to his craft and his pupils. When I began my teaching career, Leon Theodore was someone I could turn to for advice and counsel. The faculty at Edgewater loved him dearly. I can say for certain that it was a very sad day at school when we heard of his passing. He was a truly remarkable artist, and a human being. It was an honor for me to call him a friend and colleague. Oh yes, one more thing…Leon had a terrific smile which was contagious. I miss him immensely.” ….Douglas K. Loftus, Principal, Acceleration East High School Leon Theodore was not only an accomplished artist, but a talented and dedicated teacher. I remember him as an energetic worker for the WPSAF, he worked very hard on the student exhibits. Leon, Grady Kimsey and I judged many student art exhibitions and contests. He was always kind and had a great sense of humor. I enjoyed spending any time I could with him. ….Ann Clement, Friend Dad was a gentle, kind man who although quiet, stood up for those he cared for. This did not remain with just his family. He applied this concern and love to anyone under his ‘care’. I can remember being angry that I had to share him with the kids in the neighborhood. Little did I know how many kids he touched and influenced. That statement speaks to whom my father was. Each person felt like they were the center of his attention, especially my mother. ….Leon Theodore, Son of Leon L. Theodore Facebook-f Instagram Envelope Contact Us The Winter Park Sidewalk Art Festival P.O. Box 597 Winter Park, FL 32790-0597 (407) 644-7207 WPSAF@wpsaf.org Copyright © 2024 by The Winter Park Sidewalk Art Festival | Privacy Policy | Website by Zgraph Inc. Florida Web Design This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact"
    },
    {
      "url": "https://www.zapplication.org/event-info.php?ID=12565",
      "text": "ZAPP - Event Information - skip to content ZAPP - WHERE ARTISTS & ART FESTIVALS CONNECT MENU WHERE ARTISTS & ART FESTIVALS CONNECT Login Sign Up CLOSE WHERE ARTISTS & ART FESTIVALS CONNECT CLOSE Login Sign Up Events Calendar Events List Help Center About ZAPP ZAPP for Events ZAPP™ Software, LLC, powered by Creative West BACK TO EVENTS Event Information View Event Gallery BACK TO EVENTS View Event Gallery CONTACT EVENT Location: {{location(event)}} REQUIREMENTS: Accepted Application Types: Emerging Artists: This application accepts applications from emerging artists and has an emerging artist program or grant. This application accepts applications from emerging artists. This application does not accept applications from emerging artists. Time Remaining: This event has passed. Favorite Event: Dates & Deadlines {{ event.application_start | moment(\"MMMM D, YYYY\") }} Open Date {{ event.jury_fee_early_end_date | moment(\"MMMM D, YYYY\") }} Early Bird Deadline {{ event.notify_date | moment(\"MMMM D, YYYY\") }} Notification Date {{ event.purchase_deadline | moment(\"MMMM D, YYYY\") }} Purchase Deadline {{ event.event_start | moment(\"MMMM D, YYYY\") }} Event Start {{ event.event_end | moment(\"MMMM D, YYYY\") }} Event End Select a link below to jump to that section GENERAL INFORMATION RULES/REGULATIONS BOOTH INFORMATION REFUND POLICY JURY DETAILS GENERAL RULES BOOTH REFUND JURY EVENT INFORMATION GENERAL INFORMATION RULES/REGULATIONS BOOTH INFORMATION REFUND POLICY JURY DETAILS Share (opens in a new tab) Share (opens in a new tab) View Legal Agreement Terms of Use Contact Us Help Center Commitment to Accessibility | Share Feedback 2004-2025© ZAPP™ Software, LLC | Creative West Events Calendar Events List Blog ZAPP for Events About ZAPP Help Center Contact Us 2025 ZAPP™ Software, LLC | Creative West | Terms of Use Commitment to Accessibility | Share Feedback Facebook icon and link for Zapplication Instagram icon and link for Zapplication Youtube icon and link for Zapplication Contact Email: contactzapp@wearecreativewest.org Your Name: Please enter your name. Email: Please enter a valid email address. Preference: Please select a contact preference Contact me by email Contact me by phone No preference Please select a contact preference Subject: Please select a subject Image Upload Help Checkout Help Show Question Enhancement Suggestion Other Please select a subject Message: Please enter your message Close Send message Contact Email: zappsales@wearecreativewest.org Your Name: Please enter your name. Event Name: Please enter your name. Email: Please enter a valid email address. Phone: Please enter a valid phone number. Preference: Please select a contact preference Contact me by email Contact me by phone No preference Please select a contact preference Message: Please enter your message Close Send message"
    },
    {
      "url": "https://www.wpsaf.org/info-for-artists/invited-artists/",
      "text": "Invited Artists - Winter Park Sidewalk Art Festival Skip to content Support The Winter Park Sidewalk Art Festival Foundation! Learn More. MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am – 6pm SUN 9am – 5pm Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Facebook-f Twitter Instagram Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact MARCH 21 – 23, 2025 WINTER PARK, FLORIDA MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am-6pm SUN 9am-5pm Home » Info For Artists » Invited Artists Invited Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info Invited Artists The 67 th Winter Park Sidewalk Art Festival will be held March 20, 21, and 22, 2026. Application details coming soon. INSTRUCTIONS FOR INVITED ARTISTS: The Winter Park Sidewalk Art Festival 2025 HOW TO RESPOND TO YOUR INVITATION Go to zapplication.org and log in to your ZAPP account. From the “My ZAPPlication” page, please find “The Winter Park Sidewalk Art Festival” and choose “Accept” or “Decline”. If you choose to Accept , go to the “ZAPP ® Shop” in your ZAPP account. Select the booth fee payment of $575.00 (which includes $37.38 FL Sales Tax of 6.5%). Payment is required by midnight, Monday, December 9, 2024 EST. Your application status will be listed as “Confirmed” once you have paid your booth fee. While in your ZAPP account, please go to the “My Profile” section and verify your contact and website information for accuracy. This information will be used to update our show database and for your Booth ID Card, the Website, the Festival programs and other Festival-related media and advertising. It is important for you to maintain the accuracy of your contact information between your acceptance and our show dates in March. For publication use, proper capitalization in your application is appreciated. If you choose to Decline , you may archive your application by going to your “MyZAPPlications” page at zapplication.org and under the “Options” column, click on the green “Archive” link. If you choose to Accept, do not archive your application until after the Festival. HOW TO REQUEST A SPACE You may begin submitting your booth requests tomorrow afternoon (Tuesday, November 5th at 12pm EST). At this time, the form to submit your requests will open. Please refrain from emailing requests before this date/time because you will be asked to resubmit. Early requests will not be accepted. Booth requests will be processed in the order in which they are received. You may preview the questions on the booth request form by clicking HERE . All artists, including returning artists and award winners from last year should submit a booth request. You will not automatically be reassigned to the same booth space. Emerging Artists will have their space automatically assigned in the designated Emerging Artists’ area but should still answer the other questions on the booth request form. If you have been accepted in multiple categories or need any special accommodations, please indicate this on the booth request form. Provide all relevant information on your booth request because once booths are assigned, it will be difficult to make adjustments. Please use only the current park map on our website, as we have made changes from previous years’ layouts and the booth numbers may be different. A printable map of Central Park is available on our website . Click on the “Info for Artists” tab at the top, and then scroll to “Jury & Space Information” on the menu on the left. Please note that power is not available at any booth locations for artists’ use during the show. The deadline to submit your booth preferences is Monday, December 9, 2024 Midnight, EST. Our Policies Regarding Space Assignments are also contained on  our website under “Jury & Space Information”. To request a space, please complete the Google Form linked below (Option 1) OR if you are unable to use the Google Form, you may submit your request via email (Option 2). You may request up to five (5) spaces for your booth placement. As always, we will do our best to honor your request, but cannot guarantee a particular space. Option 1 (preferred): Please complete this Google Form with your booth preferences. Requests will be processed in the order in which they are received. https://forms.gle/D4Hg2ZmsjsyFrCxw8 Option 2: Please send an email to artistinfo@wpsaf.org with your choices and let us know if any of the following special requirements apply to you. Requests will be processed in the order in which they are received. You are accepted in two categories and your spaces need to be contiguous. Your space needs to be adjacent to your participating partner’s space. Your exhibit includes large artwork (e.g. tall sculptures) or your artwork requires that your exhibit face a certain direction (e.g. encaustic wax). Your exhibit includes a particularly tall tent. You have physical limitations or something else that requires special accommodations. HOW TO PROVIDE VEHICLE INFORMATION FOR PARKING Parking near the Festival is limited, but we do our best to allow all artists to park their vehicles as close to Central Park as possible. Our scheduled unloading program will be provided again this year. You will be sent additional information about the unloading program closer to the Festival. To assist us in planning for parking, please provide the following information to artistinfo@wpsaf.org at the time of your acceptance regarding the vehicle you will be bringing to the Festival: Type of vehicle STANDARD car, truck, or van EXTENDED van or truck RV Length of vehicle (if over 19′ long) Length of trailer (if any) Will you be overnighting in your vehicle? Do you intend to park in our lots, or will you make other arrangements? NOTE: Pedestrian walkways from the artists’ parking areas across the tracks are available at the crossings on Morse Boulevard, New England Avenue, and Canton Avenue. Please see the current map on our website. HOW TO PARTICIPATE IN THE HOME HOSTING PROGRAM Housing for artists will be provided in local homes on an as needed and as available basis. Please indicate your interest in the home hosting program, when completing your booth request form and you will be contacted with additional information. The information is also available on our website . Click on the “Info for Artists” tab at the top, and then scroll to “Lodging” on the menu on the left. Alternatively, information about hotel blocks and special room rates will be sent out as it becomes available. IMPORTANT REMINDERS DEADLINE: Midnight, December 9, 2024 (EST) Acceptance and Exhibitor Fee due to ZAPP. Contact and website information verified and corrected in ZAPP. Space Requests (3), with “special requirements” information and Vehicle Parking information submitted via Google Form or artistinfo@wpsaf.org . NOTE : No request for Exhibitor Fee refunds can be accepted after Midnight, December 31, 2024 (EST). Exhibitor fee refunds are subject to a ZAPP processing. Facebook-f Instagram Envelope Contact Us The Winter Park Sidewalk Art Festival P.O. Box 597 Winter Park, FL 32790-0597 (407) 644-7207 WPSAF@wpsaf.org Copyright © 2024 by The Winter Park Sidewalk Art Festival | Privacy Policy | Website by Zgraph Inc. Florida Web Design This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact"
    },
    {
      "url": "https://www.wpsaf.org/about/foundation/",
      "text": "Foundation - Winter Park Sidewalk Art Festival Skip to content Support The Winter Park Sidewalk Art Festival Foundation! Learn More. MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am – 6pm SUN 9am – 5pm Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Facebook-f Twitter Instagram Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact MARCH 21 – 23, 2025 WINTER PARK, FLORIDA MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am-6pm SUN 9am-5pm Home » About » Foundation Foundation About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News The Foundation Founded in 2008, the Winter Park Sidewalk Art Festival Foundation’s mission has been to enhance art appreciation, art education and community spirit.  The Foundation supports The Children’s Workshop, The Leon Theodore Schools Exhibit, The Emerging Artists Program, The Image Review Workshop and Performing Arts at The Winter Park Sidewalk Art Festival.  It also funds the Jean Alice Oliphant Scholarship at Rollins College in Winter Park and The Winter Park Sidewalk Art Festival Scholarship at the University of Central Florida in Orlando. Each year, more than one thousand children take the opportunity to display their creativity though easel painting and the museum workshops report more than 500 children per day take part in the hands-on art activities they provide. Each year more than 4,500 Orange County students have had the thrill of having their artwork showcased and judged at the Leon Theodore Schools Exhibit. In 2023, the Winter Park Sidewalk Art Festival Foundation established the festival’s newest artist award, the Monte Livermore Celebration of Nature Award . This annual cash award was made possible by a generous donation to the Foundation by the Family Members of the Estate of Robert Montbriand Livermore, Jr. (Monte). The award honors the memory of Monte, a beloved past WPSAF Co-President, passionate Patron, and true friend, and is funded by interest generated from the  donation. Monte’s participating family members include Phyllis L. and Fred K. Smith, Laura and Taylor C. Smith, Tammy Smith White and Thomas F. White. The Internal Revenue Service approved the Winter Park Sidewalk Art Festival Foundation, Inc., a Florida not-for-profit corporation, as a 501(c)(3) tax-exempt organization in September 2008. Make a Tax-Deductible Donation Today You can now support the Winter Park Sidewalk Art Festival Foundation via an online donation through Givebutter. You can also mail a check payable to: Winter Park Sidewalk Art Festival Foundation, Inc. P.O. Box 597 Winter Park, FL 32790 For questions about the Winter Park Sidewalk Art Festival Foundation, Inc., please contact us at: phone: 407-644-7207 email: foundation@wpsaf.org . Primary Contributor: The Joe & Sarah Galloway Foundation Key Supporters: Edyth Bush Charitable Foundation Family Members of the Estate of Monte Livermore Cornelia T. Bailey Foundation Rotary Club of Winter Park The Pocket Program FORWARD/SLASH The Winter Park Sidewalk Art Festival Friends of the Foundation: J. McLaughlin Orlando Utilities Commission (honoring Holly Henson) Ira and Anita Shafran Facebook-f Instagram Envelope Contact Us The Winter Park Sidewalk Art Festival P.O. Box 597 Winter Park, FL 32790-0597 (407) 644-7207 WPSAF@wpsaf.org Copyright © 2024 by The Winter Park Sidewalk Art Festival | Privacy Policy | Website by Zgraph Inc. Florida Web Design This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact"
    },
    {
      "url": "https://www.wpsaf.org/support-us/patrons/",
      "text": "Patrons - Winter Park Sidewalk Art Festival Skip to content Support The Winter Park Sidewalk Art Festival Foundation! Learn More. MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am – 6pm SUN 9am – 5pm Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Facebook-f Twitter Instagram Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact MARCH 21 – 23, 2025 WINTER PARK, FLORIDA MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am-6pm SUN 9am-5pm Home » Support » Patrons Patrons Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation About the Patrons Program Our Patrons Program was created to provide support to The Winter Park Sidewalk Art Festival artists through dedicated funds pledged to purchase artwork during our annual show. By participating, Patrons make monetary pledges for given levels of spending. The majority of your funds stay with you to purchase art and the remainder goes to support The Winter Park Sidewalk Art Festival. This financial commitment to the purchase of art generates enthusiasm in the artists’ community and attracts the most outstanding artists who display on the outdoor circuit. We invite you to experience the unique and rewarding opportunity to become a patron of The Winter Park Sidewalk Art Festival. All Patrons are invited to attend special Patron events throughout the year including: Patrons Kickoff Party Poster Unveiling Party Festival Eve Party All amenities in the Patrons Tent during the festival For more information, contact Patrons Chair at patrons@wpsaf.org or leave a voice message at the Winter Park Sidewalk Art Festival voice mail system 407-644-7207. Patrons Registration TO PAY BY MAIL: Download the Patron Registration Form and return with your check or credit card information. TO PAY BY CREDIT CARD: Click here to access the online Patron Registration Form. Once you submit the form, you will be taken to a page with a Square payment link and instructions on how to complete payment with your credit card. Thank you for supporting the 2026 Winter Park Sidewalk Art Festival as a Patron! Thanks for supporting the 2026 Winter Park Sidewalk Art Festival as a Patron! Facebook-f Instagram Envelope Contact Us The Winter Park Sidewalk Art Festival P.O. Box 597 Winter Park, FL 32790-0597 (407) 644-7207 WPSAF@wpsaf.org Copyright © 2024 by The Winter Park Sidewalk Art Festival | Privacy Policy | Website by Zgraph Inc. Florida Web Design This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact"
    },
    {
      "url": "https://www.wpsaf.org/info-for-artists/artist-application/",
      "text": "Artist Application - Winter Park Sidewalk Art Festival Skip to content Support The Winter Park Sidewalk Art Festival Foundation! Learn More. MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am – 6pm SUN 9am – 5pm Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Facebook-f Twitter Instagram Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact MARCH 21 – 23, 2025 WINTER PARK, FLORIDA MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am-6pm SUN 9am-5pm Home » Info For Artists » Artist Application Artist Application General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info The 67 th Winter Park Sidewalk Art Festival will be held\nMarch 20, 21, and 22, 2026. APPLICATION DETAILS COMING SOON! Location: Central Park and along Park Avenue in Downtown Winter Park, Florida Phone: 407-644-7207 (Voice Message System) (No Texting) Website: www.wpsaf.org Show Dates: March 20 – March 22, 2026 Application Available on ZAPP: Friday, August 1, 2025 Application Deadline: Tuesday, September 23, 2025 Zapplication Link: https://www.zapplication.org/event-info.php?ID=13546 EVENT SUMMARY The 67 th Annual Winter Park Sidewalk Art Festival is one of the nation’s oldest and most prestigious juried fine art shows. It consistently ranks among the most highly regarded outdoor art shows in the nation, with cash awards totaling $76,500 and dedicated Patron purchase funds expected to be over $100,000.  In 2021, the festival was named #4 Best Show of All Times in Sunshine Artist’s national poll of All Time Favorites. In 2024 the festival ranked #8 in the USA Today Readers’ Choice, 10 Best Art Festivals contest. The show is located in historic downtown Winter Park, Florida, nestled throughout Central Park and stretching along Park Avenue. The event takes place on March 20 – March 22, 2026, in the heart of this charming city. Attendance at the Festival is expected to reach over 250,000 people who will view the artwork of 215 artists and 3 emerging artists. One of Central Florida’s largest annual outdoor events, the Festival also features a wide variety of entertainment on the stage in Central Park, food and beverage to please the whole family, a popular exhibit of student art from Central Florida schools, and many interactive arts for the kids. A portion of the Festival’s proceeds is donated to The Winter Park Sidewalk Art Festival Foundation to fund scholarships through the Jean Alice Oliphant Scholarship at Rollins College and The Winter Park Sidewalk Art Festival Scholarship at the University of Central Florida. CONTACT INFORMATION The Winter Park Sidewalk Art Festival, P.O. Box 597, Winter Park, FL 32790-0597 Voice message system (No Texting): 407-644-7207 Website: wpsaf.org Zapplication Link: https://www.zapplication.org/event-info.php?ID=13546 Application questions: zapp@wpsaf.org General questions: wpsaf@wpsaf.org Artist questions: artistinfo@wpsaf.org Emerging artists: ea@wpsaf.org Facebook: https://www.facebook.com/WinterParkSidewalkArtFestival Instagram: @winterparksidewalkartfestival GENERAL INFORMATION Four (4) Images:  Three (3) of artwork with no signatures or initials & One (1) booth image of your current artwork created after 2020 with no identifying markers such as signage, booth cards, and people. Each artwork image must show the year the artwork was created on the application, not on the submitted images , or it will be marked incomplete. If selected to exhibit, the Artist’s body of work must be substantially the same as shown in their images.  Non-compliance with this requirement may result in expulsion from the show. You may submit applications in up to three (3) different categories for this show, but only two (2) entries may be accepted. Must be at least eighteen (18) years of age to apply. Application Fee:  $45.00 (Non-refundable) IMPORTANT DATES Friday, August 1, 2025 Application available on ZAPP Tuesday, September 23, 2025 Application deadline to ZAPP, by Midnight, EST. Requirements: 4 images (3 artwork, 1 booth) with no identifying markers Saturday, October 25, 2025 ZAPP Screening at (Location TBD). Open to all applicants and the public 8:30 am to 4 pm Monday, November 3, 2025 Notification of Screening results from ZAPP emailed on or before this date Tuesday, December 9, 2025 Acceptance and Exhibitor/Booth Fee through ZAPP by Midnight, EST Tuesday, December 9, 2025 Booth requests deadline for invited artists. Fill out the form or email to artistinfo@wpsaf.org by Midnight, EST. See Invited Artists page for more Booth Request details. Wednesday, December 31, 2025 Exhibitor/Booth Fee refund request deadline. Email to zapp@wpsaf.org by Midnight, EST. Exhibitor/Booth Fee refund is subject to an administrative fee of $35.00 Thursday, March 19, 2026 Spaces located in Central Park may be set up AFTER 8:30 am. Check in with Headquarters before set-up. Headquarters is open 7 am – 6 pm (NW corner of Park Ave & Morse Blvd) Friday, March 20, 2026 Spaces located along Park Avenue may be set up AFTER 5 am. Check in with Headquarters or Space Assignment Committee before set-up. Headquarters is open from 5 am to 6 pm. (NW corner of Park Ave & Morse Blvd) March 20, 21 and 22, 2026 (Friday, Saturday and Sunday) The 67th Annual Winter Park Sidewalk Art Festival hours Friday and Saturday, 9 am – 6 pm Sunday, 9 am – 5 pm ARTISTS’ AMENITIES Artists’ Hospitality Center with refreshments – open daily from 8am – 4 pm Limited free artists’ parking; Improved for 2026 Artist Housing Program Booth sitting staffed by volunteers available on call Artist Care Team – several visits each day Saturday Night Artists’ Party (Dinner & Awards Presentation) Art Festival Magazine distributed at event and archived on website Artists’ Gallery on website Security patrol after hours Extensive media promotions throughout Central Florida leading up to and during the Festival Artists retain all sales proceeds AWARDS – TOTAL OF $76,500 Best of Show: Purchase Award, $12,000 Edyth Bush Charitable Foundation Art of Philanthropy : Purchase Award, $5,000 The Charles Hosmer Morse Museum Award for Distinguished Work of Art: $2,500 The Monte Livermore Celebration of Nature Award, $2,000 Ten Awards of Excellence: $2,000 each Twenty Awards of Distinction: $1,000 each Thirty Awards of Merit: $500 each In addition, Patron Program purchases are estimated to exceed $100,000 this year THE JUDGES AND THE JUDGING PROCESS The jurist panel consists of three (3) independent judges, selected from across the country for their in-depth knowledge and experience in multiple art media. In October, they will review the digital images of all applicants to select the Festival artists and the Wait List artists. In March, the same jurist panel will review the work of the exhibitors to determine those artists they consider eligible for awards. Judging of the awards is based upon the overall quality of the artwork exhibited. After a booth is selected by a judge, the artist is responsible for selecting one piece for Saturday’s awards processing that best represents their entire body of work. Previous WPSAF award-winning artwork is not eligible for an award. The Best of Show, The Charles Hosmer Morse Museum Award for Distinguished Work of Art, and The Monte Livermore Celebration of Nature Award are presented for individual works. Awards are presented solely at the discretion of the judges.  The Edyth Bush Charitable Foundation Art of Philanthropy is determined separately. 2026 JUDGES The names and bios of the judges will be posted on our website at www.wpsaf.org under the About the Festival tab. APPLICATION INSTRUCTIONS IMPORTANT It is critical that each accepted and wait-listed artist maintains an accurate and up-to-date artist’s profile in ZAPP through March 2026, especially telephone, email, website, and postal mail. In addition, it is important to check your e-mail often as all acceptances and pertinent Festival information will be communicated electronically. TO APPLY Applications to The 67 th Winter Park Sidewalk Art Festival will be available through ZAPP at https://www.zapplication.org/event-info.php?ID=13546 between Friday, August 1 and Tuesday, September 23, 2025, Midnight, EST .  Screening order is established by the date your completed application is marked “Received” in ZAPP within your medium category. Artists may apply only once in a category and in a maximum of three (3) different categories but only if the work is substantially different in medium and technique. REMINDER – FAMILY-ORIENTED EVENT The Festival is a family-oriented event and exhibits must be in keeping with this atmosphere.  Artwork featuring nudity must portray the human body in a respectful and non-exploitative manner.  The Festival retains the right to regulate various aspects of the booth display including, but not limited to, number of pieces of artwork, size and number of bins, and overall placement within the allotted space. IMAGES You must submit four (4) images: Three (3) current artwork images ( with no visible signatures or initials ), and One (1) booth image with your current artwork displayed. Your booth image should not have any identifying markers. That means no signatures, no booth cards, no signage, and no people or pets should be shown in the photo. Each artwork image must show the year the artwork was created on the application, not on the submitted images , or it will be marked incomplete PLEASE NOTE Your application will be rejected if these rules are not followed, and the Application Fee will not be refunded.  Excellent guidelines labeled Image Preparation may be found in ZAPP. Only images submitted in the ZAPP format can be used in the Festival program and publicity. Your #1 image may be used in the Festival program, on the website and other Festival-related media. SPECIAL NOTICE:  2025 FESTIVAL AWARD WINNERS Winners of the 2025 Best of Show Award, the Edyth Bush Charitable Foundation Award, The Charles Hosmer Morse Museum Award, The Monte Livermore Celebration of Nature Award, Awards of Excellence and Awards of Distinction are invited to return in their awarded categories without being juried . To confirm your participation in The 2026 Winter Park Sidewalk Art Festival™, returning award winners must submit an application to ZAPP by Tuesday, September 23, 2025, Midnight, EST and pay the Exhibitor/Booth Fee of $575.00 through ZAPP by Tuesday, December 9, 2025, Midnight, EST. A coupon code will be emailed to returning artists to avoid the $45.00 application fee. APPLICATION BY COLLABORATING ARTISTS Collaborating artists may apply as a single entry only. No more than two (2) artists working as a team may collaborate in the design and creation of any artwork submitted with the application or selected to display at the Festival. Assistants, employees, office or other support staff are NOT considered to be collaborators. If an artist has a helper who assists the artist with frames, setup, selling, paperwork, etc., but he/she is NOT producing the work under his/her own or team name, this person is NOT a collaborator, though he or she may certainly assist you at the Festival. If selected, only one (1) booth space will be issued, and only finished work that is the result of the collaborative process may be displayed and sold. BOTH artists are required to sign in and present photo identification prior to setting up. BOTH artists must be present during Festival hours in the booth during the entire three-day Festival, except for short breaks. APPLICATION IN THREE CATEGORIES NOTE:  Artists may not apply twice in the same category. Artists may apply in a maximum of three (3) different categories (one entry per category). If applying in more than one category, the work in each must be substantially different in medium and technique. An artist may be selected in a maximum of two (2) categories. If an artist is invited and accepts in two (2) categories, separate adjacent spaces will be assigned, one (1) space for each category. The artist may not display artwork from two categories in one booth. If an artist is accepted in one category and then invited from the waitlist in another category, the Committee will make every effort to assign adjacent spaces; however, if booths have already been assigned, there is no guarantee adjacent spaces will be available. Selection is by the jury process only. The decisions of the judges are final. WAIT LIST Placement on the Wait List is determined by the jury process and is based first on a point score in a category and then by the date the completed application is received in ZAPP.  Upon a cancellation, all attempts are made to replace medium for medium. If that is not possible, vacancies will be filled by the highest scores remaining in other categories, in order to achieve a balanced show. You will be contacted when a space becomes available. There is no need to contact us. If you do not wish to remain on the Wait List, please contact us by email at artistinfo@wpsaf.org. ARTIST HOUSING PROGRAM Housing for artists is available in local homes on a limited basis.  Application for housing will be provided after acceptance and payment of your Exhibitor/Booth Fee. For more information, email: friendsofwpsaf@wpsaf.org . CATEGORIES Awards are given regardless of category. Categories are used for jurying purposes only. It is the artist’s responsibility to enter in the appropriate category. Artists may apply only once in a category. Refunds will not be given for applying twice in the same category. IMPORTANT ALL WORK MUST BE ORIGINAL AND SIGNED BY THE ARTIST. IN APPLICABLE CATEGORIES, ARCHIVAL QUALITY MATERIALS* MUST BE USED (I.E., HIGH QUALITY MATERIALS THAT ARE MEANT TO LAST A LONG TIME) . EDITIONS MUST BE LIMITED TO 250. CLAY Three-dimensional clay and porcelain work created by the artist. Jewelry is not included in this category. Work may not be machine-made or mass-produced. DIGITAL ART Works may be created using digital technology or by using digital programs to significantly manipulate or alter source material(s) such as scans or digital files.  Artwork must be original in conception and adhere to copyright and appropriation guidelines.  Work created by or with the aid of Artificial Intelligence is not permitted.  Works must be in limited editions, signed and numbered no greater than 250 including all sizes , using only archival quality materials* (see description above). Digital Art prints must be made from the artist’s original digital file under the artist’s supervision. DRAWINGS & PASTELS Two-dimensional works created by the artist using dry media including chalk, charcoal, pastels, pencils, wax crayon, or from the fluid medium of inks and washes, applied by pen, brush, or other tools for mark-making. Work must be created with archival quality materials* (see description above) and properly signed. EMERGING ARTIST This category is restricted. Artists applying as an Emerging Artist may not also apply in other categories. The Emerging Artist Program is designed specifically for outstanding new artists (18 years or older) who are just beginning their careers in the art world and who do not have an established record as a professional artist showing their work in museums, art centers, major galleries or juried outdoor art festivals.  These applicants will not need a booth image, a fourth image of artwork is required in its place.  A special code for Emerging Artists to use when applying through ZAPP is listed on our web site. If you are unable to enter the special code, please contact us. We reserve the right to pre-screen and research Emerging Artist applicants to make sure they are a fit for this category and that they do not have extensive experience exhibiting and selling their work. Visit the Festival website for complete details. Use this link, www.wpsaf.org under the “For the Artists” tab. Or find it at www.wpsaf.org/artists/emergingartists. FIBER Two-dimensional and three-dimensional work that is wearable and non-wearable and created from fibrous materials. This category includes but is not limited to baskets, books, embroidery, paper, quilts, weavings, felting, etc.  All work must be original in conception and created by the artist. No commercial or mass production works are permitted, regardless of additional modifications or enhancements by the artist. GLASS Three-dimensional work created by the artist in glass.  Techniques include but are not limited to blowing, kiln-casting, fusing, slumping, or flame-working.  No molds or other forms of mass production are permitted. JEWELRY Jewelry created by the artist without the use of commercial casts, molds, kits or a production studio, regardless of medium. Jewelry created solely through the stringing of commercially available beads and similar materials on wire, string or cord, with no elements created by the artist, is not permitted.  Only those artists accepted in the jewelry category may display or sell jewelry. LEATHER Three-dimensional handmade work designed by and created by the artist with leather. METAL Two-dimensional or three-dimensional artwork created by the artist through the forging, twisting, sculpting or fabricating of various metals.  No commercial or mass production works are permitted, regardless of additional modifications or enhancements by the artist. MIXED MEDIA – 2D Two-dimensional, one-of-a-kind works created by the artist in which the primary intent is the union of two (2) or more physical art mediums or materials.  Artwork must be original in conception and adhere to copyright and appropriation guidelines. Mixed Media categories are to be mixtures of physical media only. A digitally printed piece that combines photographs, sketches, and digital manipulation before being printed is not considered Mixed Media . For pieces that feature highly manipulated digital photography, see the Digital Art category. MIXED MEDIA – 3D Three-dimensional, one-of-a-kind works created by the artist in which the primary intent is the union of two (2) or more physical materials.  Artwork may include but is not limited to assemblage or sculpture. PAINTING Two-dimensional work created by the artist with pigment including oils and acrylics, as well as egg tempera, casein, alkyd, encaustic (excluding watercolor). Work must be created with archival quality materials* (see description above) and properly signed. PHOTOGRAPHY Two-dimensional work created by the artist that includes digital and film photography that has not been manipulated to achieve results beyond what could be produced in a traditional dark room. Hand-colored photography and emulsion transfers are accepted in this category. Only the artist’s original source material is acceptable. Work must be printed by the artist or under the artist’s supervision in limited editions no greater than 250 inclusive of all sizes , properly signed and numbered on archival quality materials*(see description above). Signage of an overtly commercial nature listing the availability of numerous sizes, print surfaces and/or framing options is prohibited. PRINTMAKING Two-dimensional printmaking is a transfer process of producing original art, usually in multiples. Printed original works are hand manipulated by the artist using etching, engraving, silk-screening, stone and plate lithography, linoleum block or woodcut, etc., which have been properly signed and numbered as a limited edition no greater than 250 using archival quality materials*(see description above). SCULPTURE Three-dimensional artwork primarily using a single medium, such as shaping figures in the round or in relief, chiseling marble, modeling clay, casting metal, or constructing from various materials.  No forms of commercial, mass-produced, or enhanced items not made by the artist are permitted. WATERCOLOR Two-dimensional work created by the artist with watercolors using archival quality materials* (see description above). WOOD Two-dimensional or three-dimensional work created by the artist that is hand-tooled, machine-worked, built-up, turned or carved in wood. RULES & REGULATIONS Please read the entire application completely, including this important section. ARTIST STATEMENT All exhibitors must prominently display their Artist Statement in their booths. These Artist Statements must describe the technique, materials, and processes used in the creation of the entire body of work. The Artist Statement display may not be any larger than 9” by 12”. Collaborators must describe each member’s involvement in the creation of the artwork in their Artist Statement. COMMITMENT A completed ZAPP application and full payment of the booth fee is a commitment to show in your selected category (categories) and to abide by the Festival rules. Artist, and collaborator if applicable, must be present at all times during the three-day Festival. EXHIBIT SPACE Each space measures 10’ by 12’. The artist’s display, including booth and viewing bins, must be contained within this space. An artist may have only one (1) single space, except in cases of two (2) category acceptances. The work of only one (1) artist may be displayed in each assigned space. A minimum of six (6) pieces must be displayed. The Festival retains the right to regulate various aspects of the booth display including, but not limited to, number of pieces of artwork, size and number of bins, and overall placement within the allotted space. The Festival is a family-oriented event, and exhibits must be in keeping with this atmosphere. THE FOLLOWING ARE PROHIBITED: Reproductions of original artwork Copies of original artwork and works reproduced or copied from works of masters, advertisements, commercial or widely circulated photographs or offset prints Work purchased from an outside source for resale Production artwork in any category Work created by kits, manufactured or kit jewelry, art supplies, commercial signage or displays, decoupage and ceramics cast from commercial molds Traditional crafts such as soaps, candles, scented oils, homemade food items and simple skill crafts should not be entered into this event Mass-produced note cards, commercial books, etc. Framing in the Park Artwork not in the category in which the artist applied and was accepted Unsigned artwork or work not using archival materials Creation or demonstration of artwork in the Park Alcohol or sound systems Pets Generators ORIGINAL ART vs. REPRODUCTION POLICY Only original artwork is allowed at the Festival.  No reproductions will be permitted. A reproduction is considered to be a piece that is copied by digital or photographic means and printed on an offset press, serigraph press, or through a computer by means of an inkjet or electrostatic printer.  This includes giclee prints. All prints in the Digital Art or Photography category must be printed by the artist or under the artist’s supervision in limited editions no greater than 250 including all sizes, properly signed and numbered on archival materials. AI-GENERATED ART POLICY The Winter Park Sidewalk Art Festival prohibits the sale of AI-prompted artworks. We are committed to providing a safe space where artists can showcase and sell their original works. We are committed to striking the right balance between enabling our artists to leverage new creative tools and technologies while ensuring that The Winter Park Sidewalk Art Festival remains a marketplace known for its original artworks created by real artists. To maintain the integrity and authenticity of the art displayed at our event, we have established the following policies regarding the use of AI in creating artwork: Originality Requirement: All artwork must be original and created by the artist. While we allow the use of AI tools during the preliminary stages of creation, the final artwork output must be the artist’s work and not solely generated by AI. AI Tool Usage: Artists may use AI tools to assist with brainstorming, generating ideas, or creating initial drafts. However, the final piece should be significantly transformed and developed beyond what the AI produced. This transformation should reflect the artist’s individual creativity, style, and effort. Disclosure: If AI tools were used at any stage of the creation process, artists must disclose this information in the description of their artwork. Transparency about the use of AI helps maintain trust and integrity within our community. Prohibited Content: Uploading artwork that is entirely generated by AI without significant human modification is PROHIBITED. Respect for Copyrights: Artists must ensure that any AI tools used do not infringe on existing copyrights or intellectual property rights. The use of AI-generated content that replicates or closely mimics existing works is not allowed. Review Process: Our team reserves the right to review and assess the originality of artwork. If an artwork is found to violate our AI policy, it may be removed from the artist’s exhibit. CERTIFICATE OF AUTHENTICITY We encourage artists to provide their buyers with a Certificate of Authenticity stating that the artwork is an original, unique piece. IMPORTANT During The 67th Winter Park Sidewalk Art Festival all displays will be visited by the Viewing Committee to ensure that the displays and artwork comply with Festival rules. It is our exclusive right and responsibility to ensure all art displayed at the Festival is in compliance. An Officer of the Festival will make the final decision.  Non-compliance can result in expulsion and will result in ineligibility for judging, awards and future Festival participation. The Festival reserves the right to refuse invitation to any applicant found to be in violation of our rules at any point during the admission process. FEES $45.00 Application Fee paid through ZAPP by Tuesday, September 23, 2025, Midnight, EST . This application fee is not refundable. $575.00 Exhibitor/Booth Fee paid through ZAPP by Tuesday, December 9, 2025, Midnight, EST. No refund of Exhibitor/Booth Fee will be made for cancellation after Wednesday, December 31, 2025, Midnight, EST .  Exhibitor/Booth Fee refund is subject to an administration fee of $35.00. There is no commission charged by the Festival on any art sales. SPACE REQUESTS Space requests are determined by date of confirmed (paid in full) application and the returning 2025 award winners within each category. Your timely email response will greatly assist the committee in completing the park layout before the holidays. Upon being extended an invitation to exhibit in The 67th Winter Park Sidewalk Art Festival, your application status will change to confirmed only after your acceptance and payment of the $575.00 Exhibitor/Booth Fee. At that time, refer to the site map available at Festival Maps and email three (3) space preferences to artistinfo@wpsaf.org by our deadline of Tuesday, December 9, 2025, Midnight, EST. The WPSAF Policies Regarding Space Assignments are posted in full on the website under “Jury & Space Information”. Booth requests will be processed in the order in which they are received. Invited artists will receive an email with detailed instructions for how to submit a booth request. All artists, including returning artists and award winners from the previous year should submit a booth request. You will not automatically be reassigned to the same booth space. Emerging Artists will have their space automatically assigned in the designated Emerging Artists’ area. If you have been accepted in multiple categories or need any special accommodations, please indicate this on the booth request form. Provide all relevant information on your booth request because once booths are assigned, it will be difficult to make adjustments. Please use only the current park map on our website, as we have made changes from previous years’ layouts and the booth numbers may be different. A printable map of Central Park is available on our website. Click on the “Info for Artists” tab at the top, and then scroll to “Jury & Space Information” on the menu on the left. Changes made to Central Park by the City of Winter Park in the Festival area may result in the layout being changed without notice. LOAD-IN & SETUP INFORMATION Detailed setup and load-in information (including the load-in route, parking and check-in locations, and reservation times) will be shared in advance of the Festival. Please note that artists with booths in the park will set up on Thursday, March 19, 2026 while artists on the street will set up on Friday, March 20, 2026. CRITICAL CHECK-IN DEADLINES Artists with booths in the park must check in at Festival Headquarters by 6:00 PM ET on Thursday, March 19, 2026 Artists with booths on the street must check in at Festival Headquarters by 7:00 AM ET on Friday, March 20, 2026. NO CALL – NO SHOW POLICY If you anticipate arriving later than your check-in deadline, you must notify the Committee via phone (407-644-7207) or email (artistinfo@wpsaf.org) before the deadline. Failure to communicate may result in the forfeiture of your acceptance and your replacement by an artist from our waitlist. TAX Each artist is responsible for collecting and reporting Florida Sales Tax on all sales made during the Festival. The current tax rate for Florida/Orange County is six and one-half percent ( 6.5% ).  Reporting forms will be provided by Florida Department of Revenue at check-in or may be obtained at http://dor.myflorida.com/Pages/forms_index.aspx . OTHER If you need assistance before, during, or after the Festival (i.e., unloading, set-up, take-down, etc.) due to a disability, please let us know and we will be happy to make arrangements to help you. FEES & REFUNDS $45.00 Application Fee paid through ZAPP by Tuesday, September 23, 2025, Midnight, EST. This application fee is not refundable. $575.00 Exhibitor/Booth Fee paid through ZAPP by Tuesday, December 9, 2025, Midnight, EST. No refund of Exhibitor/Booth Fee will be made for cancellation after Wednesday, December 31, 2025, Midnight, EST. Exhibitor/Booth Fee refund is subject to an administration fee of $35.00. There is no commission charged by the Festival on any art sales. CODE OF CONDUCT The Winter Park Sidewalk Art Festival is committed to nurturing and maintaining a positive and inclusive environment where exhibitors, visitors, patrons, suppliers, sponsors, board members and volunteers can all engage respectfully and professionally. To ensure a safe and successful festival we ask that all participants adhere to the following principles: Conduct yourself with professionalism in all interactions. Treat everyone with courtesy and respect. Follow all applicable safety procedures, application rules, and local laws at all times. Be considerate of the diverse backgrounds, experiences and beliefs of others. Report any uncomfortable, unsafe or unacceptable behavior to a member of The Winter Park Sidewalk Art Festival staff. Unacceptable behavior includes, but is not limited to: Harassment, bullying, or discrimination of any kind – whether verbal, physical, or visual. Being under the excessive influence of alcohol or other substances. Engaging in any illegal activity. Failing to follow safety procedures, festival policies as outlined in the application, local laws, or instructions from a member of the festival staff. The Winter Park Sidewalk Art Festival is committed to addressing any concerns swiftly and appropriately. If someone engages in unacceptable behavior and does not commit to change, they will be asked to leave and may not be permitted to return. Whether any conduct is in violation of this policy is determined by WPSAF in its sole discretion. The festival reserves the right to take further action, including reporting to authorities if necessary. The Winter Park Sidewalk Art Festival’s Code of Conduct has been put in place to ensure that that our event will continue to be an enjoyable and safe experience for everyone who attends. LEGAL AGREEMENT I hereby submit an application to become an exhibitor in The 67 th Winter Park Sidewalk Art Festival™. Submission of my ZAPP application confirms my commitment to abide by the Festival rules and regulations as established by the Festival Committee and the City of Winter Park. By submitting an application, I, and my co-artist (collaborator), if applicable, hereby and forever discharge The Winter Park Sidewalk Art Festival™, Winter Park Art Festival, Inc., Winter Park Sidewalk Art Festival Foundation, Inc. and the City of Winter Park, Florida, of and from all manner of actions, suits, and damages, claims and demands, whatsoever in law or equity, from any loss and damage to the undersigned’s property while in the possession, supervision or auspices of The Winter Park Sidewalk Art Festival™, Winter Part Art Festival, Inc., Winter Park Sidewalk Art Festival Foundation, Inc., the City of Winter Park, their agents, representatives or employees. I warrant that: The artwork submitted for jurying and the artwork to be displayed in my booth are all original work that are both designed and executed by my own hands since 2020 . If produced with a collaborator, the work is made solely by my collaborator and me with our own hands. There is no production studio associated with any of the work to be sold in my booth. The work in my booth is not purchased from an outside source for resale at The Winter Park Sidewalk Art Festival™. There are no reproductions or enhanced/embellished reproductions in my booth. If selected to exhibit at The Winter Park Sidewalk Art Festival™, the festival has no liability for lost, damaged or stolen artwork.  Artists are required to carry liability insurance and include The Winter Park Sidewalk Art Festival as additional insured. If selected to exhibit at The Winter Park Sidewalk Art Festival™, I authorize use of the images submitted with my application or duplicates thereof for Festival publicity or documentation. I agree to grant a license to The Winter Park Sidewalk Art Festival™ to reproduce electronically, in limited resolution, my original artwork for a period of up to thirty (30) months beginning Wednesday, January 1, 2026. I understand by submitting an application, I retain full copyright of my original artwork. My images shall not be redistributed except as anticipated on the website and in the Festival programs and other Festival related media, without my express written permission. A confirmed application in ZAPP and full payment of the Exhibitor Fee is a commitment to show in my selected category (categories) and to abide by the Festival rules. No refund of the Exhibitor Fee will be made for cancellation after Tuesday, December 31, 2025, Midnight, EST. Exhibitor Fee refund is subject to an administrative fee of $35.00. The Winter Park Sidewalk Art Festival™ reserves the right to make final interpretation of all rules. Facebook-f Instagram Envelope Contact Us The Winter Park Sidewalk Art Festival P.O. Box 597 Winter Park, FL 32790-0597 (407) 644-7207 WPSAF@wpsaf.org Copyright © 2024 by The Winter Park Sidewalk Art Festival | Privacy Policy | Website by Zgraph Inc. Florida Web Design This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact"
    },
    {
      "url": "https://www.wpsaf.org/about/about-the-festival/",
      "text": "About The Festival - Winter Park Sidewalk Art Festival Skip to content Support The Winter Park Sidewalk Art Festival Foundation! Learn More. MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am – 6pm SUN 9am – 5pm Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Facebook-f Twitter Instagram Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact MARCH 21 – 23, 2025 WINTER PARK, FLORIDA MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am-6pm SUN 9am-5pm Home » About » About The Festival About The Festival About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News The 67th Winter Park Sidewalk Art Festival Where: Central Park and along Park Avenue in Winter Park When: March 20, 21, 22, 2026 Festival Hours : 9 a.m. – 6 p.m., Friday and Saturday; 9 a.m. – 5 p.m., Sunday Schools Exhibit Hours: 9 a.m. – 5 p.m, Friday and Saturday; 9 a.m – 3:30 p.m., Sunday The Winter Park Sidewalk Art Festival is one of the nation’s oldest, largest and most prestigious outdoor art festivals. The festival debuted in March 1960 as a community project to bring local artists and art lovers together. It’s produced by an all-volunteer board and draws up to 250,000 visitors each year. More than 1000 artists from around the world applied for this year’s event. An independent panel of three judges select the artists that will exhibit their works. The festival consistently ranks among the top juried fine-art festivals in the country. In ArtFairCalendar’s list of Best Art Fairs we rank: #1 in the South and #6 in America Other national accolades include: #8 in Art Fair SourceBook’s 2025 festival rankings by artist sales #6 in Sunshine Artist’s Top 200 from 2010-2020, a 10-year ranking of the nation’s most profitable art shows #3 All Time Favorite Festival in Sunshine Artist’s recent national survey About The Festival CATEGORIES The festival features a wide variety of fine arts and crafts in the following categories: clay, digital art, drawings and pastels, fiber, glass, graphics and printmaking, jewelry, leather, metal, mixed media-2D, mixed media-3D, painting, photography, sculpture, watercolor and wood as well as an Emerging Artists category. AWARDS Artists compete for 64 awards totaling $76,500. The Best of Show purchase award was increased in 2019 to $12,000. The festival donates the winning work to the City of Winter Park, and all are on permanent display at the Winter Park Public Library. A $5,000 “Art of Philanthropy” Purchase Award is sponsored by the Edyth Bush Charitable Foundation, while a $2,500 “Distinguished Work of Art” Award is presented through the Charles Hosmer Morse Museum of American Art. New in 2023 is a $2,000 annual “Monte Livermore Celebration of Nature Award”. There are 10 Awards of Excellence of $2,000 each, 20 Awards of Distinction of $1,000 each and 30 Awards of Merit of $500 each. MUSIC AND ENTERTAINMENT Join us at the stage in north Central Park on Friday the 21st when the Winter Park Sidewalk Art Festival presents a selection of musical entertainment. Visit our Music and Entertainment page for more details! MERCHANDISE Winter Park Sidewalk Art Festival T-shirts and other memorabilia are available at three merchandise sales tents. The tents are located at the south entrance (Park and New England avenues), at the center intersection (Morse Boulevard and Park Avenue), and at the north entrance (Park and Garfield avenues). Posters will be sold at the three merchandise tents, while a vintage poster & merchandise tent will be located across the mulch path next to the festival headquarters at Park Avenue and Morse Boulevard. CHILDREN’S WORKSHOP Girls and boys can create their own artwork at the Children’s Workshop.  Easel painting is very popular, and local art centers and museums feature a variety of fun, hands-on art activities for children. Admission is free and participants may take home their artistic creations. The Children’s Workshop hours are 10 a.m. – 4 p.m. on Friday, Saturday and Sunday. Easel painting is from 10 a.m. – 3 p.m. on Saturday and Sunday. LEON THEODORE SCHOOLS EXHIBIT The place to discover the talented artists of the next generation is at the Leon Theodore Schools Exhibit where artwork by thousands of Orange County students is on display. The creativity and level of expertise displayed by these young artists will delight and amaze you. Be sure to check out this wonderful exhibit. Exhibit Tents are open FRIDAY AND SATURDAY, 9AM-5PM and SUNDAY, 9AM-3:30PM. COMPLIMENTARY BIKE CORRAL Ride your bike to the festival and park it at the free Bike Corral provided by the Winter Park Pedestrian and Bicycle Advisory Board. The corral is located off Morse Boulevard across the street from the Train Station parking lot. Visitors are asked to be aware of any new CDC guidelines for keeping safe in crowded areas. For your safety, hand washing stations and sanitizer will be available throughout the park. No animals are allowed (except certified service animals) in Central Park or on Park Avenue between New England and Canton Avenues during festival hours, per a City of Winter Park Ordinance. For more information, call 407-644-7207. NEW 2025 Virtual Festival Map Visit the NEW Virtual Map 2025 Festival Map (PDF Download) View / Download Festival Map Facebook-f Instagram Envelope Contact Us The Winter Park Sidewalk Art Festival P.O. Box 597 Winter Park, FL 32790-0597 (407) 644-7207 WPSAF@wpsaf.org Copyright © 2024 by The Winter Park Sidewalk Art Festival | Privacy Policy | Website by Zgraph Inc. Florida Web Design This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact"
    },
    {
      "url": "https://www.wpsaf.org/artists/?category=glass",
      "text": "2025 Artists - Winter Park Sidewalk Art Festival Skip to content Support The Winter Park Sidewalk Art Festival Foundation! Learn More. MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am – 6pm SUN 9am – 5pm Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Facebook-f Twitter Instagram Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact MARCH 21 – 23, 2025 WINTER PARK, FLORIDA MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am-6pm SUN 9am-5pm Home » 2025 Artists 2025 Artists Filter by Category: All Categories Clay Digital Art Drawing & Pastels Emerging Artists Fiber Glass Jewelry Leather Metal Mixed Media 2D Mixed Media 3D Painting Photography Printmaking Sculpture Watercolor Wood Sort By: Last Name Ascending Last Name Descending Booth # Ascending Booth # Descending Search: Tom Bloyd Stilwell KS Media: Glass Website: https://bloydartglass.com Email: bloydartglass@gmail.com Booth: 251 Jeremy Griffith Chelsea Griffith Murphysboro IL Media: Glass Website: https://delishglass.com Email: me@delishglass.com Booth: 8 Michael Hayes Spruce Pine NC Media: Glass Website: https://michaelhayesglass.com Email: michaelroberthayes@gmail.com Booth: 196 Christopher Jeffries Laguna Beach CA Media: Glass Website: https://jeffriesglass.com Email: info@jeffriesglass.com Booth: 124 Matt Kolbrener Detroit MI Media: Glass Website: https://mattkolbrener.com Email: mattkolbrener@gmail.com Booth: 13 Andy Koupal Detroit MI Media: Glass Website: https://andykoupal.com Email: andy.koupal@gmail.com Booth: 244 Mark Lewanski Portland MI Media: Glass Website: https://glassweavers.com Email: m_lewanski@hotmail.com Booth: 143 Andrew Libecki Chico CA Media: Glass Website: https://andrewlibecki.com Email: info@andylibecki.com Booth: 208 Andrew Madvin Royal Oak MI Media: Glass Website: https://axiomglass.com Email: Info@axiomglass.com Booth: 207 Amber Marshall Spruce Pine NC Media: Glass Website: https://ambermarshallglass.com Email: ambermarshallglass@gmail.com Booth: 195 Michael Mikula Cleveland OH Media: Glass Website: https://mikulaglass.com Email: mikulaglass@sbcglobal.net Booth: 256 Steve Palmer Minnetonka MN Media: Glass Website: https://hstarglassworksdesign.com Email: starglassworks@comcast.net Booth: 103 Richard Ryan Bourbonnais IL Media: Glass Website: https://vmglassart.com Email: vitreousmatter@yahoo.com Booth: 55 Douglas Sigwarth Renee Sigwarth River Falls WI Media: Glass Website: https://sigwarthglass.com Email: sigwarthglass@gmail.com Booth: 130 Joshua Solomon Norfolk VA Media: Glass Website: https://jsolomonsolutions.com Email: Joshsoulman@hotmail.com Booth: 117 Mark Sudduth Cleveland Hts. OH Media: Glass Website: https://sudduthglass.com Email: sudduthglass@gmail.com Booth: 4 Warner Whitfield Beatriz Kelemen Ocala FL Media: Glass Website: https://warnerwhitfield.com Email: warnerwhitfield@mac.com Booth: 165 Facebook-f Instagram Envelope Contact Us The Winter Park Sidewalk Art Festival P.O. Box 597 Winter Park, FL 32790-0597 (407) 644-7207 WPSAF@wpsaf.org Copyright © 2024 by The Winter Park Sidewalk Art Festival | Privacy Policy | Website by Zgraph Inc. Florida Web Design This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact"
    },
    {
      "url": "https://www.wpsaf.org/legal/",
      "text": "Legal - Winter Park Sidewalk Art Festival Skip to content Support The Winter Park Sidewalk Art Festival Foundation! Learn More. MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am – 6pm SUN 9am – 5pm Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Facebook-f Twitter Instagram Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact MARCH 21 – 23, 2025 WINTER PARK, FLORIDA MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am-6pm SUN 9am-5pm Legal Public User Disclaimers Privacy Policy Terms of Use About Copyright & Intellectual Property Rights According to the law in the United States, The UK, Russia and most countries in Western Europe, copyright protection is assigned to original author of the the work. Symbols such as ©, tm, sm or ® are not required to be displayed since the year 1989 according to the “Berne Convention Implementation Act” (source: Copyright on Wikipedia.com ). Copyright symbols and disclaimers only further clarify who owns the copyright and whether it has been further registered or not. If a special license is granted to some portion of the content on our web site, it will be clearly labeled, and the license is limited to that specific information only. We also allow freely available public search engines to index our content in order to help people find our web site, but users of those search engines have no right to copy the images, text, videos or other data they find from our web site through search engines. When in doubt, you must assume your rights to the information on this web site are limited to viewing, printing and caching the information using a web browser for your non-commercial personal use only. We reserve all other rights for ourselves except where explicitly noted otherwise. Reporting Abuse of Copyright. If you have found that our web site is violating copyright law, the terms of a license agreement or misusing trademarks, please report this problem immediately to us via the form below so that we may review your claim. A valid claim must identity the original copyright holder and you must tell us the location(s) you found this information on the web site including any URLs or other identifying information you can list. Please describe the requested action you want us to take. We will honor removal of any information related to a claim that 1) provides reasonable evidence that we don’t have the permission to use the information and 2) if we fail to provide adequate evidence to deny the claim. The information you submit on this form will solely be used by the web developer and web site owner for the purpose of resolving the claim. We ask that you provide us a reasonable amount of time to respond and/or make corrections. Make sure your contact information is accurate, we are not able to respond to claims with incorrect contact information. Facebook-f Instagram Envelope Contact Us The Winter Park Sidewalk Art Festival P.O. Box 597 Winter Park, FL 32790-0597 (407) 644-7207 WPSAF@wpsaf.org Copyright © 2024 by The Winter Park Sidewalk Art Festival | Privacy Policy | Website by Zgraph Inc. Florida Web Design This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact"
    },
    {
      "url": "https://www.wpsaf.org/about/judges/",
      "text": "Judges - Winter Park Sidewalk Art Festival Skip to content Support The Winter Park Sidewalk Art Festival Foundation! Learn More. MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am – 6pm SUN 9am – 5pm Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Facebook-f Twitter Instagram Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact MARCH 21 – 23, 2025 WINTER PARK, FLORIDA MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am-6pm SUN 9am-5pm Home » About » Judges Judges About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Judges and the Judging Process The jurist panel consists of three (3) independent judges who are selected annually from across the country for their in-depth knowledge and experience in multiple art media. In October, they will review the digital images of all applicants to select the Festival artists and the Waitlist artists. In March, the same jurist panel will review the work of the exhibitors to determine those artists they consider eligible for awards. Judging of the awards is based upon the overall quality of the artwork exhibited. After a booth is selected by a judge, the artist is responsible for selecting one piece for Saturday’s awards processing that best represents his or her entire body of work. The Best of Show, Edyth Bush Charitable Foundation Award, and the Morse Museum Award are each presented for an individual piece of art. Awards are presented solely at the discretion of the judges. 66th Winter Park Sidewalk Art Festival 2026 Judges Will Be Announced Soon! Eepi Chaad Albuquerque, New Mexico Eepi Chaad is a multidisciplinary artist, cultural worker, and naturalist based on the Gulf Coast. She tells stories using textiles, fibers, metals, places, and people. Chaad’s practice studies human impacts and lives at the intersection of natural and built environments. Her work ranges from tiny adornments to large-scale installations to the art of making space and convening people. Chaad has presented and exhibited work nationally and has received numerous grants and awards including residencies with CAMH and the City of Houston and most recently the BANF Artist Awards. Recent projects include a public art installation in Galveston, TX, a collaboration with the Houston Grand Opera, and exhibitions at Arrowmont and Charlotte Street Foundation. Chaad also considered arts administration a part of her creative practice and currently serves as Professional Development Program Manager with Mid-America Arts Alliance and maintains a private consultancy practice working with a variety of arts & culture nonprofits. Liz Maugans Cleveland, Ohio Liz Maugans is the Director of YARDS Projects , and Curator of the Dalad Collection in Cleveland. She co-founded and was the Former Executive Director of Zygote Press , a non-profit printmaking studio located in Cleveland for over 30 years. Liz founded the Collective Arts Network , a quarterly journal, online resource and arts consortium that works to promote Northeast Ohio artists and organizations to a greater audience. She founded the Artist Trust (renamed The Cleveland Artist Registry ), an open access multidisciplinary artist registry to connect Cuyahoga County Artists to each other and the greater community. Liz teaches at the Art and Design School at Cleveland State University and holds the Haddad Arts Mentor post that supports students in obtaining paid internships in the arts and museum sector. For 40 years+, Liz Maugans has organized one-person and thematic group exhibitions featuring regional, national and internationally known artists. Her curatorial specialization is a devotion to emerging artists, social justice and local experimental practices that broaden access through social networks, inclusion and community-building initiatives.  Liz is an artist with a strong studio and social practice and is represented by Hedge Gallery. John Petrey Santa Fe, New Mexico Born in 1958, in Southern California, an only child to self-employed parents, John spent many afternoons watching television and movies portraying perfect people, in perfect families, living in a perfect society. These shows had a profound impact on his career path. He pursued a career in advertising design, receiving an A.S. Degree in Graphic Design from Mt. San Jacinto College, followed by a B.S. Degree from Brooks Institute in Commercial Photography. Throughout the 80’s and 90’s, he gained national recognition winning numerous awards as a photographer in the area of food, celebrities and advertising. Throughout his career as a photographer any spare time he enjoyed was dedicated to creating art, building art furniture and restoring vintage motorcycles. In 2003 John closed his photo studio to pursue his passion for sculpture and began creating several diverse bodies of work. John’s art is included in both private and corporate collections, and has been shown in galleries and exhibitions throughout North America. As John has grown as an artist, his work has become more of an expression of his soul. He is constantly re-formulating the process of his creative thinking. He’ll observe something that strikes a chord with him, tuck it away in his mind, and later it becomes an inspiration. As a result, his art can be lighthearted and whimsical or deeply symbolic. Facebook-f Instagram Envelope Contact Us The Winter Park Sidewalk Art Festival P.O. Box 597 Winter Park, FL 32790-0597 (407) 644-7207 WPSAF@wpsaf.org Copyright © 2024 by The Winter Park Sidewalk Art Festival | Privacy Policy | Website by Zgraph Inc. Florida Web Design This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact"
    },
    {
      "url": "https://the32789.com/2024/03/05/winter-park-sidewalk-art-festival-prepares-for-65th-show/",
      "text": "Winter Park Sidewalk Art Festival Prepares for 65th Show · the32789 September 11, 2025 Search the32789 News Business Food & Drink Community Arts Homes Health & Wellness Follow Us Winter Park, FL News Business Food & Drink Community Arts Homes Health & Wellness Search the32789 Plans are coming together for next week’s festival setup and the return of the Friday Night Concert. Photo by: Jim Carchidi Winter Park Sidewalk Art Festival Prepares for 65th Show By Jim Carchidi | March 5, 2024 Plans are coming together for next week’s festival setup and the return of the Friday Night Concert. Photo by: Jim Carchidi Share This: The groundhog may have seen its shadow weeks ago, but a local springtime tradition will return to Park Avenue on March 15, 16 and 17 with the 65 th Annual Winter Park Sidewalk Art Festival. The list of 219 participating artists was selected from more than 1,000 applications. Cash awards totaling $76,500 rank among the highest of any art festival in the country and include the Best of Show Purchase Award. The recipient becomes part of a special collection owned by the city. “(The pieces) originally were all housed at the former library,” said City of Winter Park Communications Director Clarissa Howard of the collection, which is now managed by the city’s Public Art Advisory Board. “Due to the growing size of the collection and limited city-owned public spaces that are climate controlled, (the Advisory Board) is working to showcase the work in multiple locations.” The Best of Show collection is currently housed at the Winter Park Library & Events Center campus, the J.K. and Sarah Galloway Foundation Community Gallery on the first floor of the Winter Park Welcome Center, and in the Chapman Room on the 2 nd floor of Winter Park City Hall. The Public Art Advisory Board is also working on an online inventory to make the Best of Show collection and all other city-owned public art pieces accessible to a worldwide audience. Irina Ashcraft’s artwork was chosen for this year’s festival poster. She was trained at the Latvian Academy of Art and relocated to Orlando in 1999. She has shown her work at several local and European galleries and festivals, and teaches art at Winter Park’s Trinity Preparatory School. Image courtesy of: Winter Park Sidewalk Art Festival Behind the scenes Winter Park Sidewalk Art Festival is more than an event, it’s a 501(c)(4) with an all-volunteer board that pools its resources to tackle a year-long logistical process. Priorities range from selecting judges and screening applications to arranging exhibit tent locations and scheduling live entertainment. But according to WPSAF Public Relations Manager Alice Moulton, refining the selection process was a key strategy in raising the festival’s profile. “The number of artists has varied quite a bit over the years,” she said. “At one time there were about 600 artists; I think all you had to do at that time was apply and you were in.” The number of participants may have been reduced from its early years, but the festival attracts an estimated 250,000 visitors to the downtown shopping and dining district. Photo by: Jim Carchidi The application period begins in August and runs through mid-September with judges coming to town in late October to view submissions at Winter Park City Hall’s Commission Chambers. “We call it Screening Weekend,” Moulton said. Judges assign numeric scores to the works submitted with each application, but steps are taken to ensure a variety of fine art media – from jewelry to digital art – is represented. “It doesn’t just go by the highest (overall) scores, it’s the highest scores in each category.” The show goes on This year marks the return of a festival tradition: the Friday Night Concert. Beginning in 2022, the live music event was scheduled a week before festival set-up to offer adequate post-pandemic audience spacing. However, the move proved to be confusing and detracted from its impact as a festival kickoff event. “I think many people didn’t even realize we were putting on the concert during that time,” Moulton said. “People coming to town for the festival weren’t able to see the concert and the new schedule really didn’t represent its intent.” The show will begin at 5:30 p.m. on March 15 with a celebration of the late Jimmy Buffett by tribute band, Gary Roland and The Landsharks . The vibe will take a jazzy turn at 7:30 p.m. when Michael Andrew and Swingerhead take the stage. Guests are invited to bring their own food and blankets, but are advised that no blankets larger than 10 feet are allowed and cannot be put down until 2 p.m. Additional live music performances will take place each day of the festival, the full schedule is available here . Road closures and daily schedule An estimated 250,000 visitors attend the three-day festival with many turning their attention to downtown’s retail and restaurant offerings. The following street closures are in effect during the event weekend: Garfield Avenue Lincoln and East Welbourne Avenues, from Center Street to Park Avenue Morse Boulevard, from South Knowles to South New York Avenues New England Avenue from West Park Avenue to Center Street Park Avenue from West Canton to Lyman Avenues Festival hours will be 9 a.m.-6 p.m. on March 15-16, and 9 a.m.-5 p.m. on March 17. Guests are advised that no pets, bicycles, motorized scooters or skateboards will be allowed inside the festival areas. For more information and to view a gallery of participating artists, visit WPSAF.org . Share This: Have a story idea?  Send us a note at news@the32789.com .  Follow our stories on Instagram , Twitter , and Facebook . About the Author This story was written by Jim Carchidi, one of our collection of writers covering news in Winter Park, Florida. Our staff writers can be reached at news@the32789.com. Related Stories Scenes from the 66th Annual Winter Park Sidewalk Art Festival Winter Park enjoyed another weekend at the center of the Central Florida art community with… Read More By Jim Carchidi | 6 months ago Winter Park Playhouse Offers Productions with a Purpose Central Florida’s only professional musical theater is taking performers off the mainstage and into the… Read More By Jim Carchidi | 6 months ago Know Before You Go: The 66th Annual Winter Park Sidewalk Art Festival The next major event on the local art calendar is approaching as the Winter Park… Read More By Jim Carchidi | 6 months ago Our Sponsors News News News Food & Drink Food & Drink Food & Drink Community Community Community Business Business Business Arts Homes Health & Wellness ABOUT US PUBLISHER’S LETTER FAQ ABOUT US PUBLISHER’S LETTER FAQ ©2025 Findsome & Winmore, Inc. All Rights Reserved. | Privacy Policy | Terms & Conditions | Disclosure Statement Follow Us"
    },
    {
      "url": "https://www.wpsaf.org/contact/",
      "text": "Contact - Winter Park Sidewalk Art Festival Skip to content Support The Winter Park Sidewalk Art Festival Foundation! Learn More. MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am – 6pm SUN 9am – 5pm Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Facebook-f Twitter Instagram Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact MARCH 21 – 23, 2025 WINTER PARK, FLORIDA MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am-6pm SUN 9am-5pm Home » Contact Contact Have questions about the festival? Whether you’re looking for more details, want to get involved, or have specific inquiries, we’re here to help. Fill out the form below, and a member of our team will get back to you soon. We can’t wait to connect and hope to see you at the next Winter Park Sidewalk Art Festival! First Name (Required) Last Name (Required) Email (Required) Phone (Required) Comments (Required) Check the box to join our newsletter. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Facebook-f Instagram Envelope Contact Us The Winter Park Sidewalk Art Festival P.O. Box 597 Winter Park, FL 32790-0597 (407) 644-7207 WPSAF@wpsaf.org Copyright © 2024 by The Winter Park Sidewalk Art Festival | Privacy Policy | Website by Zgraph Inc. Florida Web Design This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact"
    },
    {
      "url": "https://www.eventeny.com/events/wpsaf-914/",
      "text": "The 62nd Winter Park Sidewalk Art Festival - Eventeny Organize Event Management Tools Event mapping Ticketing / registration Artist, vendor & exhibitor management Volunteer management Sponsor management Event programming & talent management  - New Interactive schedules Hardware solutions Solutions by event type About Eventeny Product overview Company values Pricing Helpful Resources Knowledge base Community center Comparison guide Blog Contact sales Product updates Case studies See all events Create an Event Participate Artists, Vendors & Exhibitors Your applications Create a shop page View your sales Ticket Buyers / Attendees Your tickets Your orders Volunteers Your applications Sponsors Your sponsorships Create a shop page View your sales Explore new applications Download the mobile app Browse help articles Find your next event Search for events, applications, tickets or products. Sign in Sign up 0 Organize Event Management Tools Event mapping Ticketing / registration Artists, Vendors & Exhibitors Volunteer management Sponsor management Event programming & talent management  - New Interactive schedules Hardware solutions Solutions by event type About Eventeny Product overview Company values Pricing Helpful Resources Knowledge base Community center Comparison guide Blog Contact sales Product updates Case studies Participate Artists, Vendors & Exhibitors Your applications Create a shop page View your sales Ticket Buyers / Attendees Your tickets Your orders Volunteers Your applications Sponsors Your sponsorships Create a shop page View your sales Resources Explore new applications Download the mobile app Browse help articles Find your next event Create your event Log in > Don't have an account? Sign up! Events Tickets Products Applications The 62nd Winter Park Sidewalk Art Festival Starts on Monday, March 15th, 2021 Virtual Hosted by The Winter Park Sidewalk Art Festival 227 Followers Overview Schedule About the event This March, We’re Bringing The Winter Park Sidewalk Art Festival to You! You don’t have to wait until May 14, 15 & 16 to enjoy The Winter Park Sidewalk Art Festival. Start early at our Virtual Festival, March 15-31, 2021. Highlights of the Virtual Festival include a Poster Unveiling, Artist Marketplace, Merchandise Store, Virtual Scavenger Hunt, School's Exhibit, Children's Workshop, and presentations by your favorite artists! Show more Show less Dates Mar 15, 2021 · 6:00 PM - Mar 31, 2021 · 11:59 PM (GMT-04:00) Eastern Time (US & Canada) The event has ended Location Virtual Event highlights About WPSAF View link The Winter Park Sidewalk Art Festival is one of the nation’s oldest, largest and most prestigious outdoor art festivals. The Festival debuted in March 1960 as a community project to bring local artists and art lovers together. It is produced by an all-volunteer board and draws more than 350,000 visitors each year. Over 1,100 artists from around the world apply for the Festival each year. Festival. An independent panel of three judges selects the 225 artists who will exhibit their works. The Festival consistently ranks as one of the top juried fine art festivals in the country with high rankings in Art Fair Calendar’s “2019 Best Art Fairs”, Art Fair Source Book’s rankings, and Sunshine Artist Magazine’s “Top 100” lists. The 2021 Artists Application is by invitation only this year and is being extended to the final 2020 accepted artists. Show more Show less Posters & T-Shirts View link Click here to visit the WPSAF merchandise booth!\n\nItems Available:\n> 2020 Poster\n> 2021 Poster\n> 2020-2021 Poster Combo\n> 2020 Unisex Tee\n> 2021 Unisex Tee\n> 2021 Women's Tee Show more Show less Leon Theodore Schools Exhibit View link Visit the Leon Theodore Schools Exhibit and enjoy a celebration of youthful creativity! The Schools Exhibit features amazing works of art by Central Florida's talented elementary, middle, and high school students from Orange County public and private schools. The Winter Park Sidewalk Art Festival has proudly showcased the artists and art programs of our local schools since the first festival in 1960. This year, we’re excited to bring the Schools Exhibit to you virtually. \n\nMiddle and High School students have an opportunity to have their work judged by a panel of distinguished judges. Award winners will be announced online on Friday, March 19, 2021. Show more Show less Children's Workshop View link This year, the Children’s Workshop looks a little different. For the first time ever, the Children’s Workshop is going virtual! Each of the participating museums and learning centers have designed exciting crafts, projects, and activities for children to create. \n\nAll the necessary supplies will be provided in project kits which will be available for pickup on the stage in North Central Park (on Park Ave. at Garfield Ave) on Saturday, March 20th between 10am and 4pm. Kids of all ages are invited to pick up project kits for any or all of the activities they’re interested in! Show more Show less Scavenger Hunt View link Art lovers of all ages are invited to visit each artist’s booth to search for hidden prizes in our Virtual Scavenger Hunt. For clues, take a good look at our 2021 WPSAF Poster, created by artist Victor Bokas, so you will be able to recognize those elements hidden throughout the Artist Marketplace. Keen eyed viewers have an opportunity to find FREE prizes including artist’s artwork and WPSAF posters. \n\nIn order to claim a found prize, add the Scavenger Hunt item to your cart and “purchase” the prize (all prizes are listed for $0.00). Each prize can only be claimed once. Once a prize is “purchased” it will be listed as “out of stock”. At the conclusion of the event, found prizes will be shipped to the winners. \n\nParticipants are only eligible to claim one scavenger hunt prize. Members of the WPSAF Board of Directors and their immediate families are not eligible to participate in this event. Show more Show less Poster Artist: Victor Bokas Victor Bokas grew up against a backdrop of palm trees, beautiful beaches and sunbathers in the Florida Panhandle. These influences surface in his paintings through vibrant colors, tropical icons and a good measure of whimsy. Life’s highway later brought Victor to Central Florida in 1987 where sun, fun and exuberant energy infused his work.\nIn many of his pieces, he pays homage to his Greek heritage. A self-described “collector of kitsch,” his studio is filled with vintage flea market finds. His collection is a source of inspiration and items from it are often incorporated into his works.\nGrids, squares and other graphic design elements lend structure and direction, no doubt his long career as a graphic designer ingrained a sense of order to his hyper imaginative settings. \nHis list of accomplishments are many. Including a 15-foot x 85-foot mosaic floor for Orlando International Airport’s “A Terminal”. Designed by Victor and installed by Italian masters of natural stone and glazed enamel. Most recently, a wall installation for Orlando International Airport “C Terminal”. Victor’s paintings are included in corporate and museum collections throughout the South, plus having numerous solo exhibitions. \nVictor’s career path includes 9 years Senior Art Director for Sea World and 20 years Senior Art Director Tupperware. Check out his website at Victorbokas.com. Show more Show less Judges & Awards View link Judges for the Winter Park Sidewalk Art Festival are selected annually for their in-depth knowledge and experience in multiple art media. Each year, they review digital images from all applicants and select the exhibiting artists in a process called jurying. This year's judges are: Chris Dahlquist, John W. Kincade and Brent Kee Young.\n\nThe artists in this year’s Festival were originally selected by these three judges to exhibit during the 2020 show that was canceled. Since they were unable to exhibit, all of the artists were invited back for the 2021 Festival. The artwork displayed in the March WPSAF Virtual Festival will not be judged; however, in May, all three judges will return to Winter Park to judge the in-person Festival. \n\nDuring the in-person Festival, the panel of judges will review each exhibit to determine which artists will be considered for awards. After a booth is selected, the artist will select one of their pieces to submit to the judges for consideration. Award winners are determined by the judges on Saturday during the live event. \n\nArtists complete for 63 awards totaling $74,500. The Best of Show winner is purchased for $12,000 by The Winter Park Sidewalk Art Festival Board and donated to the City of Winter Park. Previous Best of Show winners are on permanent display at the Winter Park Public Library. A $5,000 “Art of Philanthropy” Purchase Award is sponsored by the Edyth Bush Charitable Foundation. A $2,500 “Distinguished Work of Art” Award is presented through The Charles Hosmer Morse Museum of American Art. There are 10 Awards of Excellence of $2,000 each, 20 Awards of Distinction of $1,000 each and 30 Awards of Merit of $500 each. Show more Show less Join the Patron's Program! Our Patrons Program was created to provide support of the Winter Park Sidewalk Art Festival artists through dedicated funds pledged to purchase artwork during our annual show. By participating, Patrons make monetary pledges for given levels of spending. Up to 95 percent of your contribution stays with you to purchase art and the remainder goes to support The Winter Park Sidewalk Art Festival. This financial commitment to the purchase of art generates enthusiasm in the artist’s community and attracts the most outstanding artists who display on the outdoor circuit. We invite you to experience the unique and rewarding opportunity to become a patron of The Winter Park Sidewalk Art Festival.\n\nAll Patrons are invited to attend special Patron events including meet-and-greets throughout the year. All patrons receive exclusive concert seating and refreshments in the Patrons tent throughout the Art Festival weekend.\n\nFor more information, contact the Patrons Chair at patrons@wpsaf.org or leave a voice message at the Winter Park Sidewalk Art Festival voice mail system 407-644-7207. Show more Show less Become a Winter Park Sidewalk Art Festival Volunteer! View link By volunteering you will experience a one-of-a kind behind-the-scenes opportunity to gain a deeper appreciation for the artists and their award-winning artwork. The volunteers are the backbone of the festival. They help make the Winter Park Sidewalk Art Festival one of the top outdoor festivals in the country.\n\nWe Have a Place for You:\nAs a volunteer, you'll enjoy being involved in many activities throughout the 3-day festival. If you are willing to assist in the areas of the festival where you may be most needed, we have a place for you! Sign-up to be on the Merchandise Team to participate in the sales of festival T-shirts and posters. Join the Children's Workshop Team to encourages young artists with easel painting activities. As part of the Artists' Care Team, you will assist over 200 Artists with booth sitting and kind care activities.\n\nThe More the Merrier!\nWe would love to have you volunteer with your family and friends! High school, college, school clubs and organizations can earn valuable community service points participating in our volunteer opportunities. Community clubs and organizations are welcome to join our many volunteer roles for this popular community event.\n\nVolunteer Perks\n- Free Volunteer T-Shirt\n- Free WPSAF Poster\n- Meet the Artists\n- Have fun getting to know other volunteers!\n- Become part of the WPSAF Volunteer Team!\n\nTo apply, visit: https://www.wpsaf.org/support/volunteer/index Show more Show less The WPSAF Foundation View link The Winter Park Sidewalk Art Festival Foundation, Inc. (the “Foundation”) provides grants to promote community appreciation of the arts and supports art education through scholarships and programs.  The Foundation supports The Children’s Workshop, The Leon Theodore Schools Exhibit, The Emerging Artists Program, The Image Review Workshop and Performing Arts at The Winter Park Sidewalk Art Festival.  It also funds the Jean Alice Oliphant Scholarship at Rollins College in Winter Park and The Winter Park Sidewalk Art Festival Scholarship at the University of Central Florida in Orlando.\n \n\nSince 2008 the Foundation has had a continuing mission to enhance art appreciation, art education and community spirit. Each year during the festival more than a thousand children take the opportunity to express their creativity though easel painting and more than 500 children per day visit the museum workshops and participate in hands-on art projects.  In 2019 more than 4,500 Orange County students have had the thrill of having their artwork showcased and judged at the Leon Theodore Schools Exhibit.\n\n \nThe Foundation received funding in 2019 from donations by The Joe and Sarah Galloway Foundation, The Edyth Bush Charitable Foundation, The Rotary Club of Winter Park, The Pocket Program and The Winter Park Sidewalk Art Festival.\n\n \nThe Internal Revenue Service approved the Foundation, a Florida corporation not-for-profit, as a 501(c) 3 tax-exempt entity in September of 2008. Show more Show less Schedule Filters Track All tracks Type All types Location All locations Status Active Cancelled Clear all List view List view Day view Event schedule Event schedule My schedule View details Add to my schedule Title Description Status Active pill Guest Time and Location Time Location Types Filter Track Type Location Session status Clear filters Apply filters Hosted by The Winter Park Sidewalk Art Festival Joined Eventeny in November 2020 5 events Winter Park, Florida, United States View profile Message Follow Following Search Share this event Send to: Personal message: Send Email Map Check in with your tickets Please check in using the tickets or confirmation code below. If you do not have a ticket, you can get ticket here: https://www.eventeny.com/events/ticket/?id=914 Enter your confirmation code Have an account? Sign in to autoload Confirmation code info Please enter your confirmation number. check Check in close Close share Share close Close Share this link to give direct access to pay invoices Copy Link close Close Share this link with friends and family Copy Link Facebook Twitter \"X\" LinkedIn Email SMS WhatsApp Messenger We use 🍪 cookies to improve your experience. By continuing, you agree to our Privacy Policy and Cookie Policy. Accept Decline Product Create my first event Events Applications Products Why Eventeny Artist, vendor, & exhibitor management Volunteer management Sponsor management Ticketing and registration Scalable maps & seating charts Event programming & talent management  - New Interactive schedules Hardware rentals Mobile app Pricing Google reviews Event Type Food & drink festivals Art festivals Community events Fairs Fandom conventions Pride events Music festivals Markets Heritage festivals Resources Refer Knowledge base Community center Case studies Compare Our partners Podcast episodes evPride pledge Blog Media kit What's new Resource hub About Eventeny About the company Global enrichment efforts Careers - We're hiring! Terms Privacy Security Contact us Talk to support: Contact us here Experience Easier Events! Join our mailing list below to receive product updates, industry news, promotions, & more. Join You're in — welcome to the evFamily!! Check your inbox for some helpful resources to get you started on the path to easier event management. Sign-up to Receive Updates! I'm an... * Select role Event Organizer Artist, Vendor, or Exhibitor Attendee First name * Last name * Email * Verify email * Emails do not match Organization name * Events you host Phone number Website I agree to receive recurring automated promotional and personalized marketing text messages. Reply STOP to cancel, HELP for help. Msg & data rates may apply. Newsletter coming soon. In the meantime, browse new events. Subscribe Go to participant sign-up Browse events Eventeny was founded on the belief that managing large-scale events with hundreds of exhibitors, vendors, sponsors, and volunteers should not be stressful and burdensome. Our mission is to remove event organizers from being the 5th most stressful job in the world. That's why we built Eventeny and continue to work everyday on the biggest problems in the event industry. We don't just dream it, we build it. Eventeny © 2025 Terms Privacy Acceptable Use"
    },
    {
      "url": "https://www.wpsaf.org/info-for-artists/dates-and-deadlines/",
      "text": "Dates And Deadlines - Winter Park Sidewalk Art Festival Skip to content Support The Winter Park Sidewalk Art Festival Foundation! Learn More. MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am – 6pm SUN 9am – 5pm Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Facebook-f Twitter Instagram Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact MARCH 21 – 23, 2025 WINTER PARK, FLORIDA MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am-6pm SUN 9am-5pm Home » Info For Artists » Dates And Deadlines Dates And Deadlines General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info Important Dates The 67th Winter Park Sidewalk Art Festival will be held March 20,21, and 22, 2026. Friday, August 1, 2025 Application available on ZAPP Tuesday, September 23, 2025 Application deadline to ZAPP, by Midnight, EST. Requirements: 4 images (3 artwork, 1 booth) with no identifying markers Saturday, October 25, 2025 ZAPP Screening at (Location TBD). Open to all applicants and the public 8:30 am to 4 pm Monday, November 3, 2025 Notification of Screening results from ZAPP emailed on or before this date Tuesday, December 9, 2025 Acceptance and Exhibitor/Booth Fee through ZAPP by Midnight, EST Tuesday, December 9, 2025 Booth requests deadline for invited artists. Fill out the form or email to artistinfo@wpsaf.org by Midnight, EST. See Invited Artists page for more Booth Request details. Wednesday, December 31, 2025 Exhibitor/Booth Fee refund request deadline. Email to zapp@wpsaf.org by Midnight, EST. Exhibitor/Booth Fee refund is subject to an administrative fee of $35.00 Thursday, March 19, 2026 Spaces located in Central Park may be set up AFTER 8:30 am. Check in with Headquarters before set-up. Headquarters is open 7 am – 6 pm (NW corner of Park Ave & Morse Blvd) Friday, March 20, 2026 Spaces located along Park Avenue may be set up AFTER 5 am. Check in with Headquarters or Space Assignment Committee before set-up. Headquarters is open from 5 am to 6 pm. (NW corner of Park Ave & Morse Blvd) March 20, 21 and 22, 2026 (Friday, Saturday and Sunday) The 67th Annual Winter Park Sidewalk Art Festival Hours: Friday and Saturday, 9 am – 6 pm Sunday, 9 am – 5 pm Facebook-f Instagram Envelope Contact Us The Winter Park Sidewalk Art Festival P.O. Box 597 Winter Park, FL 32790-0597 (407) 644-7207 WPSAF@wpsaf.org Copyright © 2024 by The Winter Park Sidewalk Art Festival | Privacy Policy | Website by Zgraph Inc. Florida Web Design This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact"
    },
    {
      "url": "https://www.winterpark.org/aaf-plan-your-weekend/",
      "text": "AAF Plan Your Weekend - Winter Park Chamber of Commerce Skip to content Join Now Member Login Upcoming Events Facebook Instagram LinkedIn YouTube About Us About Us Board of Directors Staff Trustees Blog Membership Join Now Member Directory Membership Benefits Member Onboarding Marketing Opportunities Events & Programs Signature Events Signature Series Leadership Winter Park Relaunch Youth Leaders Resources Winter Park  Prosperity Scorecard Meeting Room Rentals Job Board Member Discounts Leadership Development Visit Welcome Center Park Avenue Member Directory Relocation Guide Interactive Map 52nd Annual Festival Sat. & Sun., Oct. 11 & 12 | 9:00 a.m. - 5:00 p.m. | Central Park, Winter Park Hosted By Presented By The Winter Park Autumn Art Festival is the only juried fine art festival exclusively featuring Florida artists. The community-oriented sidewalk show presents quality visual art and live entertainment the whole family can enjoy. The festival is held in beautiful Central Park located along historic Park Avenue in downtown Winter Park. Food & Drink Music & Entertainment Children's Art Artivites Merchandise Parking Places to Stay Pets Food & Drink Festival Patrons and VIPs will have catered lunches and premium pours of beer, wine, and non-alcoholic beverages available in the VIP Lounge presented by Artisan Kitchen & Bath Gallery . A Beer Garden with drinks will be located in front of the entertainment stage. Food and Beverages will be available from vendors throughout the event. Find the list of food vendors below: Asia Kitchen Bricks & Bowls C & R Food Concepts Fowler's Fresh Foods Gelato Go Go Juice Gran Arepa Kona Ice Mango Kings Nimbuya Olde Country Kettle Korne Paellas Madrilenas Pipo's Latin Food Little Lu Lu Cotton Candy Creations Jeremiah's Italian Ice Explore restaurants in the area here.Â Music & Entertainment Saturday 10/11 Schedule: 9:00 a.m. - 9:50 a.m. Orlando Children's Choir 10:00 a.m. - 10:50 a.m. WPHS Jazz Ensemble 11:00 a.m. - 12:00 p.m. Capt. Carl Dirkes 12:10 p.m. - 1:20 p.m. Lucy Spotts 1:30 p.m. - 2:20 p.m. Intersectus Band 2:30 p.m. - 3:20 p.m. Jordan Mohr & Micheal Allen Walker 3:30 p.m. - 5:00 p.m. Sugar Vibe Sunday 10/12 Schedule:Â 9:00 a.m. - 9:50 a.m.Â Winter Park Music Academy 10:00 a.m. - 11:00 a.m. School of Rock 11:15 a.m. - 12:10 p.m. Luis Alfredo Garcia 12:30 p.m. - 2:00 p.m. Oklahoma Stackhouse 2:15 p.m. - 3:10 p.m. Savannah Savino 3:30 p.m. - 5:00 p.m. The Buzzcatz Band Children's Art Artivites Check back closer to the festival! Merchandise Official Winter Park Autumn Art Festival posters and note cards will be on sale during festival hours along Park Avenue. Additionally, the Winter Park Chamber sells Autumn Art Festival merchandise year-round. Contact our concierge team at wpcc@winterpark.org or (407) 644-8281 . Parking Park Avenue will be closed to traffic from Lyman Avenue to Canton Avenue during the festival on Saturday and Sunday. Ample parking is available on surrounding streets, with handicap spaces available in municipal lots throughout downtown as well as in the Truist Parking Garage at 203 E. Lyman Ave.,Â and the Canton Avenue Parking Garage at 150 E. Canton Ave. Places to Stay Explore hotels in the area here.Â Pets Pets are not allowed in Central Park. For details on local ordinances, please contact the City of Winter Park at www.cityofwinterpark.org . or (407) 599-3399 . 2025 Patrons ASM Interiors Alan Chambers Jennifer Deery Diana & Dan Galante Carroll Goggin Rinat Halon Neal Bob Jimenez Susan & Jim King Heidi Lifrage Andrew McGowen David Odahowski Carina Sexton Stonebridge Financial Planning Group Theresa & Jon Swanson Volunteer at the Festival Apply to be a Food Vendor Students, Families, Businesses and more are welcome to volunteer at the Autumn Art Festival. Service Hours will be given to students in need of hours. Sign up for Our Volunteer List Questions? Contact our Events Manager Gabbi Formosa, at gformosa@winterpark.org or (407) 643-1698 . Follow Us On Facebook Facebook Icon Follow Us On Instagram Instagram Icon Thank You To Our Sponsors Hosted By Presented By Supporting Sponsors VIP Lounge Presenting Sponsor Beer Garden Presenting Sponsor Participating Sponsors Contributing Sponsors AARP Community Programs All American Gutter Protection Bach Festival Society Cutco Elite Medical Concierge Florida Blue Floor and DÃ©cor Furry Land of Orlando and Central Florida Gables Baldwin Park Health First Holiday Accents Florida iQ Home Care LeafFilter Leonardo 5th Avenue Orlando Magic Ox Floors Park Smiles Dentistry Power Home Remodeling Renewal by Andersen Seniors Helping Seniors Simmons Counseling Zsolt Granite Corporation VIP Lounge Supporting Sponsors GCG Wealth Management The Mayflower at Winter Park VIP Lounge Luncheon Sponsor RLH Residential Media Partners Central Florida Public Media Orlando Sentinel In-Kind Sponsors: Claire Cox Photography Hughes Fioretti Photography Luxe Flush Want to become a sponsor? Â Contact our Senior Director of Strategic Partnerships Stacey Cox atÂ scox@winterpark.org orÂ 407-599-3646 . View Our Sponsor Guide We make better businesses, leaders and community. View Our Full Calender © 2025 Winter Park Chamber of Commerce | Site by GrowthZone Membership Resources Member Â Member Login Member Â Member Benefits Member Onboarding Member Onboarding Member Card Member Directory Get in Touch Address & Map 151 W. Lyman Ave.,Â Winter Park, FL 32789 Phone icon 407.644.8281 Envelope icon wpcc@winterpark.org Facebook Instagram LinkedIn YouTube © 2025 Winter Park Chamber of Commerce. All Rights Reserved. Site by GrowthZone"
    },
    {
      "url": "https://www.tampabay.com/archive/1990/10/23/jean-oliphant-founder-of-winter-park-festival/?outputType=amp",
      "text": "Jean Oliphant, founder of Winter Park festival Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement Archive Jean Oliphant, founder of Winter Park festival Published | Updated MORE FOR YOU Photos: Clearwater Ferry crash • Transportation After a baby was born in a hurricane shelter, a witness is left wondering • Hurricane Advertisement Hurricane Helene to keep Tampa Bay area schools closed Friday • Hurricane More Florida faculty still looking to leave the state, survey shows • Archive Drivers could cross the new Howard Frankland in six months. Here’s what’s left. • Transportation What to expect from the Lightning at NHL trade deadline • Sports Tampa council approves $14 million to settle wrongful conviction lawsuit over 1983 murder • Tampa Florida makes it official: Universities to drop sociology as a core course • Archive Pete Alonso’s Battle for the Bay knocks giving back out of the park • Photos Tampa woman charged after 3 puppies found in dumpster, police say • Breaking News Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    },
    {
      "url": "https://www.wpsaf.org/artists-info/index",
      "text": "General Information - Winter Park Sidewalk Art Festival Skip to content Support The Winter Park Sidewalk Art Festival Foundation! Learn More. MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am – 6pm SUN 9am – 5pm Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Facebook-f Twitter Instagram Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact MARCH 21 – 23, 2025 WINTER PARK, FLORIDA MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am-6pm SUN 9am-5pm Home » Info For Artists » General Information General Information General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info General Information The 67th Winter Park Sidewalk Art Festival March 20, 21 and 22, 2026 Friday & Saturday: 9am-6pm Sunday: 9am-5pm The Winter Park Sidewalk Art Festival is one of the nation’s oldest, largest and most prestigious juried outdoor fine art festivals. It is also one of the nation’s most profitable, positioned at #8 in Art Fair SourceBook’s 2025 rankings by artists sales and #6 in Sunshine Artist’s Top 200 from 2010-2020, a 10-year ranking of the nation’s most profitable art shows.  Also voted #3 All Time Favorite Festival in Sunshine Artist’s recent national survey. And listed as #1 Best Festival in the South by Art Fair Calendar. The Festival debuted in March 1960 as a community project and is still produced today by an all-volunteer board that puts an emphasis on meeting the needs of the artists.  Set in a beautiful, historic downtown setting, the festival draws approximately 250,000 art-loving visitors. Artists from all around the country and beyond apply yearly to this highly competitive and very popular show.  An independent panel of three nationally accomplished judges will select the 212 fine artists and three emerging artists invited to exhibit their works. Emerging artists are encouraged to apply, see full details under the Emerging Artist tab. Cash Prizes: $76,500 in cash awards ranks among the highest in the country Additional $95,000 plus projected in Patron Bucks Best of Show: $12,000 purchase award Important Dates: Artist’s Application Deadline: September 23, 2025 Jury Notification: November 3, 2025 Festival dates: March 20, 21, 22, 2026 Artists Amenities and Features: Cash prizes and Patron Bucks estimated at $171,500 High attendance with 250,000 visitors expected over 3 days Artists’ Hospitality Center with refreshments available all day Booth sitting staffed by volunteers available on call Artist Care Team visiting artists with water and snacks Free artists’ parking near the Park (Improved for 2026) Discount hotel rates Saturday Night Artists’ Dinner & Awards Presentation Art Festival Magazine distributed at event and archived on website Artists’ Gallery on website Security patrol after hours Live music throughout the weekend Set in an affluent art loving community with a robust Patrons Program Extensive media promotions leading up to and during the Festival Artists retain all sales proceeds Facebook-f Instagram Envelope Contact Us The Winter Park Sidewalk Art Festival P.O. Box 597 Winter Park, FL 32790-0597 (407) 644-7207 WPSAF@wpsaf.org Copyright © 2024 by The Winter Park Sidewalk Art Festival | Privacy Policy | Website by Zgraph Inc. Florida Web Design This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact"
    },
    {
      "url": "https://www.wpsaf.org/store/",
      "text": "Store - Winter Park Sidewalk Art Festival Skip to content Support The Winter Park Sidewalk Art Festival Foundation! Learn More. MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am – 6pm SUN 9am – 5pm Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Facebook-f Twitter Instagram Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact MARCH 21 – 23, 2025 WINTER PARK, FLORIDA MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am-6pm SUN 9am-5pm Home » Store Store POSTERS Years available are: 2025, 2024, 2023, 2022 (signed only) , 2021, 2020, 2019, 2018, 2017 (signed only) , 2016, 2015, 2014, 2013, 2012, 2011 (signed only) , 2010, 2009, 2006, 2004, 2003, 2001, 1999, 1998, 1996, 1993, 1985, 1982. Un-signed Posters Pricing: $25 per poster plus $15 S&H per poster. Signed Posters Pricing: $35 per poster plus $15 S&H per poster. Click here to view the previous years' posters. At this time, we only accept checks or money orders. Please make checks payable to: Winter Park Sidewalk Art Festival. Include your mailing address and the poster year(s) that you are requesting. Mail to: Winter Park Sidewalk Art Festival P.O. Box 597 Winter Park, FL 32790-0597 407-644-7207 EMAIL: WPSAF@wpsaf.org Facebook-f Instagram Envelope Contact Us The Winter Park Sidewalk Art Festival P.O. Box 597 Winter Park, FL 32790-0597 (407) 644-7207 WPSAF@wpsaf.org Copyright © 2024 by The Winter Park Sidewalk Art Festival | Privacy Policy | Website by Zgraph Inc. Florida Web Design This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact"
    },
    {
      "url": "https://www.wpsaf.org/",
      "text": "Home - Winter Park Sidewalk Art Festival Skip to content Support The Winter Park Sidewalk Art Festival Foundation! Learn More. MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am – 6pm SUN 9am – 5pm Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Facebook-f Twitter Instagram Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact MARCH 21 – 23, 2025 WINTER PARK, FLORIDA MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am-6pm SUN 9am-5pm THE 67th WINTER PARK SIDEWALK ART FESTIVAL Artist Applications Open AUGUST 1 - SEPTEMBER 23 SUPPORT THE FESTIVAL FOUNDATION Click to Learn More Thank you to all 2025 Festival patrons WE APPRECIATE YOUR SUPPORT! Thank you to our many festival volunteers We hope to see you back in 2026! 67th Winter Park Sidewalk Art Festival MARCH 20 - 22, 2026 Visit the Festival Learn More Exhibit at the Festival Learn More Volunteer at the Festival Learn More Congratulations to All 2025 Festival Award Winners! Best in Show “Suburbandale” R. Michael Wommack Drawing & Pastels Few bass players in the history of modern New Orleans music are as storied as George Porter Jr. During the course of a career spanning more then four decades, Porter has not only made a deep impression with his work in the Meters, but he’s notched session work with artists as diverse as Paul McCartney, Jimmy Buffett, David Byrne, Patti LaBelle, Robbie Robertson, Tori Amos, Taj Mahal, Ryan Montbleau and live performances with Mickey Hart, Bill Kreutzmann , Warren Haynes, John Scofield, Steve Kimock , Eric Krasno (and including recent studio releases with Warren Haynes and Bill Kreutzmann ) just to name a few. Early in his career, Porter worked with seminal New Orleans artists like Allen Toussaint, Earl King, Lee Dorsey, and Johnny Adams, Irma Thomas, The Lastie Brothers again to only name a few. Porter is also the band leader of his own unique long – term project the Runnin ’ Pardners, well respected not only as a quintessential New Orleans band, the touring band continues to receive accolades on the jam band and festival scene. Learn About All 2025 Award Winners Welcome To Beautiful Park Avenue In Winter Park The Winter Park Sidewalk Art Festival is one of the nation’s oldest, largest and most prestigious outdoor art festivals. The Festival debuted in March 1960 as a community project to bring local artists and art lovers together. It is produced by an all-volunteer board and draws more than 250,000 visitors each year. Learn More The 2025 Festival Poster Click Here to Learn About 2025 Artist, Andrew Spear. Volunteer Be A Part Of The Festival By volunteering you will experience a one-of-a kind behind-the-scenes opportunity to gain a deeper appreciation for the artists and their award-winning artwork. Our volunteers help make the Winter Park Sidewalk Art Festival one of the top outdoor festivals in the country. Volunteer Now Patron Support the Festival Our Patrons Program was created to provide support of Festival artists through dedicated funds pledged to purchase artwork during our annual show. By participating, Patrons make monetary pledges for given levels of spending. The majority of your funds stay with you to purchase art and the remainder goes to support The Winter Park Sidewalk Art Festival. Visit Patron Page Donate Support Our Foundation Since 1960, The Winter Park Sidewalk Art Festival has been a community leader in bringing art and the community together and has created wonderful memories for its visitors through the years. Donations to the foundation will help finance programs created to promote art appreciation and education through children’s programming at the annual Winter Park Sidewalk Art Festival, our scholarship programs at Rollins College and University of Central Florida and other community outreach programs throughout the year. Donate Now 2025 Award Winners Click here to download a full list of 2025 Winners! Best of Show \"Surbandale\" Drawing & Pastels by R. Michael Wommack Edyth Bush Art of Philanthropy Award \"Woven Glass\" Glass by Mark Lewansky Morse Museum Award \"thorntt\" Sculpture by Mark Winter Monte Livermore Celebration of Nature Award \"Great White Egret\" Watercolor by Michael Williams Click to See a List of  All 2025 Award Winners! Artists 2025 Categories And Artists Clay Digital Art Drawing & Pastels Emerging Artists Fiber Glass Jewelry Leather Metal Mixed Media 2D Mixed Media 3D Painting Photography Printmaking Sculpture Watercolor Wood View Artist Lineup 2025 Featured Sponsors View All Event Sponsors Event Information Where: In Central Park and Along Park Avenue in Winter Park, FL Hours: 9 a.m. – 6 p.m., Friday and Saturday; 9 a.m. – 5 p.m., Sunday Contact: (407) 644-7207 Facebook-f Instagram Envelope Contact Us The Winter Park Sidewalk Art Festival P.O. Box 597 Winter Park, FL 32790-0597 (407) 644-7207 WPSAF@wpsaf.org Copyright © 2024 by The Winter Park Sidewalk Art Festival | Privacy Policy | Website by Zgraph Inc. Florida Web Design This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact"
    },
    {
      "url": "https://www.wpsaf.org/about/2024-emerging-artists/",
      "text": "2025 Emerging Artists - Winter Park Sidewalk Art Festival Skip to content Support The Winter Park Sidewalk Art Festival Foundation! Learn More. MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am – 6pm SUN 9am – 5pm Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Home Visit Info For Artists 2025 Artists About Support Us Store Contact Us Facebook-f Twitter Instagram Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact MARCH 21 – 23, 2025 WINTER PARK, FLORIDA MARCH 20 – 22, 2026 WINTER PARK, FLORIDA FRI & SAT 9am-6pm SUN 9am-5pm Home » About » 2025 Emerging Artists 2025 Emerging Artists About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News 2025 Emerging Artists The Winter Park Sidewalk Art Festival’s Emerging Artist Program was founded in 1977 and encourages new artists to participate in the world of outdoor festivals at no cost to the selectees. Emerging Artists, who are determined through the same juried process as all of the event’s participating artists, will have the opportunity to make sales and get feedback from art patrons and judges. While Emerging Artists are not eligible for prizes, the exposure and the experience is invaluable. This year four artists were chosen for the program. Sarah Luciano sarahgiselle98@gmail.com https://www.instagram.com/pausa_pottery/ Booth Number: 211 Sarah Luciano was born in Puerto Rico and raised in Orlando. She began working with clay in 2016 at Valencia Community College and continued to earn her BFA at UCF in 2020. During those years, her body of work consisted of strictly working on the wheel with porcelain and mastering crystalline glaze. Sarah only began hand-building a couple years later when she began to test the limits of clay. From making ceramic cakes to now knots. The idea of making something look deceivingly solid or appear “malleable” with clay fascinates me, and it is something I will continue to expand on. Stephanie Brown stephjbee@gmail.com https://stephaniejeanbrown.com Booth Number: 212 Stephanie grew up in California and relocated to Pennsylvania in 2021. Originally a watercolor painter who focused on florals and still life, she has recently found a more natural home for herself in soft pastel. She loves its versatility and immediacy and enjoys exploring its many possibilities as a medium. The change of medium also coincided with a more from California to Pennsylvania, which ignited a love for the landscape and a newfound enjoyment of painting plein air. In September of 2023, Stephanie enrolled in Studio Incamminati’s Advanced Diploma of Fine Arts program. She has achieved Signature status with the Pastel Society of America, the Philadelphia Pastel Society, the Pastel Society of the West Coast, and the Maryland Pastel Society.  She is an Associate member of the American Impressionist Society. Matt Matsudaira mattmatsudaira@gmail.com https://mattmatsudairafineart.com/ Booth Number: 210 Matt Matsudaira, born in 1995, is a self-taught Japanese-American oil painter living in Orlando, Florida. He is passionate about recreating landscapes from impactful real-life moments, but also enjoys painting wildlife and architecture. Born in Tokyo, Japan, Matt Matsudaira enjoyed a rich childhood filled with soccer, Legos, and drawing wildlife encyclopedia books. In 2006, he and his family moved to the United States. He continued to practice drawing, and in high school art class he was introduced to both charcoal and paint. Charcoal came naturally, but Matsudaira was so disappointed in his first painting that he vowed never to pick up a brush again. 10 years later in 2021, Matt Matsudaira was so inspired by the vivid colors of Sedona, Arizona, where he and his wife were married, that he decided to give paint another chance. There was no turning back. Since then, he has created countless paintings and honed his own style that combines the detail of drawing with the depth of color that harkens back to his first inspiration to capture the dramatic beauty of Sedona. Will Shotwell willshotwellphoto@gmail.com https://willshotwellphotography.com Booth Number: 209 Will, the creative mind behind Will Shotwell Photography, has always had a passion for creating. From leather working to designing and creating jewelry, he has a knack for transforming ideas into tangible art. Photography has been part of Will’s life since an early age—his parents were professional photographers with their own studio, and their influence inspired his own love for the craft. In high school, Will discovered his own passion for capturing moments through the lens. While studying at Embry-Riddle after high school, Will realized that photography was his true calling. He decided to turn his passion into a career and has never looked back. By day, Will works for a medical equipment sales Company where he specializes in photographing and selling used and/or refurbished medical equipment. In his spare time, he channels his creativity into Will Shotwell Photography, capturing moments and memories that reflect his unique artistic vision.  When he’s not behind the camera, Will enjoys spending time with his fiancée, Susan, and his two stepsons. He also continues to channel his creativity into making jewelry and working with leather. Will’s family and artistic pursuits are at the heart of everything he does, bringing a personal touch to every photo he takes. Facebook-f Instagram Envelope Contact Us The Winter Park Sidewalk Art Festival P.O. Box 597 Winter Park, FL 32790-0597 (407) 644-7207 WPSAF@wpsaf.org Copyright © 2024 by The Winter Park Sidewalk Art Festival | Privacy Policy | Website by Zgraph Inc. Florida Web Design This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact Home Visit Know Before You Go Maps Parking, Transit & Bicycling Music & Entertainment Where To Stay Where To Eat Local Attractions Info For Artists General Information Artist Application Emerging Artists Invited Artists Wait List Artists Dates And Deadlines Jury & Space Information Awards Image Review Workshop Artist Parking Load In/Out Booth Sitting Lodging Police Letter for Artists Other Info 2025 Artists About About The Festival Maps Festival Program Judges Mission Statement Foundation Committee Members Award Winners Poster Artist Previous Posters Previous Programs Schools Exhibits Children’s Workshop 2025 Emerging Artists Press Releases & News Support Us Volunteer at the Festival Patrons 2025 Patron List Become a Sponsor 2025 Sponsor List Support Our Foundation Store Contact"
    },
    {
      "url": "http://mail.wpsaf.org/artists/waitlist.html",
      "text": "Winter Park Sidewalk Art Festival: Instructions for Wait Listed Artists Home About the Festival About the Festival Award Winners Judges Poster Artist Children's Workshop Committee Members Driving Directions Food Concessions Mission Statement Music & Entertainment Parking & Bicycling Press Releases Previous Years Posters Schools Exhibit The Foundation Emerging Artists For the Artists Artist Application Artist Packet (Parking, Loading, etc.) General Information Police Letter Booth Sitting Artist Parking Instructions Schedule for Load-in Map for Load-in and Load-out Print the Packet Awards Dates & Deadlines Emerging Artists Instructions: Invited Artists Image Review Workshop Instructions: Wait Listed Artists Jury & Space Info Lodging Other Info Wi-Fi in Park Artist Gallery Alphabetical List of Artists Clay Digital Art Fiber Emerging Artists Drawing & Pastels Glass Jewelry Leather Metal Mixed Media 2D Mixed Media 3D Painting Photography Printmaking Sculpture Watercolor Wood Patrons Join Now Our Patrons Sponsorships Sponsorships Sponsor Package Volunteers Festival Volunteers Home Hosting Volunteers Festival Store Posters Programs Park Map Contact INSTRUCTIONS FOR WAIT LISTED ARTISTS, The Winter Park Sidewalk Art Festival 2019 TO REMAIN ON THE WAIT LIST Go to www.zapplication.org and log in to your ZAPP account ASAP but no later than December 3, 2018, Midnight (EST). If you wish to be removed from the Wait List, you may âDeclineâ our invitation. Otherwise, your name will remain on our Wait List in your selected category. In the My Profile section, verify the accuracy of your contact and website information in ZAPP .  Correct any items ASAP but no later than December 3, 2018. Between now and March 1st, this contact information should enable you to respond to us within 48 hours of receipt of an invitation to fill a cancellation. If a space becomes available after March 1st, we will continue calling through the Wait List until we reach an artist in the same category who can immediately accept our invitation to participate in the Festival. In the event you are accepted from our Wait List, your ZAPP information will also be used to update our show database and for the Booth ID Card, the website, the Festival programs and other Festival-related media and advertising. NOTES: Your booth fee payment will be required only upon acceptance of an invitation to fill a cancellation in your category. Depending on our print deadline, artists accepted from the Wait List may not be featured in the Festival program. The Wait List will be maintained in ZAPP for your convenience. IMPORTANT REMINDER: Midnight, DECEMBER 3, 2019 (EST) Wait List âdeclineâ due to ZAP. Contact and website information verified and corrected in ZAPP. TO ACCEPT WHEN CALLED TO FILL A CANCELLATION Go to www.zapplication.org and log in to your ZAPP account From the My ZAPPlications page, please find The Winter Park Sidewalk Art Festival and choose the Accept or Decline link. If you choose to \"Accept\" , go to the ZAPPÂ® Shop section in your ZAPP account. Select the booth fee payment of $485.00 (which includes $29.60 Orange County, FL Sales Tax of 6.5%). Payment is required before your participation can be confirmed. Please pay this fee within five (5) days of this notification, or we must assume you cannot accept the invitation and your status will be changed to âWithdrawnâ and your space will be offered to another artist. While in your ZAPP account, please go to the My Profile section and verify your contact and website information for accuracy. NOTES: You will have 48 hours to reply to us if you are asked to join our show from the Wait List. However, if a space becomes available after March 1st and we are unable to reach you immediately by telephone, we will continue calling through the Wait List until we reach another artist in the same category who can accept our invitation to participate in the Festival. You may exhibit only in the category checked on your ZAPP application. A Wait-Listed artist will normally be assigned the space of the artist they are replacing. Click here to download a printable PDF of this page. The Winter Park Sidewalk Art Festival P.O. Box 597 Winter Park, FL 32790-0597 (407) 644-7207 E-mail: WPSAF@wpsaf.org © Copyright The Winter Park Sidewalk Art Festival, All Rights Reserved"
    },
    {
      "url": "https://business.winterpark.org/list/member/the-winter-park-sidewalk-art-festival-5007884",
      "text": "The Winter Park Sidewalk Art Festival | Arts & Cultural Organizations Skip to content Join Now Member Login Upcoming Events Facebook Instagram LinkedIn YouTube About Us About Us Board of Directors Staff Trustees Blog Membership Join Now Member Directory Membership Benefits Member Onboarding Marketing Opportunities Events & Programs Signature Events Signature Series Leadership Winter Park Relaunch Youth Leaders Resources Winter Park  Prosperity Scorecard Meeting Room Rentals Job Board Member Discounts Leadership Development Visit Welcome Center Park Avenue Member Directory Relocation Guide Interactive Map The Winter Park Sidewalk Art Festival Categories Arts & Cultural Organizations P.O. Box 597 Winter Park FL 32790-0597 (407) 644-7207 wpsaf.org Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel © 2025 Winter Park Chamber of Commerce | Site by GrowthZone Membership Resources Member Member Login Member Member Benefits Member Onboarding Member Onboarding Member Card Member Directory Get in Touch Address & Map 151 W. Lyman Ave., Winter Park, FL 32789 Phone icon 407.644.8281 Envelope icon wpcc@winterpark.org Facebook Instagram LinkedIn YouTube © 2025 Winter Park Chamber of Commerce. All Rights Reserved. Site by GrowthZone"
    }
  ]
}