{
  "fuentes": [
    {
      "url": "https://wslr.org/fogartyville-defunded/",
      "email": "-mmoran@scgov.net"
    },
    {
      "url": "https://wslr.org/fogartyville-defunded/",
      "email": "-rcutsinger@scgov.net"
    },
    {
      "url": "https://wslr.org/fogartyville-defunded/",
      "email": "jneunder@scgov.net"
    },
    {
      "url": "https://wslr.org/fogartyville-defunded/",
      "email": "mhsmith@scgov.net"
    },
    {
      "url": "https://wslr.org/fogartyville-defunded/",
      "email": "nrainford@scgov.net"
    },
    {
      "url": "https://wslr.org/members/johannes-werner/",
      "email": "news@wslr.org"
    },
    {
      "url": "https://wslr.org/event/call-for-artists-memento-mori/",
      "email": "fogartyville@wslr.org"
    },
    {
      "url": "https://wslr.org/contact/",
      "email": "info@wslr.org"
    },
    {
      "url": "https://wslr.org/contact/",
      "email": "info@wslr.orgto"
    },
    {
      "url": "https://wslr.org/contact/",
      "email": "psa@wslr.org"
    },
    {
      "url": "https://wslr.org/news-team/",
      "email": "news@wslr.org"
    },
    {
      "url": "https://wslr.org/news-team/",
      "email": "scooplopez@erols.com"
    },
    {
      "url": "https://wslr.org/board-of-directors/",
      "email": "info@wslr.org"
    }
  ],
  "mails": [
    "-mmoran@scgov.net",
    "-rcutsinger@scgov.net",
    "fogartyville@wslr.org",
    "info@wslr.org",
    "info@wslr.orgto",
    "jneunder@scgov.net",
    "mhsmith@scgov.net",
    "news@wslr.org",
    "nrainford@scgov.net",
    "psa@wslr.org",
    "scooplopez@erols.com"
  ],
  "nombre_sitio": "wslr.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://wslr.org/fogartyville-defunded/",
      "text": "Fogartyville Defunded!  - WSLR+Fogartyville Facebook call DJ @ 941-954-8636 Donate Now About Us Mission, Vision, and Values WSLR History WSLR Testimonials Board of Directors Board Members Staff Committees Contact IDEA Policy Employment Opportunities WSLR 96.5 Radio Programs Full Week Schedule Grid Become a Programmer Submit a PSA How to Listen to WSLR News News Team Activist Calendar Podcasts Critical Times Emergency Resources Transparency Policies Fogartyville Music Art Film Community Fogartyville FAQs Support Membership Volunteer Founders Fund Underwriting and Sponsorship Merch Store Buy A Brick Donate Your Vehicle Day Sponsorship Leave a Legacy Archive Donate Now! Listen Live Democracy Now with Amy Goodman Need To Know Incognito Today's Show Schedule All Playlists On Air Now 10:00 AM - 11:00 AM Democracy Now! Up Next 11:00 AM - 01:00 PM Metropics See today's playlist Leave A Tip About Us Mission, Vision, and Values WSLR History WSLR Testimonials Board of Directors Board Members Staff Committees Contact IDEA Policy Employment Opportunities WSLR 96.5 Radio Programs Full Week Schedule Grid Become a Programmer Submit a PSA How to Listen to WSLR News News Team Activist Calendar Podcasts Critical Times Emergency Resources Transparency Policies Fogartyville Music Art Film Community Fogartyville FAQs Support Membership Volunteer Founders Fund Underwriting and Sponsorship Merch Store Buy A Brick Donate Your Vehicle Day Sponsorship Leave a Legacy Archive Donate Now! Programming Public Affairs Fogartyville Defunded! Written by Jesse Coleman on             Thursday, July 11, 2024 From Jesse Coleman, General Manager of WSLR+Fogartyville Hello, I am writing to update you on the disheartening news we received Wednesday morning. The Sarasota County Commission has cut funding to WSLR+Fogartyville from the Tourist Development Cultural Grant recommended by the Arts and Cultural Alliance of Sarasota County. This is devastating.This decision limits our ability to provide the community with the world-class talent that you have come to expect. Their decision did not come as a surprise to us. We became aware during last year’s funding process that Commissioner Mike Moran would be challenging our TDC funding.  That did not happen in 2023, instead, the Commission decided to restructure the criteria by which grants would be awarded. New panelists and new criteria were established, and we stepped up as an organization, submitting a proposal that met their requirements. Based on their discussions with Commissioners, Arts Alliance staff shared with us that there was no way WSLR would be receiving funding this year no matter what the grants panel decided. The panelists reviewed WSLR+Fogartyville’s application and we scored strongly on the rubric, garnering a 93.11 and a recommendation to fund the request at 90% for $27,822.33. Ignoring the panel’s recommendation, Commissioner Neunder singled out WSLR and Embracing Our Differences as falling short of an unexplained ‘litmus test’, and Commissioner Rainford then added Avenida De Colores’ Chalk Festival to the chopping block. The only reasoning the Commissioners gave was that these organizations offer events that are open to the public and do not have ticketed entry for reporting purposes. This does not apply to us. Fogartyville offered 66 world-class ticketed concerts in the 2023-2024 season and our ticketed customers completed required reporting surveys. The Commissioner’s stated objections are bogus. This decision was a brazen political maneuver . It was not made based on the quality of offerings or the applications not meeting the criteria. Fogartyville, Embracing our Differences, and the Chalk Festival are committed to being inclusive, and welcoming diverse artist perspectives. This County Commission continues to undermine the integrity of its own processes, just as we have seen them do to child care and mental health funding. They have ignored the work of the citizen-led advisory councils set up by the commission themselves. We hope that everyone who appreciates live music and other forms of creative expression will stand with us as we continue to amplify the voices of our diverse community and promote peace, sustainability, democracy, and economic and social justice. We need your help now to make up for this huge loss. Keep Fogartyville Community Media and Arts Center bringing unparalleled programming to Sarasota County by donating today. MAKE A DONATION TO SUPPORT FOGARTYVILLE In community, Jesse Coleman General Manager WSLR+Fogartyville Below we have  a draft email you can send your County Commissioners to voice your opposition to this defunding: Mike Moran -mmoran@scgov.net, Mark Smith – mhsmith@scgov.net, Neil Rainford – nrainford@scgov.net, Joe Neunder – jneunder@scgov.net, Ron Cutsinger -rcutsinger@scgov.net Subject: Strong Opposition to Defunding Arts Programming at Fogartyville Dear Sarasota County Commissioner, I am writing to express my strong opposition to the decision to defund arts programming at Fogartyville. This decision undermines the cultural and economic health of our community. Fogartyville has provided essential, diverse, and enriching arts programs that many in our community value and rely on. The arts are not expendable. Defunding these programs disregards their significant contributions to our community. I urge you to reconsider this decision and restore funding immediately. Our community deserves better, and we will not remain silent as you remove vital resources. Sincerely, [Your Name] [Your Address] [Your Email Address] [Your Phone Number] Author Jesse Coleman Author's archive Search Coming Up Next Metropics 11:00 am The Thom Hartmann Show 1:00 pm Out of the Basement…On the Road 2:00 pm Ted’s Head 4:00 pm Alternative Radio 6:00 pm Discovery Road 7:00 pm Cardwell’s Cove Spaceage Luau 9:00 pm Subscribe to our mailing list Email Address: * Our Mailing Lists: WSLR+Fogartyville E-News Weekly WSLR News Update Powered by Robly ™ WSLR APP FOLLOW WSLR You may also like Public Affairs 0 Healthy Living Hour – All About the Face with Michelle Gellis Rebecca Acosta Monday, September 8, 2025 Event 0 Peace & Justice Report: One Stop Housing Tom Walker Monday, September 1, 2025 Public Affairs 0 Healthy Living Hour with Dr Cyndi.  Your role in Healthcare Rebecca Acosta Monday, August 25, 2025 Continue reading Next post ‘Mother’ of marijuana legalization gets farewell event in Sarasota Previous post Venice seeks compromise between developers, homeowners WSLR+Fogartyville About Mission Statement About the Station Programming Schedule Contact Us Location, Map & Directions Programming Listening Options Music News & Public Affairs WSLR Podcasts Events Fogartyville Music Art Community Support Membership Volunteer Donate Your Vehicle Leave a Legacy User Login Copyright WSLR+Fogartyville 2005-2023 Your browser does not support the audio element. X Mission Statement WSLR+Fogartyville is a center for creative expression and community engagement that amplifies the voices of our diverse community, and promotes peace, sustainability, democracy, and economic and social justice. X Meeting Schedule Board Meetings Programmer Committee 2nd Monday of the month at 6pm 1st Monday of the month at 6pm ×"
    },
    {
      "url": "https://wslr.org/members/johannes-werner/",
      "text": "Johannes Werner - WSLR+Fogartyville Facebook call DJ @ 941-954-8636 Donate Now About Us Mission, Vision, and Values WSLR History WSLR Testimonials Board of Directors Board Members Staff Committees Contact IDEA Policy Employment Opportunities WSLR 96.5 Radio Programs Full Week Schedule Grid Become a Programmer Submit a PSA How to Listen to WSLR News News Team Activist Calendar Podcasts Critical Times Emergency Resources Transparency Policies Fogartyville Music Art Film Community Fogartyville FAQs Support Membership Volunteer Founders Fund Underwriting and Sponsorship Merch Store Buy A Brick Donate Your Vehicle Day Sponsorship Leave a Legacy Archive Donate Now! Listen Live The Detail with Cathy Antunes Talking . . . Today's Show Schedule All Playlists On Air Now 09:00 AM - 10:00 AM The Detail Up Next 10:00 AM - 11:00 AM Democracy Now! See today's playlist Leave A Tip About Us Mission, Vision, and Values WSLR History WSLR Testimonials Board of Directors Board Members Staff Committees Contact IDEA Policy Employment Opportunities WSLR 96.5 Radio Programs Full Week Schedule Grid Become a Programmer Submit a PSA How to Listen to WSLR News News Team Activist Calendar Podcasts Critical Times Emergency Resources Transparency Policies Fogartyville Music Art Film Community Fogartyville FAQs Support Membership Volunteer Founders Fund Underwriting and Sponsorship Merch Store Buy A Brick Donate Your Vehicle Day Sponsorship Leave a Legacy Archive Donate Now! Staff Johannes Werner                              / News Director Johannes is a veteran journalist who directs WSLR News, your grassroots reporting from southwest Florida. Search Coming Up Next Democracy Now! 10:00 am Metropics 11:00 am The Thom Hartmann Show 1:00 pm Out of the Basement…On the Road 2:00 pm Ted’s Head 4:00 pm Alternative Radio 6:00 pm Discovery Road 7:00 pm Subscribe to our mailing list Email Address: * Our Mailing Lists: WSLR+Fogartyville E-News Weekly WSLR News Update Powered by Robly ™ WSLR APP FOLLOW WSLR You may also like Staff Ariel Aparicio-Jerro Ariel Aparicio-Jerro brings a decades-long hospitality background combined with experience as a singer-songwriter and independent recording artist to the director role at Fogartyville Community Media and Arts Center. “I’ve spent most of my adult life playing with my band (Ariel Aparicio & The Hired Guns) at places like Fogartyville” – including the final week of […] Staff Joe Vermilya Joe Vermilya works on event strategy for DMI Music & Media Solutions, most recently producing the experiential marketing for Rolling Stones tour sponsor AARP. He has experience as a concert/event producer, artists and repertoire A&R representative, booking agent, conference services host, venue manager, customer service manager, and strategic idea person. “I’ve been wanting to use […] Staff Leon Kerber Leon Kerber, a central figure in Sarasota’s music and cultural scene, hails from Columbus, Ohio, where he first honed his skills in radio and music. Moving to Sarasota in 2000, he has significantly influenced the local music scene, notably with bands like Fiasco, Tuss Sons, and Big Blu House, the latter commemorated by a painting in Fogartyville Community Media and Arts Center. Beyond performing, Leon has contributed to music education through the School of Rock, utilized music therapy for neurodivergent individuals, and managed prominent nightlife venues. His work extends to community radio, enhancing Sarasota’s cultural diversity. Married to Jamee since 2016, Leon’s life is a blend of personal growth, professional dedication, and community service, embodying a legacy of volunteerism and the transformative power of music.\r\n\r\n[caption id=\"attachment_28848\" align=\"alignnone\" width=\"2048\"] Leon Kerber plays the Rhodes - by Brian David Braun[/caption] WSLR+Fogartyville About Mission Statement About the Station Programming Schedule Contact Us Location, Map & Directions Programming Listening Options Music News & Public Affairs WSLR Podcasts Events Fogartyville Music Art Community Support Membership Volunteer Donate Your Vehicle Leave a Legacy User Login Copyright WSLR+Fogartyville 2005-2023 Your browser does not support the audio element. X Mission Statement WSLR+Fogartyville is a center for creative expression and community engagement that amplifies the voices of our diverse community, and promotes peace, sustainability, democracy, and economic and social justice. X Meeting Schedule Board Meetings Programmer Committee 2nd Monday of the month at 6pm 1st Monday of the month at 6pm ×"
    },
    {
      "url": "https://wslr.org/event/call-for-artists-memento-mori/",
      "text": "Call for Artists: Memento Mori - WSLR+Fogartyville Facebook call DJ @ 941-954-8636 Donate Now About Us Mission, Vision, and Values WSLR History WSLR Testimonials Board of Directors Board Members Staff Committees Contact IDEA Policy Employment Opportunities WSLR 96.5 Radio Programs Full Week Schedule Grid Become a Programmer Submit a PSA How to Listen to WSLR News News Team Activist Calendar Podcasts Critical Times Emergency Resources Transparency Policies Fogartyville Music Art Film Community Fogartyville FAQs Support Membership Volunteer Founders Fund Underwriting and Sponsorship Merch Store Buy A Brick Donate Your Vehicle Day Sponsorship Leave a Legacy Archive Donate Now! Listen Live Democracy Now with Amy Goodman Need To Know Incognito Today's Show Schedule All Playlists On Air Now 10:00 AM - 11:00 AM Democracy Now! Up Next 11:00 AM - 01:00 PM Metropics See today's playlist Leave A Tip About Us Mission, Vision, and Values WSLR History WSLR Testimonials Board of Directors Board Members Staff Committees Contact IDEA Policy Employment Opportunities WSLR 96.5 Radio Programs Full Week Schedule Grid Become a Programmer Submit a PSA How to Listen to WSLR News News Team Activist Calendar Podcasts Critical Times Emergency Resources Transparency Policies Fogartyville Music Art Film Community Fogartyville FAQs Support Membership Volunteer Founders Fund Underwriting and Sponsorship Merch Store Buy A Brick Donate Your Vehicle Day Sponsorship Leave a Legacy Archive Donate Now! Art Opening Community Fogartyville Call for Artists: Memento Mori Event info Date: Saturday, December 2, 2023 Time: 11:59 am Details Visual artists are invited to submit their 2D original work for inclusion in “Memento Mori, ” an exhibition that opens Wednesday, Jan. 24 at Fogartyville Community Media and Arts Center, 525 Kumquat Court and runs through March 3, 2024. Memento mori, which means “remember, you must die” in Latin, is an artistic trope that serves as a reminder of the inevitability of death and the transitory nature of earthly pleasures. In art history, a basic memento mori painting would be a portrait with a skull, but other symbols commonly found are hour glasses or clocks, extinguished or flickering candles, fruit and flowers. Closely related to memento mori is the vanitas still life. In addition to the symbols of mortality these may include musical instruments, wine and books. The curators for the exhibition encourage artists to explore the theme of remembering death and treating time as a gift in whatever way speaks to them, their practice and their culture. “Memento Mori” is part of Fogartyville’s ongoing Death Talk series, demystifying and enlightening conversations exploring mortality from diverse perspectives. Sales of any artwork are split in the artist’s favor 70-30 with WSLR+Fogartyville, a 501(c)(3) nonprofit organization. Artists should email jpegs of up to three works for consideration, along with contact information, website address and social media handles to: fogartyville@wslr.org Deadline for submission is Friday, Dec. 22 at 11:59 p.m. Add to Google Calendar Add Now Search Coming Up Next Metropics 11:00 am The Thom Hartmann Show 1:00 pm Out of the Basement…On the Road 2:00 pm Ted’s Head 4:00 pm Alternative Radio 6:00 pm Discovery Road 7:00 pm Cardwell’s Cove Spaceage Luau 9:00 pm Subscribe to our mailing list Email Address: * Our Mailing Lists: WSLR+Fogartyville E-News Weekly WSLR News Update Powered by Robly ™ WSLR APP FOLLOW WSLR WSLR+Fogartyville About Mission Statement About the Station Programming Schedule Contact Us Location, Map & Directions Programming Listening Options Music News & Public Affairs WSLR Podcasts Events Fogartyville Music Art Community Support Membership Volunteer Donate Your Vehicle Leave a Legacy User Login Copyright WSLR+Fogartyville 2005-2023 Your browser does not support the audio element. X Mission Statement WSLR+Fogartyville is a center for creative expression and community engagement that amplifies the voices of our diverse community, and promotes peace, sustainability, democracy, and economic and social justice. X Meeting Schedule Board Meetings Programmer Committee 2nd Monday of the month at 6pm 1st Monday of the month at 6pm ×"
    },
    {
      "url": "https://wslr.org/contact/",
      "text": "Contact Us - WSLR+Fogartyville Facebook call DJ @ 941-954-8636 Donate Now About Us Mission, Vision, and Values WSLR History WSLR Testimonials Board of Directors Board Members Staff Committees Contact IDEA Policy Employment Opportunities WSLR 96.5 Radio Programs Full Week Schedule Grid Become a Programmer Submit a PSA How to Listen to WSLR News News Team Activist Calendar Podcasts Critical Times Emergency Resources Transparency Policies Fogartyville Music Art Film Community Fogartyville FAQs Support Membership Volunteer Founders Fund Underwriting and Sponsorship Merch Store Buy A Brick Donate Your Vehicle Day Sponsorship Leave a Legacy Archive Donate Now! Listen Live The Detail with Cathy Antunes Talking . . . Today's Show Schedule All Playlists On Air Now 09:00 AM - 10:00 AM The Detail Up Next 10:00 AM - 11:00 AM Democracy Now! See today's playlist Leave A Tip About Us Mission, Vision, and Values WSLR History WSLR Testimonials Board of Directors Board Members Staff Committees Contact IDEA Policy Employment Opportunities WSLR 96.5 Radio Programs Full Week Schedule Grid Become a Programmer Submit a PSA How to Listen to WSLR News News Team Activist Calendar Podcasts Critical Times Emergency Resources Transparency Policies Fogartyville Music Art Film Community Fogartyville FAQs Support Membership Volunteer Founders Fund Underwriting and Sponsorship Merch Store Buy A Brick Donate Your Vehicle Day Sponsorship Leave a Legacy Archive Donate Now! Contact Us 17 By Email: General Email: info@wslr.org To submit PSA’s: psa@wslr.org By Telephone: Office Phone: (941) 894-6469 Studio Phone: (941) 954-8636 By Mail: WSLR-LP 96.5\nP.O. Box 2540\nSarasota, FL 34230 Map and Directions WSLR is located at 525 Kumquat Court in downtown Sarasota. Kumquat Court is located between Orange and Lemon Avenues just south of the Blvd of the Arts and North of Fruitville Road. Messages/Inquiries: Fill out this form to send us a message. Search Coming Up Next Democracy Now! 10:00 am Metropics 11:00 am The Thom Hartmann Show 1:00 pm Out of the Basement…On the Road 2:00 pm Ted’s Head 4:00 pm Alternative Radio 6:00 pm Discovery Road 7:00 pm Subscribe to our mailing list Email Address: * Our Mailing Lists: WSLR+Fogartyville E-News Weekly WSLR News Update Powered by Robly ™ WSLR APP FOLLOW WSLR WSLR+Fogartyville About Mission Statement About the Station Programming Schedule Contact Us Location, Map & Directions Programming Listening Options Music News & Public Affairs WSLR Podcasts Events Fogartyville Music Art Community Support Membership Volunteer Donate Your Vehicle Leave a Legacy User Login Copyright WSLR+Fogartyville 2005-2023 Your browser does not support the audio element. X Mission Statement WSLR+Fogartyville is a center for creative expression and community engagement that amplifies the voices of our diverse community, and promotes peace, sustainability, democracy, and economic and social justice. X Meeting Schedule Board Meetings Programmer Committee 2nd Monday of the month at 6pm 1st Monday of the month at 6pm ×"
    },
    {
      "url": "https://wslr.org/news-team/",
      "text": "News Team - WSLR+Fogartyville Facebook call DJ @ 941-954-8636 Donate Now About Us Mission, Vision, and Values WSLR History WSLR Testimonials Board of Directors Board Members Staff Committees Contact IDEA Policy Employment Opportunities WSLR 96.5 Radio Programs Full Week Schedule Grid Become a Programmer Submit a PSA How to Listen to WSLR News News Team Activist Calendar Podcasts Critical Times Emergency Resources Transparency Policies Fogartyville Music Art Film Community Fogartyville FAQs Support Membership Volunteer Founders Fund Underwriting and Sponsorship Merch Store Buy A Brick Donate Your Vehicle Day Sponsorship Leave a Legacy Archive Donate Now! Listen Live The Detail with Cathy Antunes Talking . . . Today's Show Schedule All Playlists On Air Now 09:00 AM - 10:00 AM The Detail Up Next 10:00 AM - 11:00 AM Democracy Now! See today's playlist Leave A Tip About Us Mission, Vision, and Values WSLR History WSLR Testimonials Board of Directors Board Members Staff Committees Contact IDEA Policy Employment Opportunities WSLR 96.5 Radio Programs Full Week Schedule Grid Become a Programmer Submit a PSA How to Listen to WSLR News News Team Activist Calendar Podcasts Critical Times Emergency Resources Transparency Policies Fogartyville Music Art Film Community Fogartyville FAQs Support Membership Volunteer Founders Fund Underwriting and Sponsorship Merch Store Buy A Brick Donate Your Vehicle Day Sponsorship Leave a Legacy Archive Donate Now! News Team 2 Johannes Werner News Director / news@wslr.org Johannes Werner is a journalist who has pursued a wide range of beats, from Berlin to Mexico City, Detroit, and Miami. During the last two decades, his career took him to cover Cuba, from his home base in Sarasota. All that changed in 2023: WSLR brought him home professionally early that year, to direct a growing news team that covers the economic and environmental dysfunction, political extremism, and the grassroots movements that are springing up in response. Johannes knows the ins and outs of this place, and he loves it. He has spent half of his life in Sarasota with his wife Sarah; their child was born at Sarasota Memorial Hospital. He also happens to be a founding member of WSLR, and hosted a public affairs show on 96.5 FM from 2005 to 2015. Gretchen Cochran Community Volunteer / gretchen.cochran@gmail.com Gretchen Cochran is a former pilot and race car driver, but always a news junky. Once owner of a small weekly newspaper and managing editor of a 100,000 circulation newspaper, she continues to tell stories - but printer's ink now gives way to radio waves. Ramon Lopez Community Volunteer / scooplopez@erols.com Ramon Lopez has 45-plus years experience as an aviation, aerospace and defense journalist, editor and manager for daily, weekly, monthly and bimonthly international publications. He was a regular contributor to Jane’s Airport Review and Unmanned Systems magazine. He edited the Precision Strike Digest . He previously served as editor-in-chief of Air Safety Week, editor-in-chief of Unmanned Systems and Washington Correspondent for Jane’s Defence Wee kly , Flight International and International Defense Review. He has worked in both radio and television news, in Washington, DC and now in Sarasota, FL. He holds a Bachelor of Arts Degree in Mass Communications from the University of Maryland with a minor in Journalism. Ryan Stanley Community Volunteer Ryan Stanley, a 30-year resident of Sarasota, is a New College of Florida graduate, wife, and mom. Over the last ten years, she has sewn together a patchwork quilt of paid and unpaid work with a dozen different non-profit organizations including Girl Scouts of the Gulf Coast, The Healthy Start Coalition of Sarasota County, and WSLR Community Radio+Fogartyville. Ryan also enjoys cooking, traveling, and the company of fierce women. Dania Hefley Intern Dania Hefley is a fourth-year Creative Writing major at New College of Florida. She is Venezuelan-American and spent part of her childhood in Ukraine and Georgia. She edits the poetry section of The NCF Review and is passionate about storytelling in all its forms. She loves the ocean, folky country music, and fostering strong, creative communities. Above all, she is curious, engaged, and always eager to connect through words. Noah Vinsky Reporter Noah Vinsky is back to freelancing for WSLR, after being a standout intern during fall 2024. He also happens to be the managing editor of The Oracle, the student-run, award-winning newspaper at USF covering the main campus in Tampa. Before taking the managerial reins, he earned a Sunshine State Award finalist spot for his sports reporting for the Oracle. Melody Saberian Intern Melody is a USF graduate with a Bachelor's in Women and Gender Studies. She is currently pursuing a graduate certificate in nonprofit and NGO management. She has experience in community outreach, education, and grassroots activism, with a passion for amplifying local voices and fostering civic engagement. At WSLR, Melody is excited to strengthen her skills in storytelling and community media while learning how nonprofit radio serves as a platform for change. She hopes to continue building a career dedicated to advocacy, service, and community empowerment. Brice Claypoole Intern Search Coming Up Next Democracy Now! 10:00 am Metropics 11:00 am The Thom Hartmann Show 1:00 pm Out of the Basement…On the Road 2:00 pm Ted’s Head 4:00 pm Alternative Radio 6:00 pm Discovery Road 7:00 pm Subscribe to our mailing list Email Address: * Our Mailing Lists: WSLR+Fogartyville E-News Weekly WSLR News Update Powered by Robly ™ WSLR APP FOLLOW WSLR WSLR+Fogartyville About Mission Statement About the Station Programming Schedule Contact Us Location, Map & Directions Programming Listening Options Music News & Public Affairs WSLR Podcasts Events Fogartyville Music Art Community Support Membership Volunteer Donate Your Vehicle Leave a Legacy User Login Copyright WSLR+Fogartyville 2005-2023 Your browser does not support the audio element. X Mission Statement WSLR+Fogartyville is a center for creative expression and community engagement that amplifies the voices of our diverse community, and promotes peace, sustainability, democracy, and economic and social justice. X Meeting Schedule Board Meetings Programmer Committee 2nd Monday of the month at 6pm 1st Monday of the month at 6pm ×"
    },
    {
      "url": "https://wslr.org/board-of-directors/",
      "text": "Board of Directors - WSLR+Fogartyville Facebook call DJ @ 941-954-8636 Donate Now About Us Mission, Vision, and Values WSLR History WSLR Testimonials Board of Directors Board Members Staff Committees Contact IDEA Policy Employment Opportunities WSLR 96.5 Radio Programs Full Week Schedule Grid Become a Programmer Submit a PSA How to Listen to WSLR News News Team Activist Calendar Podcasts Critical Times Emergency Resources Transparency Policies Fogartyville Music Art Film Community Fogartyville FAQs Support Membership Volunteer Founders Fund Underwriting and Sponsorship Merch Store Buy A Brick Donate Your Vehicle Day Sponsorship Leave a Legacy Archive Donate Now! Listen Live The Detail with Cathy Antunes Talking . . . Today's Show Schedule All Playlists On Air Now 09:00 AM - 10:00 AM The Detail Up Next 10:00 AM - 11:00 AM Democracy Now! See today's playlist Leave A Tip About Us Mission, Vision, and Values WSLR History WSLR Testimonials Board of Directors Board Members Staff Committees Contact IDEA Policy Employment Opportunities WSLR 96.5 Radio Programs Full Week Schedule Grid Become a Programmer Submit a PSA How to Listen to WSLR News News Team Activist Calendar Podcasts Critical Times Emergency Resources Transparency Policies Fogartyville Music Art Film Community Fogartyville FAQs Support Membership Volunteer Founders Fund Underwriting and Sponsorship Merch Store Buy A Brick Donate Your Vehicle Day Sponsorship Leave a Legacy Archive Donate Now! Board of Directors The WSLR+Fogartyville Board meets on the third Monday of the month, 6:30pm, at WSLR, 525 Kumquat Court, Sarasota, FL  34236. Meetings are open to the public. Note: Meetings are occasionally rescheduled due to holidays or other date conflicts; please call the station at 941-894-6469 to confirm the date and time of any particular monthly meeting. The Board consists of community members that are vetted by the current Board and are appointed to serve a 2-year term. A member of the Management Team is an ex-officio, non-voting member of the Board.  The Board appoints new members in October of each year. If you are interested in serving on the Board of Directors, please complete our Board Application and email it to info@wslr.org with the SUBJECT: Board Application, or mail it to Governance Committee, Board of Directors, PO Box 2540, Sarasota, FL  34230. ROLE OF THE BOARD : The Board governs the organization, which owns the assets of WSLR, including physical assets, the property at 525 Kumquat Court, and the FCC license. The Board is responsible for advancing the mission of WSLR. The Board establishes working committees that make recommendations for consideration by the full Board. The Board establishes prudent fiscal policies, approves an annual budget, conducts planning retreats, and approves personnel policies, editorial statements and programming policies. The Board is responsible for strategic planning. The Board participates in the fundraising functions of WSLR. Information about committees and meetings is available here . WSLR Bylaws (revised and approved 6/2023). WSLR+Fogartyville’s Strategic Plan is available here. Search Coming Up Next Democracy Now! 10:00 am Metropics 11:00 am The Thom Hartmann Show 1:00 pm Out of the Basement…On the Road 2:00 pm Ted’s Head 4:00 pm Alternative Radio 6:00 pm Discovery Road 7:00 pm Subscribe to our mailing list Email Address: * Our Mailing Lists: WSLR+Fogartyville E-News Weekly WSLR News Update Powered by Robly ™ WSLR APP FOLLOW WSLR WSLR+Fogartyville About Mission Statement About the Station Programming Schedule Contact Us Location, Map & Directions Programming Listening Options Music News & Public Affairs WSLR Podcasts Events Fogartyville Music Art Community Support Membership Volunteer Donate Your Vehicle Leave a Legacy User Login Copyright WSLR+Fogartyville 2005-2023 Your browser does not support the audio element. X Mission Statement WSLR+Fogartyville is a center for creative expression and community engagement that amplifies the voices of our diverse community, and promotes peace, sustainability, democracy, and economic and social justice. X Meeting Schedule Board Meetings Programmer Committee 2nd Monday of the month at 6pm 1st Monday of the month at 6pm ×"
    }
  ]
}