{
  "fuentes": [
    {
      "url": "https://www.westmoor.org/golf/meet-the-golf-staff",
      "email": "golfshop@westmoor.org"
    },
    {
      "url": "https://www.wynmoor.com/about-wynmoor/news-views/",
      "email": "karens@wynmoorcc.org"
    },
    {
      "url": "https://www.wynmoor.com/about-wynmoor/news-views/",
      "email": "kiaw@wynmoorcc.org"
    },
    {
      "url": "https://www.wynmoor.com/about-wynmoor/wynmoor-community-council/",
      "email": "recent@wynmoorcc.org"
    },
    {
      "url": "https://www.wynmoor.com/about-wynmoor/wynmoor-community-council/",
      "email": "fred_wynmoor@bellsouth.net"
    },
    {
      "url": "https://www.wynmoor.com/services/association-services/",
      "email": "residentregistration@wynmoorcc.org"
    },
    {
      "url": "https://www.sevenoaksgolf.com/contact-us",
      "email": "dpylinski@sevenoaksgolf.com"
    },
    {
      "url": "https://www.golflink.com/golf-courses/fl/coconut-creek/wynmoor-golf-course",
      "email": "customerservice@golflink.com"
    },
    {
      "url": "https://villagegreennurseryschool.org/contact/",
      "email": "vgns@fccsouthington.org"
    },
    {
      "url": "https://lynxgolf.co.uk/pages/who-we-are",
      "email": "rik@pqina.nl"
    },
    {
      "url": "https://www.wynmoor.com/recreation/clubs/",
      "email": "threebridgepub@aol.com"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    },
    {
      "url": "https://www.par3-executive-golf.com/Florida/FLBrowardWynmoorCommunityGolfCourse.htm",
      "email": "info@9holegolfcourses.com"
    },
    {
      "url": "https://puttviewbooks.com/products/wynmoor-village-golf-club",
      "email": "flags@2x.png"
    },
    {
      "url": "https://puttviewbooks.com/products/wynmoor-village-golf-club",
      "email": "globe@2x.png"
    },
    {
      "url": "https://puttviewbooks.com/products/wynmoor-village-golf-club",
      "email": "puttview_black_140x@2x.png"
    },
    {
      "url": "https://puttviewbooks.com/products/wynmoor-village-golf-club",
      "email": "puttview_black_200x@2x.png"
    },
    {
      "url": "https://puttviewbooks.com/products/wynmoor-village-golf-club",
      "email": "puttview_white_140x@2x.png"
    },
    {
      "url": "https://puttviewbooks.com/products/wynmoor-village-golf-club",
      "email": "puttview_white_200x@2x.png"
    },
    {
      "url": "https://puttviewbooks.com/products/wynmoor-village-golf-club",
      "email": "puttview_white_x50@2x.png"
    },
    {
      "url": "https://puttviewbooks.com/products/wynmoor-village-golf-club",
      "email": "recipient@giftnote.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/wynmoor-golf-course/",
      "email": "golf-club-detail@2x.png"
    },
    {
      "url": "https://www.1golf.eu/en/club/wynmoor-golf-course/",
      "email": "travel@albrecht.de"
    }
  ],
  "mails": [
    "customerservice@golflink.com",
    "dpylinski@sevenoaksgolf.com",
    "flags@2x.png",
    "fred_wynmoor@bellsouth.net",
    "globe@2x.png",
    "golf-club-detail@2x.png",
    "golfshop@westmoor.org",
    "info@9holegolfcourses.com",
    "info@inzmo.com",
    "karens@wynmoorcc.org",
    "kiaw@wynmoorcc.org",
    "puttview_black_140x@2x.png",
    "puttview_black_200x@2x.png",
    "puttview_white_140x@2x.png",
    "puttview_white_200x@2x.png",
    "puttview_white_x50@2x.png",
    "recent@wynmoorcc.org",
    "recipient@giftnote.com",
    "residentregistration@wynmoorcc.org",
    "rik@pqina.nl",
    "threebridgepub@aol.com",
    "travel@albrecht.de",
    "vgns@fccsouthington.org"
  ],
  "nombre_sitio": "wynmoor.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.westmoor.org/golf/meet-the-golf-staff",
      "text": "Meet the Golf Staff - Westmoor CC Member Sign In »Clear Forgot your password? Login Instructions Menu Home About Membership Membership Categories Golf Meet the Golf Staff Guest Information Amenities Dining & Social Pool Meet the Pool Staff Guest Information Tennis Meet the Tennis Staff Guest Policies Careers Contact Directions More ▾ Meet the Golf Staff Guest Information For additional information regarding golf, please contact: Golf Shop (262) 796-7812 golfshop@westmoor.org Golf Staff Vince Pulizzano • Head Golf Professional Vince has been the Head Golf Professional of Westmoor Country Club since 2014. Vince is a sixteen-year member of the PGA of America, and he achieved Certified Professional status in 2018. He brings a wealth of experience to Westmoor, holding previous positions as the Head Golf Professional of Hamilton Farm Golf Club in Gladstone, New Jersey (2010-2013) and as the Assistant Golf Professional at Conway Farms Golf Club in Lake Forest, Illinois (2005-2009). A consummate Golf Professional, Vince brings many skills to Westmoor. Customer service, merchandising, event management, recruiting, and club fitting are just a few of the areas in which he specializes. Vince has been recognized by his peers, winning a total of five PGA of America awards so far in his career. Vince is a graduate of Ferris State University (MI) where he earned a BS degree in Marketing and Professional Golf Management along with a certificate in Business-to-Business Marketing. He is married to his college sweetheart, Marsha, and he has two daughters: Olivia (born in 2011) and Emma (born in 2015). His family resides in Brookfield. Tyler Wood • Assistant Golf Professional Tyler is originally from Eagan, Minnesota. After graduating from Wisconsin Lutheran College in Milwaukee with a business degree, he has returned to WLC to coach the men’s golf team. Tyler has years of experience both playing and working in the golf industry. He played Division III golf and competed in two Division III NCAA National Championships. Tyler previously worked at Mendakota Country Club in Mendota Heights, Minnesota and also Troy Burne Golf Club in Hudson, Wisconsin. Tyler recently married his wife, Lauren, and moved to Waukesha Connor Adlington • Assistant Golf Professional Connor is returning from Scottsdale, Arizona, for his second season at Westmoor Country Club. Originally from Menomonee Falls, he has spent the last decade on the move. Connor served four years as a machine gunner in the United States Marine Corps. After being honorably discharged, he began school at the University of Colorado - Colorado Springs, attending their Professional Golf Management program. Newly graduated, Connor has been at Desert Highlands in Scottsdale, and was recently elected to Class A PGA membership. Molly Braid • Teaching Professional Molly is entering her fifth season as a Teaching Professional at Westmoor Country Club. Molly was recently named the 2022 Wisconsin PGA Teacher of the Year, and for the past four years, she has been named one of the Best Young Teachers in America and Best in State by Golf Digest. She played golf at Pfeiffer University in North Carolina, graduating with a degree in Exercise Science and Sports Medicine. After graduation, she earned her LPGA and PGA Certifications while working as a Teaching Professional and the Director of Junior Golf at the Dana Rader Golf School in Charlotte, North Carolina. Prior to moving to Milwaukee, Molly was the Head Women's Golf Coach at Ithaca College in New York. While coaching at Ithaca, Molly was named the 2016 LPGA T&CP Northeast Coach of the Year and 2017 Empire 8 Conference Coach of the Year. For more information about Molly and her instructional programs, visit www.braidgolf.com . Contact & Directions Privacy Policy - Site by ForeTees 400 South Moorland Road, Brookfield WI 53005 (262) 796-7800 © 2025 Westmoor Country Club"
    },
    {
      "url": "https://www.wynmoor.com/about-wynmoor/news-views/",
      "text": "News and Views Skip to main content Skip to footer Wynmoor Community Council Adult Community Catering to Your Lifestyle Search this website Facebook THEATRE Show Schedule Movies Schedule Purchasing Tickets Season RECREATION Classes Trips & Dinner Bus Racquet Complex Reservations Clubs Social Activities Special Events Dance & Live Music Country Club Business Center Art & Event Rooms Café on the Green Health Services – MultiMed Wynmoor Pool & Fitness Golf Membership Tournaments Pro Shop Services About Our City Contact Information Cable TV Lineup Links Career Opportunities Media News and Views The Village Choice Community updates Resources Architectural Guidelines Resident Information News and Views STAFF OFFICES: APPOINTMENTS ARE AVAILABLE. PLEASE CONTACT US VIA PHONE OR EMAIL. WELCOME to News & Views!  Wynmoor’s official publication.  News & Views is a clearly written, entertaining, and informative guide to the Wynmoor way of life.  Residents are dependent upon this media source to learn about all current events and activities, as well as recreational and educational options available to them just outside their doorstep. News & Views Publication August 2025 News and Views September 2025 News and Views News & Views Advertising All ads are by contract only Term of the contract is 6 months at a cost of $175.00 per month payable in 2-month increments of $350.00 each for a one half-page ad (8-1/2” x 5-1/2”); cost for a full-page ad (8-1/2” x 11”) is $300.00 per month payable in 2-month increments of $600.00 each.  The first payment is due upon contract signing. Ad copy must be directed to News & Views editor at kiaw@wynmoorcc.org no later than the 10 th of the month for the following month; ad may be revised each month if desired.  All changes must be received by the 10 th of the month and payment is due on the 10 th for the following month as well. Further questions may be directed to karens@wynmoorcc.org . News & Views Club Advertising All Club submissions are for Wynmoor Clubs Only. Club submissions are due the 1st of the month for the following month. All club submissions should be sent to kiaw@wynmoorcc.org . Activity Schedule Living in Wynmoor you will always have something to do. Our monthly activity schedule includes both Council and Club events. Please view the ‘Club Update’ Section of the News and Views to see Scheduled Club Activities Back To Previous Page Footer Active Adult Community (954) 978-2600 Driving Directions Address 1310 Avenue of Stars Coconut Creek, FL 33066 Facebook Copyright © 2025 Wynmoor Community Council. All rights reserved. Designed by AdSketch Design Return to top"
    },
    {
      "url": "https://www.wynmoor.com/about-wynmoor/wynmoor-community-council/",
      "text": "Wynmoor Community Council Skip to main content Skip to footer Wynmoor Community Council Adult Community Catering to Your Lifestyle Search this website Facebook THEATRE Show Schedule Movies Schedule Purchasing Tickets Season RECREATION Classes Trips & Dinner Bus Racquet Complex Reservations Clubs Social Activities Special Events Dance & Live Music Country Club Business Center Art & Event Rooms Café on the Green Health Services – MultiMed Wynmoor Pool & Fitness Golf Membership Tournaments Pro Shop Services About Our City Contact Information Cable TV Lineup Links Career Opportunities Media News and Views The Village Choice Community updates Resources Architectural Guidelines Resident Information Wynmoor Community Council Wynmoor Village has a population of over 9,000, residing in 5,260 units, consisting of 44 independent Condominium Associations. Wynmoor “Community Council”, the master association, has a 44-member Board of Directors, (One representative from each association). The Council Board of Directors oversees the maintenance and operation of the Council facilities, including the Theatre, Golf Course, Tennis Courts, Fitness Center, Main and Walking Pools, Country Clubhouse, Transportation Fleet, ect. The 5,260 unit owners in Wynmoor wholly own these amenities. Our fully trained professional staff of over 200, are dedicated to the common goal of promoting excellent “customer” service. Our Council Wynmoor Community Council, Inc. Jackie Railey, President Bruce Bandler, Administrator Selma Bass, Vice President Ronny Sydney, Vice President Vice President: Open Seat David  Mintzes, Vice President Alan Wagner, Secretary Fred Stein, Treasurer 1310 Avenue of the Stars Coconut Creek, Florida 33066 954-978-2600 Monday through Friday, 8 am – 12 pm From time to time, we send news and information to our residents via email. Please CLICK HERE ( RecEnt@wynmoorcc.org ) if you would like to be included. Be sure to type “Wynmoor News Updates” in the Subject Line. Back To Previous Page Footer Active Adult Community (954) 978-2600 Driving Directions Address 1310 Avenue of Stars Coconut Creek, FL 33066 Facebook Copyright © 2025 Wynmoor Community Council. All rights reserved. Designed by AdSketch Design Return to top"
    },
    {
      "url": "https://www.wynmoor.com/services/association-services/",
      "text": "Association Services Skip to main content Skip to footer Wynmoor Community Council Adult Community Catering to Your Lifestyle Search this website Facebook THEATRE Show Schedule Movies Schedule Purchasing Tickets Season RECREATION Classes Trips & Dinner Bus Racquet Complex Reservations Clubs Social Activities Special Events Dance & Live Music Country Club Business Center Art & Event Rooms Café on the Green Health Services – MultiMed Wynmoor Pool & Fitness Golf Membership Tournaments Pro Shop Services About Our City Contact Information Cable TV Lineup Links Career Opportunities Media News and Views The Village Choice Community updates Resources Architectural Guidelines Resident Information Association Services STAFF OFFICES: APPOINTMENTS ARE AVAILABLE PLEASE CONTACT US VIA PHONE OR EMAIL. New residents wishing to obtain a barcode should email a copy of your vehicle registration to ResidentRegistration@wynmoorcc.org or call 954-978-2600, and press 2. Once your vehicle is processed Wynmoor security will come to your parking lot and place the barcode on your vehicle. The Association Affairs Office assists condominium directors in operating their associations in accordance with the Florida Condominium Act (Florida Statute 718), as well as their condominium governing documents. If directors are unfamiliar with a situation or have reached a dead end, we assist in resolving it. Additional services include: Handle all requests for approval to sell or lease apartments Education on condominium living to directors and residents Maintain the official records of the condominiums Mediate disputed between associations and residents Property Management Back To Previous Page Footer Active Adult Community (954) 978-2600 Driving Directions Address 1310 Avenue of Stars Coconut Creek, FL 33066 Facebook Copyright © 2025 Wynmoor Community Council. All rights reserved. Designed by AdSketch Design Return to top"
    },
    {
      "url": "https://www.sevenoaksgolf.com/contact-us",
      "text": "Contact Us, Directions | Seven Oaks Golf Club at Colgate University COLGATE UNIVERSITY | 315-824-1432 | CONTACT US Skip to main content Golf Download Our App Book A Tee Time Golf Rates Our History The Course Practice Facility Rules & Regulations Download Our App Book A Tee Time Golf Rates Our History The Course Practice Facility Rules & Regulations Join Students Events Outings Lessons Golf Instruction & Clinics Coaches Corner Golf Instruction & Clinics Coaches Corner Store Gift Cards Merchandise Gift Cards Merchandise Search Close Search Keyword Search Search Keyword Search 54° Thu 09/11 clear sky 73°/53° Fri 09/12 clear sky 72°/52° Sat 09/13 overcast clouds 71°/55° Book A Tee Time Contact Us Get in touch or find driving directions to Seven Oaks Golf Club at Colgate University. X CONTACT INFORMATION ADDRESS 2 E Lake Rd (East Lake & Payne Streets) Hamilton, NY 13346 PHONE Golf: 315.824.1432 Restaurant: 315.824.4420 FEEDBACK Comments & suggestions welcome Call 1.888.986.0699 to share comments HOURS OF OPERATION Currently Closed GET IN TOUCH OR FIND US Please submit your inquiry and a member from our team will in touch or utilize the map below for directions. We hope to see you soon! CONTACT US FORM First Name Last Name Email Phone Subject Message Submit MEET THE TEAM DALLAS C. PYLINSKI, PGA Director of Golf Email Dallas TYLER COWEN Assistant Golf Professional GOLF IS CALLING YOUR NAME Designed by the Legendary Robert Trent Jones Sr. Seven Oaks is a must play. PLUS avoid booking fees when you book direct! Book A Round MANAGED BY QUICK LINKS The Course Online Store Careers at Seven Oaks Colgate University Colgate Athletics Colgate Inn CONTACT US Golf: 315.824.1432 Restaurant: 315.824.4420 Submit an Inquiry facebook instagram twitter ADDRESS 2 E Lake Road Hamilton, NY 13346 Get Driving Directions PLAY GOLF CALL 315.824.1432 OR Book A Tee Time JOIN OUR EMAIL LIST SUBSCRIBE TO GET THE LATEST NEWS AND OFFERS I consent to receive emails from Seven Oaks Golf Club. I can unsubscribe anytime. Email Thank you for subscribing. Enter Another Email Subscribe Copyright © 2025. Seven Oaks Golf Club at Colgate University. All Rights Reserved. Privacy Policy Terms of Use Accessibility Sitemap"
    },
    {
      "url": "https://www.golflink.com/golf-courses/fl/coconut-creek/wynmoor-golf-course",
      "text": "Wynmoor Golf Course, Coconut Creek, FL - Scorecard & Overview Join Now Log In Book a Tee Time Find a Course Learn Equipment Instruction Lifestyle Tour Golf Travel All Articles Resources Find Driving Ranges Find Golf Simulators About Us Find golf lessons Newsletter Join Now Log In Newsletter Search Courses Enter Keyword Home Courses FL Coconut Creek Private N/A No Reviews Yet Wynmoor Golf Course Opened in 1974 Wynmoor - Coconut Creek , Florida Course Details Scorecard Flyover Views Yardage Maps Reviews Nearby Courses Course Details Holes: 18 Par: 60 Length: 3456 yards Slope: 86 Rating: 57.7 Driving Ranges: No The 18-hole \"Wynmoor\" course at the Wynmoor Golf Course facility in Coconut Creek , Florida features 3456 yards of golf from the longest tees for a par of 60. The course rating is 57.7 and it has a slope rating of 86. The estimated green fees for 18 holes is $41. The Wynmoor golf course opened in  1974. Estimated Green Fees $41 These rates are an estimate of what you might expect to pay at Wynmoor with a cart. Actual rates may vary. Fees are typically lowest Monday through Thursday and during twilight (late afternoon and evenings). Expect to pay the highest rates on weekends. Scorecard for Wynmoor HOLE 1 2 3 4 5 6 7 8 9 OUT 10 11 12 13 14 15 16 17 18 IN TOT Blue 0/0 305 156 324 233 113 216 206 169 145 1867 136 108 89 143 189 129 285 174 235 1488 3355 Blue 0.00/0 305 156 324 233 113 216 206 169 145 1867 136 108 89 143 189 129 285 174 235 1488 3355 White 0.00/0 260 148 314 219 99 148 196 155 123 1662 122 99 172 130 75 99 268 149 215 1329 2991 White 0/0 260 148 314 219 99 148 196 155 123 1662 122 99 172 130 75 99 268 149 215 1329 2991 Red 0/0 234 132 306 196 86 140 176 133 112 1515 104 90 155 116 162 94 251 117 186 1275 2790 Red 0.00/0 234 132 306 196 86 140 176 133 112 1515 104 90 155 116 162 94 251 117 186 1275 2790 Par 4 3 4 4 3 3 4 3 3 31 3 3 3 3 3 3 4 3 4 29 60 Swipe to See full table Wynmoor Flyover Experience the course like never before with our Flyover feature. Get a bird's-eye view of each hole, helping you strategize your round and navigate the course with precision. Wynmoor Yardage Maps Plan your shots effectively with our Yardage Maps. Click on the yardage maps for detailed measurements on every hole, including distances to hazards and key landmarks, ensuring you make the right decisions on every swing. FRONT 9 BACK 9 HOLE 1 HOLE 2 HOLE 3 HOLE 4 HOLE 5 HOLE 6 HOLE 7 HOLE 8 HOLE 9 Load More Holes HOLE 10 HOLE 11 HOLE 12 HOLE 13 HOLE 14 HOLE 15 HOLE 16 HOLE 17 HOLE 18 What Golfers are Saying N/A Be the first to leave a review Write a review Add a Photo Drop Photo Here or Click to Upload Submit View More Courses in Coconut Creek Adios Golf Club, Adios Course Private Year Opened: 2014 7740 NW 39th Ave, Coconut Creek, FL, 33073-3127 5 miles from the center of Coconut Creek view course details 18 Holes 72 Par 6,735 Yards Driving Range: Yes Nearby cities with courses Boca Raton 35 Courses Boynton Beach 14 Courses Cooper City 1 Course Coral Springs 2 Courses Davie 3 Courses Deerfield Beach 1 Course Delray Beach 18 Courses Fort Lauderdale 4 Courses Hallandale Beach 2 Courses Hollywood 5 Courses Margate 2 Courses Parkland 1 Course Pembroke Pines 3 Courses Plantation 6 Courses Pompano Beach 3 Courses 1310 Avenue of The Stars, Coconut Creek, FL 33066-1485 (954) 978-2677 Visit course website Caption Join the GolfLink Newsletter! Sign up for golf news, information, and special offers. SUBSCRIBE By signing up you agree to receive communications from GolfLink and select partners in accordance with our Privacy Policy . You may opt out of email messages/withdraw consent at any time. FOLLOW US JOIN OUR NEWSLETTER Sign up for golf news, information and special offers SUBSCRIBE SUPPORT About GolfLink Partner With Us Contact GolfLink Support Privacy Policy Terms of Use Do Not Sell my Personal Information FOLLOW US Copyright © 1996-2025, LoveToKnow Media . All rights reserved. GolfLink™ is a trademark or registered trademark of LoveToKnow Media in the United States and or other countries."
    },
    {
      "url": "https://villagegreennurseryschool.org/contact/",
      "text": "Contact Us – Village Green Nursery School Skip to content Village Green Nursery School Learning through play. Menu + × expanded collapsed Prospective Family Information Program Overview About VGNS Contact Facebook Instagram Contact Us Please don’t hesitate to reach out using the contact information below or send a message via the form. Get in Touch 37 Main Street Southington , CT 06489 USA vgns@fccsouthington.org 860-628-6958 ext. 113 Instagram Facebook Twitter WordPress Want to send an inquiry form? Inquiry Form Send Us a Message Go back Your message has been sent Name (required) Warning Email (required) Warning Website Warning Message (required) Warning Warning. Submit Δ Like Loading... Village Green Nursery School , Blog at WordPress.com. Subscribe Subscribed Village Green Nursery School Sign me up Already have a WordPress.com account? Log in now. Village Green Nursery School Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar %d"
    },
    {
      "url": "https://lynxgolf.co.uk/pages/who-we-are",
      "text": "Who We Are | About Us | Lynx Golf UK Clubs Men Women Juniors Gear All Products Bags Accessories Gift Cards Bundles Personalise Sale Golf Guide Our Mission Our Mission Innovation Blog Custom Fitting 10 Clubs Men Women Juniors Gear All Products Bags Accessories Gift Cards Bundles Personalise Sale Golf Guide Our Mission Our Mission Innovation Blog Custom Fitting In the vibrant tapestry of golf history, one brand stands out as a testament to innovation and excellence: Lynx Golf. Born in the 1970s, Lynx emerged as a fierce contender in the world of golf equipment, quickly etching its name into the annals of the sport. From its humble beginnings to the present day, Lynx's journey is a remarkable tale of determination, cutting-edge technology, and triumph. 1970s – A Spark Ignites: Lynx Golf burst onto the scene in the heart of the disco era, embodying the spirit of change and progress. Its founders, John Riley and Carl Ross, were driven by a singular vision: to craft golf equipment that seamlessly fused precision with style. This commitment to excellence set the tone for decades to come. 1980s – A Golden Age: The 1980s saw Lynx soar to prominence as it introduced groundbreaking innovations, pushing the boundaries of golf equipment design. With cutting-edge materials and revolutionary club designs, the brand attracted a wave of enthusiasts and professionals alike. 1990s – Masters of Innovation: The brand's relentless pursuit of perfection birthed game-changing technologies, such as the Parallax irons, which gained a cult following. Amidst fierce competition, Lynx stood out as a beacon of innovation, capturing the hearts of golfers worldwide. Golfing legends such as Fred Couples and Ernie Els wielded Lynx clubs to victory, etching their names in history books. Couples winning the 1992 Masters, and Els the ’94 US Open. 2000s – Global Dominance: As the world entered a new millennium, Lynx continued to redefine golf equipment. The brand's dedication to crafting clubs that married form and function propelled it to the forefront of the golfing world. As the golf landscape evolved, Lynx Golf continued to evolve alongside it. The 2010s saw the brand adapt to modern demands, with an unwavering focus on performance, value and aesthetics. The Lynx Black Cat series, for instance, married sleek design with cutting-edge technology, captivating a new generation of golf enthusiasts. Present Day – Embrace Greatness: The modern advancements of artificial intelligence and bioengineering in sporting equipment has once again propelled Lynx to the front of the pack. The revolutionary Junior Ai clubs which are lauded for their technical application to the growing golfer have once again made Lynx the Brand of Choice for aspiring young golfers, spurred on by the guidance of savvy parents. Lynx continues to bring silverware to professional golfers, with Paul Eales winning the Jamaican Open in 2017, and Dame Laura Davies scooping the big win at the Inaugural Senior US Women’s Open in 2018. Today, Lynx Golf stands as a beacon of inspiration for golfers of all skill levels. With a legacy that spans generations, Lynx remains committed to its core principles of innovation, craftsmanship, and excellence. Unleash Your Potential: As you step onto the green, envision yourself wielding the tools of champions. Embrace the legacy of Lynx Golf and experience the exhilaration of game-changing equipment. Whether you're a seasoned pro or just teeing off for the first time, Lynx clubs are your gateway to unlocking your full potential. Join the ranks of golfing legends and enthusiasts who have embraced Lynx's legacy of  greatness. Elevate your game – choose Lynx Golf and redefine what's possible on the course. In every swing, there's a chance to make history. Choose Lynx Golf and unleash greatness with every shot. My services list Subscribe to newsletter and be the first to learn about best deals Keep subscribed More from Lynx About us FAQ Innovation Products Men's Women's Junior Ai Bags & Accessories Starter Sets Legal Privacy Policy Terms of Service Money-Back Guarantee Delivery Information Returns & Refunds Contact us Contact Us Retail Partners © Lynx Golf 2025 . All rights reserved."
    },
    {
      "url": "https://www.wynmoor.com/recreation/clubs/",
      "text": "Clubs Skip to main content Skip to footer Wynmoor Community Council Adult Community Catering to Your Lifestyle Search this website Facebook THEATRE Show Schedule Movies Schedule Purchasing Tickets Season RECREATION Classes Trips & Dinner Bus Racquet Complex Reservations Clubs Social Activities Special Events Dance & Live Music Country Club Business Center Art & Event Rooms Café on the Green Health Services – MultiMed Wynmoor Pool & Fitness Golf Membership Tournaments Pro Shop Services About Our City Contact Information Cable TV Lineup Links Career Opportunities Media News and Views The Village Choice Community updates Resources Architectural Guidelines Resident Information Clubs PLEASE CONTACT CLUB PRESIDENTS FOR FURTHER CLUB INFORMATION. B Ballet Exercise – 973-7740 Belly Dance Exercise – 439-0313 Ben’s Friends Art Club – 933-7755-9479 Billiard & Pool Club – 516-582-8327 or wynmoorpoolclub@gmail.com Bocce Club – 400-9302 Bookies Book Review –754-231-6368 Bridge Welcome to WynmoorBridge C Canasta – 822-6245 Ceramics Club – 450-567-2950 Chess Club – 917-548-5120 Clay Sculpture – 514-704-4497 Conservative Club – 956-3158 Current Events – 933-7743 D Democratic Club of Wynmoor – 305-720-5860 Drawing/Painting Workshop – 847-338-5962 E Eastern European Social – 267-688-2580 F Fishing Club – 516-526-5313 Fun with Friends- 973-820-1392 or FunWithFriendsWyn2@Gmail.com G Glass Kiln Club – 416-432-1280 Golf Association – 971-6544 Great To be Alive (GTA) – 590-8823 Guys & Dolls – 971-6544 H Hadassah – 612-1629 Health & Wellness Club – 971-9538 L Ladies Circle Club – 242-5421 Ladies Golf Association – 282-374-2672 Latin Women’s Club – 676-2773 M Mah Jongg (Monday) – 822-6245 Mah Jongg (Friday) – 822-6245 Monday Night Dance & Social Club – 867-8774 N Nature & Arts Club – 973-2181 Needlecraft Clique – 754-222-6375 P Photography Club – 917-359-7181                                                                                                                                                            Pickleball Club – 203-589-7733 Pottery Club – 631-495-4868 R Republican Club – 579-3118 S Shades of Color – 954-984-3672 Social Duplicate Bridge (Tuesday) – 970-3456 Social Duplicate Bridge (Friday) – 973-1223 Stained Glass Club – 727-237-8540 Stone Sculpture – 979-0774 T Tennis Club – 516-302-5229 U US Club – 984-2801 W Women’s Non-Fiction Book Club – 979-0295 Woodshop Club – 972-6231 Writers Workshop – 973-2181 Wynmoor Short Film Festival – 295-1551 or threebridgepub@aol.com **No area code indicates 954 ** Footer Active Adult Community (954) 978-2600 Driving Directions Address 1310 Avenue of Stars Coconut Creek, FL 33066 Facebook Copyright © 2025 Wynmoor Community Council. All rights reserved. Designed by AdSketch Design Return to top"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    },
    {
      "url": "https://www.par3-executive-golf.com/Florida/FLBrowardWynmoorCommunityGolfCourse.htm",
      "text": "Wynmoor Community Golf Course, Coconut Creek, Florida Par 3 Golf Courses Home (current) United States Alabama Alaska Arizona Arkansas California Colorado Connecticut DC Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming International Africa Australia Austria Belgium Canada Caribbean China Croatia CzechRep Denmark Finland France Germany Hungary Iceland Indonesia Ireland Luxembourg Mexico Netherlands New Zealand Norway Portugal Singapore Spain Turkey United Arab Emirates United Kingdom Add/Edit Course About Us Join Email List Our Other Golf Sites GroupChips.com GolfPuns.com GolfMajors2020.com ReachTheGreen.com WinFreeGolfBalls.com Wynmoor Community Golf Course, Coconut Creek, Florida Get your short game on! Florida Home Florida Course List Florida County Map Wynmoor Community Golf Course 1310 Avenue Of The Stars Coconut Creek FL 33066 Phone: (954) 978-2677 Type: Private Par: 60 Holes: 18 Website: https://www.wynmoor.com/golf/ Comments: Wynmoor's 18-hole Executive Golf Course is recognized as one the finest in Florida. Photos info@9holegolfcourses.com Copyright © Morton Technologies, LLC - All rights reserved | Privacy Policy Our disclosure to you: We spend a great deal of time keeping our directory up-to-date.  We are a participant in the Amazon Services LLC Associates Program, an affiliate advertising program designed to provide a means for us to earn fees by linking to Amazon.com and affiliated sites.  We also partner with other advertisers like Rock Bottom Golf and earn commissions by linking to their websites as well.  Please contact us if you have any questions. Par 3 and Executive Golf Courses Privacy Notice × Privacy Notice This privacy notice discloses the privacy practices for Par 3 and Executive Golf Courses. This privacy notice applies solely to information collected by this website. It will notify you of the following: What personally identifiable information is collected from you through the website, how it is used and with whom it may be shared. What choices are available to you regarding the use of your data. The security procedures in place to protect the misuse of your information. How you can correct any inaccuracies in the information. Information Collection, Use, and Sharing We are the sole owners of the information collected on this site. We only have access to/collect information that you voluntarily give us via email or other direct contact from you. We will not sell or rent this information to anyone. We will use your information to respond to you, regarding the reason you contacted us. We will not share your information with any third party outside of our organization, other than as necessary to fulfill your request, e.g. to ship an order. Unless you ask us not to, we may contact you via email in the future to tell you about specials, new products or services, or changes to this privacy policy. Your Access to and Control Over Information You may opt out of any future contacts from us at any time. You can do the following at any time by contacting us via the email address or phone number given on our website: See what data we have about you, if any. Change/correct any data we have about you. Have us delete any data we have about you. Express any concern you have about our use of your data. Security We take precautions to protect your information. When you submit sensitive information via the website, your information is protected both online and offline. Wherever we collect sensitive information (such as credit card data), that information is encrypted and transmitted to us in a secure way. You can verify this by looking for a lock icon in the address bar and looking for \"https\" at the beginning of the address of the Web page. While we use encryption to protect sensitive information transmitted online, we also protect your information offline. Only employees who need the information to perform a specific job (for example, billing or customer service) are granted access to personally identifiable information. The computers/servers in which we store personally identifiable information are kept in a secure environment. If you feel that we are not abiding by this privacy policy, you should contact us immediately via email. Registration In order to use this website, a user must first complete the registration form. During registration a user is required to give certain information (such as name and email address). This information is used to create a unique user account for you to access our web portal. At your option, you may also provide demographic information (such as gender or age) about yourself, but it is not required. Orders We request information from you on our order form. To buy from us, you must provide contact information (like name and shipping address) and financial information (like credit card number, expiration date). This information is used for billing purposes and to fill your orders. If we have trouble processing an order, we'll use this information to contact you. Cookies We use \"cookies\" on this site. A cookie is a piece of data stored on a site visitor's hard drive to help us improve your access to our site and identify repeat visitors to our site. For instance, when we use a cookie to identify you, you would not have to log in a password more than once, thereby saving time while on our site. Cookies can also enable us to track and target the interests of our users to enhance the experience on our site. Usage of a cookie is in no way linked to any personally identifiable information on our site. Some of our business partners may use cookies on our site (for example, advertisers). However, we have no access to or control over these cookies. Sharing We share aggregated demographic information with our partners and advertisers. This is not linked to any personal information that can identify any individual person.  We use a credit card processing company to bill users for goods and services. These companies do not retain, share, store or use personally identifiable information for any secondary purposes beyond filling your order. Links This website may contain links to other sites. Please be aware that we are not responsible for the content or privacy practices of such other sites. We encourage our users to be aware when they leave our site and to read the privacy statements of any other site that collects personally identifiable information. Surveys & Contests From time-to-time our site requests information via surveys or contests. Participation in these surveys or contests is completely voluntary and you may choose whether or not to participate and therefore disclose this information. Information requested may include contact information (such as name and shipping address), and demographic information (such as zip code, age level). Contact information will be used to notify the winners and award prizes. Survey information will be used for purposes of monitoring or improving the use and satisfaction of this site. Close We'd like permission to email you ONCE a month! We promise, just once a month.  We will email you news about our site, deals and offers from Golf retailers, and other Golf info you might find interesting! You can opt-out at any time, but we hope you don't. Just enter your email below.  We will send you a validation link to confirm you really do want email from us (we respect your privacy). Email Address Also enter me for FREE Monthly Golf Ball Drawing at WinFreeGolfBalls.com * Click here to submit form and join our list! * We also own WinFreeGolfBalls.com - we will NEVER sell or otherwise transfer your email address to anyone.  Never! No thanks Golf info isn't important to me"
    },
    {
      "url": "https://puttviewbooks.com/products/wynmoor-village-golf-club",
      "text": "Wynmoor Village Golf Club\n– PuttView [{\"id\":451630039334,\"handle\":\"all-books\",\"title\":\"All Books\",\"updated_at\":\"2025-09-10T07:03:38-04:00\",\"body_html\":\"\",\"published_at\":\"2023-06-26T16:05:39-04:00\",\"sort_order\":\"best-selling\",\"template_suffix\":\"\",\"disjunctive\":true,\"rules\":[{\"column\":\"type\",\"relation\":\"equals\",\"condition\":\"Book\"},{\"column\":\"type\",\"relation\":\"equals\",\"condition\":\"PuttView\"}],\"published_scope\":\"global\"},{\"id\":165610455092,\"handle\":\"florida\",\"title\":\"Florida\",\"updated_at\":\"2025-09-10T07:03:38-04:00\",\"body_html\":\"\",\"published_at\":\"2020-05-30T13:23:15-04:00\",\"sort_order\":\"alpha-asc\",\"template_suffix\":\"list\",\"disjunctive\":false,\"rules\":[{\"column\":\"tag\",\"relation\":\"equals\",\"condition\":\"State_Florida\"}],\"published_scope\":\"global\"},{\"id\":165612224564,\"handle\":\"shop-all\",\"title\":\"Shop All\",\"updated_at\":\"2025-09-10T07:03:38-04:00\",\"body_html\":\"\",\"published_at\":\"2020-05-30T13:42:54-04:00\",\"sort_order\":\"best-selling\",\"template_suffix\":\"list\",\"disjunctive\":false,\"rules\":[{\"column\":\"variant_price\",\"relation\":\"greater_than\",\"condition\":\"0\"}],\"published_scope\":\"global\",\"image\":{\"created_at\":\"2020-05-30T13:44:03-04:00\",\"alt\":null,\"width\":374,\"height\":69,\"src\":\"\\/\\/puttviewbooks.com\\/cdn\\/shop\\/collections\\/puttview.png?v=1590860644\"}}] [\"City_Coconut Creek\",\"Country_United States of America\",\"Course_Wynmoor Village Golf Club\",\"import_2020_07_08_185650\",\"State_Florida\"] Skip to content \"Close\" Log in Search Site navigation Cart Search \"Close (esc)\" View more Close (esc) Close (esc) Close (esc) Close (esc) Wynmoor Village Golf Club Coconut Creek, Florida, United States of America No reviews Regular price $49.00 / Conquer every hole at Wynmoor Village Golf Club with elite-level green and yardage insights. Estimated arrival at ZIP Order within Type: Yardage + Green Map Help me choose Yardage + Green Map $49.00 Major Slopes $39.00 Yardage Only $29.00 Which Course Book Type Should I Choose? Unit: Yards Yards Meters Yardage + Green Map / Yards - $49.00 USD Major Slopes / Yards - $39.00 USD Yardage Only / Yards - $29.00 USD Yardage + Green Map / Meters - $49.00 USD Major Slopes / Meters - $39.00 USD Yardage Only / Meters - $29.00 USD Quantity − + Add to cart $49.00 [{\"id\":32206849015860,\"title\":\"Yardage + Green Map \\/ Yards\",\"option1\":\"Yardage + Green Map\",\"option2\":\"Yards\",\"option3\":null,\"sku\":\"134761\",\"requires_shipping\":true,\"taxable\":true,\"featured_image\":{\"id\":41708456378662,\"product_id\":4639421071412,\"position\":4,\"created_at\":\"2023-06-09T14:35:28-04:00\",\"updated_at\":\"2023-06-09T14:35:28-04:00\",\"alt\":null,\"width\":1080,\"height\":1080,\"src\":\"\\/\\/puttviewbooks.com\\/cdn\\/shop\\/products\\/yardagegreenmap_6c8fc712-c8d1-4340-bc70-98545a9466e7.jpg?v=1686335728\",\"variant_ids\":[32206849015860,45195895898406]},\"available\":true,\"name\":\"Wynmoor Village Golf Club - Yardage + Green Map \\/ Yards\",\"public_title\":\"Yardage + Green Map \\/ Yards\",\"options\":[\"Yardage + Green Map\",\"Yards\"],\"price\":4900,\"weight\":56,\"compare_at_price\":null,\"inventory_management\":null,\"barcode\":null,\"featured_media\":{\"alt\":null,\"id\":34074705068326,\"position\":4,\"preview_image\":{\"aspect_ratio\":1.0,\"height\":1080,\"width\":1080,\"src\":\"\\/\\/puttviewbooks.com\\/cdn\\/shop\\/products\\/yardagegreenmap_6c8fc712-c8d1-4340-bc70-98545a9466e7.jpg?v=1686335728\"}},\"requires_selling_plan\":false,\"selling_plan_allocations\":[]},{\"id\":45195895832870,\"title\":\"Major Slopes \\/ Yards\",\"option1\":\"Major Slopes\",\"option2\":\"Yards\",\"option3\":null,\"sku\":\"164826\",\"requires_shipping\":true,\"taxable\":true,\"featured_image\":{\"id\":29316835409972,\"product_id\":4639421071412,\"position\":3,\"created_at\":\"2022-06-29T15:18:10-04:00\",\"updated_at\":\"2022-06-29T15:18:10-04:00\",\"alt\":null,\"width\":1920,\"height\":1920,\"src\":\"\\/\\/puttviewbooks.com\\/cdn\\/shop\\/products\\/AQAA0dke8gZ4R6vNUkY3wcpAY2mpS5hAMAq7jzjGekcTd6aEW5qNOSz98T0AKS9802N0r7YTDegVzfc_V7a5qQa5rg_cd5c80b4-8cf1-4248-ad58-0932ed285903.jpg?v=1656530290\",\"variant_ids\":[45195895832870,45195895931174]},\"available\":true,\"name\":\"Wynmoor Village Golf Club - Major Slopes \\/ Yards\",\"public_title\":\"Major Slopes \\/ Yards\",\"options\":[\"Major Slopes\",\"Yards\"],\"price\":3900,\"weight\":56,\"compare_at_price\":null,\"inventory_management\":null,\"barcode\":null,\"featured_media\":{\"alt\":null,\"id\":21594515767348,\"position\":3,\"preview_image\":{\"aspect_ratio\":1.0,\"height\":1920,\"width\":1920,\"src\":\"\\/\\/puttviewbooks.com\\/cdn\\/shop\\/products\\/AQAA0dke8gZ4R6vNUkY3wcpAY2mpS5hAMAq7jzjGekcTd6aEW5qNOSz98T0AKS9802N0r7YTDegVzfc_V7a5qQa5rg_cd5c80b4-8cf1-4248-ad58-0932ed285903.jpg?v=1656530290\"}},\"requires_selling_plan\":false,\"selling_plan_allocations\":[]},{\"id\":45195895865638,\"title\":\"Yardage Only \\/ Yards\",\"option1\":\"Yardage Only\",\"option2\":\"Yards\",\"option3\":null,\"sku\":\"164827\",\"requires_shipping\":true,\"taxable\":true,\"featured_image\":{\"id\":14564803084340,\"product_id\":4639421071412,\"position\":2,\"created_at\":\"2020-07-09T01:11:00-04:00\",\"updated_at\":\"2020-07-09T01:11:00-04:00\",\"alt\":null,\"width\":1080,\"height\":1080,\"src\":\"\\/\\/puttviewbooks.com\\/cdn\\/shop\\/products\\/Yardage-book_46c46381-1378-4ecf-955e-9ca3a74736eb.jpg?v=1594271460\",\"variant_ids\":[45195895865638,45195895963942]},\"available\":true,\"name\":\"Wynmoor Village Golf Club - Yardage Only \\/ Yards\",\"public_title\":\"Yardage Only \\/ Yards\",\"options\":[\"Yardage Only\",\"Yards\"],\"price\":2900,\"weight\":56,\"compare_at_price\":null,\"inventory_management\":null,\"barcode\":null,\"featured_media\":{\"alt\":null,\"id\":6737050697780,\"position\":2,\"preview_image\":{\"aspect_ratio\":1.0,\"height\":1080,\"width\":1080,\"src\":\"\\/\\/puttviewbooks.com\\/cdn\\/shop\\/products\\/Yardage-book_46c46381-1378-4ecf-955e-9ca3a74736eb.jpg?v=1594271460\"}},\"requires_selling_plan\":false,\"selling_plan_allocations\":[]},{\"id\":45195895898406,\"title\":\"Yardage + Green Map \\/ Meters\",\"option1\":\"Yardage + Green Map\",\"option2\":\"Meters\",\"option3\":null,\"sku\":\"164828\",\"requires_shipping\":true,\"taxable\":true,\"featured_image\":{\"id\":41708456378662,\"product_id\":4639421071412,\"position\":4,\"created_at\":\"2023-06-09T14:35:28-04:00\",\"updated_at\":\"2023-06-09T14:35:28-04:00\",\"alt\":null,\"width\":1080,\"height\":1080,\"src\":\"\\/\\/puttviewbooks.com\\/cdn\\/shop\\/products\\/yardagegreenmap_6c8fc712-c8d1-4340-bc70-98545a9466e7.jpg?v=1686335728\",\"variant_ids\":[32206849015860,45195895898406]},\"available\":true,\"name\":\"Wynmoor Village Golf Club - Yardage + Green Map \\/ Meters\",\"public_title\":\"Yardage + Green Map \\/ Meters\",\"options\":[\"Yardage + Green Map\",\"Meters\"],\"price\":4900,\"weight\":56,\"compare_at_price\":null,\"inventory_management\":null,\"barcode\":null,\"featured_media\":{\"alt\":null,\"id\":34074705068326,\"position\":4,\"preview_image\":{\"aspect_ratio\":1.0,\"height\":1080,\"width\":1080,\"src\":\"\\/\\/puttviewbooks.com\\/cdn\\/shop\\/products\\/yardagegreenmap_6c8fc712-c8d1-4340-bc70-98545a9466e7.jpg?v=1686335728\"}},\"requires_selling_plan\":false,\"selling_plan_allocations\":[]},{\"id\":45195895931174,\"title\":\"Major Slopes \\/ Meters\",\"option1\":\"Major Slopes\",\"option2\":\"Meters\",\"option3\":null,\"sku\":\"164829\",\"requires_shipping\":true,\"taxable\":true,\"featured_image\":{\"id\":29316835409972,\"product_id\":4639421071412,\"position\":3,\"created_at\":\"2022-06-29T15:18:10-04:00\",\"updated_at\":\"2022-06-29T15:18:10-04:00\",\"alt\":null,\"width\":1920,\"height\":1920,\"src\":\"\\/\\/puttviewbooks.com\\/cdn\\/shop\\/products\\/AQAA0dke8gZ4R6vNUkY3wcpAY2mpS5hAMAq7jzjGekcTd6aEW5qNOSz98T0AKS9802N0r7YTDegVzfc_V7a5qQa5rg_cd5c80b4-8cf1-4248-ad58-0932ed285903.jpg?v=1656530290\",\"variant_ids\":[45195895832870,45195895931174]},\"available\":true,\"name\":\"Wynmoor Village Golf Club - Major Slopes \\/ Meters\",\"public_title\":\"Major Slopes \\/ Meters\",\"options\":[\"Major Slopes\",\"Meters\"],\"price\":3900,\"weight\":56,\"compare_at_price\":null,\"inventory_management\":null,\"barcode\":null,\"featured_media\":{\"alt\":null,\"id\":21594515767348,\"position\":3,\"preview_image\":{\"aspect_ratio\":1.0,\"height\":1920,\"width\":1920,\"src\":\"\\/\\/puttviewbooks.com\\/cdn\\/shop\\/products\\/AQAA0dke8gZ4R6vNUkY3wcpAY2mpS5hAMAq7jzjGekcTd6aEW5qNOSz98T0AKS9802N0r7YTDegVzfc_V7a5qQa5rg_cd5c80b4-8cf1-4248-ad58-0932ed285903.jpg?v=1656530290\"}},\"requires_selling_plan\":false,\"selling_plan_allocations\":[]},{\"id\":45195895963942,\"title\":\"Yardage Only \\/ Meters\",\"option1\":\"Yardage Only\",\"option2\":\"Meters\",\"option3\":null,\"sku\":\"164830\",\"requires_shipping\":true,\"taxable\":true,\"featured_image\":{\"id\":14564803084340,\"product_id\":4639421071412,\"position\":2,\"created_at\":\"2020-07-09T01:11:00-04:00\",\"updated_at\":\"2020-07-09T01:11:00-04:00\",\"alt\":null,\"width\":1080,\"height\":1080,\"src\":\"\\/\\/puttviewbooks.com\\/cdn\\/shop\\/products\\/Yardage-book_46c46381-1378-4ecf-955e-9ca3a74736eb.jpg?v=1594271460\",\"variant_ids\":[45195895865638,45195895963942]},\"available\":true,\"name\":\"Wynmoor Village Golf Club - Yardage Only \\/ Meters\",\"public_title\":\"Yardage Only \\/ Meters\",\"options\":[\"Yardage Only\",\"Meters\"],\"price\":2900,\"weight\":56,\"compare_at_price\":null,\"inventory_management\":null,\"barcode\":null,\"featured_media\":{\"alt\":null,\"id\":6737050697780,\"position\":2,\"preview_image\":{\"aspect_ratio\":1.0,\"height\":1080,\"width\":1080,\"src\":\"\\/\\/puttviewbooks.com\\/cdn\\/shop\\/products\\/Yardage-book_46c46381-1378-4ecf-955e-9ca3a74736eb.jpg?v=1594271460\"}},\"requires_selling_plan\":false,\"selling_plan_allocations\":[]}] {\"id\":32206849015860,\"title\":\"Yardage + Green Map \\/ Yards\",\"option1\":\"Yardage + Green Map\",\"option2\":\"Yards\",\"option3\":null,\"sku\":\"134761\",\"requires_shipping\":true,\"taxable\":true,\"featured_image\":{\"id\":41708456378662,\"product_id\":4639421071412,\"position\":4,\"created_at\":\"2023-06-09T14:35:28-04:00\",\"updated_at\":\"2023-06-09T14:35:28-04:00\",\"alt\":null,\"width\":1080,\"height\":1080,\"src\":\"\\/\\/puttviewbooks.com\\/cdn\\/shop\\/products\\/yardagegreenmap_6c8fc712-c8d1-4340-bc70-98545a9466e7.jpg?v=1686335728\",\"variant_ids\":[32206849015860,45195895898406]},\"available\":true,\"name\":\"Wynmoor Village Golf Club - Yardage + Green Map \\/ Yards\",\"public_title\":\"Yardage + Green Map \\/ Yards\",\"options\":[\"Yardage + Green Map\",\"Yards\"],\"price\":4900,\"weight\":56,\"compare_at_price\":null,\"inventory_management\":null,\"barcode\":null,\"featured_media\":{\"alt\":null,\"id\":34074705068326,\"position\":4,\"preview_image\":{\"aspect_ratio\":1.0,\"height\":1080,\"width\":1080,\"src\":\"\\/\\/puttviewbooks.com\\/cdn\\/shop\\/products\\/yardagegreenmap_6c8fc712-c8d1-4340-bc70-98545a9466e7.jpg?v=1686335728\"}},\"requires_selling_plan\":false,\"selling_plan_allocations\":[]} Product Description Book size measurement is 6.5\"x 3.75\" and greens are scaled to no larger than 3/8 inch to 5 yards (USGA conforming). Distance is presented in yards and slope is presented in percentage. They are saddle stitched to fit perfectly inside a traditional yardage book cover. Variant types: Yardage Penalty to penalty width distance Carries and runout distances Compass off tee shot and into green Tee to fairway and fairway to green +/- elevation change To green and from tee distance rings Major Slopes Everything in the yardage book, plus: Detailed thermal green view with contours and arrows in major slope areas (3% and above). Also includes arrows and contours in surrounding areas around green. Fairway arrows that represent slope above 4% Yardage + Green Map Everything in the yardage book, plus: Duel view topographical green map Thermal View - easily see ridges and spot possible hole locations Detailed View - supports green reading with arrows and contours shown at the maximum resolution allowed within the rules of golf Fairway arrows that represent slope above 4% 0 Shipping & Returns Shipping As our books are made to order, shipping times may vary. We appreciate your patience and understanding. Returns ReturnsWe only accept returns for books confirmed by the carrier to be damaged during transit. Please inspect your order upon delivery and contact us within 14 days of the posted delivery date if the item is defective, damaged, or incorrect. To initiate a return for a damaged book, please contact us at support@puttviewbooks.com.help.puttviewbooks.com+2help.puttviewbooks.com+2puttview-books.tenereteam.com+2 Wynmoor Village Golf Club Type\n                Yardage + Green Map\n              \n            \n              \n              \n                Unit\n                Yards $49 +ADD Elite-Level Data Trusted by Elite Teams Nationwide USGA Compliant Elite-Level Data Trusted by Elite Teams Nationwide USGA Compliant Elite-Level Data Trusted by Elite Teams Nationwide USGA Compliant Elite-Level Data Trusted by Elite Teams Nationwide USGA Compliant Thousands are using PuttView to up their game \"Compact, waterproof, and incredibly accurate. Worth every penny for competitive play.\" Sarah T. Great for Strategy \"I use this book for every round now. The fairway and green details have helped me plan my shots much better. It’s like having a personal caddy on the course.\" Mark T. Verified Reviewer “The most accurate course maps I've ever used. My game has improved with every round!” Michael B. Perfect for Tournament Prep \"The detail in the yardage and green maps is exceptional. I felt more confident on the course and made smarter decisions during my rounds. Highly recommend for serious golfers!\" John D. Verified Reviewer \"Stunning detail and impressive quality\" Driving Range Hero Excellent and Accurate Information \"Thanks PuttView for giving me an edge that helps me play, putt and SCORE my best.\" Michael M. Verified Reviewer \"Have been using these books for awhile and they are the best. Gives you all the information you need on the course and is very simple to read and understand.\" Brian F The Only Books I Use Puttview books are by far the easiest to understand and use for tournament play. The added lines of play off the tee make practice rounds and taking notes for the tournament super easy. I highlight the line of play I think is best and write what club I will use right on the line. Matthew j. Verified Reviewer Customer Reviews Be the first to write a review Write a review 0% (0) 0% (0) 0% (0) 0% (0) 0% (0) You may also like Save $5.00 No reviews Fuzzy Bunkers Leather Cover from $30.00 Regular price $35.00 Sale price No reviews Gift Card from $10.00 Save $9.00 No reviews Winston Yardage Book Cover from $40.00 Regular price $49.00 Sale price No reviews Statcards with Inspiration $10.00 265 Verified Reviews PuttView PuttView Home PuttView Points Club Best Practices Returns and Refunds Other PuttView Products Call Us Privacy Policy Terms of Service Affiliates Subscribe for updates Subscribe for updates Enter your email Currency USD $ AED د.إ ALL L AMD դր. ANG ƒ AUD $ AWG ƒ AZN ₼ BAM КМ BBD $ BDT ৳ BGN лв. BND $ BOB Bs. BSD $ BWP P BZD $ CAD $ CHF CHF CNY ¥ CRC ₡ CVE $ CZK Kč DJF Fdj DKK kr. DOP $ DZD د.ج EGP ج.م ETB Br EUR € FJD $ FKP £ GBP £ GMD D GNF Fr GTQ Q GYD $ HKD $ HNL L HUF Ft IDR Rp ILS ₪ INR ₹ ISK kr JMD $ JPY ¥ KES KSh KGS som KHR ៛ KMF Fr KRW ₩ KYD $ KZT ₸ LAK ₭ LKR ₨ MAD د.م. MDL L MNT ₮ MOP P MUR ₨ MVR MVR MWK MK MYR RM NGN ₦ NIO C$ NPR Rs. NZD $ PEN S/ PGK K PHP ₱ PKR ₨ PLN zł PYG ₲ QAR ر.ق RON Lei RSD РСД RWF FRw SAR ر.س SBD $ SEK kr SGD $ SLL Le STD Db THB ฿ TOP T$ TTD $ TWD $ TZS Sh UGX USh USD $ UYU $U UZS so'm VND ₫ VUV Vt WST T XAF CFA XCD $ XOF Fr XPF Fr American Express Apple Pay Bancontact Diners Club Discover Google Pay iDEAL JCB Maestro Mastercard PayPal Shop Pay Union Pay Venmo Visa © 2025 Competitive Golf Advantage, LLC Powered by Zettler Digital Previous Next \"Close (esc)\""
    },
    {
      "url": "https://www.1golf.eu/en/club/wynmoor-golf-course/",
      "text": "Wynmoor Golf Course, Coconut Creek, FL - Albrecht Golf Guide Golf Courses Golf Hotels Golf Packages Bookshop Apps Sign in / Sign up Saved Items Deutsch English Español Italiano Albrecht Golf Guide Golf courses in North America United States Florida Wynmoor Golf Course 18 Hole Private Overview Course Visitors Amenities Reviews No image available Wynmoor Golf Course 1310 Avenue of Stars, Coconut Creek, FL 33066, USA Phone: +1 954-978-2677 , Fax: +1 954-968-2524 www.wynmoor.com Map Save Share The Course 18-Hole Executive Course Driving Range  &  Practice area Visitors welcome? By invitation only. Season: Year round The Course 18-Hole Executive Course Opened in 1974 Terrain: Water hazards Technical difficulty: Easy Scorecard Tee Par CR Slope Length Blue (Men) 60 57.7 86 3456 yards White (Men) 60 57 85 3140 yards Red (Women) 60 57.4 87 2855 yards Practice Facilities Driving Range Putting Green Chipping Green Visitors 18-Hole Executive Course Reserved for members and their guests. Amenities Club Amenities Snack Bar Rentals Clubs for hire Electro-cart for hire Enlarge / get directions Nearby Courses Palm-Aire Country Club & Resort Pompano Beach (3.2 km) 3.3 of 5 stars (3) 54 Hole 26-68 € / 18 Holes Oriole Golf & Tennis Club Margate (5.1 km) 4.0 of 5 stars (1) 18 Hole 1371 € / 18 Holes Margate Executive Golf Course Margate (5.4 km) 4.0 of 5 stars (1) 9 Hole See all User Reviews There are no user reviews yet. Been to Wynmoor Golf Course ? Share your experiences! Write a Review Golf Packages Tenerife, Spain Tivoli La Caleta Tenerife Resort 5 stars Very good 8,4 / 10 7 Nights 5 green fees from € 1475 per person Tenerife, Spain Hacienda del Conde Meliá Collection Golf & Spa 5 stars Wonderful 9,1 / 10 7 Nights HB unlimited golf from € 1231 per person La Gomera, Spain Hotel Jardín Tecina 4 stars Excellent 8,7 / 10 7 Nights HB 5 green fees from € 833 per person Majorca, Spain Elba Sunset Mallorca 4 stars Very good 8,2 / 10 7 Nights 5 green fees from € 855 per person Majorca, Spain VIVA Golf Adults Only 18+ 4 stars Superior Very good 8,4 / 10 7 Nights HB 5 green fees from € 1083 per person Sicily, Italy Verdura Resort 5 stars Excellent 8,8 / 10 7 Nights 4 green fees from € 1269 per person Porto Cervo, Italy Cervo Hotel, Costa Smeralda Resort 5 stars Excellent 8,8 / 10 7 Nights unlimited golf from € 1042 per person Cyprus Almyra 5 stars Very good 8,2 / 10 7 Nights 4 green fees from € 928 per person All Packages Get a €20 discount on your golf vacation with our newsletter Sign up for our newsletter and be the first to discover new golf packages, special offers, and exclusive golf tours. As a bonus, you will receive a €20 discount code for your next golf vacation. Yes, please send me the newsletter You can change your mind at any time by clicking the unsubscribe link in the footer of any newsletter you receive from us, or by contacting us at travel@albrecht.de . We will treat your information with respect. You can find details about our privacy practices here . By clicking above, you agree that we may process your information in accordance with these terms. Follow us on Instagram New Golf Guide Africa Asia Caribbean Central America Europe Middle East North America Pacific South America Golf Packages Book Golf Holiday Travel Themes Golf Round Trips Group Golf Tours Early Booking Deals Majorca Canary Islands Tuscany Algarve Andalusia Greece All Destinations Mobile App Golf Guide for iPhone Golf Guide for iPad Info Contact/Imprint Media Information Privacy Policy Terms Feedback © 2025 Albrecht Golf Verlag GmbH"
    }
  ]
}