{
  "fuentes": [
    {
      "url": "https://www.jcnewman.com/our-team/",
      "email": "aferrer@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/our-team/",
      "email": "apuncioni@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/our-team/",
      "email": "asariyan@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/our-team/",
      "email": "bramirez@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/our-team/",
      "email": "dlebold@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/our-team/",
      "email": "dludwig@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/our-team/",
      "email": "jcronin@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/our-team/",
      "email": "joliva@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/our-team/",
      "email": "kcastaldi@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/our-team/",
      "email": "lmarshall@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/our-team/",
      "email": "mdougherty@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/our-team/",
      "email": "mhayes@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/our-team/",
      "email": "mlott@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/our-team/",
      "email": "mrushing@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/our-team/",
      "email": "personalreserve@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/our-team/",
      "email": "rzunt@jcnewman.com"
    },
    {
      "url": "https://www.jcnewman.com/our-team/",
      "email": "spoza@jcnewman.com"
    },
    {
      "url": "https://www.fox13news.com/news/ybor-city-cigar-festival-returns-centennial-park",
      "email": "fox13tampanews@foxtv.com"
    },
    {
      "url": "https://www.ybormuseum.org/about-us",
      "email": "info@ybormuseum.org"
    },
    {
      "url": "https://tabanerocigars.com/pages/private-sporting-event",
      "email": "store@tabanerocigars.com"
    },
    {
      "url": "https://www.childrensfestival.ca/about/staff-board/",
      "email": "info@childrensfestival.ca"
    },
    {
      "url": "https://thatssotampa.com/ybor-city-cigar-festival/",
      "email": "info@thatssotampa.com"
    },
    {
      "url": "https://www.tampabay.com/breaking-news/ybor-citys-cigar-heritage-festival-aims-to-keep-cigar-city-smoky-20181202/",
      "email": "adawson@tampabay.com"
    },
    {
      "url": "https://www.tampabay.com/breaking-news/ybor-citys-cigar-heritage-festival-aims-to-keep-cigar-city-smoky-20181202/",
      "email": "licensing@zumapress.com"
    }
  ],
  "mails": [
    "adawson@tampabay.com",
    "aferrer@jcnewman.com",
    "apuncioni@jcnewman.com",
    "asariyan@jcnewman.com",
    "bramirez@jcnewman.com",
    "dlebold@jcnewman.com",
    "dludwig@jcnewman.com",
    "fox13tampanews@foxtv.com",
    "info@childrensfestival.ca",
    "info@thatssotampa.com",
    "info@ybormuseum.org",
    "jcronin@jcnewman.com",
    "joliva@jcnewman.com",
    "kcastaldi@jcnewman.com",
    "licensing@zumapress.com",
    "lmarshall@jcnewman.com",
    "mdougherty@jcnewman.com",
    "mhayes@jcnewman.com",
    "mlott@jcnewman.com",
    "mrushing@jcnewman.com",
    "personalreserve@jcnewman.com",
    "rzunt@jcnewman.com",
    "spoza@jcnewman.com",
    "store@tabanerocigars.com"
  ],
  "nombre_sitio": "yborcigarfestival.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.jcnewman.com/our-team/",
      "text": "Our Team | J.C. Newman Staff | J.C. Newman Cigar Co. HOME ABOUT US OUR CIGARS DOMINICAN REPUBLIC Diamond Crown MAXIMUS Julius Caeser Black Diamond Cuesta-Rey La Unica NICARAGUA Alcazar Brick House Bricktoberfest Don Jose El Baton Jose Gaspar Cigars Perla Del Mar Quorum Yagua Havana Q UNITED STATES The American The American All-Star Humidor Angel Cuesta LeRoy Neiman Tampa Smokers Wm Brown Decision El Reloj Cigars Factory Throwouts Mexican Segundos Tampa Trolleys Trader Jacks RETAILERS DIAMOND CROWN LOUNGES STORE LOCATOR ACCESSORIES CRAFTSMAN’S BENCH DIAMOND CROWN TEAM OUR TEAM CAREERS VISIT THE EL RELOJ DISTRICT HOME ABOUT US OUR CIGARS DOMINICAN REPUBLIC Diamond Crown MAXIMUS Julius Caeser Black Diamond Cuesta-Rey La Unica NICARAGUA Alcazar Brick House Bricktoberfest Don Jose El Baton Jose Gaspar Cigars Perla Del Mar Quorum Yagua Havana Q UNITED STATES The American The American All-Star Humidor Angel Cuesta LeRoy Neiman Tampa Smokers Wm Brown Decision El Reloj Cigars Factory Throwouts Mexican Segundos Tampa Trolleys Trader Jacks RETAILERS DIAMOND CROWN LOUNGES STORE LOCATOR ACCESSORIES CRAFTSMAN’S BENCH DIAMOND CROWN TEAM OUR TEAM CAREERS VISIT THE EL RELOJ DISTRICT Toggle navigation our team owners Eric Newman 3rd Generation Owner and                             President Bobby Newman 3rd Generation Owner and Executive Vice President Drew Newman 4th Generation Owner and General Counsel officers Vice President and General Manager El Reloj Aimee Cooks Vice President of Operations Rich Dolak Vice President of Sales and Marketing Cristal Lastra Vice President of Finance Scott Lewis Chief Financial Officer Shira Martin Vice President and General Manager El Reloj Aimee Cooks Year Started with the Company: 1997 Vice President of Operations Rich Dolak Year Started with the Company: 1996 Vice President of Sales and Marketing Cristal Lastra Year Started with the Company: 2015 Vice President of Finance Scott Lewis Year Started with the Company: 2001 Chief Financial Officer Shira Martin Year Started with the Company: 2000 management team Security and Safety Manager John Carlo Director of Eastern Territory Sales Jake Cronin Director of Western Territory Sales Michael Dougherty Marketing Manager Sydney Elliott Executive Director of Hospitality and Community Engagement Kara Guagliardo The American Room Production Manager Gene Haines Accounting & Accounts Receivable Manager Stacy McDermid European Brand Manager Aldo Puncioni SR. BUSINESS PROCESS MANAGER Terri Ryan Creative Director Tyler Storms Consumer Programs Director Chris Szeglowski Director of Military Sales Annie Vander Veen Warehouse Operations Manager Drew Washington Director of H.R. Payroll & Compliance Luke Wendell I.T. Manager David Witt Security and Safety Manager John Carlo Year Started with the Company: 2024 Director of Eastern Territory Sales Jake Cronin Territory: KY, MO, Southern IL, Western TN Year Started with the Company: 2005 2009 J.C. Newman Salesperson of the Year Email: jcronin@jcnewman.com Director of Western Territory Sales Michael Dougherty Territory: NV, CA Year Started with the Company: 1999 2010 J.C. Newman Salesperson of the Year 2011 J.C. Newman Salesperson of the Year 2017 Fuente Salesperson of the Year 2019 Trailblazer Award 2020 Cigar Family Award 2020 Fuente Salesperson of the Year 2021 Trailblazer Award Email: mdougherty@jcnewman.com Marketing Manager Sydney Elliott Year Started with the Company: 2022 Executive Director of Hospitality and Community Engagement Kara Guagliardo Year Started with the Company: 2010 The American Room Production Manager Gene Haines Accounting & Accounts Receivable Manager Stacy McDermid Year Started with the Company: 2014 European Brand Manager Aldo Puncioni Year Started with the Company: 2021 Email: apuncioni@jcnewman.com SR. BUSINESS PROCESS MANAGER Terri Ryan Year Started with the Company: 1991 Creative Director Tyler Storms Year Started with the Company: 2018 Consumer Programs Director Chris Szeglowski Year Started with the Company: 2018 Director of Military Sales Annie Vander Veen Year Started with the Company: 1998 Warehouse Operations Manager Drew Washington Year Started with the Company: 2022 Director of H.R. Payroll & Compliance Luke Wendell Year Started with the Company: 2015 I.T. Manager David Witt Year Started with the Company: 2007 regional sales managers Kristyn Castaldi Director of Eastern Territory Sales Jake Cronin Director of Western Territory Sales Michael Dougherty Antonio Ferrer Mark Hayes Dan Lebold Mills Lott David Ludwig Louis Marshall John Oliva Sean Poza Bradley Ramirez Michael Rushing Anthony Sariyan Rick Zunt Kristyn Castaldi Territory: CT, NH, MA, ME, RI, VT, Northeast NY Year Started with the Company: 2022 2024 Cigar Family Award 2024 Fuente Salesperson of the Year Email: kcastaldi@jcnewman.com Director of Eastern Territory Sales Jake Cronin Territory: KY, MO, Southern IL, Western TN Year Started with the Company: 2005 2009 J.C. Newman Salesperson of the Year Email: jcronin@jcnewman.com Director of Western Territory Sales Michael Dougherty Territory: NV, CA Year Started with the Company: 1999 2010 J.C. Newman Salesperson of the Year 2011 J.C. Newman Salesperson of the Year 2017 Fuente Salesperson of the Year 2019 Trailblazer Award 2020 Cigar Family Award 2020 Fuente Salesperson of the Year 2021 Trailblazer Award Email: mdougherty@jcnewman.com Antonio Ferrer Territory: South Florida Year Started with the Company: 2019 2021 Fuente Salesperson of the Year 2022 Fuente Salesperson of the Year 2022 Cigar Family Award 2022 J.C. Newman Salesperson of the Year Email: aferrer@jcnewman.com Mark Hayes Territory: MI, IN, Western OH Year Started with the Company: 2001 2009 J.C. Newman Salesperson of the Year 2014 Fuente Salesperson of the Year 2016 Fuente Salesperson of the year 2020 J.C. Newman Salesperson of the Year 2020 Cigar Family Award Email: mhayes@jcnewman.com Dan Lebold Territory: Western VA, PA, OH, NY, KY Year Started with the Company: 2015 Email: dlebold@jcnewman.com Mills Lott Territory: NC, Northern SC, Eastern TN, Southern VA. Year Started with the Company: 2019 Email: mlott@jcnewman.com David Ludwig Territory: AK, AZ, ID, MT, ND, OR, SD, WA, WY, UT, CO, NM Year Started with the Company: 2006 2010 Trailblazer Award 2014 J.C. Newman Salesperson of the Year 2015 Fuente Salesperson of the Year 2017 Cigar Family Award 2017 J.C. Newman Salesperson of the Year 2017 Trailblazer Award 2018 Trailblazer Award 2021 J.C. Newman Salesperson of the Year 2024 J.C. Newman Salesperson of the Year 2024 Cigar Family Award Email: dludwig@jcnewman.com Louis Marshall Territory: AL, GA, MS, SC, Western TN Year Started with the Company: 1999 2013 Fuente Salesperson of the Year 2016 J.C. Newman Salesperson of the Year 2012 Trailblazer Award 2016 Trailblazer Award 2022 Trailblazer Award 2023 Trailblazer Award 2024 Trailblazer Award Email: lmarshall@jcnewman.com John Oliva Northern/Central FL, AL. Year Started with the Company: 2018 Email: joliva@jcnewman.com Sean Poza Territory: TX, OK, LA Year Started with the Company: 2011 Email: spoza@jcnewman.com Bradley Ramirez Territory: Northern IL, MN, MO, WI, IA, KS, NE Year Started with the Company: 2019 2019 Cigar Family Award 2019 Fuente Salesperson of the Year Email: bramirez@jcnewman.com Michael Rushing Territory: Southeast PA, Southern NJ, DE, MD,DC, VA Year Started with the Company: 2023 Email: mrushing@jcnewman.com Anthony Sariyan Territory: NYC, Northern NJ, Northeast PA Year Started with the Company: 2015 2016 J.C. Newman Salesperson of the year 2018 J.C. Newman Salesperson of the year 2019 J.C. Newman Salesperson of the year 2018 Cigar Family Award 2023 Cigar Family Award 2023 Fuente Salesperson of the Year 2023 J.C. Newman Salesperson of the year Email: asariyan@jcnewman.com Rick Zunt Territory: Southern LA, MS, Southern TX, HI. Year Started with the Company: 2005 2011 Trailblazer Award 2013 J.C. Newman Salesperson of the year Email: rzunt@jcnewman.com In Loving Memory of Our Friend Stefan Bastiaenssens In Loving Memory of Our Friend Stefan Bastiaenssens Territory: All Territories outside the US; mainly Europe Year Started with the Company: 2018 Favorite JCN Cigar: Black Diamond Hobbies/Interests: Cigars, wine, beer, music fitness. Favorite Thing About the Cigar Industry: The bond that is created between two people that smoke. You can enter a cigar room or lounge without knowing anyone and leave it having made many new friends! Favorite Place to Travel: All countries in the Carribean Favorite Newman Memory: I love all members of the family, but Bobby was the first one I met. He picked me up at the airport when I flew over applying for the job and the first thing he said was: “I am Bobby, and this is Jeanny”. Next thing I know I am showing pictures of me and my family. Couldn’t think of a warmer welcome. Favorite Quote: “Happiness is about a good meal, a good cigar, and a good woman, or a bad woman, depending on how much happiness you can handle” Fun Fact: Stefan ran a cigar magazine for a number of years before joining the J.C. Newman Team. QUICK LINKS Follow Follow Follow Follow Follow BLOG FOUNDATION CONTACT CAREERS PRIVACY POLICY SHIPPING & RETURNS TERMS  & CONDITIONS AGE VERIFICATION SIGN UP FOR OUR NEWSLETTER Marketing Permissions Please check this box to confirm you would like to receive marketing materials and newsletters from J.C. Newman Cigar Co. Company News Tampa Events You can unsubscribe at any time by clicking the link in the footer of our emails. For information about our privacy practices, please visit our website. We use Mailchimp as our marketing platform. By clicking below to subscribe, you acknowledge that your information will be transferred to Mailchimp for processing. Learn more about Mailchimp's privacy practices here. Designed by Elegant Themes | Powered by WordPress This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settings Accept Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT"
    },
    {
      "url": "https://www.fox13news.com/news/ybor-city-cigar-festival-returns-centennial-park",
      "text": "Ybor City Cigar Festival returns to Centennial Park | FOX 13 Tampa Bay News Weather Sports Good Day We Live Here Contests More Watch Live Expand / Collapse search ☰ Search site News Top Stories Local Tampa Bay News Florida Tonight National FOX 13 Investigates Consumer Health Politics Seen on TV Daily Newsletter FOX News Sunday Weather SkyTower Radar Views Interactive Radar Live Webcams Marine Weather Weather Alerts Hurricane Safety Tracking the Tropics MyFoxHurricane FOX Weather Sports Buccaneers Rays Lightning No Off Days with Scott Smith Weekly Fishing Report High School Sports Good Day Traffic Charley's World Hometown Heroes Extraordinary Ordinaries Recipes First Birthdays We Live Here What's Right Dinner DeeAs One Tank Trips Theme Parks Made in Tampa Bay Recipes, Food & Drink Tampa Bay History Care Force Watch Live How To Stream Live FOX 13 Newscasts LiveNOW from FOX FOX Weather FOX Soul FOX Live Feed Central NASA TV Money Consumer Personal Finance The Economy Small Business Entertainment Headlines Trending Stories FOX Shows What's on FOX 13 Contests FOX Local Book Club Regional News Orlando News - FOX 35 Orlando Gainesville News - FOX 51 Gainesville Atlanta News - FOX 5 Atlanta About Us Meet the FOX 13 team TV Listings Jobs & Internships WTVT History Closed Captioning FCC Public File FCC Applications Contact Us Ybor City Cigar Festival returns to Centennial Park By Regina Gonzalez Published December 8, 2024 5:28pm EST Tampa FOX 13 News Share Copy Link Email Facebook Twitter LinkedIn Reddit TAMPA - The smell of fresh tobacco filled the Ybor City air on Sunday, as the largest cigar festival of its kind took over Centennial Park. \"This is the place where all the biggest personalities in the cigar industry brigade to enjoy this amazing festival,\" said Karen Berger, who traveled from Daytona Beach to sell her own name-brand cigars at the event. Ybor City Cigar Festival at Centennial Park. Cigar aficionados could be seen admiring premium hand-rolled cigars from dozens of global vendors; and, of course, indulged in tastings as they celebrated the craftsmanship and history of the industry that turned Tampa into what it is today. \"I was born in Clearwater. I was raised in Tampa. So being part of the cigar community, it means a lot to everyone in the city,\" said cigar enthusiast Bruce Busch. \"This is something special for us to showcase for everyone, not just the United States, but the world, there are people here from Europe right now. We're very proud of it.\" Statements like that are music to Rob Aguinaga's ears. Decades ago, his grandmother participated in the original cigar festivals of Ybor City. \" It's been going on since the 30s. It was called La Verbena,\" Aguinaga told FOX 13. \"They used to go on for a whole week. There was a full parade that brought out 15 or 16,000 people .\" Ybor City Cigar Festival at Centennial Park. Aguinaga's mother, Lisa Figueredo, is the founder and publisher of Cigar City Magazine. After changing hands in ownership a few times, their family took over the festival in 2016. Ever since, they've made it bigger and better with the help of presenting sponsors like Arturo Fuente Cigars and J.C. Newman Cigars. But Rob said they still have a grand vision in mind. \"We are thinking about maybe next year doing the week-long event and bringing that back to Tampa,\" Aguinaga added. STAY CONNECTED WITH FOX 13 TAMPA: Download the FOX Local app for your smart TV Download FOX Local mobile app: Apple | Android Download the FOX 13 News app for breaking news alerts, latest headlines Download the SkyTower Radar app Sign up for FOX 13’s daily newsletter Tampa Hillsborough County Daily Newsletter All the news you need to know, every day By clicking Sign Up, I confirm that I have read and agree to the Privacy Policy and Terms of Service . Trending Millions could lose SNAP benefits as stricter rules take effect Sarasota's 'Sash and Sill' owner arrested for third time on two additional larceny charges Suni Bell murder: Trial of 5 suspects in 4-year-old girl's shooting death begins Gibbs High School has the tallest wide receiver recruit in the country Potential Rays owner considering HCC as stadium site Latest headlines Remembering 9/11: Retired New York officers, firefighters join Governor DeSantis for Palm Harbor ceremony Charlie Kirk shooting: Person of interest photos released by FBI Charlie Kirk to receive posthumous Presidential Medal of Freedom Teen killed, 5 men hurt in shooting at Tampa apartment complex Citrus County deputy dies 2 years after being hit by a car at a high school graduation News Top Stories Local Tampa Bay News Florida Tonight National FOX 13 Investigates Consumer Health Politics Seen on TV Daily Newsletter FOX News Sunday Weather SkyTower Radar Views Interactive Radar Live Webcams Marine Weather Weather Alerts Hurricane Safety Tracking the Tropics MyFoxHurricane FOX Weather Sports Buccaneers Rays Lightning No Off Days with Scott Smith Weekly Fishing Report High School Sports Good Day Traffic Charley's World Hometown Heroes Extraordinary Ordinaries Recipes First Birthdays We Live Here What's Right Dinner DeeAs One Tank Trips Theme Parks Made in Tampa Bay Recipes, Food & Drink Tampa Bay History Care Force Watch Live How To Stream Live FOX 13 Newscasts LiveNOW from FOX FOX Weather FOX Soul FOX Live Feed Central NASA TV Money Consumer Personal Finance The Economy Small Business Entertainment Headlines Trending Stories FOX Shows What's on FOX 13 Contests FOX Local Book Club Regional News Orlando News - FOX 35 Orlando Gainesville News - FOX 51 Gainesville Atlanta News - FOX 5 Atlanta About Us Meet the FOX 13 team TV Listings Jobs & Internships WTVT History Closed Captioning FCC Public File FCC Applications Contact Us facebook twitter instagram youtube email New Privacy Policy Updated Terms of Use Your Privacy Choices FCC Public File EEO Public File About Us Jobs at FOX 13 Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"
    },
    {
      "url": "https://www.ybormuseum.org/about-us",
      "text": "About Us | My Site top of page Home About Us Board & Staff Code of Ethics Contact Events Event Sponsors Sponsors Join & Give Memberships (New/Renewing) Donate Programs Mobile Museum Education Material Fernando's Footsteps Visit Ybor City Parking News Search Results More Use tab to navigate through the menu items. The historical Society Our Mission Preserve, promote, and celebrate the unique cultural heritage of Ybor City, while honoring Tampa's historic roll in the game of baseball. Our Vision Preserving, promoting, and honoring the unique cultural heritage of Ybor City and Tampa's historic baseball community through educational and community accessible programming. who We are The Ybor City Museum Society, Inc. (YCMS) has been the primary interpreter and conservator of Ybor City's rich history for over 40 years. As of January 2024, YCMS has expanded its mission by rebranding as the Ybor City Historical Society. The Ybor City Historical Society is proud to preserve more than 135 years of Ybor City’s rich history by operating the Tampa Baseball Museum at the Al Lopez House, offering the Rolling Through History mobile museum program, and creating cultural assets that benefit the community. ​ We believe that valuable lessons and inspiration can be found in the remarkable story of Ybor City, its diverse immigrant roots, and the vibrant community that sprang from humble beginnings. The Ybor City Historical Society partners with our community members to r estore the character of Ybor City through e ducating the community about its history, a dvocating for the current community, and p reserving the cultural heritage for future generations. Support Us Today Board & Staff Code of Ethics DONATE Contact Us PO Box 5421 Tampa, FL 33675 813.247.1434 info@ybormuseum.org Connect with us Facebook Instagram Twitter The Ybor City Museum Society is a 501(c)(3) nonprofit organization, Federal Tax ID No. 59-2274494. Historical pictures are part of the Burgert Broth ers Collection courtesy of USF Special Collection and Hillsborough County Public Library. © 2024 by Ybor City Museum Society. Proudly created with Wix.com bottom of page"
    },
    {
      "url": "https://tabanerocigars.com/pages/private-sporting-event",
      "text": "Private Sporting Event - Tabanero Cigars Menu Cart Cigars Holiday Specials Mild Medium Medium to Full Full Sun-Grown Maduro Connecticut Original Blends Lifestyle Accessories Coffee Apparel Gifts About Us About Us Our Blog Our Retailers Contact My Account Continue Shopping Your Cart is Empty Cigars ▾ Holiday Specials Mild Medium Medium to Full Full Sun-Grown Maduro Connecticut Original Blends Lifestyle ▾ Accessories Coffee Apparel Gifts About Us ▾ About Us Our Blog Our Retailers Contact Cart Book A Private Sporting Event at Tabanero Cigars in Ybor City Fill out this form to get in touch with our event specialist to book your next private sporting event. We can accommodate all kinds of requests. If you have any issues please email us here. Tabanero Customer Links My Account Our Retailers Tour Our Factory Cigar Show Latest Cigar Laws Terms and Conditions Customer Reviews Our Location News & Updates Sign up to get the latest on sales, new releases and more … © 2025 Tabanero Cigars . WARNING: We do not sell tobacco or tobacco related products to anyone under the age of 21 X Loyalty program Free Shipping On orders $100 or more Premium Products Unmatched Quality Secure Checkout Secure Payment"
    },
    {
      "url": "https://www.childrensfestival.ca/about/staff-board/",
      "text": "Festival Event Staff & Board Members | Festival Team Members Skip to main content We notice that you’re using Internet Explorer, which is no\n\t\t\t\tlonger supported by Windows and may have difficulty displaying\n\t\t\t\tsome elements of our website. We recommend that you upgrade your browser . May 25 — May 31, 2026 Creatively Playful Menu Schedule and Shows Schedule and Shows On Site Activities Tickets Purchasing Tickets Planning Your Day Accessibility Location & Parking COVID Policy Schools First Time? Ticket Info School Ticket Festival Order Form Accessibility Planning Your Day at the Festival: For Teachers Location & Parking COVID Policy Spectacles Spectacles en français ABOUT About Us Contact Staff & Board Volunteer Info News Support Donate Sponsors and Partners Sponsorship Search Search Query Staff & Board Staff Members Katharine Carol Artistic and Executive Director She/Her/Hers Marika Kovalcikova Development Manager She/Her/Hers Joanne Da Silva Communications and Marketing Manager She/Her/Hers Leanne Zacharias Operations Manager She/Her/Hers Kelly Creelman Audience Services She/Her/Hers David Kerr (DK) Production Manager I celebrate all pronouns, my preference is DK Jessica Han Technical Director She/Her Lauren Palidwor Site Manager She/Her Alayna Y Volunteer Coordinator She/Her/Hers Vivian Qi Assistant Volunteer Coordinator she/her/hers Anika Vervecken Access Activator She/Her/Hers Jessica Hood Access Sidekick She/They elika mojtabaei Accessibility Sidekick She/Her Pengchao (Paul) Shao Deaf Consultant He/Him Tom Gatenyo Low Vision Youth Consultant He/Him Norah Gillen School & Information Administrator She/Her Marjolyn Dimapilis Digital Content Specialist She/Her Liam Taylor Operations Assistant He/She/They Ewa Borkowska Bookkeeper She/Her/Hers Wayne Stewart IT Consultant He/Him/His Board Members Natasha Jeshani Chair She/Her/Hers Kevin Campbell Treasurer He/Him/His Stewart McGillivray Secretary He/Him/His Cameron Wilson Member at large He/Him/His Clara Ruiz-Larrea Member at large She/Her Samad Raza Member at large He/Him/His Jason Dubois Member at large He/Him/His Grace Starke Member at large She/Her/Hers Christoph Clodius Member at large He/Him/His Rahima Kara Member at large Thank You To Our Sponsors Subscribe to our Newsletter Stay in the know! Subscribe to our email list today and get the latest news and updates. Name First Last Email (Required) I’d like to be subscribed to the following list (Required) General Public Info Teacher’s Info (K to 12) French Teacher’s Info (en français) Preschool Teachers Trivia Night Community Groups: Guides | Scouts | Camps | Clubs Instagram This field is for validation purposes and should be left unchanged. The Vancouver International Children’s Festival Society acknowledges that we create and work on the ancestral, traditional, stolen and unceded territories of the hən̓q̓əmin̓əm̓ speaking xʷməθkʷəy̓əm (Musqueam) and səlilwətaɬ (Tsleil-Waututh) people and the Sníchim speaking Sḵwx̱wú7mesh (Squamish) people. We acknowledge the on-going cultural genocides of Indigenous Peoples by Canada, particularly the atrocities committed against children. We commit to work with the Indigenous Peoples of this land to raise the voices of Indigenous children through creativity and play. Contact Info Monday to Friday, 8:30 am to 4:00 pm 604.708.5655 info@childrensfestival.ca Quick Links Schedule / Performers Tickets Support Us About Us Accessibility Statement Follow us! Facebook Instagram YouTube Read our Privacy Policy . Designed by Out-Smarts. Copyright 2025."
    },
    {
      "url": "https://thatssotampa.com/ybor-city-cigar-festival/",
      "text": "Ybor City gears up for its biggest cigar festival in decades We use cookies to give you the best experience on our site. Learn more or close to accept. × Skip to content Stories Guides Events Shop About Stories Guides Events Shop About Search Search COMMUNITY PARTNER Do It , So Tampa Ybor City gears up for its biggest cigar festival in decades December 2, 2024 • By Andrew Harlan December 2, 2024 • By Andrew Harlan 468 SHARES Facebook Twitter Historic Ybor City is set to host its largest cigar festival in decades on December 8 at Centennial Park (1800 E 8th Ave). Presented by Arturo Fuente Cigars and J.C. Newman Cigars, the 2024 Ybor City Cigar Festival honors the rich tradition of cigar culture in a celebration that promises to be unforgettable. Cigar aficionados can explore premium hand-rolled cigars from global vendors, meet iconic cigar makers, and indulge in tastings. The festival also features live entertainment, cigar-rolling demonstrations, and a variety of food, desserts, and beverages, including beer, wine, and spirits. Local artisans will display unique jewelry, artwork, clothing, and cigar accessories, ensuring there’s something for everyone. ADVERTISEMENT A free community event celebrating Ybor City history Carlito Fuente Jr., owner of Arturo Fuente Cigars, expressed his pride in the event: “Every year, it gets bigger and better… It makes me so proud to be back in Ybor City and see how much it has blossomed.” With free entry, this event welcomes locals and visitors alike to celebrate Ybor City’s vibrant history, craftsmanship, and community spirit. Don’t miss this unique opportunity to experience the legacy of one of the world’s most iconic cigar traditions! For more details, click here . Andrew Harlan A proud Eckerd College graduate, he’s a passionate advocate for independent bookstores and St. Petersburg’s thriving craft coffee scene. When he’s not working, you’ll find him biking the Pinellas Trail, strolling with his dogs, catching a film at Green Light Cinema, or enjoying long runs along the city’s award-winning waterfront parks. Don't miss a story 👉 Get all the best local content delivered to your inbox Email Subscribe to Emails 👇 Don't Miss a Story 👇 Email Subscribe to Emails Recent Stories Things to do with kids this weekend in Tampa FL September 11, 2025 Tampa’s biggest indie music fest, Vibes of The Bay, takes over Ybor this September September 11, 2025 Tampa Museum of Art transforms into a Macau casino for glitzy annual gala September 11, 2025 Related Stories Things to do with kids this weekend in Tampa FL September 11, 2025 Tampa’s biggest indie music fest, Vibes of The Bay, takes over Ybor this September September 11, 2025 Tampa Museum of Art transforms into a Macau casino for glitzy annual gala September 11, 2025 My Chemical Romance brings The Black Parade Stadium Tour to Tampa September 10, 2025 More Recent Stories Beats on the Street brings live music and a pop-up record shop to Water Street September 9, 2025 Tampa’s new ‘Champs Sports Reimagined’ delivers a redefined retail experience September 9, 2025 Chef and the Baker’s Cinnamon Bun Sundays are a flavorful success in South Tampa September 8, 2025 Award-winning author of ‘Build It Boldly’ to host book talk, Q&A in Tampa this week September 8, 2025 U.S. Men’s National Team returns to Tampa for showdown with Uruguay September 8, 2025 Comedy legend Adam Sandler plays pickup basketball with the USF Bulls September 8, 2025 Doechii announces new tour date in Tampa September 8, 2025 The USF Bulls just cracked the AP Top 25 after big win over Florida September 7, 2025 Since 2013, That’s So Tampa has been the most trusted local resource for discovering All Things Good in Tampa Bay. Facebook-f Instagram Twitter Tiktok Youtube Envelope Email Subscribe All Things Good Stories Guides Events Shop More From Us About / Contact Advertise Send a Gift Privacy Policy © All rights reserved Made with ❤  by WallMedia Partners Stories Guides Events Shop About"
    },
    {
      "url": "https://www.tampabay.com/breaking-news/ybor-citys-cigar-heritage-festival-aims-to-keep-cigar-city-smoky-20181202/",
      "text": "Ybor City's Cigar Heritage Festival aims to keep 'Cigar City' smoky Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement Breaking News Ybor City's Cigar Heritage Festival aims to keep 'Cigar City' smoky Tampa was home to 150 cigar factories in the 1920's and 1930's, churning out millions of cigars and shipping them worldwide. J.C. Newman Cigar Company is the sole survivor today, producing the \"Factory Throwout\" cigar at its Ybor City factory at 2701 N 16th St. [SCOTT KEELER   |   Times] By Anastasia Dawson Former Times Reporter Published Anastasia Dawson Former Times Reporter MORE FOR YOU Anna Paulina Luna wants to put a statue of Charlie Kirk in the US Capitol • The Buzz on Florida Politics Photos of Charlie Kirk's last public appearance in Tampa • Tampa Advertisement DeSantis’ Florida DOGE effort, explained • The Buzz on Florida Politics DeSantis’ latest lab rats: Florida’s children | Column • Viewpoints Democrat Jennifer Jenkins is challenging Ashley Moody for US Senate • The Buzz on Florida Politics Is the Trump-DeSantis rivalry back on? Look out for 2026. • The Buzz on Florida Politics Dick’s Sporting Goods completes multibillion-dollar deal to acquire Foot Locker • Business Clearwater Beach icon Pier 60 partially reopens to public • Photos Florida governor hopefuls react to DeSantis ending vaccine requirements • The Buzz on Florida Politics At CDC, worries mount that agency has taken anti-science turn • Health Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    }
  ]
}