{
  "fuentes": [
    {
      "url": "https://ppysports.playerspace.com/index.cfm?content_action=custom_pages&category_id=1818",
      "email": "agiarrocco@ymcasouthflorida.org"
    },
    {
      "url": "https://www.ymcaswfl.org/",
      "email": "lmeskil@ymcaswfl.org"
    },
    {
      "url": "https://www.ymcaswfl.org/",
      "email": "ppeters@ymcaswfl.org"
    },
    {
      "url": "https://www.ymcaswfl.org/",
      "email": "rtello@ymcaswfl.org"
    },
    {
      "url": "https://www.ymcaswfl.org/",
      "email": "bonitamembership@ymcaswfl.org"
    },
    {
      "url": "https://www.ymcaswfl.org/",
      "email": "bradentonmembership@ymcaswfl.org"
    },
    {
      "url": "https://www.ymcaswfl.org/",
      "email": "englewoodmembership@ymcaswfl.org"
    },
    {
      "url": "https://www.ymcaswfl.org/",
      "email": "franzrossmembership@ymcaswfl.org"
    },
    {
      "url": "https://www.ymcaswfl.org/",
      "email": "ftmyersmembership@ymcaswfl.org"
    },
    {
      "url": "https://www.ymcaswfl.org/",
      "email": "kzeigler@ymcaswfl.org"
    },
    {
      "url": "https://www.ymcaswfl.org/",
      "email": "lwrmembership@ymcaswfl.org"
    },
    {
      "url": "https://www.ymcaswfl.org/",
      "email": "maryann@coresrq.org"
    },
    {
      "url": "https://www.ymcaswfl.org/",
      "email": "mgrady@ymcaswfl.org"
    },
    {
      "url": "https://www.ymcaswfl.org/",
      "email": "puntagordamembership@ymcaswfl.org"
    },
    {
      "url": "https://www.ymcaswfl.org/",
      "email": "rkapusta@ymcaswfl.org"
    },
    {
      "url": "https://www.ymcaswfl.org/",
      "email": "vdriver@ymcaswfl.org"
    },
    {
      "url": "https://www.ymcaswfl.org/",
      "email": "venicemembership@ymcaswfl.org"
    },
    {
      "url": "https://www.ymcaswfl.org/",
      "email": "vicky@coresrq.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "anne.jeffrey@tampaymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "dcortez@fcymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "dawn.kita@tampaymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "ebone.mitchell@tampaymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "jennifer.wainman@tampaymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "paul.conley@tampaymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "robyn.ostrem@tampaymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "tonina.rodriguez@tampaymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "ben@floridaymcas.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "bnason@ymcaswfl.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "clyons@ymcatreasurecoast.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "csmith@fcymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "cstruckhoff@stpeteymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "cvelarde@ymcaswfl.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "dcortez@suncoastymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "dsaginario@cfymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "emoore@fcymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "gflaks@ymcaspbc.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "gherba@ymcasouthflorida.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "iiovanovich@ymcasouthflorida.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "jody.thorson@tampaymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "joeyb@ymcaswfl.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "jvega@suncoastymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "kcannon@fcymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "kcreque@southfloridaymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "kcreque@ymcasouthflorida.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "kgarcia@cfymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "l.stuppy@ncfymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "lynne@floridaymcas.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "mcurtis@stpeteymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "mhlady@suncoastymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "mmoore@fcymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "nnesmith@fcymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "pzuber@fcymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "raquelle@floridaymcas.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "rnilsson@suncoastymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "scott@floridaymcas.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "sdeiter@ymcaswfl.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "smilbrand@suncoastymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "sreynolds@fcymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "tburrows@fcymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "tcampbell@fcymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "thowell@fcymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "tmiller@fcymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "twheeler@cfymca.org"
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "email": "ypn@floridaymcas.org"
    }
  ],
  "mails": [
    "agiarrocco@ymcasouthflorida.org",
    "anne.jeffrey@tampaymca.org",
    "ben@floridaymcas.org",
    "bnason@ymcaswfl.org",
    "bonitamembership@ymcaswfl.org",
    "bradentonmembership@ymcaswfl.org",
    "clyons@ymcatreasurecoast.org",
    "csmith@fcymca.org",
    "cstruckhoff@stpeteymca.org",
    "cvelarde@ymcaswfl.org",
    "dawn.kita@tampaymca.org",
    "dcortez@fcymca.org",
    "dcortez@suncoastymca.org",
    "dsaginario@cfymca.org",
    "ebone.mitchell@tampaymca.org",
    "emoore@fcymca.org",
    "englewoodmembership@ymcaswfl.org",
    "franzrossmembership@ymcaswfl.org",
    "ftmyersmembership@ymcaswfl.org",
    "gflaks@ymcaspbc.org",
    "gherba@ymcasouthflorida.org",
    "iiovanovich@ymcasouthflorida.org",
    "jennifer.wainman@tampaymca.org",
    "jody.thorson@tampaymca.org",
    "joeyb@ymcaswfl.org",
    "jvega@suncoastymca.org",
    "kcannon@fcymca.org",
    "kcreque@southfloridaymca.org",
    "kcreque@ymcasouthflorida.org",
    "kgarcia@cfymca.org",
    "kzeigler@ymcaswfl.org",
    "l.stuppy@ncfymca.org",
    "lmeskil@ymcaswfl.org",
    "lwrmembership@ymcaswfl.org",
    "lynne@floridaymcas.org",
    "maryann@coresrq.org",
    "mcurtis@stpeteymca.org",
    "mgrady@ymcaswfl.org",
    "mhlady@suncoastymca.org",
    "mmoore@fcymca.org",
    "nnesmith@fcymca.org",
    "paul.conley@tampaymca.org",
    "ppeters@ymcaswfl.org",
    "puntagordamembership@ymcaswfl.org",
    "pzuber@fcymca.org",
    "raquelle@floridaymcas.org",
    "rkapusta@ymcaswfl.org",
    "rnilsson@suncoastymca.org",
    "robyn.ostrem@tampaymca.org",
    "rtello@ymcaswfl.org",
    "scott@floridaymcas.org",
    "sdeiter@ymcaswfl.org",
    "smilbrand@suncoastymca.org",
    "sreynolds@fcymca.org",
    "tburrows@fcymca.org",
    "tcampbell@fcymca.org",
    "thowell@fcymca.org",
    "tmiller@fcymca.org",
    "tonina.rodriguez@tampaymca.org",
    "twheeler@cfymca.org",
    "vdriver@ymcaswfl.org",
    "venicemembership@ymcaswfl.org",
    "vicky@coresrq.org",
    "ypn@floridaymcas.org"
  ],
  "nombre_sitio": "ymcasouthflorida.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://ppysports.playerspace.com/index.cfm?content_action=custom_pages&category_id=1818",
      "text": "Pembroke Pines YMCA Family Center About Us My YMCA Network Help Login Toggle navigation Pembroke Pines YMCA Family Center Pembroke Pines YMCA Family Center 954-727-9622 501 SW 172nd Ave, Pembroke Pines, FL, 33029 Sports Basketball Volleyball Coaches & Volunteers News About Us Select A Location Pembroke Pines YMCA Family Center Quick Links Pembroke Pines YMCA Family Center About This Program About Us Division Standings About Us AT THE Y, MEMBERSHIP MEANS MORE There’s a unique combination at the Y of South Florida. It’s a place where the community comes together to connect, play, and discover new things. The Y offers comprehensive healthy living and learning experiences for adults and kids, from fitness equipment and team sports, to creativity classes exploring music and art. At the Y, membership means more. Learn more about becoming a YMCA of South Florida member. Click Here Meet your Pembroke Pines YMCA Sports Staff Alex Giarrocco Sports Director 954.727.9622 ext 1438 AGiarrocco@ymcasouthflorida.org Coordinators Sonia (3+ Years) Chris (4+ Years) Sports Instructors George (2+ Years) Marc(2+ Years) Ro (2+ Years) Sophia (1+ Years) Open Registrations Register Now FEATURED Home program Helpful Info About Us My Account Sign-In Contact Us Contact: Alexander Giarrocco 954-727-9622 © 2025 Pembroke Pines YMCA Family Center / PlayerSpace . All Rights Reserved."
    },
    {
      "url": "https://www.ymcaswfl.org/",
      "text": "Homepage | YMCA of Southwest Florida Skip to main content User account menu Careers My Account Main navigation (mobile) Locations Schedules Membership Join the Y Workplace & Community Wellness Membership Perks Scholarships Try the Y for free! Programs Online Program Registration Wellness Aquatics Youth & Family Sports & Recreation Child Care Teens Education YMCA360 About Leadership Team Our Y News Upcoming Events Connect with us Volunteer Give Make a Gift Become a Cause Champion YMCA of Southwest Florida User account menu Careers My Account Main navigation Locations Schedules Membership Join the Y Member Code of Conduct Member Dress Code Workplace & Community Wellness Membership Perks Scholarships Try the Y for free! Programs Online Program Registration Wellness Group Exercise Class Schedule Personal and Group Training Health Innovations Active Older Adults YMCA360 Weight Loss Les Mills Virtual Studios Wellness for Kids & Teens Massage Aquatics Swim Lessons Swim Team & Masters Swim Water Exercise Lifeguards & Certifications Safety Around Water Youth & Family Family Activities Kids Zone Activity Centers CPR Certifications Homeschool Programs Parties at the Y Youth in Government Sports & Recreation Volunteer to be a Coach Youth Sports Leagues and Clinics Gymnastics, Tumbling, & Dance Tennis and Pickleball Adult Sports Leagues Child Care Summer Camp YReads Before & After School Enrichment Program Teens Education Early Learning Academy - 6 weeks to 5 years old SKY Academy - Charter Middle School YMCA360 About Leadership Team Board of Directors Our Y Our Partners Our Strategic Plan Our Hurricane Relief Efforts Annual Report News Upcoming Events Connect with us Volunteer Support the Hurricane Recovery Give Make a Gift Become a Cause Champion Join Register Donate YMCA of Southwest Florida Join Give Careers My Account Events Select Language I'm a Member of the YMCA I'm a Guest of the YMCA I Want to Help at the YMCA Breadcrumb Home Experience the Benefits of Membership at the YMCA With the Y, you’re not just a member of a facility; you’re part of a cause. With a shared commitment to nurturing the potential of kids, improving health and well-being, and giving back and supporting our neighbors, your membership will not just bring about meaningful change in yourself, but also in your community. Unlimited Access You get access to ALL 10 YMCA locations. Learn More Free Coaching & Training Get a personalized plan with a wellness coach Learn More Child Care Included Kids Zone programs while you work out. Learn More Full Family Savings Discounts on swim lessons, early learning, youth sports & more. Learn More Group Exercise Classes Included BODYPUMP™, Zumba, TRX, Pilates, Yoga, and Water Exercise classes are included. Pool & Spa Usage Included Get access to our top-rated Aquatics facilities at multiple branches. We're More Than a Gym. But don't just take our word for it ... When you move so flawlessly in the water, sometimes it kind of feels like air in the water, there’s no bridge between the two. I just love that kind of feeling. Jim Johnson Every time I walk into the Y, I see a familiar smiling face. I love teaching yoga and fitness classes and building relationships with the other members. Abbie Charleston I'm confident my Y workouts and Y support and encouragement will have me in shape to mark it off and then set my sights even higher. Beth Wilson Start Your Journey Enjoy Some of Our Members' Favorite Amenities Cardio Equipment Group Exercise Classes Gymnasium Kids Zone Meeting Rooms Outdoor Pool Playground Strength Equipment Hot tub Cardio Equipment Sauna Steam Room Indoor Pool Family Pool/Splash Pad Community Garden Outdoor Track Pickleball Courts Tennis Courts Find Your Potential The YMCA includes most programs in your membership at no additional charge. There's something for everyone at every stage of life. Discover what makes YMCA membership one of the best values in Southwest Florida. Each location offers a variety of programs designed for the whole family. Plus, the Y offers TWO HOURS of childcare free each day while you workout. Join Now More Than a Typical Gym Membership We bring people from different backgrounds, perspectives and generations together with access to opportunities, relationships and resources to grow and thrive. Your membership powers this movement. You’re not just doing something good for yourself when you join the Y. You’re contributing to the greater good of everyone in our community. Join Now Answering Some Common Questions... What makes the YMCA different than other Gyms? INCLUDED IN YOUR MEMBERSHIP: Group Exercise Classes like BODYPUMP™, Zumba, TRX, Pilates, Yoga, and Water Exercise classes Orientations with professional wellness staff who are nationally-certified fitness and wellness experts Specialized one-on-one or small group Personal Training Kids Zone while you work out, included in Family Memberships Locker room facilities Pool/spa usage SPECIAL RATES on recreational sports leagues, summer camp, adult fitness programs, and more! Discounts at other area businesses OPEN 7 days a week Teen leadership opportunities such as Youth in Government, Gymnastics and more! Additional Member Perks Every day thousands of people come to the Y to get healthy and connect with their community. Simply show your YMCA membership card to receive these special offers and discounts from our Hometown Partners: Bonita Boarding Kennel & Pet Camp : Get 10% off any service! Why is it more expensive than some other local gyms? There is! Click here for a direct link to our Dress Code. Are all programs included in my membership? YMCAs are charitable organizations that serve people of all ages, backgrounds, abilities and incomes. The YMCA is community-based and believes that its programs and services should be available to everyone. That’s why the YMCA of Southwest Florida offers a scholarship program. You can learn more about that here . What type of membership options do you offer? We offer Family, Individual, Youth, Senior and Adult membership options. 10 Locations Serving Southwest Florida Located in Bonita Springs, Bradenton, Englewood, Fort Myers, Port Charlotte, Sarasota, Punta Gorda and Venice. Start Your Journey Start Your Journey at the YMCA. First Name Last Name Email Phone Preferred Location - None - Bonita Springs YMCA Bradenton YMCA Englewood YMCA Fort Myers YMCA Franz Ross YMCA Lakewood Ranch YMCA Palmer Ranch YMCA Punta Gorda YMCA Sarasota City YMCA Venice YMCA Text Opt-In By checking this box, you agree to allow our organization to text the phone number listed above. Get a FREE 1-Day Pass Try the Y First Name Last Name Email Phone Choose Your Location - Select - Bonita Springs YMCA Bradenton YMCA Englewood YMCA Fort Myers YMCA Franz Ross YMCA Lakewood Ranch YMCA Palmer Ranch Punta Gorda YMCA Sarasota City Venice YMCA CAPTCHA Text Opt-In By checking this box, you agree to allow our organization to text the phone number listed above. Facebook Instagram Youtube Footer menu right Events Contact Us About Give Join Privacy Policy © 2025 YMCA YMCA of Southwest Florida is a 501(c)(3) not-for-profit social services organization dedicated to Youth Development, Healthy Living, and Social Responsibility."
    },
    {
      "url": "https://www.floridaymcas.org/ypn/chapter-27-leadership/",
      "text": "CHAPTER 27 LEADERSHIP - Florida State Alliance of YMCAs ABOUT US LEADERSHIP CONTACT US COMMUNITY PARTNERS CAREERS VOLUNTEER DONATE GLOBAL ENGAGEMENT AREAS OF FOCUS YOUTH DEVELOPMENT HEALTHY LIVING SOCIAL RESPONSIBILITY STATE INITIATIVES CHILD SAFETY CORPORATE MEMBERSHIP PARTNERS HEALTHY COMMUNITIES INITIATIVES TEEN INITIATIVES SAFETY AROUND WATER YMCA READS STAFF & VOLUNTEER RESOURCES CALENDAR TRAINING OPPORTUNITIES (TPY) HURRICANE PREP DISASTER RELIEF FUND FLORIDA REMLE VOTING YMCA PROFESSIONAL NETWORK (YPN) WHAT IS YPN? YPN MEMBERSHIP YPN EVENTS YPN AWARDS VOLUNTEERING FOR YPN YPN EMERGENCY ASSISTANCE FUND (EAF) CHAPTER 27 LEADERSHIP STORE LOCATIONS FIND YOUR YMCA YMCA of the USA ADVOCACY ADVOCATE FOR THE Y STATE ADVOCACY DAYS FIND YOUR LEGISLATOR PUBLIC POLICY PRIORITIES VOTER REGISTRATION NEWS NEWS COVID-19 IMPACT PRESS ROOM PAST ALLIANCE NEWSLETTERS Home About Donate Press Room Florida State Alliance of YMCAs ABOUT US LEADERSHIP CONTACT US COMMUNITY PARTNERS CAREERS VOLUNTEER DONATE GLOBAL ENGAGEMENT AREAS OF FOCUS YOUTH DEVELOPMENT HEALTHY LIVING SOCIAL RESPONSIBILITY STATE INITIATIVES CHILD SAFETY CORPORATE MEMBERSHIP PARTNERS HEALTHY COMMUNITIES INITIATIVES TEEN INITIATIVES SAFETY AROUND WATER YMCA READS STAFF & VOLUNTEER RESOURCES CALENDAR TRAINING OPPORTUNITIES (TPY) HURRICANE PREP DISASTER RELIEF FUND FLORIDA REMLE VOTING YMCA PROFESSIONAL NETWORK (YPN) WHAT IS YPN? YPN MEMBERSHIP YPN EVENTS YPN AWARDS VOLUNTEERING FOR YPN YPN EMERGENCY ASSISTANCE FUND (EAF) CHAPTER 27 LEADERSHIP STORE LOCATIONS FIND YOUR YMCA YMCA of the USA ADVOCACY ADVOCATE FOR THE Y STATE ADVOCACY DAYS FIND YOUR LEGISLATOR PUBLIC POLICY PRIORITIES VOTER REGISTRATION NEWS NEWS COVID-19 IMPACT PRESS ROOM PAST ALLIANCE NEWSLETTERS Home > STAFF & VOLUNTEER RESOURCES > YMCA PROFESSIONAL NETWORK (YPN) > CHAPTER 27 LEADERSHIP CHAPTER 27 LEADERSHIP YPN BOARD The YPN Board are individuals who believe in YPN's purpose and understand the importance of staff development and networking. Each YPN chapter is led by a local volunteer chapter board. Each board has seven leadership positions. Role Name YMCA E-mail Chapter President/Chair Robyn Ostrem Tampa Metropolitan Robyn.Ostrem@tampaymca.org Immediate Past Chair Jamie Rusnak Southwest Florida Vice President/Chair Professional Leadership Development Chair(s) Program/Peer Group Chair(s) Karla Creque Scott Fahrney South Florida Florida Alliance kcreque@ymcasouthflorida.org scott@floridaymcas.org Treasurer Delonyx Cortez First Coast DCortez@fcymca.org Emergency Assistance Fund (EAF) Chair Recognition Chair Michael Hlady Suncoast mhlady@suncoastymca.org State Alliance Representative Lynne Wilcox Florida Alliance lynne@floridaymcas.org At-Large Members Stephanie Deiter Ericia Moore Southwest Florida First Coast sdeiter@ymcaswfl.org emoore@fcymca.org YPN PEER COMMUNITIES Based within every YPN chapter but regionally and nationally connected, peer communities enable YPN members to connect with peers throughout the Y Movement. Bringing people together around a shared interest in a particular area or job function fosters connections that lead to peer-to-peer learning. In their peer communities, YPN members are able to discuss emerging practices, troubleshoot common challenges, learn innovative approaches, and inspire collaboration. Peer communities are groups of staff who come together around a shared interest in or affinity with a particular membership or program area, and any full or part-time employees of a Y can join as many peer communities as their interests and time allow. To join a peer community within your local YPN chapter, Y staff follow fill out this form. YPN Peer Community Chair(s): Karla Creque , and Scott Fahrney Peer Community Name YMCA E-mail Aquatics Lesley Stuppy Kelli Garcia North Central Florida Central Florida l.stuppy@ncfymca.org kgarcia@cfymca.org Out of School Time (Before & Aftercare, Preschool, & Camp) Karla Creque Brian Nason South Florida Southwest Florida kcreque@ymcasouthflorida.org bnason@ymcaswfl.org Finance & Fiscal Management Penny Zuber Gary Flaks Florida's First Coast South Palm Beach County pzuber@fcymca.org gflaks@ymcaspbc.org Financial Development Michelle Curtis Nekita Nesmith St. Petersburg Florida's First Coast mcurtis@stpeteymca.org nnesmith@fcymca.org Diversity, Equity & Inclusion Ericia Moore Trevor Howell Florida's First Coast Florida's First Coast emoore@fcymca.org thowell@fcymca.org Health & Wellness Tom Campbell Tiffany Wheeler Connie Smith Dawn Kita Florida's First Coast Central Florida Florida's First Coast Tampa Metropolitan Area tcampbell@fcymca.org twheeler@cfymca.org csmith@fcymca.org Dawn.Kita@tampaymca.org Human Resources & Risk Management Tammy Miller Stephanie Deiter Carla Struckhoff Florida's First Coast SKY Family St. Petersburg tmiller@fcymca.org sdeiter@ymcaswfl.org cstruckhoff@stpeteymca.org Marketing & Communications Dan Saginario Michelle Moore Jennifer Wainman Central Florida Florida's First Coast Tampa Metropolitan/Suncoast dsaginario@cfymca.org mmoore@fcymca.org Jennifer.Wainman@tampaymca.org Membership Randy Nilsson Kathy Cannon Suncoast Florida's First Coast rnilsson@suncoastymca.org kcannon@fcymca.org Executive Director/Operations Paul Conley Jody Thorson Seth Milbrand Tim Burrows Tampa Metropolitan Area Tampa Metropolitan Area Suncoast Florida's First Coast Paul.Conley@tampaymca.org jody.thorson@tampaymca.org smilbrand@suncoastymca.org tburrows@fcymca.org Sports Grace Herba Joey Belanger South Florida Southwest Florida gherba@ymcasouthflorida.org joeyb@ymcaswfl.org Teens Anne Shermayne Reynolds Tampa Metropolitan Area Florida's First Coast Anne.Jeffrey@tampaymca.org sreynolds@fcymca.org YPN EMPLOYEE RESOURCE GROUPS (ERGs) At the Y, strengthening community is our cause and ensuring access, inclusion and engagement is fundamental for all.  We are committed to recognizing and embracing all dimensions of diversity to better serve our neighbors.  Employee Resources Groups, or ERGs, are all about community.  ERGs help build community within the Y and connect the Y to the communities that we aim to serve. ERG work is strengthened by our foundational cornerstones: Staff & Volunteer Leadership Development Community Engagement Building Bridges Between Communities YPN Employee Resource Groups (ERGs) Chair(s): Ben Major , Julio Vega Employee Resource Group Name YMCA E-mail African American Resource Network (AARN) Eboné Mitchell Vacant Tampa Metropolitan Area Ebone.Mitchell@tampaymca.org Contact ypn@floridaymcas.org if you are interested. Asian Pacific Islander Leadership Network (APILN) Delonyx Cortez Vacant Suncoast dcortez@suncoastymca.org Contact ypn@floridaymcas.org if you are interested. Disability Resource Group (DRG) Vacant Vacant Contact ypn@floridaymcas.org if you are interested. Emerging Leaders Resource Network (ELRN) Scott Fahrney Vacant State Alliance scott@floridaymcas.org Contact ypn@floridaymcas.org if you are interested. Hispanic Latino Leadership Network (HLLN) Igor Iovanovich Tonina Rodriguez South Florida Tampa iiovanovich@ymcasouthflorida.org Tonina.Rodriguez@tampaymca.org Lesbian, Gay, Bisexual, Transgender, Queer, Intersex, + Resource Network (LGBTQI+RN) Cassy Velarde Vacant Southwest Florida cvelarde@ymcaswfl.org Contact ypn@floridaymcas.org if you are interested. Native American Indigenous Resource Group (NAIRG) Charlene Lyons Vacant Treasure Coast clyons@ymcatreasurecoast.org Contact ypn@floridaymcas.org if you are interested. Millitary and Veteran Resource Group (MVRG) Raquelle Quitugua Vacant Florida Alliance raquelle@floridaymcas.org Contact ypn@floridaymcas.org if you are interested. Women's Leadership Resource Network (WLRN) Stephanie Deiter Vacant Southwest Florida sdeiter@ymcaswfl.org Contact ypn@floridaymcas.org if you are interested. Florida State Alliance of YMCAs Address: 600 1st Ave. North Suite 201 St. Petersburg, FL 33701 Connect With Us Sign Up for Latest News Sign up for E-news We care about your privacy and will never sell or give your email address to anyone. Home · Contact · About · Locations · Donate · Press Room OUR MISSION: Strengthen community through youth development, healthy living, and social responsibility Copyright © 2025 Florida State Alliance of YMCAs. All Rights Reserved. yBox | Login | A Thrive Creation"
    }
  ]
}