{
  "fuentes": [
    {
      "url": "https://zmlp.com/team/",
      "email": "careers@zmlp.com"
    },
    {
      "url": "https://www.zephyr.org/about",
      "email": "info@zephyr.org"
    },
    {
      "url": "https://zephyrhomes.com/contact-us",
      "email": "flags@2x.png"
    },
    {
      "url": "https://zephyrhomes.com/contact-us",
      "email": "info@zephyrhomes.com"
    },
    {
      "url": "https://www.oakszephyrhills.com/national-parks-and-recreation/",
      "email": "ajax-loader@2x.gif"
    },
    {
      "url": "https://allmusicmagazine.com/venues/zephyr-park/",
      "email": "all-music-logo-white@2x.png"
    },
    {
      "url": "https://allmusicmagazine.com/venues/zephyr-park/",
      "email": "parks1@ci.zephyrhills.fl.us"
    },
    {
      "url": "https://www.ci.zephyrhills.fl.us/436/Zephyr-Park-Master-Plan",
      "email": "ghamilton@ci.zephyrhills.fl.us"
    },
    {
      "url": "https://www.ci.zephyrhills.fl.us/749/Hurricane-Milton-Updates-from-the-City-o",
      "email": "residentialmitigation@em.myflorida.com"
    },
    {
      "url": "https://www.ci.zephyrhills.fl.us/749/Hurricane-Milton-Updates-from-the-City-o",
      "email": "bldgdept@ci.zephyrhills.fl.us"
    },
    {
      "url": "https://www.ci.zephyrhills.fl.us/749/Hurricane-Milton-Updates-from-the-City-o",
      "email": "ghamilton@ci.zephyrhills.fl.us"
    },
    {
      "url": "https://www.ci.zephyrhills.fl.us/749/Hurricane-Milton-Updates-from-the-City-o",
      "email": "jbostic@ci.zephyrhills.fl.us"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=351&sn=ga",
      "email": "app-promo-phones@2x.png"
    },
    {
      "url": "https://www.hotelzephyrsf.com/contact/",
      "email": "ap@hotelzephyrsf.com"
    },
    {
      "url": "https://www.hotelzephyrsf.com/contact/",
      "email": "concierge@hotelzephyrsf.com"
    },
    {
      "url": "https://www.hotelzephyrsf.com/contact/",
      "email": "sales@hotelzephyrsf.com"
    },
    {
      "url": "https://www.hotelzephyrsf.com/contact/",
      "email": "zteam@hotelzephyrsf.com"
    },
    {
      "url": "https://zephyrwatering.com/pages/contact",
      "email": "01_1_x106@2x.jpg"
    },
    {
      "url": "https://zephyrwatering.com/pages/contact",
      "email": "care@zephyr.live"
    },
    {
      "url": "https://zephyrwatering.com/pages/contact",
      "email": "crm@zephyr.live"
    },
    {
      "url": "https://zephyrwatering.com/pages/contact",
      "email": "marketplace@zephyr.live"
    },
    {
      "url": "https://www.zephyrhome.com/team",
      "email": "info@zephyrhome.com"
    },
    {
      "url": "https://www.ci.zephyrhills.fl.us/161/Utility-Billing",
      "email": "billing@ci.zephyrhills.fl.us"
    },
    {
      "url": "https://www.ci.zephyrhills.fl.us/161/Utility-Billing",
      "email": "info@orangelien.com"
    }
  ],
  "mails": [
    "01_1_x106@2x.jpg",
    "ajax-loader@2x.gif",
    "all-music-logo-white@2x.png",
    "ap@hotelzephyrsf.com",
    "app-promo-phones@2x.png",
    "billing@ci.zephyrhills.fl.us",
    "bldgdept@ci.zephyrhills.fl.us",
    "care@zephyr.live",
    "careers@zmlp.com",
    "concierge@hotelzephyrsf.com",
    "crm@zephyr.live",
    "flags@2x.png",
    "ghamilton@ci.zephyrhills.fl.us",
    "info@orangelien.com",
    "info@zephyr.org",
    "info@zephyrhome.com",
    "info@zephyrhomes.com",
    "jbostic@ci.zephyrhills.fl.us",
    "marketplace@zephyr.live",
    "parks1@ci.zephyrhills.fl.us",
    "residentialmitigation@em.myflorida.com",
    "sales@hotelzephyrsf.com",
    "zteam@hotelzephyrsf.com"
  ],
  "nombre_sitio": "zephyrhills.fl.us",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://zmlp.com/team/",
      "text": "Team - Zephyr Zephyr’s Businesses About Zephyr Investment Advisory Strategies Portfolio Impact Team News Zephyr’s Businesses About Zephyr Investment Advisory Strategies Portfolio Impact Team News Upload Business Plan Seasoned, on-the-ground investment and operating teams Together, we’ve built a foundation that values innovation, fosters leadership, and thrives on making the impossible possible. We look for ethical, highly motivated investment professionals. If this sounds like you, drop us an email at careers@zmlp.com Our Team × Operations and Research Manager Anisha Bhardwaj Linkedin Anisha is involved in wealth management and client relations at Zephyr. Anisha graduated from New York University in 2024 with a B.A. in Economics and Journalism. × Associate, Research and Investments BENGALURU, INDIA Aman Soni Linkedin Aman is part of the investment and research team at Zephyr Peacock, taking care of deal sourcing, diligence, and execution. Prior to joining Zephyr, Aman worked at a prominent Venture Capital Fund, where he served as an integral member of the Portfolio Management and Finance team, working with a diverse portfolio comprising over 30 enterprises. He also has prior experience with Deloitte Touche Tohmatsu India LLP. Aman is a qualified Chartered Accountant and holds an M.Com degree from the University of Mumbai. × Senior Advisor New York, USA Andrea Geisser Linkedin Andrea serves as a mentor to the India investment team. He has over 30 years of investing experience and was a senior partner with some of North America’s largest private equity firms. He was a founder and managing director of Fenway Partners (1994 to 2006), a US$1Bn+ buy-out firm. Prior to that he served as a senior partner with Butler Capital, another US$1Bn+ private equity fund. During this period, Andrea executed investments representing over US$1bn in capital across a variety of industries with a focus on retail and consumer products. He has worked for the family office of the Agnelli family and was a portfolio manager with Lazard Freres. Andrea holds a PMD from Harvard University and a Bachelors in Economics from Bocconi University (Milano). × Information Technology New York, USA James Raymond James Raymond joined Zephyr Management in September of 2004 to run their Information Technology Department. Prior to joining Zephyr, Mr. Raymond worked as a Computer Consultant for Metrosoft, Inc. providing networking, security, Internet and office automation solutions to a wide range of installations. Mr. Raymond received his Bachelor of Arts degree in Economics from Rutgers University in June 1989. × Vice President, Marketing and ESG Bengaluru, India Laldinpuii Ralte Linkedin Laldinpuii (Din) is focused on marketing communications for Zephyr global funds and supports ESG activities. Prior to joining Zephyr, Din co-founded a business in the entertainment sector. She holds a Master’s degree in Management from the National University of Singapore and a Bachelor’s degree in Commerce, specializing in marketing, from Christ University. × Managing Director, Zephyr Acorn Nairobi, Kenya Lorcan O Cathain Linkedin Lorcan has over 15 years of experience in various leadership roles overseeing strategy development, operations management, financial oversight, and regulatory engagement in finance and governance. He is the former CEO and Co-Founder of Money Africa Group. Lorcan also served as Chief Operating Officer & Chief Commercial Officer at 4G Capital. He has previously worked with Rwandan Ministry of Trade, Industry & EAC Affairs, and GIZ. Lorcan holds an MSc in Political Economy of Late Development from London School of Economics and a BA (hons) International Relations from Dublin City University. × Administrative Assistant Bengaluru, India Lokesh V Linkedin Lokesh oversees the daily operations of the office, including managing and coordinating office resources, maintaining equipment, and ensuring a well-organized workspace. He provides high-level administrative support to executives or senior management. Lokesh is also involved in financial administration. He has been with Zephyr for over 10 years. × President & CIO New York, USA and Bengaluru, India Mukul Gulati Linkedin Mukul Gulati is the President and Chief Investment Officer of Zephyr Management, L.P. Mukul has over 20 years of experience in the investment business including private equity, investment research and general management. Previously, Mukul worked at Multex where he was involved in setting up and managing the firm’s quantitative equity research business. Mukul is a member of Young Presidents’ Organization (YPO). Mukul has an MBA from Columbia University Graduate School of Business and is a cum laude graduate from the University of Maryland with a degree in Economics. × Marketing Communications Analyst Naveena Prasad M Linkedin Naveena has joined as Marketing Communications Analyst at Zephyr Peacock.  Previously, Naveena worked as a Communication Research Associate at the Tata Institute of Social Sciences, Mumbai. She holds an MA in English Literature from The English and Foreign Languages University, Hyderabad, and specializes in communication and digital marketing. × Vice President, Accounts and Finance Bengaluru, India Nikhil Sultania Linkedin Nikhil leads Accounting, Finance and Investor Reporting for Zephyr Peacock and Emerald Funds. Prior to joining Zephyr, Nikhil worked with S.R Batliboi & Associates LLP (a member firm of EY) providing assurance services to the corporates. Nikhil is a Qualified Chartered Accountant. × Administrative Executive Bengaluru, India Nisha Biju Linkedin Nisha handles administrative, finance and corporate compliance functions for Zephyr’s Bangalore office. She is also actively involved in client services for the Zephyr Peacock’s domestic fund. She has over 15 years of experience in the office management, administration and secretarial works. Prior to joining Zephyr, Nisha worked at Infosys BPO as Executive Assistant to the Executive Council Board members. She holds a diploma in Secretarial Practice and Office Administration. × Associate, Investments and Research Bengaluru, India Om Pawaskar Linkedin Om is involved in investment research, deal sourcing, diligence, and execution at Zephyr. He has prior experience with Grant Thornton and WorldQuant. Om graduated from Indian Institute of Technology, Roorkee in 2022. × M.D., Research and Investments Bengaluru, India Pankaj Raina Linkedin Pankaj oversees Zephyr Peacock’s investment and research program. He has over a decade of experience in the private equity and investment banking industries. Prior to Zephyr, he worked as an Investment Manager at CapAleph Advisors where he focused on identifying and executing early stage buyouts in the consumer segment. He has also worked with Intellecap (part of the Aavishkaar-Intellecap Group) where he was responsible for identifying and executing investments in small and medium enterprises in the financial services, agri, food, and social infrastructure sectors. He holds a Masters in Finance from the London Business School and an MBA from IBS, Hyderabad. × Vice President, Portfolio Operations Bengaluru, India Rahul Gupta Linkedin Rahul oversees development and implementation of growth strategies at Zephyr. Prior to joining Zephyr, Rahul worked at Udaan Capital where he led credit operations. He also has prior experience with Reliance Nippon Life Insurance and ICICI Prudential. Rahul co-founded a business in the tourism sector. He holds an MBA in Marketing and Management from Narsee Monjee Institute of Management Studies, Mumbai. × Compliance Manager New York, USA Regina Beechert Linkedin Regina leads Zephyr in matters relating to regulatory compliance. Regina holds a J.D. from St. John’s University School of Law and a B.S. in chemistry from the College of New Rochelle. Regina is experienced in litigation, intellectual property law and telecommunications law. × Managing Director New York, USA Stephen E. Canter Linkedin Stephen is Managing Director for Zephyr Management, L.P. He is responsible for the overall general management of the firm’s finance, legal, marketing and client service functions. He is also Senior Advisor to Zephyr Peacock PE funds in India. Prior to joining Zephyr, he served as Chairman and CEO of The Dreyfus Corporation and as a Vice Chairman of Mellon Financial Corporation. He also served as CEO of Kleinwort Benson Investment Management Americas, Mitchell Hutchins Institutional Investments and Chase Investors Management Corp. Stephen has an AB from Cornell University and an MBA from Columbia University Graduate School of Business. He is a member of the CFA Institute, New York Society of Security Analysts, Economic Club of New York and is a Trustee of Tuskegee University. Formerly, Stephen served on the Board of Governors for the Investment Company Institute and was a member of the Financial Services Roundtable. × Associate, Finance BENGALURU, INDIA Sunit Kumar Sharma Linkedin Sunit focuses on accounting, finance and investor reporting at Zephyr Peacock. Before joining Zephyr, Sunit worked as a consultant at Grant Thornton Bharat LLP. He previously worked with SRB & Associates and MKPS & Associates. × Senior Associate, Finance BENGALURU, INDIA Sushmitha C Linkedin Sushmitha is engaged in the management of accounting, finance, and investor reporting for Zephyr Peacock and Emerald Funds. Prior to joining Zephyr, Sushmitha worked with Ernst & Young LLP providing tax consultancy services and Educational Initiatives Private Limited providing Taxes and compliance services. Sushmitha is a Qualified Chartered Accountant. × Chairman New York, USA Thomas C. Barry Thomas (Tom) is the Chairman of Zephyr Management, L.P. (Zephyr). Tom founded Zephyr in 1994 to support businesses in emerging markets. Prior to founding Zephyr, Tom was President and CEO of Rockefeller & Co., the investment management arm of the Rockefeller family. Previously, Tom was employed by T. Rowe Price Associates, Inc. where he was President of Rowe Price New Horizons Fund and Director of Research. Tom has an MBA from Harvard Business School and an undergraduate degree from Yale University where he majored in Latin American Studies. He is a Chartered Financial Analyst. Tom is also a Director or Trustee for several not for profit institutions. × Portfolio Manager and Director of Research New York, USA Tim Horsburgh Linkedin Tim Horsburgh is the portfolio manager and director of research for the Zephyr Waterfield Wealth and Investment Management business. Tim has over 10 years of experience in investments with experience in mutual funds, exchange-traded funds, investment research, and portfolio strategy. Previously, Tim worked at Invesco, an approximately $1.2 trillion AUM asset manager, as an investment strategist. He has a BA in Economics and Government from Cornell University in Ithaca, New York. Tim is a CFA charter holder and is a member of the CFA Society of New York. × Head of Client Services New York, USA Tina Keriazes Linkedin Tina Keriazes is the Head of Client Services at Zephyr Management. Prior to joining Zephyr, Ms. Keriazes served as a securities and financial analyst within Rockefeller & Co., Inc., a firm that provides financial counsel and investment management to members of the Rockefeller family, other high net worth families, and charitable institutions. Ms. Keriazes received an MM from the J.L. Kellogg Graduate School of Management in 1991, a B.A. from Barnard College in 1986 and is a CFA charter holder. × Analyst, Research and Investments Yash Berlia Linkedin Yash is part of the investment and research team at Zephyr involved in deal sourcing, diligence and execution. Prior to Zephyr, Yash worked at Bain & Company, as an analyst at the Go-To-Market (GTM) department helping companies with topline, costs and GTM strategies across industries. Yash holds a degree in Commerce (BCom (H)) from University of Delhi. Anisha Bhardwaj Operations and Research Manager Aman Soni Associate, Research and Investments Andrea Geisser Senior Advisor James Raymond Information Technology Laldinpuii Ralte Vice President, Marketing and ESG Lorcan O Cathain Managing Director, Zephyr Acorn Lokesh V Administrative Assistant Mukul Gulati President & CIO Naveena Prasad M Marketing Communications Analyst Nikhil Sultania Vice President, Accounts and Finance Nisha Biju Administrative Executive Om Pawaskar Associate, Investments and Research Pankaj Raina M.D., Research and Investments Rahul Gupta Vice President, Portfolio Operations Regina Beechert Compliance Manager Stephen E. Canter Managing Director Sunit Kumar Sharma Associate, Finance Sushmitha C Senior Associate, Finance Thomas C. Barry Chairman Tim Horsburgh Portfolio Manager and Director of Research Tina Keriazes Head of Client Services Yash Berlia Analyst, Research and Investments Let's Connect! Upload Business Plan About Zephyr Impact News Investment Advisory Portfolio Contact Strategies Team © 2022. All rights reserved. About us Services Our team Careers © 2025 ZEPHYR. All rights reserved. My account Legal Privacy"
    },
    {
      "url": "https://www.zephyr.org/about",
      "text": "About Us | Zephyr Institute top of page Home About Us News Annual Reports People Fellows & Scholars Board of Directors Staff Alumni Council Calendar Programs & Events Upcoming Events Past Events Reading Groups & Seminars High School Events Stanford Undergraduate Fellows Program Summer Programs Support Us More Use tab to navigate through the menu items. About Zephyr The Zephyr Institute is an independent academic center in Palo Alto, California, dedicated to serving Stanford students, scholars, and young professionals. We study perennial questions about the nature of the good life in order to evaluate the effects of emerging social, technological, and cultural trends. We run reading groups, seminars, intellectual retreats, and conferences for students, faculty, and professionals throughout the Bay Area. Our work is guided by three core principles 1 Intellectual inquiry must be guided by a sincere desire to pursue the truth. 2 Learning can only take place when students and teachers are free to question prevailing views and interrogate first principles. Preserving this freedom requires the cultivation of intellectual humility and charity. 3 The purpose of an education is not just to equip students with specialized knowledge. More importantly, it is to provide them with the moral and intellectual resources to build flourishing lives. Informed by these principles, we aim to complement the work of the university by providing opportunities for in-depth study and individual mentorship that are increasingly scarce on modern campuses. Through our programs, we hope to help students and professionals gain a clear sense of purpose in their vocations. Our goal is to help form the next generation of cultural and political leaders to be happier, better, more thoughtful people than those who precede them. In addition to our independent programming, Zephyr is proud to be a founding supporter of the Stanford Civics Initiative , which seeks to revitalize civic education on Stanford’s campus through a series of rigorous courses on the nature of democratic citizenship. Zephyr is also home to the The Enduring Interest podcast, hosted by Flagg Taylor. The Enduring Interest explores forgotten and under-appreciated classic texts that deserve a wider audience. Check out our Annual Reports here . CONTACT US Zephyr Institute, Inc. 560 College Ave Palo Alto, CA 94306, USA (650) 667-1160 | info@zephyr.org © 2014-2024 by Zephyr Institute, Inc. All Rights Reserved JOIN OUR MAILING LIST bottom of page"
    },
    {
      "url": "https://zephyrhomes.com/contact-us",
      "text": "Contact Us | Get in Touch with Zephyr Homes Find Your Home 0% Down* Program Lot+Home From 5k Down* Your Lot or Ours Home Plans Inspiration Gallery Get Expert Help—Contact Us! Move-in Ready Homes Home Buying Home Buying Steps Home Building Guide Breezy Home Financing Home Owners Zephyr Home - Warranty Us Contact Why Zephyr Agent Partners Careers Become a Vendor Call Zephyr Homes (352) 632-8945 Ready to Take the Next Step? Fill out the form, and one of our Zephyr Homes experts will reach out to guide you on your journey to finding or building your dream home! First Name Last Name Email * Phone * Living Situation Own a home Shared Space Renter No elements found. Consider changing the search query. List is empty. What are you paying for rent Payment Method Cash Credit [Pre-Approved] Credit [Pending] No elements found. Consider changing the search query. List is empty. By submitting this form, you agree to receive communications from Zephyr Homes, including texts, calls, and emails, at the contact details provided. Message and data rates may apply. Consent is not required for purchase, and you can opt-out at any time by replying \"STOP.\" For assistance, reply \"HELP\" or contact us at Sebring: (863) 465-6000 or Ocala: (352) 632-8945 Speak with an Specialist Now Terms of Use We’re Here to Make Homeownership a Breeze! Contact Us We’re here to help make your journey to homeownership a breeze. Whether you have questions, need guidance, or want to explore your options, our team of experts is ready to assist. Sebring 107 North Ridgewood Drive, Sebring FL 33870 Phone: (863) 465-6000 Ocala 1510 SW 17th Street, Suite 302, Ocala FL 34471 Phone: (352) 632-8945 Email: [email protected] Office Hours: Monday–Friday: 9:00 AM – 4:00 PM Saturday: By Appointment Sunday: Closed Send us a message, give us a call, or stop by one of our locations. Let’s bring your dream home to life! Highlighted Home Plans to Inspire You Home Plans Call Zephyr Homes (352) 632-8945 Book Now With a Home Specialist Acadian 1248 SqFt. 3 Beds / 2 Baths Explore Capri 1559 SqFt. 3 Beds / 2 Baths Explore Seabreeze 1612 SqFt. 3 Beds / 2 Baths Explore Evergreen 1969 SqFt. 3 Beds / 2 Baths Explore Belmont 2225 SqFt. 3 Beds / 2 Baths Explore Dinero 1786 SqFt. 3 Beds / 2 Baths Explore Luxe 2875 SqFt. 3 Beds / 2 Baths Explore Excalibur 3775 SqFt. 3-4 Beds / 2.5 Baths Explore Magnolia 2040 SqFt. 3 Beds / 2 Baths Explore All floor plans are for illustrative purposes only. These renderings are designed to provide a visual representation and may not accurately reflect dimensions, features, or finishes. Please consult with a Zephyr expert for detailed information. Marion County Ocala Park Estates Silver Springs Shores Marion Oaks Belleview Heights Estates Lake Weir Heights Victoria Heights Florida Highlands Rainbow Park Rainbow Springs Estates Rolling Hills Rolling Ranch Estates Rainbow Lakes Estates And more! Highlands County Country Club of Sebring Spring Lake Silver Spring Lake Golf Resort Leisure Lakes Oak Leafe Sebring Lakes Pine Ridge Lake Placid Avon Park And more! Visit us Sebring Location 107 North Ridgewood Drive, Sebring, FL 33870 Phone: (863) 465-6000 Ocala Location 1510 SW 17th Street, Suite 302, Ocala, FL 34471 Phone: (352) 421-5521 Copyright 2024 . All rights reserved Privacy Policy Terms of Use Habeas Data"
    },
    {
      "url": "https://www.oakszephyrhills.com/national-parks-and-recreation/",
      "text": "Celebrate National Parks and Recreation Month in Zephyrhills (813) 696-1957 theoaksatzephyrhills@gmail.com 39442 Co Rd 54, Zephyrhills, FL 33542 Overview Amenities Community Testimonials Contact 09 Jul Celebrate National Parks and Recreation Month in Zephyrhills Web Master 2023-03-10T10:25:35-05:00 By Web Master Articles National Parks and Recreation , Zephyrhills Comments Off on Celebrate National Parks and Recreation Month in Zephyrhills July is National Parks and Recreation Month, and Zephyrhills, Florida, boasts some incredible parks to visit. The Oaks RV Resort , a Good Sam-certified, family-owned and operated RV and mobile home senior community (55+), is known for the majestic oaks on its property and its convenient location, an idyllic retreat mid-way between the cities of Tampa and Orlando! Here’s a list of our favorite local parks to explore when you are in the Zephyrhills area: Depot Park While small in size at just four acres, Depot Park is big on experience. Featuring a wooded walking trail, picnic areas, and ADA-accessible playground equipment, the park centers around a restored 1927 Railroad Depot – that also acts as a museum! It’s a must-visit! Gunner Paw Park Take your pup on your next trip to the park! Gunner Paw Park is Zephyrhills’ off-leash dog park for both large and small breeds. In addition to lots of room to run, this park also has a playground, a multi-purpose trail, and scenic wooded areas to experience! Krusen Park Perfect for sports enthusiasts and nature lovers alike, this 33-acre park is a community favorite. Along with trails, picnic shelters, and a playground, Krusen Park has a skate park, an inline field hockey rink, lighted sports fields, a basketball court, and more athletic facilities. Shepard Park If you’re planning a picnic or would like a quiet place to relax outdoors, Shepard Park is the park for you. We recommend the mini-picnic shelters under the shady oak trees as the perfect spot to unwind! Veterans Memorial Park Dedicated in 2001 to past, present, and future U.S. military veterans, Veteran’s Memorial Park is another local favorite, especially for those that enjoy inline skating or biking! This ten-acre park features a BMX track and a 2,000 linear foot asphalt bicycle/pedestrian path – perfect for a fun day of outdoor activities! Zephyr Park Known for its Civil War Era oak trees, Zephyr Park is a 34-acre park, featuring a community center, lighted tennis courts, picnic facilities, barbecue grills, horseshoe pits, playground equipment, a lakeside fitness path, and even a water park for kids. You can learn more about WaterPlay at Zephyr Park here: http://www.ci.zephyrhills.fl.us/Facilities/Facility/Details/Water-Park-12 Just outside of the Zephyrhills city limits, you can find even more amazing parks to explore: Crystal Springs Crystal Springs Preserve is an impressive 530-acre sanctuary devoted to environmental education and dedicated to the preservation of Florida’s natural environment. Visitors can experience the wilderness firsthand through experiences that include a living laboratory and butterfly gardens! Featured within the property is Crystal Springs, which is a source for the internationally known Nestlé Zephyrhills bottled water brand. Weeki Wachee Springs State Park Located in nearby Spring Hill, Weeki Wachee Springs State Park is known for having one of the deepest, naturally formed caverns in the United States – and for its live mermaid show! At Weeki Wachee, you can swim in the crystal-clear waters, learn about wildlife, or embark on a paddling adventure. A natural tourist attraction, this world-renown park was added to the National Register of Historic Places in 2020. SunWest Park A one-of-a-kind outdoor attraction, SunWest Park is a recreational waterfront facility, located just off Highway 19 in northwest Pasco County, that was developed around an old limestone mine. At SunWest, you’ll find a public swimming beach and many on-water amenities, including a wake park, an aqua park, paddle boarding, kayaking, and beach volleyball. Hillsborough River State Park Located in the northeast corner of Hillsborough County, not far from Zephyrhills, Hillsborough River State Park consists of over 2,990 acres, featuring seven miles of trails that run throughout it. If you love to fish, canoe, kayak, hike, or go birding, this is the park for you! And, when your tour of the local parks is complete, there’s one more to come home to – The Oaks RV Resort ! With an oak tree-filled landscape and amenities that include free WiFi, you’ll feel like you never left nature! Conveniently located off of U.S. 301 in Zephyrhills, The Oaks RV Resort  is a senior community, featuring 75+ lots, studios, one-bedroom units, and two-bedroom units for seasonal and long-term rental solutions that fit any budget. For more information about the availabilities at The Oaks RV Resort , contact us at (813) 696-1957 or theoaksatzephyrhills@gmail.com . Share this post Facebook Twitter LinkedIn Google + Email Author Web Master Related Posts 16 Dec Our Top Three RV Trends for 2021 No one could have predicted 2020, so what will happen 2021? The COVID-19 pandemic has changed life as we... read more 06 Oct October is Breast Cancer Awareness Month Started as a campaign to encourage women to schedule mammograms, National Breast Cancer Awareness Month has been celebrated every... read more 25 Mar Spring Cleaning for Your RV! Spring is here, and it’s our favorite season at The Oaks RV Resort ! The flowers are blooming, the... read more 11 May Honoring Our Veterans During Military Appreciation Month Designated by Congress in 1999, Military Appreciation Month takes place every year during the month of May. Here at... read more 22 Feb Reasons to Love Long-Term RVing Are you 55 or older and love to travel? Do you want to spend more time experiencing your favorite... read more 26 Oct Are Snowbirds Grounded This Winter? Flying into town on the warm breezes Zephyrhills is known for, “snowbirds” typically begin to arrive in the city... read more 02 Aug What You Should Know: Renting an RV If you are interested in renting a recreational vehicle, commonly known as an RV, there is a lot to... read more 13 May Preparing for the 2021 Hurricane Season The 2021 Hurricane Season starts on June 1, and now is the time to prepare! It only takes one... read more 18 Aug Top 10 RV Park Amenities Who doesn’t love an amenity? Good amenities add value to any property, and that is especially true for RV... read more 21 Sep When You Camp in Zephyrhills, You Can Experience History With its great weather and scenic landscapes, it’s no secret that Florida is a favorite destination for RVers and... read more Search for: Recent Posts Embracing the Spirit of Community Beating the Summer Heat: Tips for Mobile Home Renters in Florida 6 Steps to Spring Cleaning Giving Thanks to Our Veterans What You Should Know: Renting an RV Recent Comments Archives October 2023 July 2023 March 2023 November 2022 August 2022 May 2022 February 2022 December 2021 October 2021 September 2021 August 2021 July 2021 June 2021 May 2021 April 2021 March 2021 February 2021 December 2020 November 2020 October 2020 September 2020 Categories Articles Meta Log in Entries feed Comments feed WordPress.org Location The Oaks RV Resort 39442 Co Rd 54, Zephyrhills, FL 33542 Business Hours Mon-Fri 10:00 am to 3:00 pm Saturday 10:00 am to 1:00 pm Sunday Closed Phone Number (813) 696-1957 Property Managed by The Oaks RV Resort | © Copyright 2024. All Rights Reserved.   | Sitemap Search for: Facebook Overview Amenities Community Testimonials Contact Search for: Recent Posts Embracing the Spirit of Community Beating the Summer Heat: Tips for Mobile Home Renters in Florida 6 Steps to Spring Cleaning Giving Thanks to Our Veterans What You Should Know: Renting an RV Recent Comments Archives October 2023 July 2023 March 2023 November 2022 August 2022 May 2022 February 2022 December 2021 October 2021 September 2021 August 2021 July 2021 June 2021 May 2021 April 2021 March 2021 February 2021 December 2020 November 2020 October 2020 September 2020 Categories Articles Meta Log in Entries feed Comments feed WordPress.org"
    },
    {
      "url": "https://allmusicmagazine.com/venues/zephyr-park/",
      "text": "Zephyr Park - All Music Magazine Logout Search Search News Reviews Album Reviews Concert Reviews Interviews Galleries Podcasts Editorials Videos Contact News Reviews Album Reviews Concert Reviews Interviews Galleries Podcasts Editorials Videos Contact Festivals Contributors Advertising Festivals Contributors Advertising Venues Edit Venue Details Add Upcoming Show Reset Password Zephyr Park Zephyrhills Rock (813) 780-0022 parks1@ci.zephyrhills.fl.us View Website 38116 5th Ave. Zephyrhills FL 33542 Smoking About The Venue Zephyr Park is a thirty-four (34) acre park that features the Alice Hall Community Center, (5) lighted tennis courts, handball, fishing, picnic pavilions w/ picnic tables, BBQ grills, horseshoe pits, playground equipment, and a 5/8 mile lakeside fitness path. Zephyr Park includes many Civil War Era large oak trees that provide plenty of shade and a peaceful setting for recreation and relaxation. Upcoming Events: No events yet, check back later! Contact Us © 2025 All Music Magazine. All rights reserved. Privacy Policy"
    },
    {
      "url": "https://www.ci.zephyrhills.fl.us/436/Zephyr-Park-Master-Plan",
      "text": "Zephyr Park Master Plan | Zephyrhills, FL Skip to Main Content Announcements Notice of Public Hearings [July 28, 2025] More Info... 2025 Recycling Calendar More info... Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Search About Us Neighborhoods Projects & Plans Forms & Permits Home Government Departments Community Redevelopment Agency Projects & Plans Zephyr Park Master Plan Zephyr Park Master Plan The CRA's Redevelopment Plan envisions the redevelopment of Zephyr Park as a catalyst and priority for the district. The Park will be developed as a iconic feature unique to Zephyrhills, The City of Pure Water. The Park will become a destination for residents and visitors alike, using creative design to develop park amenities that showcase out environmental resources and improve the storm water function and biodiversity associated with Zephyr Park. The plan will look to improve connections from the Park to downtown businesses and the residential neighborhoods surrounding the Park including identifying potential public private partnership for creation of residential and business opportunities. Creating a unique asset will create a destination for downtown, provide opportunities for business and residential development and redevelopment. All which will increase property values and open up new markets for businesses. 2015 Zephyr Park Master Plan Zephyr Park Master Plan (PDF) Commercial Improvement Grant Commercial Improvement Grant CRA Grant Application CRA Design Standards CRA Master Plan (PDF) Lien Forgiveness Program Residential Paint Grant Program Residential Paint Grant Application Residential Paint Grant Program 2018 Residential Ownership Incentive Residential Ownership Incentive Program Small Business Development Guide Utility Account Application/Change Form Zephyr Park Master Plan About Us FAQs Active CRA Projects CRA District Map Visit Downtown CRA Reports Grants & Incentives Contact Us Gail K Hamilton CRA Director Email Zephyrhills City Hall Second Floor, 5335 8th Street Zephyrhills, FL 33542 Phone: 813-780-0202 Quick Links CRA Board CRA Master Plan (PDF) /QuickLinks.aspx Site Links Accessibility Copyright Notices Government Websites by CivicPlus Privacy Site Map /QuickLinks.aspx Facebook Twitter Instagram LinkedIn Youtube Nextdoor City E-Newsletter Public Meetings (Audio) Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.ci.zephyrhills.fl.us/749/Hurricane-Milton-Updates-from-the-City-o",
      "text": "Hurricane Milton (Updates from the City of Zephyrhills) | Zephyrhills, FL Skip to Main Content Announcements Notice of Public Hearings [July 28, 2025] More Info... 2025 Recycling Calendar More info... Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Search Doing Business Government Services Community How Do I... Home Government Hurricane Milton (Updates from the City of Zephyrhills) Hurricane Milton (Updates from the City of Zephyrhills) (Posted 12/27/2024) The First Statewide Residential Mitigation Program, Elevate Florida The Florida Division of Emergency Management (FDEM) is excited to announce Florida's first statewide Residential Mitigation program, Elevate Florida. The goal of this program is to enhance community resilience by mitigating private residences against natural hazards. Learn more: https://www.floridadisaster.org/dem/mitigation/residential-mitigation/ If you have any questions about the program, please email ResidentialMitigation@em.myflorida.com (Posted 12/20/24) Gunner Paw Park Reopened Following Hurricane Milton The City of Zephyrhills has officially reopened Gunner Paw Park following Hurricane Milton! While fence repairs are still ongoing, the dog park, located at 39536 Alston Avenue, is safe and open for your furry friends to jump right in from 6 AM to 10 PM daily. This approximately 5.66-acre park features: • Off-leash areas for both large and small breeds • Multi-purpose trail • Wooded areas with park benches for relaxation • Playground • Restroom facilities • Convenient trash receptacles to keep the park clean The City of Zephyrhills appreciates your patience and understanding during the repair process. Bring your pups and explore this fantastic community space today! Check out all our parks, facilities, and amenities: https://secure.rec1.com/FL/zephyrhills-fl/catalog (Posted 12/17/2024) Permitting Information for City of Zephyrhills Property Owners Affected by Flooding Dear City of Zephyrhills residents and commercial property owners, If floodwaters have entered your residence or business (in the Zephyrhills municipal limits) due to Hurricane Milton, please ensure you obtain the necessary building permits from the City of Zephyrhills before completing any repairs. These permits are essential for proper documentation of repairs, which will be required for future real estate disclosures and FEMA documentation. Thank you for your attention to this important matter. If you have any questions or need assistance with the permitting process, please do not hesitate to contact us at: City of Zephyrhills Building Department 5335 8th Street, Zephyrhills, FL 33542 Open Monday through Friday, 8:00 AM to 4:30 PM Phone: 813-780-0020 Email: bldgdept@ci.zephyrhills.fl.us For more information on Building Permit Applications, please visit: ci.zephyrhills.fl.us/670/Building-Permit-Application Important FEMA Information on Direct Temporary Housing, Sheltering, Rental Solutions,   Filing Appeals, and More DH- Operations PPT 061522 Direct Housing Guide v2021 Disaster Survivor Checklist Flyer 112324 DR-4828-4834-FL FS 030 FEMA Seeks Property Management Companies for Direct Lease DR-4834-FL Flyer (FL00) Sheltering and Housing Solutions 11-08-24 DR-4834-FL FS 005 How to Appeal FEMA Decision DR-4834-FL FS 024 FEMA Seeking Multi-family Rental Properties to Support Disaster Survivors DR-4834-FL FS 031 FAQ Direct Temporary Housing Assistance in Florida DR-4834-FL FS 036 FEMA Rental Assistance ES DR-4834-FL FS 000 FAQ Direct Temporary Housing Assistance in Florida FEMA Sheltering and Housing Solutions_horizontal FEMA Sheltering and Housing Solutions_page fema_ia-quick-reference_habitability Survivors Road to Recovery - Flyer 112324 (Posted on 12/11/2024) Important Update: Hurricane Debris Collection Deadline Approaching The City of Zephyrhills has completed the first pass of hurricane debris collection. Over 100,000 cubic yards of hurricane yard waste has already been collected. The deadline for City of Zephyrhills residents to place yard debris curbside is Sunday, Dec. 15, 2024. If you still have hurricane-related yard waste at your curb, please contact the City of Zephyrhills Public Works Department at 813-780-0022 or submit an online service request using the SeeClickFix platform ( click here ). Hurricane debris must be placed curbside and NOT placed in the alley. (Alleys do not provide sufficient space for the safe operation of debris collection equipment.) Piles must be yard waste only. (Any mixed construction-type debris, such as fencing, roofing material, and lumber will not be collected). Fresh green yard waste that is not hurricane-related will not be collected. (Tree contractors are responsible to remove and dispose of their own generated yard waste properly.) If you prefer to dispose of hurricane-related debris yourself, you can drop it off for free until Saturday, Dec. 28, 2024, at the East Pasco Transfer Station, located at 9626 Handcart Road, Dade City, FL. (Message sent by the City of Zephyrhills Public Information Office, on behalf of the City of Zephyrhills Public Works Department.) Important City of Zephyrhills contacts: Building Department: 813-780-0020 Public Works Department: 813-780-0022 Utilities Department (Water/Sewer): 813-780-0029 Water Emergency: 813-714-6309 Sewer Emergency: 813-714-6307 Zephyrhills CRA: 813-780-0000 ext. 3506 Zephyrhills City Hall: 813-780-0000 Zephyrhills Police Department: 813-780-0050 Online Service Requests: SeeClickFix.com/Zephyrhills (Posted on 11/19/2024) City of Zephyrhills Town Hall Meeting (Friday, Nov. 22, 2024) + Other Updates Dear City of Zephyrhills residents and water customers, Please see the following important updates regarding our recovery efforts following Hurricane Milton: -City of Zephyrhills Town Hall Meeting (Friday, Nov, 22, 2024) The City of Zephyrhills invites you to an upcoming town hall-style meeting open to the public. Date: Friday, Nov. 22, 2024 Time: 5:30 PM to 8:00 PM Location: Zephyrhills City Hall, 5335 8th Street, Zephyrhills, FL, 33542 At this meeting, citizens can file for FEMA assistance and follow up on existing claims. -City of Zephyrhills Water Usage Update: Residents in the following subdivisions can now resume normal water/sewer use, as Lift Station No. 28 is fully operational: Silver Oaks Abbott Square Oaks of Pasco The Links of Calusa Springs Note: While normal usage is permitted, we still encourage everyone to continue practicing water conservation when possible. -City of Zephyrhills Parks + Facilities Update: Zephyr Park reopened: Zephyr Park (38116 5th Avenue) has reopened to the public. However, some minor work (i.e. removing tree stumps) is still ongoing, so we appreciate your patience as these final tasks are completed. Gunner Paw Park remains closed: Gunner Paw Park (39536 Alston Avenue) remains closed due to fence repairs that are necessary to ensure the safety of dogs and their owners. The City is presently obtaining quotes for these repairs. Note: All other City of Zephyrhills parks and facilities are open. For more detailed information on park listings, please visit: https://secure.rec1.com/FL/zephyrhills-fl/catalog (Posted on 11/18/2024) Reminders on Debris Pickup Related to Hurricane Milton Dear City of Zephyrhills residents, We appreciate your patience and cooperation as the City of Zephyrhills Public Works Department and our vegetative/yard waste debris removal contractor work seven days a week, to clean up following Hurricane Milton. To ensure this ongoing process is as efficient as possible, please review and follow the guidelines below: Place Hurricane Yard Waste Curbside: Vegetative/yard waste debris related to Hurricane Milton must be placed curbside only. Residential Properties Only: Our debris removal contractor services residential properties, not commercial properties. Separate Debris Properly: Mixed piles of vegetative debris containing trash, fencing, or construction materials will not be picked up. Please separate vegetative debris and other material debris piles at least three feet apart. Tree Contractors: Per City of Zephyrhills Ordinance 1396-19, Section 50.11 (sub paragraph c), tree contractors are responsible for removing and disposing of tree debris. \"Live\" Tree Trimming: Any \"live\" tree trimming not deemed to be hurricane-related debris is the property owner's responsibility to dispose of. \"Green\" debris will not be picked up. Missed Debris Pickup: If debris has already been collected in your area and you believe your property was missed, please contact the City of Zephyrhills Public Works Department at 813-780-0022 or submit an online service request via SeeClickFix ( click here ). Thank you for your attention to these guidelines, which will help us expedite the debris removal process (Posted on 11/12/24) Multi-Agency Resource Center closed at Zephyrhills City Hall The Multi-Agency Resource Center (MARC) at Zephyrhills City Hall is now closed. Please refer to the updated locations for disaster recovery assistance, per Pasco County: The Mobile Disaster Recovery Center (DRC) is open daily from 8 a.m. - 7 p.m. at:  Hudson Regional Library | 8012 Library Road, Hudson The Multi-Agency Recovery Center (MARC) is open daily from 8 a.m. - 7 p.m. at:  UF/IFAS Pasco Extension One Stop Shop | 15029 14th St, Dade City (Posted on 11/1/24) Multi-Agency Resource Center (MARC) at Zephyrhills City Hall Dear City of Zephyrhills residents and water customers, We are pleased to inform you that a Pasco County Multi-Agency Resource Center (MARC) is now open at the Zephyrhills City Hall Council Chambers to assist our community following Hurricanes Milton and Helene. Location: Zephyrhills City Hall Council Chambers, 5335 8th Street, Zephyrhills, FL, 33542 Hours: Open Daily, from 9:00 AM to 6:00 PM (including Saturdays and Sundays) The MARC location is expected to be staffed with personnel from federal, state, and regional partners and nonprofit agencies providing access to available resources following the storms. The MARC location is open to individuals, families, businesses, and nonprofits seeking assistance after being impacted by Hurricanes Milton and Helene. (Posted on 10/29/24) FEMA's Florida Hurricane Recovery Fact Sheet As our City of Zephyrhills community recovers from recent storm impacts, FEMA Federal Emergency Management Agency has provided a detailed three-page Fact Sheet that may be of assistance: https://ow.ly/bbOk50TVGn5 It provides valuable information on application deadlines and available programs, such as Operation Blue Roof, Disaster Recovery Centers, Transitional Sheltering Assistance, Serious Needs Assistance, and more. How to Apply for FEMA Assistance: If you sustained damage or loss from Hurricanes Milton, Helene or Debby, FEMA may be able to help. You may be eligible for financial assistance for displacement, serious needs, temporary lodging, basic home repairs, personal property losses and other uninsured disaster-related expenses. • Quickest way to apply is online at https://ow.ly/21Gg50TVGn6 • Or use the FEMA App for mobile devices. • You can also call the FEMA helpline at 800-621-3362. (Posted on 10/28/24) Vegetative Debris Cleanup Update Our contractors have collected an impressive 25,815 cubic yards of vegetative debris across the City of Zephyrhills municipal limits. This puts us at nearly 26% completion of the estimated 100,000 cubic yards of total storm debris that came down following the aftermath of Hurricane Milton. We’re actively working on a debris pickup schedule for specific neighborhoods in the #cityofzephyrhills and will share more details as soon as they’re available. We appreciate your patience during this cleanup process. For additional questions, please call the City of Zephyrhills Public Works Department at 813-780-0022. (Posted on 10/28/24) Flood Water Pumping in Chalfont Villas Area & Temporary Road Closure Dear City of Zephyrhills residents and water customers, Effective today (10/28/24), the City of Zephyrhills Public Works Department will begin pumping floodwaters from the Chalfont Villas neighborhood, located on the west side of Court Street. To ensure public safety and to facilitate this work, Court Street will be closed to through traffic, and a detour will be in place directing motorists to use Wisteria Drive and Larch Drive as alternate routes. Eastbound and westbound traffic on C Avenue will remain open to allow local access. At this time, the pumping process is estimated to last 5 to 7 days. We ask all residents and visitors to exercise caution and adhere to posted detour signs while this essential work is underway. Thank you for your patience and understanding. (POSTED ON 10/25/24) Joint Mobile Office Hours for Hurricane Recovery Assistance Dear City of Zephyrhills residents and water customers, We are pleased to inform you that State Senator Danny Burgess and State Representative Randy Maggard will be hosting Joint Mobile Office Hours at Zephyrhills City Hall from Monday, October 28 through Friday, November 8, 2024. This is an an excellent opportunity to get help with hurricane-related questions and to navigate the recovery process. Event Details: Dates: Mondays, Wednesdays, and Fridays (Oct. 28 – Nov. 8) Time: 10 AM - 2 PM Location: Zephyrhills City Hall, 5335 8th Street, Zephyrhills, FL 33542 Representatives from the office of Florida CFO Jimmy Patronis will also be on-site to assist with insurance claims and related concerns. We encourage you to take advantage of this opportunity to receive personalized assistance as our community works together toward recovery. (POSTED ON 10/24/24) Pasco County Comfort Station moved to Krusen Field Pasco County has relocated their Comfort Station to Krusen Field, located at 4626 Krusen Field Rd, Zephyrhills, FL, 33542. (Adjacent to the Zephyrhills Skate Park.) The Comfort Station is open daily from 7:00 AM to 8:00 PM and provides clean showers, laundry, and bathroom amenities for those impacted by Hurricane Milton. For more info, call or chat with Pasco Customer Service at 727-847-2411. (POSTED ON 10/22/24) Stormwater Pumping Update: 12th Street and 7th Street Now Open The City of Zephyrhills is pleased to inform you that 12th Street and 7th Street are now open, following emergency stormwater pumping operations. However, please be aware that daisy chain pumping operations will continue from today (10/22/2024) for approximately the next seven days along 7th Avenue from 20th Street to the 7th Street retention area (Lake Necessity). Please be mindful of other streets, alleys and private driveways that remain closed and barricaded off during this operation; and, do not drive over the pump hose. Our City of Zephyrhills Public Works Departments is still addressing heavily flooded areas, including the following locations that have homes which have experienced water intrusion: 23rd Street/Dogwood Street 9th Avenue/Beech Street 20th Street to 7th Avenue Additionally, flooding issues at Silver Oaks are being mitigated with the assistance of Pasco County and the Florida Department of Emergency Management. If you have any questions, please contact the City of Zephyrhills Public Works Department at 813-780-0022. Thank you for your patience and cooperation as we work to resolve these issues. (POSTED ON 10/21/24) Important Update: Water and Sewer Usage for Specific Neighborhoods in Zephyrhills Dear City of Zephyrhills residents and water customers: We would like to provide a critical update regarding water and sewer usage for specific neighborhoods in our City of Zephyrhills community. If you live in one of the following areas below, please continue to limit your potable water usage and flushing of toilets: Abbott Square neighborhood Oaks of Pasco neighborhood Links of Calusa Springs neighborhood Silver Oaks neighborhood Sarah Vande Berg Tennis & Wellness Center These areas flow into the City’s Lift Station No. 28, which currently remains underwater. It is essential that you remain very conservative with potable water use and flush toilets only when absolutely necessary to help keep the system stable. For residents living outside of these areas, it is safe to use potable water for daily activities such as cooking, laundry, showers, toilet flushing and so on. However, we kindly ask that you also remain mindful of your usage to help reduce strain on our entire sewer system as it continues to recover from Hurricane Milton. We appreciate your cooperation and understanding. We will keep you informed as we work to restore normal operations throughout the city. If you have any questions about water and sewer services, please contact John Bostic III, City of Zephyrhills Utilities Director, at jbostic@ci.zephyrhills.fl.us or 813-780-0000 ext. 3508. (POSTED ON 10/21/24) Pasco County to Host Virtual/In-Person Town Hall Event Dear City of Zephyrhills residents and water customers, Pasco County is hosting a town hall-style meeting for Pasco residents impacted by Hurricanes Helene and Milton on Thursday, Oct. 24, 2024, from 6:00 PM to 8:00 PM, in the Historic Pasco County Courthouse Boardroom, located at 37918 Meridian Avenue, in Dade City. This meeting will also be streamed online. In Person: You can address county officials from the podium inside the boardroom. Online Option: mypas.co/PascoTownhall All Pasco County residents impacted by the recent hurricanes are invited to attend either virtually or in-person to ask questions of Pasco County officials. For more information, please contact Pasco County Customer Service at 727-847-2411. (POSTED ON 10/18/24) Zephyr Park Closed Until Further Notice (Tennis Courts Remain Open) Please be advised that Zephyr Park (38116 5th Avenue) will be closed until further notice, with the exception of the tennis courts, which will remain open. This closure is a precautionary measure due to the possibility of large trees falling on the park's property. Thank you for your understanding. (POSTED ON 10/18/24) Important: Storm-Related Yard Debris Pickup (Update) The City of Zephyrhills Public Works Department has begun residential storm-related yard debris pickup. To ensure a smooth and efficient process, we encourage residents to take this weekend to have any storm-related yard debris placed curbside for collection. Please keep the following in mind: Do not place yard debris in alleys. Do not place yard debris near mailboxes, street signs, fire hydrants, etc. Do not place yard debris in black bags – the City’s contractors will not collect debris in black bags. Do not co-mingle flood-damaged household items with yard debris. The City’s yard debris contractors will only make one pass – they will only be coming by once, so please have everything ready for pickup. A more defined yard debris pickup schedule will be shared with residents sometime next week. Additionally, the City of Zephyrhills will be collecting flood-damaged household items, but not refrigerators and freezers. Residents must schedule a special pickup, by calling 813-780-0022 or by submitting a request online at SeeClickFix.com/Zephyrhills Please note that the City reserves the right to decline pickup of certain items. Thank you for your patience and cooperation. (POSTED ON 10/17/24) Report Hurricane Milton Property Damage to the City of Zephyrhills Building Department If you have experienced flooding intrusion or structural damage to your home or business because of Hurricane Milton, please also report this information to the City of Zephyrhills Building Department This information is vital for property damage assessment purposes and to help us better understand the scope of the storm's impact on our community. Here are ways you can submit a report to the Building Department: Email: bldgdept@ci.zephyrhills.fl.us Call: 813-780-0020 Online: seeclickfix.com/zephyrhills The City of Zephyrhills Building Department (5335 8th Street, Zephyrhills, FL, 33542) is open Mondays through Fridays, from 8:00 AM to 4:30 PM. Please note: This only applies to City of Zephyrhills municipal residents and businesses. (Posted on 10/17/24) Important: Storm-Related Yard Debris Pickup (Update) The City of Zephyrhills Public Works Department has begun residential storm-related yard debris pickup. To ensure a smooth and efficient process, we encourage residents to take this weekend to have any storm-related yard debris placed curbside for collection. Please keep the following in mind: Do not place yard debris in alleys. Do not place yard debris near mailboxes, street signs, fire hydrants, etc. Do not place yard debris in black bags – the City’s contractors will not collect debris in black bags. Do not co-mingle flood-damaged household items with yard debris. The City’s yard debris contractors will only make one pass – they will only be coming by once, so please have everything ready for pickup. A more defined yard debris pickup schedule will be shared with residents sometime next week. Additionally, the City of Zephyrhills will be collecting flood-damaged household items, but not refrigerators and freezers. Residents must schedule a special pickup, by calling 813-780-0022 or by submitting a request online at SeeClickFix.com/Zephyrhills Please note that the City reserves the right to decline pickup of certain items. Thank you for your patience and cooperation. (POSTED ON 10/16/24) City of Zephyrhills: Stormwater Pumping Operations Starting this afternoon (10/16/24), our City of Zephyrhills Public Works team will begin emergency pumping operations along 7th Avenue from 20th Street to the 7th Street retention area (Lake Necessity). All streets, alleys, and private driveways along this route will be closed and barricaded off during the operation. The hose will placed on the north side of 7th Avenue. Please note that vehicles CANNOT drive over the pump hose. Estimated duration of pumping: Up to 48 hours. For any questions, please contact the Public Works Department at 813-780-0022. (POSTED ON 10/16/2024) City of Zephyrhills: Important Update on Water, Sewer, and More Dear City of Zephyrhills residents and water customers, We hope you and your loved ones are safe. As our community continues to recover from the effects of Hurricane Milton, please take a moment to review these important updates: City of Zephyrhills Utilities (Water & Sewer) Update City of Zephyrhills residents and water customers may use our water system for essential purposes (like drinking, showering, and other personal hygiene needs). Citizens can flush toilets, but please be conservative with the amount of flushing, as our sewer system is still in recovery. The City is working with private haulers and nearby municipalities to bring in multiple pumper trucks to assist in the recovery of our sewer system. City of Zephyrhills Yard Debris Pickup Residents may begin staging loose piles of yard debris (tree limbs, leaves, etc.) curbside or in the public right-of-way for pickup. Please avoid placing debris in alleyways and ensure it is not piled near mailboxes, fire hydrants, or street signs. Crews will not enter private property to collect debris. The City of Zephyrhills is in the process of securing contractors for assistance with this pickup. Note: These contractors will not pick up yard debris if it is bagged, so loose piles are needed. City of Zephyrhills Flood-Damaged Household Item Pickup The City of Zephyrhills will be collecting flood-damaged household items, but not refrigerators and freezers. Residents must schedule a special pickup, by calling 813-780-0022 or submit a request online at SeeClickFix.com/Zephyrhills Please note that the City reserves the right to decline pickup of certain items. City of Zephyrhills Flooding Update The City is closely monitoring ongoing flooding in the following areas: Alpha Village/16th Street 9th Avenue/Beech Henry Drive Silver Oaks neighborhood We are coordinating with contractors and Pasco County Emergency Management to assist with pumping water out of these flooded locations. Tree Removals The City of Zephyrhills Public Works Department is actively securing contractors to assist with tree cutting and removal throughout the City’s public right-of-way, including at City parks and Oakside Cemetery. City of Zephyrhills Permit Fees Waived for 90 Days Due to Hurricane Milton, building permit fees for residents and businesses will be waived for the next 90 days. While permits are still required for any repair or restoration work, the associated fees will be waived. For more information, please call the City of Zephyrhills Building Department at 813-780-0020. Zephyrhills CRA Grant Assistance The Zephyrhills Community Redevelopment Agency (CRA) offers various grants to assist with property restoration for residents living in the CRA District. For more information, please contact CRA Director Gail Hamilton at ghamilton@ci.zephyrhills.fl.us or call 813-780-0000 ext. 3506. Zephyrhills Public Library & Pasco County Comfort Station The Zephyrhills Public Library (5347 8th Street) is open during its regular hours. Free Wi-Fi and charging stations are available for residents needing to connect online or charge their devices. The Library is open Tuesday through Friday, from 9:00 AM to 6:00 PM, and Saturday, from 9:00 AM to 12:00 PM. Additionally, Pasco County has staged a Comfort Station at the Library parking lot (5404 8th Street). This comfort station is open daily, from 7:00 AM to 8:00 PM. For more information on the amenities there, please call or chat with Pasco Customer Service at 727-847-2411. FEMA Hurricane Recovery Resources Representatives from Congresswoman Laurel Lee’s District Office will be at Zephyrhills City Hall (5335 8th Street) from 9:00 AM to 5:00 PM each day through Friday, Oct. 18, 2024 to assist with FEMA-related questions and applications. For more information, contact the Congresswoman’s District Office at 813-393-5077 or visit LaurelLee.house.gov Agendas & Minutes Agendas & Minutes Archived Agendas & Minutes (before September 2021) Local State of Emergency (10-21-2024) Boards & Commissions Airport Authority Application for Board Membership Board of Adjustment, Code Enforcement, and Appeals Community Redevelopment Agency (CRA) Board of Commissioners Historic Preservation Board Library Board Mayor's Youth Council Mayor's Youth Council Application Parks & Recreation Board Planning Commission Site Plan Review Committee Charter of Zephyrhills, Florida City Council Code of Ordinances & LDC Departments Administration Public Records Request Code Of Ordinances Application for Board Membership City Scholarship Application Compliance Contact Information Employment Applications Alice Hall Community Center Oakside Cemetery Zephyrhills News Archives Airport Aeronautical Use and Related Airport Fees (Resolution No. 850-25) Associated Businesses & Leases DBE Goals and Methodology Plan Environmental Assessments Facilities Leasing Interest Packet Links T-Hangars Rules & Regulations Building Department Archived Building Permits Building Permit Application Business Tax Receipt Business Tax Receipt Application Fiscal Year (FY) 2023-2024 Business Tax Receipt Renewals Commercial Check Procedures Home Business Application Commercial Information Commercial Building Permit Requirements Commercial Checklist - New Construction Impact Connection Fees Fee Sheet Permitting Requirements Pool Requirements Right of Way Use Permit Temporary Sales Checklist Transportation Impact Fee Schedule Water Meter Information Miscellaneous Documents Contractor Certificate Requirements FAQs Building Inspections Building Inspections - Plan Examination Central Permitting Residential Information Accessory Buildings Impact Connection Fee Conversion to Living Space Fee Sheet Fence Requirements Inspections Required Permitting Requirements Pool Requirements Residential Checklist New Construction Roof Affidavit HVAC Affidavit Water Meter Information Miscellaneous Documents Garage Sales City Clerk Agendas & Minutes Alice Hall Rental Code of Ordinances & LDC Municipal Election Oakside Cemetery Public Notices Public Records Request Train Depot Rental Code Enforcement Code of Ordinances & LDC Code Enforcement-Steps For Non-compliance Guidelines For Compliance Business Tax Receipt Pool Violations Signage Yard Waste Notice Senate Bill 60 Community Redevelopment Agency About Us CRA Board CRA Map Boundary Agendas & Minutes Annual Budget Annual Audit Annual Reports CRA Design Standards Neighborhoods Neighborhood Beautification Award Projects & Plans Commercial Improvement Grant CRA Design Standards CRA Master Plan (PDF) Lien Forgiveness Program Residential Paint Grant Program Residential Ownership Incentive Small Business Development Guide Zephyr Park Master Plan Forms & Permits Residential Paint Grant Program Application Matching Facade Rehabilitation Grant Application Building Permits Neighborhood Beautification Award Residential Ownership Incentive Application Small Business Development Guide Finance City Audits City Budgets Financial Transparency Center Fiscal Management Policies and Procedures Human Resources About Us Careers City Staff Diversity & Equity Services Employee Recognition FAQs Risk Management Volunteer and Internship Opportunities Wellness Employment Applications Employee Benefits Job Listings Zephyrhills Public Library Library Search the Catalog Library Events & Classes Calendar FAQs Friends of the Zephyrhills Public Library, Inc. Parks & Recreation City Parks Gunner Paw Park League Contacts Parks Athletic Facilities Forms Athletic Facility Use Policy Facilities Use Agreement Facility Use Reservation Form Facility User Categories Sports League Co-Sponsor Requirements Playground Safety Skate Park Consent Form for Ages Under 18 Policies and Guidelines GFL Series Presented by Marinela at Zephyrhills Summer Recreation Information Tree City USA Water Park Planning Department Applications (Online Planning) Business Impact Estimates Community Success Stories 38027 10th Avenue Home Renovation Historic World War 2 Barracks Renovation Historic Jeffries House Renovation Living Foods Oasis Zephyrhills Brewing Company Comprehensive Plan Downtown Rezoning FAQs - Planning Form-Based Code Forms & Petitions GoingPLACES Historic Preservation Land Development Code Maps & Demographics Special Event Permit Application Checklist Sustainability Plan Police Department About Us Police Administration Divisions Public Records Request Submit a Crime Tip Stay Informed Local Resources Volunteer Opportunities Public Works About Us Staff Directory FAQs Divisions Fleet Maintenance Parks Sanitation Streets Stormwater Programs & Services Commercial Service Information Construction Containers Forms Household Hazardous Waste Collection Medical Sharps Disposal Recycling Recycling Update Report Streetlight Outage & Repair Residential Curbside Service Submit A Request How Do I... Access Apply For Contact Submit Purchasing Bids/RFP/RFQ Information Vendor Registration Tax Documents 2025 FL Resale Certificate Tax Exemption Certificate-7/2027 W-9 City of Zephyrhills Fiscal Management Policies and Procedures Utilities Annual Drinking Water Report Automated Meter Reader Conservation Tips Consumer Confidence Reports EPA Notice Lawn Watering Restrictions Water/Sewer Rates Utilities Projects Fort King Road Water Line Project Zephyr Lakes Reclaim Water Line Project Wastewater Treatment Plant Upgrade Project Waste Water Division FOG - Fats, Oils, and Grease Water Division Utility Billing Online Bill Pay Online Utility Billing Deposit RV Park Rates Utility Account Application/Change Form Utility Lien Searches Employment Opportunities Staff Directory Hurricane Milton (Updates from the City of Zephyrhills) Careers Public Records Request Pay a Bill Permits & Licenses Planning Department Police Department Downtown Trash & Recycling Contact Us City of Zephyrhills City Hall Email 5335 8th Street Zephyrhills, FL 33542 Phone: 813-780-0000 Fax: 813-780-0005 Quick Links East Pasco Chamber of Commerce E-Notifications Main Street Zephyrhills Fix It! Zephyrhills Pay a Bill Public Records Custodian Southwest FL WMD Zephyrhills 2030 /QuickLinks.aspx Site Links Accessibility Copyright Notices Government Websites by CivicPlus Privacy Site Map /QuickLinks.aspx Facebook Twitter Instagram LinkedIn Youtube Nextdoor City E-Newsletter Public Meetings (Audio) TextMyGov Service Requests Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=351&sn=ga",
      "text": "Contact Us (U.S. National Park Service) An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government\norganization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely connected to\nthe .gov website. Share sensitive information only on official,\nsecure websites. Skip to global NPS navigation Skip to the main content Skip to the footer section National Park Service Search Search This Site All NPS Open Menu Close Menu Explore This Park Explore the National Park Service Exiting nps.gov Cancel About Us Contact Us Contact Us Important Links Frequently Asked Questions Entrance Passes Jobs Pets Help us help you by directing your question to the right people! Before you send an email, check out frequently asked questions , which includes information about the National Park Service, visiting parks (including entrance passes ), and other topics. Parks For information about a specific park (or to report an error on a park webpage), type the park's name into the search box below to get the park's contact information. If you have a park-specific question, it's best to communicate directly with that park. Park names Select a park Abraham Lincoln Birthplace National Historical Park Acadia National Park Adams National Historical Park African American Civil War Memorial African Burial Ground National Monument Agate Fossil Beds National Monument Ala Kahakai National Historic Trail Alagnak Wild River Alaska Public Lands Alcatraz Island Aleutian Islands World War II National Historic Area Alibates Flint Quarries National Monument Allegheny Portage Railroad National Historic Site Amache National Historic Site American Memorial Park Amistad National Recreation Area Anacostia Park Andersonville National Historic Site Andrew Johnson National Historic Site Aniakchak National Monument & Preserve Antietam National Battlefield Apostle Islands National Lakeshore Appalachian National Scenic Trail Appomattox Court House National Historical Park Arches National Park Arkansas Post National Memorial Arlington House, The Robert  E. Lee Memorial Assateague Island National Seashore Aztec Ruins National Monument Badlands National Park Baltimore-Washington Parkway Bandelier National Monument Belmont-Paul Women's Equality National Monument Bent's Old Fort National Historic Site Bering Land Bridge National Preserve Big Bend National Park Big Cypress National Preserve Big Hole National Battlefield Big South Fork National River & Recreation Area Big Thicket National Preserve Bighorn Canyon National Recreation Area Birmingham Civil Rights National Monument Biscayne National Park Black Canyon Of The Gunnison National Park Blackstone River Valley National Historical Park Blackwell School National Historic Site Blue Ridge Parkway Bluestone National Scenic River Booker T Washington National Monument Boston African American National Historic Site Boston Harbor Islands National Recreation Area Boston National Historical Park Brices Cross Roads National Battlefield Site Brown v. Board of Education National Historical Park Bryce Canyon National Park Buck Island Reef National Monument Buffalo National River Butterfield Overland National Historic Trail Cabrillo National Monument California National Historic Trail Camp Nelson National Monument Canaveral National Seashore Cane River Creole National Historical Park Canyon de Chelly National Monument Canyonlands National Park Cape Cod National Seashore Cape Hatteras National Seashore Cape Henry Memorial Part of Colonial National Historical Park Cape Krusenstern National Monument Cape Lookout National Seashore Capitol Hill Parks Capitol Reef National Park Captain John Smith Chesapeake National Historic Trail Capulin Volcano National Monument Carl Sandburg Home National Historic Site Carlisle Federal Indian Boarding School National Monument Carlsbad Caverns National Park Carter G. Woodson Home National Historic Site Casa Grande Ruins National Monument Castillo de San Marcos National Monument Castle Clinton National Monument Castle Mountains National Monument Catoctin Mountain Park Cedar Breaks National Monument Cedar Creek & Belle Grove National Historical Park Chaco Culture National Historical Park Chamizal National Memorial Channel Islands National Park Charles Pinckney National Historic Site Charles Young Buffalo Soldiers National Monument Chattahoochee River National Recreation Area Chesapeake & Ohio Canal National Historical Park Chesapeake Bay Chickamauga & Chattanooga National Military Park Chickasaw National Recreation Area Chiricahua National Monument Christiansted National Historic Site City Of Rocks National Reserve Civil War Defenses of Washington Clara Barton National Historic Site Colonial National Historical Park Colorado National Monument Coltsville National Historical Park Congaree National Park Constitution Gardens Coronado National Memorial Cowpens National Battlefield Crater Lake National Park Craters Of The Moon National Monument & Preserve Cumberland Gap National Historical Park Cumberland Island National Seashore Curecanti National Recreation Area Cuyahoga Valley National Park César E. Chávez National Monument Dayton Aviation Heritage National Historical Park De Soto National Memorial Death Valley National Park Delaware Water Gap National Recreation Area Denali National Park & Preserve Devils Postpile National Monument Devils Tower National Monument Dinosaur National Monument Dry Tortugas National Park Dwight D. Eisenhower Memorial Ebey's Landing National Historical Reserve Edgar Allan Poe National Historic Site Effigy Mounds National Monument Eisenhower National Historic Site El Camino Real de los Tejas National Historic Trail El Camino Real de Tierra Adentro National Historic Trail El Malpais National Monument El Morro National Monument Eleanor Roosevelt National Historic Site Ellis Island Part of Statue of Liberty National Monument Emmett Till and Mamie Till-Mobley National Monument Eugene O'Neill National Historic Site Everglades National Park Federal Hall National Memorial Fire Island National Seashore First Ladies National Historic Site First State National Historical Park Flight 93 National Memorial Florissant Fossil Beds National Monument Ford's Theatre National Historic Site Fort Bowie National Historic Site Fort Caroline National Memorial Fort Davis National Historic Site Fort Donelson National Battlefield Fort Dupont Park Fort Foote Park Fort Frederica National Monument Fort Laramie National Historic Site Fort Larned National Historic Site Fort Matanzas National Monument Fort McHenry National Monument and Historic Shrine Fort Monroe National Monument Fort Necessity National Battlefield Fort Point National Historic Site Fort Pulaski National Monument Fort Raleigh National Historic Site Fort Scott National Historic Site Fort Smith National Historic Site Fort Stanwix National Monument Fort Sumter and Fort Moultrie National Historical Park Fort Union National Monument Fort Union Trading Post National Historic Site Fort Vancouver National Historic Site Fort Washington Park Fossil Butte National Monument Frances Perkins National Monument Franklin Delano Roosevelt Memorial Frederick Douglass National Historic Site Frederick Law Olmsted National Historic Site Fredericksburg & Spotsylvania National Military Park Freedom Riders National Monument Friendship Hill National Historic Site Gates Of The Arctic National Park & Preserve Gateway Arch National Park Gateway National Recreation Area Gauley River National Recreation Area General Grant National Memorial George Rogers Clark National Historical Park George Washington Birthplace National Monument George Washington Carver National Monument George Washington Memorial Parkway Gettysburg National Military Park Gila Cliff Dwellings National Monument Glacier Bay National Park & Preserve Glacier National Park Glen Canyon National Recreation Area Glen Echo Park Gloria Dei Church National Historic Site Golden Gate National Recreation Area Golden Spike National Historical Park Governors Island National Monument Grand Canyon National Park Grand Canyon-Parashant National Monument Grand Portage National Monument Grand Teton National Park Grant-Kohrs Ranch National Historic Site Great Basin National Park Great Egg Harbor River Great Falls Park Great Sand Dunes National Park & Preserve Great Smoky Mountains National Park Green Springs Greenbelt Park Guadalupe Mountains National Park Guilford Courthouse National Military Park Gulf Islands National Seashore Hagerman Fossil Beds National Monument Haleakalā National Park Hamilton Grange National Memorial Hampton National Historic Site Harmony Hall Harpers Ferry National Historical Park Harriet Tubman National Historical Park Harriet Tubman Underground Railroad National Historical Park Harry S Truman National Historic Site Hawaiʻi Volcanoes National Park Herbert Hoover National Historic Site Historic Jamestowne Part of Colonial National Historical Park Home Of Franklin D Roosevelt National Historic Site Homestead National Historical Park Honouliuli National Historic Site Hopewell Culture National Historical Park Hopewell Furnace National Historic Site Horseshoe Bend National Military Park Hot Springs National Park Hovenweep National Monument Hubbell Trading Post National Historic Site Ice Age Floods National Geologic Trail Ice Age National Scenic Trail Independence National Historical Park Indiana Dunes National Park Isle Royale National Park Iñupiat Heritage Center James A Garfield National Historic Site Jean Lafitte National Historical Park and Preserve Jewel Cave National Monument Jimmy Carter National Historical Park John Day Fossil Beds National Monument John Fitzgerald Kennedy National Historic Site John Muir National Historic Site Johnstown Flood National Memorial Joshua Tree National Park Juan Bautista de Anza National Historic Trail Kalaupapa National Historical Park Kaloko-Honokōhau National Historical Park Katahdin Woods and Waters National Monument Katmai National Park & Preserve Kenai Fjords National Park Kenilworth Park & Aquatic Gardens Kennesaw Mountain National Battlefield Park Keweenaw National Historical Park Kings Mountain National Military Park Klondike Gold Rush - Seattle Unit National Historical Park Klondike Gold Rush National Historical Park Knife River Indian Villages National Historic Site Kobuk Valley National Park Korean War Veterans Memorial Lake Clark National Park & Preserve Lake Mead National Recreation Area Lake Meredith National Recreation Area Lake Roosevelt National Recreation Area Lassen Volcanic National Park Lava Beds National Monument LBJ Memorial Grove on the Potomac Lewis & Clark National Historic Trail Lewis and Clark National Historical Park Lincoln Boyhood National Memorial Lincoln Home National Historic Site Lincoln Memorial Little Bighorn Battlefield National Monument Little River Canyon National Preserve Little Rock Central High School National Historic Site Longfellow House Washington's Headquarters National Historic Site Lowell National Historical Park Lower Delaware National Wild and Scenic River Lower East Side Tenement Museum National Historic Site Lyndon B Johnson National Historical Park Maggie L Walker National Historic Site Maine Acadian Culture Mammoth Cave National Park Manassas National Battlefield Park Manhattan Project National Historical Park Manzanar National Historic Site Marsh - Billings - Rockefeller National Historical Park Martin Luther King, Jr. Memorial Martin Luther King, Jr. National Historical Park Martin Van Buren National Historic Site Mary McLeod Bethune Council House National Historic Site Medgar and Myrlie Evers Home National Monument Mesa Verde National Park Mill Springs Battlefield National Monument Minidoka National Historic Site Minute Man National Historical Park Minuteman Missile National Historic Site Mississippi National River & Recreation Area Missouri National Recreational River Mojave National Preserve Monocacy National Battlefield Montezuma Castle National Monument Moores Creek National Battlefield Mormon Pioneer National Historic Trail Morristown National Historical Park Mount Rainier National Park Mount Rushmore National Memorial Muir Woods National Monument Natchez National Historical Park Natchez Trace National Scenic Trail Natchez Trace Parkway National Capital Parks-East National Mall and Memorial Parks National Park of American Samoa National Parks of New York Harbor Natural Bridges National Monument Navajo National Monument New Bedford Whaling National Historical Park New England National Scenic Trail New Jersey Pinelands National Reserve New Orleans Jazz National Historical Park New Philadelphia National Historic Site New River Gorge National Park & Preserve Nez Perce National Historical Park Nicodemus National Historic Site Ninety Six National Historic Site Niobrara National Scenic River Noatak National Preserve North Cascades National Park North Country National Scenic Trail Obed Wild & Scenic River Ocmulgee Mounds National Historical Park Oklahoma City National Memorial Old Spanish National Historic Trail Olympic National Park Oregon Caves National Monument & Preserve Oregon National Historic Trail Organ Pipe Cactus National Monument Overmountain Victory National Historic Trail Oxon Cove  Park & Oxon Hill Farm Ozark National Scenic Riverways Padre Island National Seashore Palo Alto Battlefield National Historical Park Paterson Great Falls National Historical Park Pea Ridge National Military Park Pearl Harbor National Memorial Pecos National Historical Park Pennsylvania Avenue Perry's Victory & International Peace Memorial Petersburg National Battlefield Petrified Forest National Park Petroglyph National Monument Pictured Rocks National Lakeshore Pinnacles National Park Pipe Spring National Monument Pipestone National Monument Piscataway Park Point Reyes National Seashore Pony Express National Historic Trail Port Chicago Naval Magazine National Memorial Potomac Heritage National Scenic Trail Poverty Point National Monument President William Jefferson Clinton Birthplace Home National Historic Site Presidio of San Francisco Prince William Forest Park Pullman National Historical Park Puʻuhonua o Hōnaunau National Historical Park Puʻukoholā Heiau National Historic Site Rainbow Bridge National Monument Reconstruction Era National Historical Park Redwood National and State Parks Richmond National Battlefield Park Rio Grande Wild & Scenic River River Raisin National Battlefield Park Rock Creek Park Rocky Mountain National Park Roger Williams National Memorial Roosevelt Campobello International Park Rosie the Riveter WWII Home Front National Historical Park Russell Cave National Monument Sagamore Hill National Historic Site Saguaro National Park Saint Croix Island International Historic Site Saint Croix National Scenic Riverway Saint Paul's Church National Historic Site Saint-Gaudens National Historical Park Salem Maritime National Historical Park Salinas Pueblo Missions National Monument Salt River Bay National Historical Park and Ecological Preserve San Antonio Missions National Historical Park San Francisco Maritime National Historical Park San Juan Island National Historical Park San Juan National Historic Site Sand Creek Massacre National Historic Site Santa Fe National Historic Trail Santa Monica Mountains National Recreation Area Saratoga National Historical Park Saugus Iron Works National Historic Site Scotts Bluff National Monument Selma To Montgomery National Historic Trail Sequoia & Kings Canyon National Parks Shenandoah National Park Shiloh National Military Park Sitka National Historical Park Sleeping Bear Dunes National Lakeshore Springfield 1908 Race Riot National Monument Springfield Armory National Historic Site Star-Spangled Banner National Historic Trail Statue Of Liberty National Monument Ste. Geneviève National Historical Park Steamtown National Historic Site Stones River National Battlefield Stonewall National Monument Sunset Crater Volcano National Monument Tallgrass Prairie National Preserve Thaddeus Kosciuszko National Memorial The White House and President's Park Theodore Roosevelt Birthplace National Historic Site Theodore Roosevelt Inaugural National Historic Site Theodore Roosevelt Island Theodore Roosevelt National Park Thomas Cole National Historic Site Thomas Edison National Historical Park Thomas Jefferson Memorial Thomas Stone National Historic Site Timpanogos Cave National Monument Timucuan Ecological & Historic Preserve Tonto National Monument Touro Synagogue National Historic Site Trail Of Tears National Historic Trail Tule Lake National Monument Tule Springs Fossil Beds National Monument Tumacácori National Historical Park Tupelo National Battlefield Tuskegee Airmen National Historic Site Tuskegee Institute National Historic Site Tuzigoot National Monument Ulysses S Grant National Historic Site Upper Delaware Scenic & Recreational River Valles Caldera National Preserve Valley Forge National Historical Park Vanderbilt Mansion National Historic Site Vicksburg National Military Park Vietnam Veterans Memorial Virgin Islands Coral Reef National Monument Virgin Islands National Park Voyageurs National Park Waco Mammoth National Monument Walnut Canyon National Monument War In The Pacific National Historical Park Washington Monument Washington-Rochambeau Revolutionary Route National Historic Trail Washita Battlefield National Historic Site Weir Farm National Historical Park Whiskeytown National Recreation Area White Sands National Park Whitman Mission National Historic Site William Howard Taft National Historic Site Wilson's Creek National Battlefield Wind Cave National Park Wing Luke Museum Affiliated Area Wolf Trap National Park for the Performing Arts Women's Rights National Historical Park World War I Memorial World War II Memorial Wrangell - St Elias National Park & Preserve Wright Brothers National Memorial Wupatki National Monument Yellowstone National Park Yorktown Battlefield Part of Colonial National Historical Park Yosemite National Park Yucca House National Monument Yukon - Charley Rivers National Preserve Zion National Park National Park Service Submit a media inquiry (for members of the media) Ask questions about our agency Report errors or technical difficulties Addresses and phone numbers for national and regional offices Freedom of Information Act Customer service standards Additional Links Entrance passes Recreation.gov for many park reservations such as camping Authorized concessioners (see park websites for information about specific services) This Site All NPS Experience Your America. Download the NPS app to navigate the parks on the go. National Park Service U.S. Department of the Interior Accessibility Privacy Policy FOIA Notices Contact The National Park Service NPS FAQ No Fear Act Disclaimer Vulnerability Disclosure Policy USA.gov"
    },
    {
      "url": "https://www.hotelzephyrsf.com/contact/",
      "text": "Hotel Zephyr | Fisherman’s Wharf Hotels | Contact Skip to main content best rate guaranteed Home Stay Dining Local Area Pier 39 Gallery Offers Meetings & Events Zephyr Walk Sustainability Book a room Home Stay Dining Local Area Pier 39 Gallery Offers Meetings & Events Zephyr Walk Sustainability 250 Beach St. San Francisco, CA  94133 415-617-6565 CONTACT & LOCATION INFORMATION Wondering about accommodation specifics? Trying to find the best dim sum in town? Don’t be shy — get in touch with us today and find out more about your new favorite hotel and city. HOTEL ZEPHYR 250 Beach Street San Francisco, CA 94133 Hotel Direct: 415-617-6565 Hotel Fax: 415-986-7853 Hotel Email: zteam@hotelzephyrsf.com Reservations: 415-617-6555 Reservations Fax: 415-362-5021 Reservations Toll Free: 844-617-6555 Reservations Email: zteam@hotelzephyrsf.com Requests for a copy of your room bill: ap@hotelzephyrsf.com Concierge Team: concierge@hotelzephyrsf.com Lost and Found: Report a lost item Groups and Events Email: sales@hotelzephyrsf.com Click to view Sales Sheet GETTING HERE From Points North: Take US-101 South over the Golden Gate Bridge and keep left at the fork upon reaching the mainland. Turn left onto Marina Boulevard and continue onto Laguna Street. Turn left onto Bay Street and then left onto Mason Street. After making a right onto Beach Street, the hotel will be on the left. From Points South: Take US-101 North and exit onto I-280 North toward Daly City/Downtown SF. Continue onto King Street and then onto The Embarcadero. After continuing onto Beach Street, the hotel will be on the right, two blocks down. From Points East: Take I-80 over the San Francisco-Oakland Bay Bridge and take the Harrison Street exit on the left. Turn right onto Harrison Street and left onto The Embarcadero. After continuing onto Beach Street, the hotel will be on the right, two blocks down. PARKING For your convenience, Hotel Zephyr offers self-parking for guests. Hourly parking cost $15 per 30 minutes, with a maximum rate of $65 per day plus tax. Overnight self-parking is $64 plus tax, and includes unlimited in-and-out access. Currently, we do not offer parking for RVs. Vans are permitted, as long as they fit into a standard single parking space. Contact FAQ Press Careers Subscribe Privacy Policy Cookie Policy Terms of Use ADA Accessibility Statement Cookie Settings 250 Beach St. San Francisco, CA  94133 opens at new window 415-617-6565 opens at new window opens at new window opens at new window opens at new window opens at new window Keep Afloat with special offers and deals Stay in touch Please add a valid email address. Thank you for signing up! You will receive an email shortly to confirm your request."
    },
    {
      "url": "https://zephyrwatering.com/pages/contact",
      "text": "Contact Zephyr Watering | Get in Touch for Support & Inquiries Custom Event Setup × Click on the elements you want to track as custom events. Selected elements will appear in the list below. Track New Element Selected Elements (0) Finish Setup Buy 1 Product Get 10% Off & Buy 2 Products Get 15% Off My Account My Wishlist My Cart 0 Hoses Hose Reels Quick Connectors Watering Garden Tools Solar Lights Pressure Washer Promotions Flash Deals Menu Call Us Now : 9875957364 Contact Home / Contact Phone Toll-Free: +91 9875957364 Email marketplace@zephyr.live Address 612, Nirvana Courtyard Nirvana Country, Sector 50 Gurugram – 122018 Haryana, India. Contact Form Name Email Phone Message Send The largest exporter of rubber air and water hoses from India. Manufacturing since more than 30 years back, RMX Industries sells in over 20 countries, most of them across North America and Europe. Know more Facebook Instagram YouTube Information Why Zephyr About Us Contact Warranty Policy Terms of Service Returns & Refund Policy Shipping Policy Track Order Categories Water Hoses Water Hose Reels Accessories Videos Blogs Combo Gifting Contact us Through Whatsapp +91 9875957364 RMX Industries Pvt Ltd C-612, Nirvana Courtyard Nirvana Country, Sector 50 Gurugram – 122018 Haryana, India. Email: care@zephyr.live © 2025 Zephyr BluBird Integrated Services"
    },
    {
      "url": "https://www.zephyrhome.com/team",
      "text": "Team about team CONTACT US Our leadership team has deep experience at the intersection of operations, technology, and talent development. Shawn Weidmann CEO & Zephyr Co-Founder Shawn is Co-Founder and CEO of Zephyr. He has decades of experience scaling platforms in other industries. Previously Shawn served as CEO of Spring Education, CEO of Teleflora, and COO of Public Storage. Shawn is a former Army officer (with an engineering degree from West Point) and a graduate of Stanford Graduate School of Business. About Shawn Linkedin Deklan Robinson Head of Strategy & Zephyr Co-Founder Deklan is Co-Founder and Head of Strategy at Zephyr, where he oversees growth strategy and designs scalable systems to support our local brands and their technicians. Before Zephyr, Deklan worked at Harry's where he helped launch the company's M&A efforts and complete its first acquisition of Lume Deodorant. He led the ensuing integration that included a retail launch and systems migration. Deklan began his career as a private equity investor at L Catterton and is a graduate of Middlebury College. About Deklan Linkedin Kevin McDunn Chief Product and Technology Officer Kevin is Chief Product and Technology Officer at Zephyr, where he marshals technology and design to empower technicians, delight customers, and transform home services. Previously, as Chief Product Officer at SMS Assist he delivered innovations that contributed to a $2.2B merger with Lessen in the largest PropTech deal to date. He built winning products at MxD USA, Lenovo, Google, and Motorola. Kevin has an International Masters in Management from Lancaster University (U.K.), a B.S. in Mechanical Engineering from the University of Illinois, and is an inventor on 24 U.S. patents. About Kevin Linkedin Michele DiPasquale Chief Financial Officer Michele is CFO for Zephyr, focused on building, supporting and informing through all things numbers. She has decades of experience scaling Finance organizations in high growth environments. Most recently Michele served as the CFO of People Pets and Vets where the team grew the company 10x in four years culminating in a successful merger. Previously Michele served as the CFO of both Imagine Health and AdvancedMD. Michele holds an MBA from the University of Utah and an undergrad BS in Finance and Accounting from the University of Arizona and is a CPA. About Michele Linkedin Nick Bayer VP of Operations Nick is the VP of Operations at Zephyr, where he leads our local brands in realizing their maximum true potential. Nick has years of experience in the home services industry, first with Carrier on the corporate strategy and residential and light commercial HVAC teams and then with Apex Service Partners, where he led HVAC, plumbing, and electrical businesses. Nick is a graduate of West Point and Yale School of Management. About Nick Linkedin Nicolette Jackson Head of Talent Nicolette is the Head of Talent at Zephyr. She leads HR, Talent Acquisition & Development, focused on Zephyr's goal to build a culture that not only attracts top talent, but makes them feel at home. Before Zephyr, Nicolette worked with start-ups in the Tech, Home Insurance and Real Estate industries to create and execute recruiting, DEI and talent development programs from the ground up. At Hippo Insurance, Nicolette served as an integral part of the People Leadership team that grew Hippo from 95 to 650 employees and facilitated a successful IPO in 2021. Nicolette is a proud University of Texas Alumni. About Nicolette Linkedin Business building capabilities Zephyr transforms local brand operations through its centralized platform of people, technology, and process. M&A Finance & Accounting HR & Recruiting Operations Technology &Â Training Marketing Make it a labor of love We're looking for talented individuals excited about making a real difference in homeowners' lives. Join our team info@zephyrhome.com 30 Cooper Square, New York, NY 10003 Contact Us ZephÂ·âyr /ze-fÉr/ NOUN A soft gentle breeze Careers Terms of Use Copyright Zephyr @ 2024 Technicians We're looking for talented individuals excited about making a real difference in homeowners' lives.Â Join Our team Local Business Owners Learn more about transitioning your business. CONTACT US Open your next door If you are interested in partnering with us, weâd love to hear from you. Please share a few details, and a Zephyr team member will reach out to you shortly. First name Last name Email Company Name Total Number of Employees 1-10 11-25 26-50 51+ Weâll be in touch! Weâll review your business details and get back to you. CLOSE Oops! Something went wrong while submitting the form. Terms & Conditions The information on this website is for informational purposes only; it is deemed accurate but not guaranteed. It does not constitute professional advice. All information is subject to change at any time without notice. Contact us for complete details. Privacy Policy Your privacy is important to us, and this policy will inform you of the information that Zephyr may collect from you, how it is used, and/or disclosed. By using our Website, https://www.zephyrhome.com, you are acknowledging and accepting the practices and information described in this policy and on our Website. Collecting Personal Information When you visit our Website, we may collect personal and non-personal information such as: domain name, IP Address, type of internet browser used, operating system, what brought you to our Website, which pages you visited, and the length of time you were on each page. We work with third parties, using cookies and other similar identifiers, to collect user data on our Website and elsewhere on the Internet for the purposes of tracking and advertising. Additionally, any information you willingly submit to us via our Website or otherwise will be collected. We may use this information to contact you in the future regarding investment, employment, or business sale opportunities; or changes to this privacy policy. Using Information We may use the information we have collected primarily for our own internal purposes, including improving our products, services, Website, advertising, remarketing efforts, etc. However, we may also use your collected information to contact you to respond to inquiries or provide information about our company and its services. Protecting Information Zephyr generally follows accepted industry standards when it comes to protecting the information you submit to us and that we gather, both during transmission and once we receive it. We use appropriate data collection, storage, and processing practices and security measures to protect against unauthorized access, alteration, disclosure, or destruction of your personal information, username, password, transaction information, and data stored on our site. Web Browser Cookies We may use âcookiesâ to enhance your experience on our Website. A cookie is a piece of data placed on your hard drive for record-keeping purposes by your web browser that may sometimes track information about you. You may choose to set your web browser to refuse cookies or to alert you when cookies are being sent. If you do so, note that some parts of the Site may not function properly. Usage of a cookie is in no way linked to any personally identifiable information on our site. Sharing Information We do not sell, trade, or rent your personal identification information to others. We may share generic aggregated demographic information not linked to any personal identification information regarding visitors and users with our business partners, trusted affiliates, and advertisers. We may also disclose your customer information with third parties in order to perform services on our behalf, and we will obtain consent for such sharing where it is legally required. We will disclose personal information and/or an IP Address when required by law or in good-faith belief that such an action is necessary to: cooperate with an investigation of purported unlawful activity, protect the rights or property of our Website and related properties, or identify persons who may be violating the law, the rights of third parties, or otherwise misusing our Website or its related properties. Please keep in mind that if you voluntarily submit your information in a public forum on our related to our Websiteâsuch as a comment section, discussion board, etc.âit may be collected and used by others, and we have no control of how third parties may use your publically accessible information.Â Third-Party Websites Zephyrâs Website may contain links to third-party websites, including links to the sites and services of our partners, suppliers, advertisers, sponsors, licensors, and other third parties. We do not control the content or links that appear on these sites and are not responsible for the practices employed by websites linked to or from our Site. In addition, these sites or services, including their content and links, may be constantly changing. These sites and services may have their own privacy policies and customer service policies. Browsing and interaction on any other website, including websites which have a link to our Site, is subject to that websiteâs own terms and policies. Privacy Policy Changes Zephyr may make changes to this privacy policy at our discretion. When we do, we will revise the updated date at the bottom of this page. We encourage you to frequently check this page for any changes to stay informed about how we are helping to protect the personal information we collect. By using our Website, you acknowledge and agree that it is your responsibility to review this privacy policy periodically and become aware of modifications. Your Consent By using this site, you signify your acceptance of this policy. If you do not agree to this policy, please do not use our Site. Your continued use of the Site following the posting of changes to this policy will be deemed your acceptance of those changes. If you would like to opt out of our tracking, you may do so here: http://www.aboutads.info/choices/ http://www.networkadvertising.org/choices/ If you have questions about our privacy policy, please contact us. Last updated: 07/14/2023"
    },
    {
      "url": "https://www.ci.zephyrhills.fl.us/161/Utility-Billing",
      "text": "Utility Billing | Zephyrhills, FL Skip to Main Content Announcements Notice of Public Hearings [July 28, 2025] More Info... 2025 Recycling Calendar More info... Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Search Doing Business Government Services Community How Do I... Home Government Departments Utility Billing Utility Billing Utility Billing (UB) maintains and processes all water, sewer, and sanitation billing records, processing four scheduled billing cycles each month, and provides services to utility customers regarding their accounts. In conjunction with Utility Department meter readers, UB coordinates work related to checking for leaks, lock-offs, and re-read orders. UB functions as the primary cash receipts area within the City, collecting and aggregating receipts from other city departments to prepare the City’s daily banking deposit. First Time Using Our Service To start service for the first time, you will need to provide some documents. Please email us with the following information: Click here to fill out and download the Utility application/change form . Required documents: Utility application/change (see link above) Proof of ownership (signed deed/lease in a PDF format) Photo ID Attach the required documents to an email and send them to: billing@ci.zephyrhills.fl.us Once the documents have been submitted, call Customer Care on 813-780-0015 to complete the move-in and pay the deposit. Customer Care will arrange for a service worker to turn your water on within 24 hours. Deposit information: A deposit must be paid before starting services. Deposit amounts depend on what we service: $61.80 Where only water service is available $91.06 Where water and garbage are available $123.60 Where water and sewer are available $152.86 Where water, sewer, and garbage are available $29.26 Where only garbage is available If you have any questions or concerns, contact us at (813) 780-0015 or billing@ci.zephyrhills.fl.us . Pay Your Utilities Bill Online (WaterSmart) We would like to remind you that there are alternatives to coming into City Hall and paying your utility bill at the counter. Customers can: 1) Go online to zephyrhillsfl.watersmart.com and register your account. You can pay with debit or credit card and can also enter checking account information for eChecks. 2) Pay over the phone by calling 833 -360-7528 . You will need your account number, as the automated system will ask you to enter the entire account number. You can use credit or debit cards, or enter your checking account number. 3) Mail your payment to the address on your bill in the payment envelope enclosed with your bill. Please make payable to \"City of Zephyrhills,\" and mail to Zephyrhills City Hall, 5335 8th Street, Zephyrhills, FL, 33542. 4) Place check payment in the drop box in front of City Hall, 5335 8th Street. The metal box attached to the building is labeled “Place Payments Here”. Please do not place cash in the box. Place your check and payment stub in an envelope. In addition, if you want to connect or disconnect service, you can accomplish this by going here. Pay Your Utilities Deposit Online ***The link below is for Utility Billing Deposit ONLY*** Go online to https://cityofzephyrhillsfl.tylerportico.com/payments/billsearch/ You can pay with debit or credit card and can also enter checking account information for eChecks. Please pay full deposit amount given to you by the Customer Service Representative. Contact us at 813-780-0015 or billing@ci.zephyrhills.fl.us if you are not sure how to much to pay. Below is the required information to pay your deposit online: Email Address Name Service Address Account Number Customer Identification Number Phone Number Required Deposit Amount Find out if Zephyrhills services your property by contacting Orange Lien Data at: Email: info@orangelien.com Website: www.orangelien.com Phone: 1-407-965-4245 Contact Us Utility Billing Physical Address View Map 5335 8th Street Zephyrhills , FL 33542 5335 8th Street  Zephyrhills FL 33542 Directions Phone: 813-780-0015 Report Water/Sewer Issues Online SeeClickFix Zephyrhills Website Pay By Phone 833-360-7528 Customer Service Hours (by phone) Monday - Friday 8 a.m. - 5 p.m. Lobby Hours (in-person) Monday - Friday 8 a.m. - 4 p.m. Payment Mailing Address City of Zephyrhills 5335 8th Street Zephyrhills, FL, 33542 Website Water Smart Program Website Lien Search Requests and Questions Email Website Phone: 1-407-965-4245 Directory FAQs How do I pay my bill? How do I turn on services? How do I turn off services? View All FAQs /FAQ.aspx Online Bill Pay Online Utility Billing Deposit RV Park Rates Utility Account Application/Change Form Utility Lien Searches Careers Public Records Request Pay a Bill Permits & Licenses Planning Department Police Department Downtown Trash & Recycling Contact Us City of Zephyrhills City Hall Email 5335 8th Street Zephyrhills, FL 33542 Phone: 813-780-0000 Fax: 813-780-0005 Quick Links East Pasco Chamber of Commerce E-Notifications Main Street Zephyrhills Fix It! Zephyrhills Pay a Bill Public Records Custodian Southwest FL WMD Zephyrhills 2030 /QuickLinks.aspx Site Links Accessibility Copyright Notices Government Websites by CivicPlus Privacy Site Map /QuickLinks.aspx Facebook Twitter Instagram LinkedIn Youtube Nextdoor City E-Newsletter Public Meetings (Audio) TextMyGov Service Requests Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    }
  ]
}